{
    "title": "The Crusader Ch. 04",
    "pages": [
        "Chapter 4: Blood Feud \n\nThe further adventures of Rollie Chambers.\n\nConstructive comments, emails and critiques are welcome and requested. \n\nThank you for taking the time to read and comment on my story.\n\n********************\n\nRollie Chambers was speeding. Weaving through traffic he jumped a yellow light and roared through another intersection. Damn rush hour, he thought. City's getting too crowded. Rollie cut in front of a car on his right, getting a one finger salute and a long horn blast for the maneuver. Turning into the lane leading to the Washington University Hospital emergency room, he did a power slide up to the door. \n\nA security guard approached Rollie as he left his truck. \"You can't park here,\" the man said in an officious voice.\n\n\"Police business,\" Rollie replied as he rushed past the guard and into the emergency room lobby. \"Keys are in it, move it if you have to,\" he yelled over his shoulder.\n\nHe had lied to the security guard so he wouldn't have to take the time to find a parking place; Rollie wasn't with the police anymore. He'd resigned three months earlier due to his disgust with what he called the 'Oh So Politically Correct Brass Hats' running the St. Louis Police Department. \n\nRollie knew it was possible that the real police would either be waiting for him or would look for him in the hospital. It didn't matter to him; he had to get to his friend, Ted Crowe.\n\nTed had retired from the First Patrol Squad as a Patrol Sergeant of the St. Louis Police after 30 years of service. Almost 5 years ago he and his wife Donna had bought and remodeled a neighborhood bar and grill, renaming it First Squad. They served good food and honest drinks to their customers. The clientele was mostly off duty and retired police and/or their families; there was also a good number of cop wannabes and groupies. The place was known as a \"cop bar\".\n\nRollie had been on his way out the door that morning when his friend, roommate, and girlfriend called to tell him that Ted had been brought into the emergency room. Rollie's lady was Jessica Talbert, a Doctor of Psychology. She had been making morning rounds at the hospital and learned that Ted was being treated for injuries caused by a severe beating. Jessica said Ted asked a nurse for her and then asked her to call Rollie.\n\n\"I'll be there in 20,\" Rollie told her.\n\nWhatever it is, whoever did this will answer to me,\" Rollie thought as he walked up to the nurse's station. Two nurses were gossiping about a new doctor in the department. One of them glanced up but ignored him and continued the gab fest with her friend.\n\n\"Excuse me. Could you stop talking about the new doctor's cute ass long enough to help me?\" Rollie asked sarcastically.\n\n\"And who are you?\" The older of the women asked.\n\n\"Not that it matters but I'm Detective First Class Rollie Chambers of the St. Louis Police Department. I'm looking for a man that was brought into the emergency room this morning.\" Rollie didn't feel bad about his subterfuge.\n\n\"Oh sorry, Detective,\" the nurse said. \"Who were you looking for?\"\n\n\"Ted Crowe, he was beaten very badly. I'd like to talk to him.\"\n\nThe woman typed for a few seconds on a computer. \"Mr. Crowe is in Trauma Room 4. Go to the end of the hall, make a left into the emergency room and check with the nurse at the desk. She will direct you from there.\"\n\n\"Thank you. You can go back to talking about Doctor Sweet Cheeks,\" Rollie said with scorn as he turned and walked away.\n\nJessica was waiting at the nurse's counter when Rollie walked in. She took three or four steps toward him and put her arms around him.\n\n\"How's Ted?\" Rollie asked.\n\n\"He's stable; the doctor says he's going to be okay.\" Jessica tried to swallow the sob that threatened to come out. \"Oh Rollie, they almost beat him to death.\"\n\n\"Who?\"\n\n\"Ted won't say. He wouldn't talk to the patrolman that found him or to me. He asked me to call you.\" Jessica paused and added, \"That's all I know.\"\n\n\"Take me to him please. When we get there, get anyone in the room out and close the door as you leave. Okay?\"\n\nJessica nodded, hugged Rollie again, and took his hand. She led him to Trauma Room 4. There was a nurse adjusting the monitoring device hooked up to Ted. Jessica identified herself and herded the nurse out of the room, closing the door behind her.\n\nRollie stepped closer to the man on the bed. Ted's left eye was swollen shut, he had a gash that had been stitched closed on his left cheek, and it looked like his nose was broken. The injured areas were beginning to bruise and Rollie knew his friends face would be black and blue in another couple of hours or so. There was also a cast on Ted's right arm. As he stood there, looking down, Ted opened his one good eye.\n\n\"Glad you could make it Rollie. You missed the party though.\"\n\nRollie took Ted's left hand in his. \"Sorry, but next time send the invitation a bit earlier.\" \n\nTed's smile was almost gruesome because his lips were cut and swollen too. \"I'll remember that next time.\"\n\n\"Who did this Ted? Do the police have any ideas?\"\n\n\"I didn't talk to the patrolman. Acted like I was in too much pain to talk.\" Ted chuckled and winced at the pain it caused. \"Wasn't far from the truth either. Have a seat and I'll tell you about it.\" Rollie pulled the only chair in the room closer to the bed, sat down and waited. \n\n\"About a week ago two big gorillas came into the First Squad right after I opened. They introduced themselves as the Dalton brothers. Said they represented the Carondelet Neighborhood Redevelopment Association and they wanted me to join. Told me that the dues were $1000 a week. I told them to go to hell; that I knew a protection racket when I saw one.\" Ted paused and asked, \"See if I can have some water will you? They wouldn't let me have any before.\"\n\nRollie stepped out of the room and talked to Jessica. She had the nurse bring a pitcher of water, a glass, and one of the straws that could be bent to make it easier for the patient to drink. After Ted took a few sips he continued his story.\n\n\"I asked them if they knew who most of my customers are and they just laughed. Said I wouldn't tell the cops about them if I knew what was good for me and that I would pay up. Sooner or later they said. I told them to go to Hell and they turned around and left the bar without another word. I was coming out of the First Squad with last night's receipts on my way to the bank. Just like every morning. The Daltons grabbed me and pushed me into the alley.\" Ted asked for more water and Rollie held the glass so he could drink.\n\n\"They told me that they were going to give me a little example of what would happen if I didn't join up. The bigger one, Riley I think I heard the other guy call him, told me that if I reported any of this to the cops they'd throw a Molotov cocktail through the front window of the bar. And if that didn't convince me they would find my waitress Tina and invite her to a party. One of them grabbed my face, looked me in the eye and said my wife would be next. Then they beat the hell out of me. I tried to fight back but these guys are huge; like professional wrestlers or something.\"\n\nHe paused in pain. \"They took the receipts from the bar. I told them there was more than the $1000 they originally wanted in the bank bag. The one called Shawn laughed; said I should consider it an initiation fee.\" Ted grabbed Rollie's hand. \"I can't tell the police and take a chance on Donna or Tina getting hurt. That's why I wanted to talk to you. Could you maybe look into these guys and get them off my back?\"\n\nRollie looked at his friend remembering how Ted and Donna had helped him when his wife, Susan, died. She had been beaten and raped. When Susan discovered she had also been infected with the HIV virus, she had committed suicide. \n\n\"Ted, you and Donna were there for me when Susan died. I know I would have made it but your help made it a lot easier.\" Rollie got a faraway look in his eyes for a few seconds. \"I'll take care of it.\" \n\nHe squeezed Ted's hand. \"Give me a description of these guys.\"\n\n\"The one called Riley is bigger and older than the other one. Shawn,\" Ted said all at once. He tried to snap his figures but winced in pain. \"That's the other guy's name, Shawn. Riley told Shawn not to go crazy on me.\" Guess Shawn doesn't take direction well.\" Ted gave Rollie a painful smile. \n\n\"Riley Dalton, 35 to 40, Caucasian, 6' 6, about 270 pounds, dark brown hair, brown eyes. He's got scars around his left eyebrow, like he was a boxer or something. Shawn Dalton is his brother, late 20s, Caucasian, 6'4, 230, light brown hair, blue eyes, tattoo on his right forearm; a shamrock with the words Erin go Bragh in a circle around it. \"Oh yeah, Shawn has a hell of a punch. Don't think I've ever been hit that hard.\" Ted paused. \"That's all I can remember.\"\n\n\"Thirty years as a police officer taught you something,\" Rollie said with a laugh. He got serious and asked, \"Where's Donna?\"\n\n\"She's down in the waiting room. I wanted to talk to you before she came in here.\"\n\n\"I'll go get her,\" Rollie said. He left the room and Jessica joined him. \"Donna is in the waiting room. Can you go get her or send someone for her? I've got a couple of phone calls to make.\"\n\n\"I'll get her,\" Jessica replied. \"I can tell her about Ted's injuries and reassure her that he's going to be okay.\"\n\nRollie took his cell phone out of his jacket and punch in a number. \"Hey Tully. How's the washed up Gunny today?\"\n\nJacob Tully was a Sergeant on the St. Louis Police Department. He was a retired Marine Gunnery Sergeant with 20 years of service. After retiring he joined a National Guard unit, just to keep his hand in he said, and shortly was deployed to Iraq. Tully lost his right leg below the knee while serving with his Guard unit. The prosthetic leg he wore didn't hinder him from running the Department's main shooting range. Tully had helped Rollie find and apprehend a rapist; most recently he had assisted Rollie in returning a kidnapped girl to her father.\n\n\"Fine, until you interrupted me,\" Tully replied. \"I was showing a pretty young rookie officer the finer points of using the Weaver stance when shooting.\"\n\n\"Male or female rookie?\"\n\n\"Female you overgrown pervert,\" Tully said laughing. \"What can I do for you?\"\n\nRollie explained about the protection scam and Ted's attack. \"You know a couple of patrolmen that would like to make some extra money when they're off duty? And that can keep their mouth shut.\"\n\n\"Guard detail?\"\n\n\"Yeah. I want an around the clock presence until Ted get's out of the hospital. He won't get out by the next meeting with those idiots. I don't think the Daltons will try to get to him in here but these guys aren't the sharpest tool in the shed.\"\n\n\"What makes you say that?\"\n\n\"If you want a guy to pay protection money, you don't beat him so bad that he can't work.\"\n\n\"Sounds like amateurs to me.\" Tully thought for several seconds. \"You know Rollie if you've got uniformed officers outside of Ted's door, the Daltons are gonna think he went to the cops. It could cause them to overreact.\"\n\n\"I need Ted and Donna protected and I can't hang around,\" Rollie said. \"I'm gonna be busy finding these idiots.\"\n\n\"Call Williams Security Specialists,\" Tully suggested. \"I'll email the number to your cell. John Williams is a friend from the old days. He retired about from the Department about three years ago and opened Security Specialists. They provide armed guards, body guards, and security details for just about anything.\" He hesitated and added, \"It's gonna cost though Rollie. Those men can't work for nothing.\"\n\n\"I'm not worried about the money. Thanks Tully.\" Rollie hung up and before he could put his phone away he got a message alert that he had the email from Tully. He called the number.\n\n\"Williams Security Specialists\" a receptionist answered.\n\n\"John Williams please,\" Rollie requested.\n\n\"May I tell him who's calling please?\"\n\n\"My name is Rollie Chambers. I'm a friend of Jacob Tully's.\"\n\n\"Oh yes, Mr. Chambers. John is talking to Tully right now. I'll put you through.\"\n\nDon't waste any time do you Tully, Rollie said to himself.\n\n\"Hi Rollie. This is John Williams. Tully explained what you want to do. How many men and how do you want them dressed?\"\n\n\"I want my friend protected around the clock until he gets out of the hospital; two men outside his door at all times. I'll leave up to you as to how many men you'll need each day. Could we have them dressed in business suits like body guards? Oh, and I want them armed.\"\n\n\"No problem. When do you want them to start?\"\n\n\"Could we start today?\"\n\n\"I'll have to rearrange the schedule but I can have two men at the hospital by 3:30.\"\n\n\"That'll work. I'll stay on until they get here. Ted's in room 614, have them ask for me at the nurse's station. Thanks John and send the bill to me. Tully's got my address.\"\n\n\"We'll worry about that after. I need to get to work. Call me if you need anything.\" Having said all that needed to be said, John Williams hung up.\n\nRollie went back to Ted's room. Donna was sitting with her husband's hand in her's. Jessica stood by the window with an angry look on her face. \n\n\"Hi Donna. The docs say our boy is going to be fine.\"\n\n\"The old fool should have told me about this earlier,\" Donna said giving a smile to Ted. \"He'll probably milk this for a long time to get out of doing any work.\"\n\nRollie chuckled and Jessica lost the angry look and smiled.\n\n\"When are the Daltons supposed to come back and see you Ted?\" Rollie asked.\n\n\"They said they'd be back to see me in three days.\"\n\n\"Have the doctors told you how long you're going to be here?\"\n\n\"Four or five days. \n\n\"I don't think they realize how much damage they did to you. There's no way you can meet them in three days.\" Rollie thought for a moment. \"I've got guards on your door until you get out.\" Donna looked alarmed and Rollie added, \"I don't think they'll try anything but then again they weren't too smart putting Ted in here to begin with.\"\n\n\"Are you going to be able to find them Rollie?\" Jessica asked. \"And what are you going to do if you do find them?\"\n\n\"Don't have to find them; they'll find me. I've got three days to find out as much about them as possible. When they come to the First Squad to collect from Ted, I'll be there instead.\" Rollie hesitated. \"What I do will depend on them.\" He saw the concerned look on Jessica's face. \"That's the best I can offer Jess.\"\n\nRollie left the room and roamed the halls for about an hour. As he past the nurse's station for the tenth time, two large men dressed in business suits approached him.\n\n\"Mr. Chambers. I'm Todd Stevens and this Joey Simpson. Mr. Williams told us to report to you.\"\n\nRollie shook hands with both men and explained the job. Todd and Joey nodded and then smiled.\n\n\"No worries Mr. Chambers. We'll take care of Mr. Crowe.\"\n\nRollie re-entered the hospital room. \"Okay, there are armed guards on your door Ted. There'll be two guards all the time until you get released. I'm going to leave now but I'll be back tomorrow to see you. If you need me call my cell.\"\n\n\"Where are you going Rollie?\" Jessica asked as she followed him into the hallway,\n\n\"I'm going to find out everything I can about the Daltons and put a stop to this protection racket.\" He put his arm around Jessica, pulled her close, and gave her a quick but emotion filled kiss. \"Why were you so mad when I came back into Ted's room?\"\n\nShe was embarrassed that her emotions were so easy to read and chuckled. \"When I do my rounds, I see people hurt and injured all the time.\" Jessica took a deep breath. \"But to see someone I know, a friend, beaten up for money, well it just pissed me off.\"\n\nRollie smiled and hugged Jessica tighter. \"A champion of the underdog aren't you? That's my girl.\" He kissed her again. \"Jess please don't forget to tell the hospital about the guards. I'll call you later. \" \n\nAs he left the hospital Rollie called Tully again. \"Thanks for the help Sarge,\" he said when Tully answered. \"Need another favor. Can you run wants and warrants on Riley and Shawn Dalton. See if they're in the system.\n\n\"That the two bastards that did Ted?\"\n\n\"Yeah, that's the guys. See what you can dig up will you? Call me if you find out anything.\"\n\nI've got three days to find out as much about these scumbags as I can, Rollie thought. On his way to his next meeting Tully called back.\n\n\"Nothing on the Daltons locally. I'm checking a national data base now. It'll take an hour or so. Call you back.\"\n\n\"Thanks Tully.\" Rollie said as he parked his truck in the driveway of a very large home. He got out of his truck and rang the front door bell. The last time he'd been here he had beat on the door with his fist. The door opened and Rollie smiled.\n\n\"Hello Leo,\" he greeted the squat heavy set man that had answered the door. \"Beat up any young girls latterly?\"\n\nRollie had met Leo a few months previously. He'd been looking for Frank Rossi's daughter. Rossi was the head of the crime family that controlled the rackets in St. Louis; Leo worked for Frank's brother Vito. Vito was the apparent head of the Rossi syndicate but Rollie knew better. Frank was the power behind the throne. Leo and Rollie had crossed paths when Leo was strong arming a young woman for information about Frank's daughter. Rollie had forcefully put a stop to his efforts and there had been bad blood between them ever since. \n\n\"What'da you want Chambers?\" Leo asked with a sneer.\n\n\"Frank around? Like to talk to him if possible?\" Rollie stepped past Leo into the entryway. \"This time I'll wait here until you ask him.\" \n\nThe last two times Rollie had been to the Rossi home, he'd brushed past Leo like he didn't exist. Leo growled and went toward a closed door. Rollie knew that the door led to the formal sitting room; he'd been there before. Three minutes later Leo opened the door and motioned for Rollie to come in.\n\nFrank Rossi sat in a big easy chair. He didn't get up as Rollie walked into the room but motioned to another chair across from him.\n\n\"Have a drink Rollie?\" Frank saw Rollie smile and shake his head. \"What's so funny?\"\n\n\"We're going to act like two gentlemen are we?\" Rollie asked still smiling.\n\nFrank smiled too. \"I suppose not; it's not our style. \"What can I do for you?\"\n\n\"Need some information and I think you're my best bet.\" \n\n\"What kind of information?\" Frank asked.\n\n\"Couple of hoods calling themselves Riley and Shawn Dalton are trying to set up a protection racket. They approached a friend of mine and when he turned them down they did a number on him; put him in the hospital. I thought these guys must be new to this type of thing and maybe new to St. Louis. Know them or anything about them?\"\n\n\"Why come to me? We're not in the protection business.\"\n\n\"Always found that strange,\" Rollie said. \"It's a money maker for families in other cities.\"\n\n\"It's a business that isn't really cost effective and it can lead to trouble,\" Frank said. \"All it takes is one macho hero to report it to the police. If you've got a Mayor or D.A. running for office, they come down on you like the wrath of God to make a name for themselves. And it's not only the protection racket they attack; they go after you all across the board. I don't think the money's worth the eventual trouble.\"\n\n\"Okay I believe that you're not involved but you know more than most what goes on it this city.\"\n\nFrank could see that Rollie was angry and intense. \"I'll check around and see what I can find out. Your number still the same? I'll give you a call if I find out anything.\"\n\n\"Appreciate it Frank.\" Rollie took a card out of a small leather card case and handed it to Rossi. \"This is the number where you can reach me.\"\n\nRossi looked down at the card and smiled. The card read:\n\nCHAMBERS AND ASSOCIATES  Investigations & Security   314-555-4141",
        "\"Made it official did you?\" Frank asked.\n\n\"Not really. I only work by referral and won't take just any case.\"\n\n\"Can't be too picky about your cases. That's not conducive to making money Rollie.\"\n\n\"Frank, you should know I don't care about the money. Think about what I charged you for finding your daughter.\"\n\nRossi's nodded his head in understanding. His daughter, Angela, had faked her kidnapping to get money from him to go to Europe with her friends. But her boyfriend took over and really did kidnap her. He'd demanded $250,000 for her release. Rollie had found her and brought her home. He had a tape recorder with Angela admitting her part in the scam but Rollie destroyed it to protect Rossi's reputation. The only fee charged was $100 to replace the recorder.\n\n\"Well I still owe you for that Rollie. If those boys are local, I'll find out about them.\"\n\nRollie nodded his thanks and walked toward the front door. \"See ya around Leo,\" he called out as he left. Leo gave him a dark look as he walked past. I shouldn't rattle his cage like that, Rollie thought. But I just don't like him.\n\nHe drove back to his apartment and found Jessica in the kitchen making a sandwich. Dr. Jessica Talbert had been Rollie's therapist when his wife Susan committed suicide. They had been thrown together again when Jessica worked as a profiler for the St. Louis Police on the \"Campus Rapist Case\"; Rollie was the lead detective on the case. Rollie persisted and she had finally gotten over her ethical concerns about dating a patient. He had pointed out that he was no longer her patient and wore her down. Jessica had moved into Rollie's place after the case of the kidnapped daughter. \n\n\"That looks good,\" Rollie said as he kissed her hello.\n\n\"I make a pretty good sandwich,\" Jessica replied. \"You want one?\"\n\n\"Oh yeah, a sandwich. That looks good too.\" Jessica smiled and swatted him on the shoulder.\n\n\"I'll grab a shower and be right back,\" Rollie said. As he came back into the galley style kitchen, Jessica was putting sandwiches, chips, and drinks on the breakfast bar. \n\n\"Thought you'd still be with Ted and Donna,\" Rollie said.\n\n\"No need with those two behemoths you've got outside Ted's door.\" Jessica hesitated. \"I know you were rushed but couldn't you have found guards that didn't look so out of place. Todd and Joey are sweethearts but there's no doubt what they are. I mean they wear suits and all but you can see the bulge of their guns. They look like what they are; armed guards.\"\n\n\"That's exactly the look I was going for,\" Rollie explained. \"I couldn't use uniformed police so I got the next best thing. If the Daltons are stupid enough to beat a prospective client the way they did, they might be stupid enough to visit Ted in the hospital. The guards will warn them away just like cops would.\"\n\n\"You can be a devious man Rollie Chambers, a devious man,\" Jessica said. Then she got serious. \"Are you going to find those two gorillas? And if you meet them at the bar, what are you going to do? How will you explain your involvement?\"\n\n\"I'll tell them I'm Ted's partner and since he's in the hospital they'll have to deal with me. If I can get them on tape trying to shake me down, I can call in the police.\"\n\n\"If you can't record them what will you do?\"\n\nRollie looked down for a few seconds in thought. \"Jess, I'm going to bring their plans to a halt. With the police's help if I can, but I will stop this.\" She started to protest but he held up his hand to stop her. \"I know what you're going to say, you're going to talk about rights and legalities and letting the authorities handle it.\" He took her hands in his. \"Sometimes you have the right to protect yourself and people you care about... I promise to let the police handle it if I can.\"\n\nJessica looked into Rollie's eyes and knew he would put an end to the Daltons scheme; one way or another. \"I want to be there when they come,\" she said. Now it was her turn to hold up her hand to silence Rollie. \"Maybe I can get a feel or handle on them.\" She smiled. \"Besides it's a free country and I can go where I want to.\"\n\n\"Won't do me any good to ask or tell you to stay away, will it?\"\n\n\"Nope.\"\n\n\"If trouble starts, if they get aggressive, you have to do as I say and do it with no questions. Agreed?\"\n\n\"Okay,\" Jessica said. \"Now what was looking so good to you earlier?\"\n\nRollie smiled, took her hand, led her to the big comfortable couch in the living room and showed her what he meant.\n\n********************\n\nFrank Rossi called Rollie. \"Can't find out anything about those two guys; they must be from out of town. I'll keep checking and let you know if I find anything.\"\n\nSo three days later, Rollie was working behind the bar at First Squad. During those three days Rollie checked around the neighborhood and found four other shops and restaurants that were paying the Carondelet Redevelopment Association. They were reluctant to talk about it but Rollie knew what was going on. It's not just Ted that's being hurt, Rollie thought.\n\nJessica sat on a stool at the end of the bar. In spite of Rollie's objection, she had refused to stay away from the bar that particular night. \"Ted and Donna are my friends too,\" she stated leaving no room for debate.\n\nDirectly across from Rollie, against the wall Tully took up space in one of the booths. Tully had also refused to be left out of the meeting. \"Ain't fair you getting to have all the fun, Rollie. Besides you can't stop me from going to have a drink and relax at my favorite bar.\" \n\nRollie glanced at a blank faced Jessica thinking she ratted me out to Tully. Then he smiled at her.\n\nRollie had put a sign on the front door: \"Closed from 7:00 until 10:00 for private party\" the sign read. He'd hoped to keep away any of the cops that normally came to the bar. Rollie wanted the Daltons to feel safe enough to come into the First Squad that evening and talk openly.\n\n\"Not much of a party,\" one of the two men said as they came into the bar.\n\nRollie looked up. This must be the Daltons, he thought; there's not many men that big in St. Louis. They match the descriptions Ted gave me. Me and Tully aren't small but those two almost make us look like runts. \n\n\"Where's Ted?\" The bigger of the two said.\n\n\"Who's asking?\" Rollie answered. \n\n\"I'm Riley Dalton, this is my brother Shawn. We've got business with Ted. Who are you?\"\n\n\"Rollie Chambers, I'm Ted's partner. Some bastards put him in the hospital so I've got to work the bar\"\n\nRiley didn't like the term Rollie used. \"I wasn't aware that Ted had a partner.\"\n\n\"Right after he bought the bar, he needed money for renovations. I gave him money for a 30 percent share of the business.\" Rollie wiped some glasses like bartenders had done forever. \"If you got bar business with Ted, you'll have to deal with me.\"\n\n\"Perhaps we should come back when Ted is back at work,\" Riley said.\n\n\"Nope, I'm in charge now. You'll have to do business with me.\"\n\nRiley stared at Rollie for several seconds. His eyes darted around the room taking in the other two people in the bar. He ignored Jessica at the end of the bar. Shawn had turned toward Tully and was watching him with almost a sneer on his face.\n\n\"Very well Mr. Chambers, we will deal with you.\" Riley unbuttoned his jacket, showing the butt of a gun in a shoulder holster and rested his hand just below it. \"We represent the Carondelet Neighborhood Redevelopment Association. Ted's membership fee, and now yours, is $1000 a week.\"\n\n\"What do I get for $1000 a week?\"\n\n\"We 'protect' your business by making sure no one robs you or throws bricks through your front window. We also make sure none of your customers are assaulted or robbed as they leave your bar.\" \n\n\"We also make sure what happened to Ted doesn't happen to you,\" Shawn spoke for the first time.\n\n\"Basically you're shaking us down,\" Rollie responded. \"We pay you 'protection' money or bad things will happen, right?\"\n\n\"I guess you could put it that way,\" Riley said. \"We prefer to call it insurance.\" The tone in his voice changed to a demand. \"Now give us the first weeks dues,\" he ordered.\n\nRollie caught Tully's eye and said, \"We don't need or want your services Riley. But I tell you what I'll do.\" Rollie pulled his Glock .45 from under the bar and pointed it at the Daltons. \"I'll give you one chance to drop your weapons on the bar. Believe me you won't like the consequences if you don't.\" \n\nTully also had his pistol pointed at the Daltons. Riley and Shawn were surprised to see that even the woman at the end of the bar had a pistol pointed their way.\n\nRiley tensed and then sort of relaxed. Slowly, using two fingers, he pulled his weapon from his shoulder holster and carefully laid it on the bar. Shawn's face showed an excitement, almost anticipation, and he made no move to disarm. Riley stepped next to his brother.\n\n\"Shawn, you don't stand a chance.\"\n\n\"You think this old man can stop me?\" Shawn asked with bravado pointing at Tully.\n\n\"You're gonna be real embarrassed telling everyone this old man kicked your ass,\" Tully said as he stood up.\n\nAfter several seconds, which seemed like minutes, Shawn seemed to deflate. He reluctantly followed his brother's lead and put his pistol on the bar. Rollie secured the weapons and set them under the bar while closely watching the Daltons. Tully frisked the brothers one by one, with his pistol stuck under their chins. He stared them in the eye the whole time. The look in Tully's eyes left no doubt that he would blow their heads off if they resisted.\n\n\"Sit down boys and let's talk,\" Rollie invited and pointed to the booth that Tully had vacated. The Daltons sat and slid around to the back of the booth. Tully stood at one side and Rollie at the other.\n\n\"I can't find any information on you two,\" Rollie said. \"From your accent I'd say you're from New York or Boston.\"\n\n\"So what. You got nothing on us,\" Riley bragged. \"It's your word against ours.\"\n\n\"No, it's your own words against you,\" Rollie replied. He pulled a small digital tape recorder out of his shirt pocket, rewound it and pressed play. Riley Daltons' admission to the protection scheme echoed through the bar. \"Add that recording to our testimony and you boys are going away for awhile.\"\n\nRiley settled back into the booth. \"What do you want Chambers? If you were going to just turn us in, you'd have already called the cops.\"\n\n\"Don't have to call them; the police are here.\" Rollie pointed at Tully. \"Let me introduce you to Sergeant Tully of the St. Louis Police Department. He'll be the one making the arrest.\"\n\n\"So what do you want?\" Riley asked for the second time.\n\n\"You didn't just blow into town and decide to start a criminal empire. I want to know who put you up to your scheme.\"\n\n\"We ain't tellin you nothin,\" Shawn said. \"And when we get out, I'll be comin to see you.\"\n\n\"Shut up Shawn,\" Riley ordered. \n\n\"Maybe you'll want to see me but you won't have the chance,\" Rollie said. Turning back to Riley, Rollie asked, \"You know who Frank Rossi is Riley? He's not going to very happy with you two for horning in on his business.\" \n\nRiley's face lost its color and he took a deep breath. Rollie could see by his reaction that Dalton knew about the Rossi family.\n\n\"Tell me what I want to know and I'll talk Frank into letting you two off. Frank and I have a relationship and he'll let you walk as a favor to me.\" Rollie looked Riley in the eye. \"Don't give me what I want and I'll let Rossi deal with you.\"\n\n\"If we're in jail Rossi can't touch us,\" Shawn said with belligerence in his voice. \n\n\"Shut up Shawn,\" Riley ordered again.\n\n\"You're not as smart as your brother Shawn,\" Rollie explained with a grin. \"Riley knows that Frank Rossi can get to you no matter where you are. He's got connects everywhere; including jail. There's always some con that wants some more luxuries or whose family needs help. It's easy for Frank to make a deal with one or more of them.\" \n\nRiley had a belligerent look on his face and a cocky tone in his voice. \"We'll be out on bail before the cops get all the paper work done; we've got protection.\"\n\n\"Don't count on it Riley,\" Rollie said. \"No one can protect you from Rossi forever.\"\n\nShawn grinned, it wasn't a pretty sight, and said, \"Vito will take care of us. He said...\"\n\n\"Shut up Shawn,\" Riley repeated. \"You talk too damn much.\"\n\n\"What's Vito got to do with this?\" Rollie growled.\n\n\"I'm done talkin and so is Shawn,\" Riley vowed. \"Call the cops. Arrest us or let us go.\"\n\n\"There is a third option. We could dump you in the Mississippi River.\" Rollie paused for effect and said, \"Tully oblige these gentlemen. Call your friends and have them come and take out this trash.\" Turning back to the Daltons he added, \"You would be well advised to leave Ted and us alone. If we have to have this conversation again, that third option I mentioned will come into play.\"\n\nAfter the police arrested the Daltons and took them away, Rollie poured three shots of Gentleman Jack for Tully, Jessica, and himself.\n\n\"Did you hear Shawn's slip?\" Rollie asked. \"Vito Rossi is in this up to his eye brows. But I don't know why.\"\n\n\"You think Frank lied to you about being involved in protection?\" Tully asked. \"Maybe he and Vito decided to add an income stream to the family business.\"\n\n\"I don't think so. Why would he bother lying to me? There's not much I could do if he was involved except tell my suspicions to the Bunco Squad and they're already after Frank for his other interests. Anyway, I got a sense that he wasn't happy with the Daltons.\"\n\n\"Maybe Vito's tired of being the number two man, the little brother,\" Jessica suggested. Rollie and Tully both looked at her in surprise.\n\n\"What makes you say that?\" Tully asked.\n\n\"Rollie, you said that everyone thinks Vito is the head of the family. When you worked on finding Frank's daughter you realized that he was really the guy in charge of the family. Maybe Vito wants to be the big cheese in fact, as well as in perception. The added income could be Vito's way of proving that he deserves to be boss.\"\n\n\"Would Vito take that chance? I tell you Frank was really bent out of shape that someone was doing business behind his back,\" Rollie said. \"I don't think Vito being his brother would make much difference to him. He'd see it as a betrayal and a threat.\" \n\n\"This is getting too heavy for an old Gunnery Sergeant,\" Tully said to lighten the mood. \"If we're off duty, I'll have another drink and head home.\" He took the offered drink from Rollie and threw down the shot.\n\nThen he said \"By the way did you hear what Tina did when you sent someone over to guard her?\"\n\n\"No. What happened?\"\n\n\"She told the guy to get the hell away from her. Said a guard would crimp her style with men. When the guard insisted she pulled out that .357 snub nose she carries and said she could take care of the likes of the Daltons.\"\n\nRollie and Jessica laughed. \"Tina is a force of nature,\" Jessica said.\n\n\"One more thing before I go,\" Tully said. \"You think you ought to keep the security guards with Ted and Donna? \n\n\"As far as Ted goes I don't think we need to keep the security detail,\" Rollie answered. \"With Ted it's his word against the Daltons; there were no witnesses. We're the ones they have to worry about. There are three of us that heard their try at extortion; plus the tape. Makes no sense for them to bother Ted again.\"\n\nRiley Dalton was right. He and his brother walked out of the downtown jail the next morning almost before Rollie could finish his statement to the Bunco Squad. As Rollie left headquarters he saw Riley and Shawn getting into a limo. Shawn waited until Rollie got closer and pointed his finger with his thumb held up like a pistol. He pretended to shoot three times, all the while grinning at Rollie.\n\n\"Bring it Shawn,\" Rollie said. His voice was cold and hard and his blue eyes bore into the big man like a laser.\n\nShawn stiffened and started to step away from the car but Riley grabbed his arm. \"This ain't the time or place Shawn. Get in the car,\" the older brother ordered.\n\n\"Riley.\" When Rollie got the older Dalton's attention he said, \"If you come after me, you better dig two graves. It's going to be costly.\" He turned and continued to his truck.\n\n********************\n\n\"Yeah, I heard something about them a couple of nights ago,\" Antonio Rigazzi responded to Rollie's question. Tony was the owner of Rigazzi's, a landmark Italian restaurant in the middle of the Italian neighborhood known as \"The Hill\". He was also Rollie's good friend. They had met years ago while then Patrolman Rollie Chambers had stopped two men from robbing Tony.\n\n\"I heard they beat the hell out of Ted Crowe last week,\" Tony continued. \n\n\"How'd you hear about that?\"\n\n\"Sometimes people talk when they come to eat. Sometimes they talk about things here that they wouldn't talk about out on the street.\" Tony smiled. \"Sometimes I listen.\" Tony stopped while one of his waiters refilled their coffee cups. \n\n\"I also heard that you and Tully braced them at Ted's place and arrested them for extortion.\" Tony smiled and added, \"I even heard that Jessica helped.\n\n\"Tully arrested them; I was just doing my civic duty by assisting him.\" Rollie smiled. He saw Jessica returning from the lady's room. \"Let's table this until later.\"\n\nRollie and Tony stood as Jessica got back to the table. Tony with a big smile and a flourish pulled out her chair to seat her.\n\n\"My, my, such manners. Makes a woman feel special,\" Jessica said.\n\n\"You are special Jessica and I don't understand why you're still with this broken down old police officer,\" Tony said as he took Jessica's hand. \"When are you going to let me take you away from this clown and treat you like the princess you are?\" Jessica laughed and patted Tony's hand. His invitation was a standing joke between the three friends.\n\n\"As soon as you get your wife to agree, I'll run off with you. But I don't think Adrianna to wants to share.\"\n\n\"No, my angel is very possessive.\" Tony laughed. \"She told me I could run away with you but I had to leave the deed to Rigazzi's and my soul with her. I might give up my soul but never my restaurant.\"\n\n\"So what do you know about the Daltons?\" Jessica asked, surprising Rollie and Tony.\n\n\"Who?\" Tony asked. \"I don't know any...\"\n\n\"Tony...I was born at night but it wasn't last night,\" Jessica interrupted him. \"You hear about most everything that happens on the West side. Besides the place is really busy tonight and you wouldn't normally sit down with us for this long unless you had some information for Rollie. So what do you know?\"\n\nRollie laughed and Tony looked embarrassed. \"Guess I'm not the only detective in this group,\" Rollie said. \"I'll tell you later Jess; let's order dinner.\"\n\nTony motioned for the waiter and stood to leave.\n\n\"We'll start with the toasted ravioli,\" Rollie ordered. \"The lady will have the Veal Scaloppini with mushrooms and zucchini. And I'll have the Mostoccioli all you can eat special.\"\n\n\"Still trying to put me out of business,\" Tony complained. \"When you gonna order a regular entrée?\" This too was a standing joke between friends. Rollie usually ordered an all you can eat special and Tony always complained that he lost money every time Rollie ate at Rigazzi's.\n\n\"So what did Tony have to say?\" Jessica asked on the way home after dinner.\n\n\"Not much that we don't already know. We still don't know who brought the Daltons to town. It has to be someone with clout and power.\" Rollie was quiet for a couple of blocks and said, \"But you heard what Shawn let slip. I think Vito is in this up to his neck.\" \n\n********************\n\nRiley and Shawn Dalton were sitting at the bar in Lombardi's Restaurant on the border of the Hill. A man with slicked back hair walked over to them.\n\n\"Leo says to meet him at the south entrance to Tower Grove Park in an hour,\" the young hood said. Then he turned and walked out of Lombardi's.",
        "\"Why didn't Leo just come here to talk to us?\" Shawn asked. \n\n\"Vito doesn't want us to be seen with his man,\" Riley answered. That might give certain people ideas on who's behind this protection business.\" Smart man, he thought. He didn't even call us himself. This way he can claim he knew nothing about us. \"Let's go, we'll wait at the park.\"\n\nThey had been sitting in their car for about 30 minutes when they saw a big, dark colored Cadillac pull into the park. Riley flashed his lights on and off. The dark car pulled up next to the Daltons and the rear window came down. Vito's top man, Leo, looked over at Riley in the driver's seat.\n\n\"Chambers and his friends could cause trouble for us,\" Leo said. \"If they testify you both could do time.\"\n\n\"We could make sure they don't come to court,\" Shawn said with an evil grin.\n\n\"Shut up Shawn,\" Riley said. Turning back to Leo he asked, \"What does Mr. Rossi want us to do?\"\n\n\"Maybe you could talk to Chambers or his girlfriend and make them see what a mistake it would be to testify.\" Leo leaned out of his car. \"Mr. Rossi doesn't want to get involved.\"\n\nRiley stared at Leo. \"Is Mr. Rossi gonna leave us hanging?\"\n\n\"No he won't. He said to tell you that if things get bad, he'll see that you're taken care of.\" Leo lit a cigar and once he got it going he ordered, \"Take care of the problem and do it soon. Call me when it's done.\" The rear window of the Cadillac raised and the car drove off.\n\n\"I guess we better go see that Talbert woman,\" Riley said to Shawn.\n\n\"I'm looking forward to slappin that bitch around a bit. Maybe I'll show her what a real man is like while we're there.\"\n\n\"Keep your mind on the problem. If you mess with her sexually it could have the opposite effect that we want. We'll rough her up a little and warn her that she and her friends should dummy up.... Let's go find Jessica Talbert.\"\n\nThe Daltons followed and observed Jessica for several days trying to find a good time to give her the warning against testifying. She never seemed to be alone except for the drive from home to her office and back. It was much too public for the Dalton's liking to attack her during the drive. Jessica's office was in the Washington University Medical Building and when she went to the hospital for rounds she used an underground pedestrian tunnel with security guards at each end. \n\nDuring this time Rollie hadn't heard from Frank Rossi. He'd left a few messages in the voice mail of Frank's personal number. Rollie hadn't gone to see Frank in person because he didn't want to take the chance of running into Vito. He wasn't sure how he'd react if he saw the man in person.\n\nJessica lived with Rollie in a huge two story house across from Tower Grove Park. The house had been turned into four big apartments each with their own outside entrances. Every evening Rollie's truck was in the driveway when Jessica got to the ground floor apartment they shared. The weekends were no better for the Dalton's purposes as Jessica and Rollie were together constantly.\n\n\"We should hit them both,\" Shawn suggested. \"Chambers is only one guy and I can handle him.\" Shawn grinned at his brother. \"Course that means you'd have to take care of the woman all by yourself. Think you could handle her?\"\n\n\"Shut up Shawn. Maybe you could handle Chambers but all you'd do is make him mad. I don't believe he'd be scared off; his pride wouldn't let him. If we threaten the woman he'll probably back off out of concern for her. No, we'll wait until we can get the Talbert woman alone.\"\n\nOn a Tuesday evening when the Daltons followed Jessica home they saw that Rollie's truck wasn't in the driveway. Now's our chance, Riley thought. He drove around the block and entered the alley that ran behind the homes on this block. Riley stopped the car and motioned for Shawn to follow him to the rear door. They got out of the car, making sure not to slam the doors, and walked toward the apartment. \n\nRiley and Shawn walked around the old carriage house that was now a six car garage. They peeked into the apartment through the window in the rear door. Inside they saw Jessica standing at the breakfast bar going through a pile of mail. \n\n\"Well if it isn't Miss High and Mighty herself,\" Shawn said as he and Riley came into the kitchen.\n\nJessica looked up but the look on her face was one of anger instead of fear. \"What do you want?\" She asked in a cold voice.\n\n\"We want to discuss the consequences if you or your friends testify against us,\" Riley said. His voice was hard and threatening. \"It might be a good idea if all of you develop amnesia at our trial.\"\n\n\"And if we don't?\"\n\n\"There's no need to discuss unpleasantness right now. You're a smart lady. I'm sure you know what will happen if you testify.\"\n\n\"What Riley means is that we'll put you in the ground; Rollie, Tully, and you. All of you,\" Shawn said. He laughed as he talked. \"If it was up to me, I'd do it right now; I won't stand for a bitch pointing a gun at me.\"\n\n\"Shut up Shawn,\" Riley ordered turning to look at his brother. \"Ms. Talbert let's be civilized about this, just do as we ask. It'll be simpler and no one gets hurt. If not...\" He shrugged his shoulders and held out his hands to his sides.\n\n\"Civilized like you were with Ted Crowe? Civilized like when you threatened his wife? Is that how civilized you want to be?\"\n\n\"I told you talkin to her wouldn't do any good,\" Shawn complained. \"Bitches only understand one thing; the back of your hand.\" He took two steps toward Jessica and raised a ham like fist.\n\nJessica quickly reached inside her purse on a stool beside the counter and pulled out her Glock 9MM. She had obtained the pistol and a Concealed Carry Permit when she worked Rollie's first case as a private investigator with him.\n\nShawn stopped in surprise. Then he gave her an evil type smile. \"You ain't got the balls to shoot me lady.\" Shawn took another step toward Jessica.\n\n\"I wouldn't bet my life on that Dalton,\" Rollie said as he stepped out of the large kitchen pantry. \"But I damn sure will shoot you.\"\n\nShawn turned and saw Rollie pointing a Glock at him. He started to reach for the gun in the small of his back and saw Rollie tighten his grip on his gun which was pointed at his head. Shawn slumped bringing his hand back to his side. Seeing Rollie's attention on Shawn, Riley started to reach for his gun in a shoulder holster.\n\n\"Give a reason Riley, please just give me a reason,\" Tully said coming out of the hallway on the opposite side of the kitchen. He too had a big Glock pointed at the Daltons. \"I could save the city a lot of money if you don't go to trial. Make me feel good too.\" \n\nRiley saw the rage in Tully's eyes as the big policeman continued, \"Ted Crowe is a friend of mine. I'd like nothing better than to put you and your dip shit brother down. So give me a reason.\"\n\nBoth Daltons realized that they were in an untenable situation. If they tried to use their pistols, two people, three counting Jessica, would shoot them down like rabid dogs. And according to Tully, enjoy the process. Riley raised his hands to join Shawn who already had his in the air.\n\n\"Did you think we haven't seen you shadowing Jessica for the last week?\" Rollie asked. \"We knew you followed her home every day but always left when my truck was in the drive. So today I parked my truck in the garage and we waited for you to make a move.\"\n\n\"Put your hands on your heads and interlace your fingers,\" Tully ordered. When the Daltons complied, he added, \"Now on your knees, cross your legs behind you, and sit back on them.\"\n\nRollie walked over to the kneeling men and being careful not to get in Tully's line of fire, he took the men's weapons. Riley gave up a .40 caliber Smith and Wesson. Shawn had carried a .357 revolver and a .380 semi auto back up gun in an ankle holster. Rather than using handcuffs, Rollie used plastic zip ties to secure the Dalton's hands behind them. Then he sat both of them on the big couch in the living area.\n\nTully still held his pistol at his side but Rollie holstered his Glock and Jessica put hers back into her purse. She patted the purse with satisfaction as she put the gun away. \n\nRollie couldn't help but smile at the flush on her face and the excitement in her eyes. \"We'll make a soldier of you yet Jess,\" he teased.\n\n\"No thank you. I'd be perfectly happy never to have to draw down again on anyone else.\" But she smiled back at Rollie as she spoke.\n\n\"I thought you boys would have left town when you got bailed out,\" Tully said.\n\n\"You must have some serious backing to hang around and to try this little stunt,\" Rollie suggested.\n\n\"We do and this won't amount to much,\" Shawn said. \"When it's over, we'll be back to see you Chambers.\"\n\n\"Shut up Shawn,\" Riley ordered.\n\n\"You're not as smart as your brother Shawn,\" Rollie offered. \"He knows that after you were bailed out for one felony, you committed a more serious one. He knows you won't get bail this time and that you're going to do hard time.\"\n\n\"What'da you want Chambers?\" Riley asked in an exasperated tone.\n\nRollie sat on the coffee table in front of the couch. He took a small digital tape recorder from the drawer in the end table and placed it next to him. \"You two aren't in this alone; someone is backing you. I want to know who's behind this whole mess and I want to know why\"\n\nShawn stared at Rollie with hatred. Riley slowly shook his head. \"I don't hear what's in it for us; I mean if we had any info to tell you. Maybe we'll just take our chances in court with a real good, real expensive lawyer.\"\n\n\"One thing you didn't think of Riley; your actions and crimes come under the RICO laws. That means you'll be facing Federal, State, and City charges. Think your expensive lawyer can beat the Feds? Want to take the chance?\"\n\n\"If we talk what's the deal? What can you do for us?\"\n\n\"Me? I can't promise anything; I'm just a civilian. But Sergeant Tully there is a police office. He can put in a good word with the D.A. for you. Hell, if you're nice he might even go to bat with the Federal Prosecutor for you.\" Rollie leaned back and smiled at the Daltons.\n\n\"If they charge you under RICO laws, you might even get protected witness status,\" Tully said. \"Depends on what you've got to tell them. If your backer is someone they want bad enough, you could walk away.\"\n\n\"What the hell are RICO laws?\" Shawn asked.\n\n\"It stands for Racketeer Influenced and Corrupt Organizations Act,\" Tully answered. \"It gives the good guys broader powers to go after organized crime figures and even gangs.\" He smiled and said, \"Basically it takes the gloves off and turns the prosecutors loose.\"\n\n\"So what can you do for us, Sergeant Tully?\" Riley asked sarcastically.\n\n\"I can tell the D.A. and the Federal prosecutor that you had a change of heart and wanted to do your civic duty to help us get the big boys behind this protection racket and the attack on Jessica.\" Tully chuckled at his statement and then sobered. \"Seriously Dalton, if you turn State's evidence on who I think is behind this, I think you'll probably be put in the Witness Protection Program.\"\n\nShawn opened his mouth to talk and Riley said, \"Shut up Shawn.\" Turning back to Rollie and Tully, he nodded. \"We'll give you everything.\"\n\nRollie picked up the recorder and turned it on then for the record cited the location, date and time plus who was present. He cut the zip ties holding both men and turned to Tully. \"Keep em covered Tully. Go ahead Dalton, start at the beginning. Who came to you with the idea for starting a protection racket here?\"\n\n\"Vito Rossi.\"\n\n\"Rossi? Frank and Vito approached you?\n\n\"No, just Vito. Shawn and me live in New York. We were doing some jobs for one of the families.\"\n\n\"What kind of jobs?\"\n\n\"Nothing big; collections, numbers running, maybe a little delivery work.\"\n\n\"Deliveries? You mean drugs?\"\n\n\"Yeah, sometimes drugs but mostly money and info too important to trust to mail. Things that needed to be delivered in person.\"\n\n\"Go on.\"\n\n\"Anyway, we met Vito when we delivered the weeks take from our little numbers game. While we waited for the boss to join us, Vito started to talk to us. After a few minutes the boss came in and listened to Vito and us. Then he stepped out of the room and left us alone. \n\nVito told us about his idea for a protection scheme here in St. Louis. Vito said Frank didn't like doing protection so the money wouldn't have to be shared with him. It was just Vito and us; he said it would be a gold mine. Can I have a drink or something?\"\n\nJessica brought the Daltons a beer. Riley drank his quickly while Shawn sipped his.\n\n\"Who was the boss in New York?\" Rollie asked.\n\nRiley hesitated before answering. \"I'm more afraid of him than I am of Rossi.\"\n\n\"It's all the way or nothing Riley.\" \n\n\"The Feds won't go after this 'boss' just because you mentioned him,\" Tully said. \"I'm no expert but him just being in the same room or building isn't a crime. They might look at him a little harder but they can't do anything without more proof than that.\"\n\n\"So who is this guy?\" Rollie asked again.\n\nRiley looked at Tully and then Rollie. He took a deep breath and answered, \"It was Gino Valenti. I didn't hear them talking about it but I know Valenti was involved. He smiled when Vito first mentioned the racket.\"\n\n\"Go on.\" Rollie urged when Riley stopped talking.\n\n\"That's about it,\" Riley responded. \"We came to town and started visiting different businesses. Vito said we could build it up. Said Shawn and me would clear at least ten thousand a month.\" Riley smiled and added, \"We got four or five 'clients' that first week. It looked like Vito was right about the money. Things were going good until...\" \n\n\"Until what?\" Rollie asked when Riley stopped talking.\n\n\"Until Shawn went overboard with Ted Crowe.\" Turning to his brother he said, \"I told you to take it easy but you just had to show how tough you are.\" Shawn leaned further back on the couch, recoiling from the anger that showed in Rollie's eyes. \"That's when you guys got involved,\" Riley finished in a subdued tone.\n\n\"What about Jessica? Was it your idea to attack her?\"\n\n\"Naw, that was all Vito. We were going to skip town but Leo said we should frighten you guys so you wouldn't testify against us.\" Riley snorted and gave Rollie a sad little smile. \"Guess he was wrong about that too.\"\n\n\"Take it easy Rollie,\" Tully said. He could see his friend was about to explode. You can come after him but don't mess with Jessica or any of his friends, Tully thought. You wouldn't like the results if you did.\n\nRollie didn't relax until Jessica came over and put her hands on his shoulders. He looked up at her, smiled, and nodded. \"Okay, Tully will call the precinct and get the detectives out here to take these guys in. They'll take it from here.\"\n\n\"You said...\" Riley began.\n\n\"We'll tell the D.A. that you cooperated,\" Rollie interrupted. \n\nIt was less than a half hour before two detectives from Precinct 16 came to collect the Daltons. One of the detectives, Frank Wends, was a friend of Rollie's. They had worked in the same squad before Rollie resigned from the Department.\n\n\"What'da you got Rollie?\" Wends asked, as he shook hands.\n\nRollie explained the situation. \"Tell the Captain Jessica will be in to sign a complaint tomorrow morning. Here's the recorder with their confession. I suggest you put it in a dated and witnessed bag to keep the chain of evidence.\" \n\n\"This ought to put the kibosh to Vito,\" Wends said with a smile. He put the recorder into an evidence bag, sealed the bag and signed and dated it. The two patrolmen took the Daltons away. \"See you at First Squad in a couple of days. Good to see you Rollie, you too Sergeant and it's always a pleasure to see the beautiful Dr Talbert.\"\n\nJessica laughed. \"Thank you Frank.\" Wends nodded and left the apartment.\n\n********************\n\nCaptain Pete Mallory greeted his friend. He'd been Rollie's mentor, boss and more importantly his friend for years. \"Nice to see you too Jessica.\"\n\n\"Hi Pete,\" Jessica replied and came around his desk to hug him.\n\n\"You can bring her back anytime you like Rollie.\" Pete turned to answer his phone, \"Excuse me.\"\n\nRollie and Jessica left the office so Pete could talk in private. They heard the Captain yelling into the phone.\n\n\"What the hell you mean? You guys couldn't protect them in your own jail.\" Pete listened for a minute. \"You all better get your resumes in order; somebody's gonna be looking for a job after this.\" He slammed the phone down on its base; almost breaking it in the process. \"Well hell,\" he said with an angry voice.\n\n\"What's wrong Captain?\" Rollie asked as he stepped back into the office.\n\n\"Somebody whacked the Daltons last night in the city jail. Stuck them with a shank so many times they looked like a pin cushion.\"\n\n\"What's a shank?\" Jessica asked. \n\n\"It's a homemade knife; usually made by prisoners,\" Rollie answered. \n\n\"How could someone get knife making materials in prison?\"\n\n\"They use what they can find. Sometimes they take a metal spoon and file the handle to a point using the iron bars in their cells or the concrete walls. Then they wrap a cloth or tape around the other end for a handle.\" Turning back to the Captain Rollie asked, \"How did it happen? I thought the Daltons were going into protective custody.\"\n\n\"Some idiot put them in the general population instead of their own holding cell. Vito must have been tipped off that they had been arrested. I'll call the D.A. and see what he wants to do,\" Pete said. Rollie and Jessica listened to Pete's side of the conversation.\n\n\"Yeah, I heard John. What do you want to do?\" Pete listened for several seconds and replied, \"We still got the taped confession you know. Yeah, but...\" Peter listened for a long period. \"Okay, I understand. It sucks but I understand. Good bye.\"\n\nPete looked tired although it was still relatively early morning. \"You know John Stamos, the D.A.?\" Rollie nodded. \"John says that the tape won't stand up in court.\" He held up his hand before Rollie could voice his protest. \"I know Rollie. But John says Vito's attorney can claim the confession was coerced.\"\n\n\"But all three of us can testify that Riley told us on his own.\"\n\n\"It wouldn't fly. The attorney would say that since you and Jessica are in a romantic relationship and that Tully is your friend that you are all conspiring against his client. I know it sucks but that's how it is. John isn't going to indict Vito Rossi; at least now and not for this crime.\" Pete sighed and walked to the wall safe. He opened the safe, took Rollie's tape recorder out and tossed it to him. \"Maybe you can use the recorder another time on another case.\"\n\nRollie was very quiet on the way home and Jessica didn't try to coax him out of his mood. She knew this wasn't something he could just 'oh well' and forget about. As they pulled up in front of the apartment they saw Tully's car in the driveway with Tully sitting on the hood.\n\n\"And what are you doing here Tully?\" Rollie asked shaking himself out of his mood.\n\n\"I heard about the Daltons. Heard the D.A. won't file charges.\"\n\n\"So?\"\n\n\"So what's our play?\" Tully looked directly at Rollie. \"I know you're going to do something and I want to be part of it.\" \n\n\"The news about the Daltons is too new and I don't have anything planned; at least not yet. But you're right; I won't let Vito get away with what he's done.\" Rollie put his hand on Tully's shoulder. \"You can't be involved Tully. If it goes sideways you could be kicked off the force. I can't let you chance that.\"\n\n\"Ted's my friend too you know. If you don't let me in I'll just have to do something on my own. As far as the job goes, I can live on my military pension and the disability checks for this.\" He lifted his pant leg and pointed to his prosthetic leg.\n\n\"Ok Tully. When I think of something I'll call you.\" Tully stared at Rollie for several seconds and Rollie added, \"I give you my word Tully, I'll call you.\"",
        "\"He's a good friend,\" Jessica said as they watched Tully drive away. \"Are you going to call him if you plan something?\"\n\n\"Have to; I gave him my word. And you're right he's a good friend.\"\n\n********************\n\nA week later Rollie still hadn't thought of a plan and he still hadn't heard from Frank. Both he and Tully had put the word out on the street that they wanted to know where Vito was hiding. Either the informants didn't want to get on Vito's bad side or Vito was very good at hiding; they hadn't heard a thing. \n\nSaturday evening, Tully dropped by Rollie's apartment. He invited Jessica and Rollie to go to the First Squad with him. It was Ted's first night back at the bar and a cause for celebration. Jessica begged off.\n\n\"You boys go have a drink and tell war stories,\" she said. \"I'll stay here and curl up with a good book.\"\n\nRollie kissed her. \"We'll both drive,\" he told Tully. \"That way you won't have to bring me back here if I want to leave early.\"\n\nAbout a mile from his place, Rollie had a change of heart. He called Tully's cell. \"Tully, I'm going back and talk Jess into coming with me. You go on; we'll meet you at the bar.\"\n\nThat's funny he thought as he pulled into his driveway. The front door was standing open. Rollie killed the lights on his truck and parked. He got out of his truck, made sure he closed the door gently, and quietly walked to his front door.\n\nRollie stepped inside and moved to his right. Standing still in the entryway, he listened and heard voices coming from the living room; angry voices. Rollie carefully but quickly went through to the interior of the apartment. He pulled his Glock as he walked.\n\n\"Where the hell is that tape?\" A man's voice asked.\n\n\"We gave the tape to Captain Mallory,\" Jessica answered.\n\n\"Bullshit. My guy in the precinct told me Mallory gave it back to you.\"\n\nRollie took a quick look around the door frame and saw Leo standing over Jessica with a pistol in his hand. Jessica was sitting on the floor with a hand print on her cheek.\n\n\"I'm gonna ask one more time bitch. Where's that tape?\" Leo started to raise his gun toward Jessica.\n\n\"If you move I'll put a hole in you that you could put a fist through Leo,\" Rollie said in a cold voice. \"Drop the weapon and step back.\"\n\nLeo turned his head and saw Rollie pointing a pistol at him. He hesitated for a couple of seconds.\n\n\"Hell,\" he said and started to turn his weapon toward Rollie. Leo felt the impact of the big .45; he'd never been hit so hard in his life. He dropped his gun, took a step backwards, and fell to the floor. Jessica jumped up and ran to Rollie.\n\n\"You okay Jess?\"\n\nShe had her head on Rollie's chest and nodded. \"He must have picked the lock on the front door or something. I heard a noise and turned around. That's when he hit me.\" Jessica shuddered and asked, \"What made you come back?\"\n\n\"I didn't want to go without you. Came back to talk you into going with me. Glad I did.\"\n\nRollie sat Jessica down. He called Tully and told him what had happened. Next he called the police and reported the shooting.\n\nIt was early morning by the time the police, the ambulance, and the forensic department left Rollie, Jessica, and Tully alone.\n\n\"Stay with Jess, will you Tully?\"\n\n\"Where you going?\" Tully asked. \"I'll go with you. Hell we'll both go with you.\"\n\n\"No I want Jess here and I want you to stay with her. I think Leo was acting alone but I can't be sure. As to where I'm going; I'm going to see Frank Rossi.\"\n\n\"Why?\"\n\n\"Because he can find Vito for me.\" Rollie looked Tully in the eye and added, \"I want Vito, Tully.\"\n\nThe big Sergeant slowly nodded his head. \"You go on, I'll stay with Jessica.\"\n\n********************\n\nThe sun was showing the first signs of rising when Rollie pulled up in front of Frank Rossi's mansion. He got to the hand carved wooden doors and started beating on them first with his fist and kicking them. \n\nA tall, swarthy young man opened the door. \"What the hell you want at this time of the day?\" \n\n\"I want to see Frank Rossi.\"\n\n\"You'll have to come back at a reasonable hour. Mr. Rossi is sleeping.\"\n\nRollie started to push past and the lackey made a very bad choice. He decided he would push Rollie back out the door. He reached for the intruder and actually got a hand on Rollie's shoulder. The next thing he knew he felt an excruciating pain in his knee and found himself on the floor with Rollie standing over him. Rollie had kicked him in the knee cap and when the young man bent over off balance, he was pushed to the floor.\n\n\"Frank Rossi, get your butt down here,\" Rollie yelled up the wide staircase in front of him. \"Rossi get down here,\" he repeated.\n\nWearing a men's silk robe, Frank Rossi came down the stairs. He helped his young doorman to his feet and then to a chair. Rossi came over and stood in front of Rollie.\n\n\"We really must do something about your manners when you come to my house Rollie,\" he said with a small grin.\n\n\"Cut the crap Frank. I want to talk to you.\"\n\nRossi sighed and asked, \"What do you want Rollie?\"\n\n\"I want to know where Vito is. We've got unfinished business.\"\n\n\"When Vito wants to hide away, he can be very hard to find. What kind of business?\"\n\nRollie explained Vito's involvement in the protection scheme. \"Man from New York was working with Vito and they contacted the Daltons.\"\n\nFor the first time Rossi lost the smile and smirk he'd had on his face. \"What man from New York?\"\n\n\"Riley Dalton told me it was Gino Valenti. Name ring a bell Frank?\"\n\nSlowly Frank nodded.\n\n\"Tonight Vito sent Leo to get the tape I have of the Daltons confession. I wasn't there but my lady was. He slapped her around and threatened her with a gun.\" Rollie paused. \"Leo wouldn't have been there without orders from your brother. I want Vito, Frank.\"\n\n\"Where's Leo now?\" Rossi asked looking around. \"Wait, what confession? What tape?\"\n\n\"Leo is on his way to the morgue. He pointed his gun at me and I shot him.\" Rollie took the little recorder out of his jacket pocket and pushed \"Play\". For the next few minutes Frank listened to the Daltons roll over on Vito and Gino.\n\n\"I don't know why Vito wants this tape; the D.A. says it's inadmissible in court. But he wanted the tape bad enough to send Leo after it. Maybe he didn't want you to hear it. Now are you going to help me or do we go to war?\"\n\n\"Go to war?\"\n\n\"That's right Frank. I'm not a cop any more so I don't have to play by the rules. If you don't help me...well maybe I can't destroy you but I can sure make things real interesting.\"\n\nRossi was quiet as he looked at Rollie's eyes. Finally after what seemed a long time he said, \"I truly don't know where Vito is.\" He held up his hand. \"But I'll find him and let you know. Give me a day or two.\"\n\nRollie stared into Rossi's eyes and then nodded. \"Quick as you can Frank.\" Rollie turned and left the house.\n\nTwo days later there was a note under the windshield wiper on Rollie's truck when he came out of his apartment that morning. It read: \"Eads Bridge maintenance shed, Illinois side\". He jumped in his truck and headed downtown to the police weapons range, calling Tully as he drove.\n\n\"Tully, I've got a line on Vito. I'll pick you up in twenty.\"\n\n\"I'll be at the Clark Avenue entrance waiting for you.\"\n\nRollie's truck hadn't come to a complete stop before Tully jumped in. \n\n\"Glad you called Rollie.\"\n\n\"I gave you my word.\"\n\n\"Where are we headed?\"\n\nShowing Tully the note, Rollie drove to the on ramp for Eads Bridge. He drove across the Mississippi to the Illinois side of the river and found a little used roadway leading back under the bridge. At the end of the road was a dilapidated metal shed.\n\nRollie stopped his truck about 300 yards from the shed and he and Tully got out and carefully walked toward the shed. As they got closer, they pulled their pistols. The shed had no windows on the sides or the back; the only window was in the door on the front of the building. Rollie went around the north side of the shed and Tully crept around the south side. They got to the corners at the front of the shed and stopped.\n\nRollie listened intently but couldn't hear anything; he looked at Tully who shook his head. He began to wonder if Frank had set him up. Rollie looked carefully around but didn't see anyone. Slowly they walked to the door and then Rollie threw it open pointing his pistol into the shed. Tully was right behind him and covered his back.\n\nVito was there, just as the note had said. But he wouldn't be standing trial or even facing Rollie's anger. His hands and feet were tied and there was a bullet hole in the center of his forehead. Vito had been dead for at least a day, Rollie guessed.\n\n\"Frank seems to be upset with his brother,\" Tully said as he looked at Vito.\n\nRollie called the St. Louis Police and explained the situation. He told them he and Tully would wait until the Illinois authorities arrived. Three hours later he dropped Tully off at the range and was on his way to Frank Rossi's place. He rang the bell at Rossi's front door and waited. Rollie was just reaching to ring the bell again when Rossi himself opened the door.\n\n\"Hello Rollie, I expected you. I thought I'd save wear and tear on my men and answer the door myself.\" Rossi motioned for Rollie to enter. \"I assume you've found Vito.\"\n\n\"Why Frank?\"\n\n\"Why what?\"\n\n\"Don't play games with me. Why did you kill Vito?\"\n\n\"Vito's dead? I'm shocked and dismayed at that news,\" Frank said with a straight face. He didn't look surprised or sad. \"How can you accuse me of killing my own brother?\"\n\nRollie could see how the conversation was going to go. \"Okay Frank, no bullshit. Why did you have Vito whacked? I thought you might slap him down some or exile him; I didn't think you'd kill him.\"\n\n\"You wearing a wire?\" Frank asked.\n\nRollie shook his head. \"No, I'm not. You have my word Frank.\"\n\n\"Not admitting anything and strictly hypothetically I'll tell you my reasoning; if I had done it.\" Frank paused and looked out the open front door at the rolling hills that dotted his estate. \n\n\"It wasn't that Vito went out on his own without getting permission or even talking to me about it. It wasn't that he brought in the Daltons instead of using our own people. I could have forgiven all that. As long as the family got its cut of the business, I would have let him slide.\" Rossi offered Rollie a cigar and when Rollie declined he lit one for himself.\n\n\"The problem was that Vito went outside the family for help,\" Rossi explained. \"He went to Geno Valenti; a competitor. Gino thought I would find out about Vito's business and we two brothers would fight for the leadership of our family. While we were fighting and weak internally, Gino was going to step in and take over some or maybe all of our businesses.\" Rossi paused with a strange look on his face as he continued to stare at the rolling hills. The look was a mixture of anger and a deep sadness. \"Vito joined with an enemy of our family for money and power. That caused a feud that could only be settled with blood.\"\n\nFrank looked at Rollie with a fire in his eyes. This isn't as easy on him as Frank makes it out to be, Rollie thought.\n\n\"That's why Vito had to go Rollie. It wasn't greed that caused his death, it was disloyalty.\" Frank threw his half smoked cigar out the front door. \"Anything else? I need to make plans for my brother's funeral.\"\n\n\"Are you going after Valenti now?\" Rollie asked as he walked toward the door. \"I'd hate to see my town turned into a battle ground.\"\n\n\"Any actions on my part are for Valenti and the New York authorities to worry about and deal with. Nothing will happen in St. Louis. You have my word.\"\n\n\"I'm sorry it came to this Frank.\" Rollie shook Frank's hand and headed home to Jessica.\n\n********************\n\nRigazzi's was busy on Tuesday evening but not crowded. School had started so the restaurant was missing many of its usual family groups. Antonio Rigazzi saw two of his favorite people and regulars at a table against the back wall. He walked over to their table and sat down.\n\nRollie and Jessica looked up and greeted the owner of Rigazzi's. \"Hi Tony, it's nice to see you,\" Rollie said. \"This Chicken Cacciatore is really good.\"\n\n\"You finally ordered something besides one of the all you can eat specials,\" Tony teased. \"But I see you're still drinking a draft beer. You could have at least ordered a good bottle of wine so I could finally make some money off you.\"\n\nRollie smiled and Jessica laughed. \"Baby steps Tony, baby steps,\" she said. \"It was hard enough to talk him out of the Mostoccioli Special.\"\n\n\"I like Mostoccioli,\" Rollie protested with a grin.\n\nTony caught the eye of his head bartender. He pointed to himself with his left hand and held up three fingers with his right. The bartender nodded and brought three glasses and a bottle of wine to the table. The wine was not from a big name winery and had no fancy label. The bottle was unlabeled except for a small piece of tape that had a date written on it in faded ink. It was also a little dusty. The server wiped the bottle with a bar rag, used a corkscrew to open the wine, and poured a small amount in Tony's glass. Tony tasted the wine, nodded, and the three glasses were filled.\n\n\"Oh my,\" Jessica said as she sipped the wine. \"This is really good.\" \n\n\"Beats the hell out of my beer,\" Rollie agreed.\n\n\"My grandmother made this wine,\" Tony said. \"I've been saving it for a special occasion. I think that you two getting through this thing with Vito qualifies.\" He raised his glass and said, \"To Good food, Good friends, and Good times. Salute!\"\n\nAfter a few more minutes talking with his friends, Tony left to greet some of his other guests. \n\nJessica finished her wine. Smiling she said, \"About all those good times we toasted to. Let's go home.\"\n\nSmiling broadly Rollie called to the waiter \"Check please\".\n\nThe End - For Now"
    ],
    "authorname": "woodmanone",
    "tags": [
        "police",
        "mystery"
    ],
    "category": "Novels and Novellas",
    "url": "https://www.literotica.com/s/the-crusader-ch-04"
}