{
    "title": "Her Second Job Ch. 07",
    "pages": [
        "This is the seventh and final story in this series. I apologize that it is so long and has less sex than the prior chapters. I thought this necessary to conclude the story of Denise Hines and her friends. I hope you have enjoyed them. This story will make much more sense if you've already read Her Second Job chapters 1 -6.\n\nThe series was inspired by things which really happened years ago, but this story is complete fiction. Any similarities between any character in this story and any real person are coincidental and unintended. Comments on this story, both favorable and unfavorable, are always welcome. Thank you for reading.\n\n________________\n\nAs I've said, Danielle considered our dancing \"art\" rather than just exhibitionism. This meant that she kept coming up with new ways for us to show our naked bodies that were \"artistic\" or \"challenging.\" Early in the third calendar year I danced at the bar, Danielle decided I should dance with Jessie. She liked the contrast of a white guy dancing naked with an African American woman.\n\nThe bar was in a very conservative area. I'd always been surprised that it hadn't gotten grief from people bent on enforcing their notions of \"morality.\" Local government loved us because the bar paid real property taxes, personal property taxes, sales taxes, and a monthly \"adult entertainment license fee;\" and everyone who worked there paid a 1% earnings tax. I doubted that self-appointed guardians of public morals cared about taxes paid. But no one had hassled the bar.\n\nThis tolerance led us to think that a white guy onstage dancing naked onstage with a naked black woman would be ok. Danielle created a dance for Jessie and me that had us spend most of the song close but not touching. As the song hit its final chord, Jessie and I embraced face-to-face. Jessie was a lovely woman with a firm body. Embracing her naked felt good. Denise and Annie were fine with it. I didn't see any problems. We only danced together once an evening in the midnight show.\n\nJessie and I first danced on a Friday might in February. Annie, Denise, and I danced together in the 11 o'clock show. I danced twice, once with Jessie and once with Denise, in the midnight show. Everything went great. After the usual afterwork drinks, Denise, Annie, and I left in my VW to take Annie home.\n\nWe'd gone about seven miles, and made two turns, when Denise said, \"Harry, we're being followed. That truck behind us with the unusual lights. I saw it in the bar's lot when we left.\" Looking in the rearview mirror, I saw a pick-up truck behind us with an illuminated design in its grill.\n\nAnnie looked behind us. \"I saw that same truck at the bar.\" The illuminated design was unique, something like a fist holding a knife. I doubted there were two trucks like that and was sure that Denise and Annie were not mistaken. \n\nI wondered what was up. If the truck wanted to stop us, the best place was in the rural area near the bar. We were already back into the city suburbs. Drawing on spy novels I'd read in my teens; I made several meaningless turns that made basically a full circle. I wanted to see whether the truck stayed with us and to let it know we knew it was following. The truck stayed behind us and, apparently, didn't care what we knew.\n\nI didn't want to lead them to Annie's apartment or ours. When I saw a ramp to the circle freeway, I got an idea. I got on the freeway, went two exits, got off, and pulled into a discount motel. After a nervous moment pressing the buzzer on the office door while the truck pulled in and parked, an old man let the three of us in. Denise and Annie immediately took off their winter coats. They were obviously braless under their tee shirts. The old man's initially gruff attitude immediately improved.\n\nI told the old man why we'd pulled into his motel. Through the office window, we could see the truck and two men sitting inside. The old man said, \"They get ten minutes. They either came in and rent a room, leave, or I'm calling my friends.\" Ten minutes passed. The old man stepped out of sight of the window, pulled out a cell phone and dialed. When his call was answered, he said, \"Mike, this is Ralph. I think we've got druggies here again.\" Ralph ended his called and snickered.\n\nSooner than I expected, two police cruisers were in the motel lot, one parked in front and one parked behind the truck. The officer from the front cruiser was talking to the truck's driver while the other officer brought a dog out of his cruiser and began circling the truck. The dog reacted on the passenger side of the truck. The canine officer said something into a radio clipped to his shirt. The other officer unholstered his gun and held it beside his leg. I couldn't hear what was said, but the officer's body language became more assertive. Two more police cruisers pulled into the lot, lights on, as the two men slowly got out of the truck. \n\nThe two men from the truck were guarded by two officers while other officers searched the truck. The officers took several plastic bags out of the truck. The two from the truck were handcuffed and put into cruisers. The officer who had parked in front of the truck came into the office.\n\n\"Ralph,\" the officer said, \"we'll have a tow truck here soon. You were right again. The dog reacted to some coke which I guess those boys had for personal use. That gave us probable cause to search the truck and we found a lot of fentanyl. I doubt those boys have any legit reason to be carrying fentanyl early on a Saturday morning. Thanks Ralph, this was a good bust.\"\n\nThe officer went back outside. Ralph said, \"Ok, you can be getting on. Sure you've got things to do.\"\n\n\"Thanks for your help,\" I replied. \"At least let me pay you for a room for a night.\"\n\n\"Nah,\" Ralph said. \"You provided entertainment. That's enough.\"\n\n\"How did you know they had drugs in the truck?\" Annie asked.\n\n\"I didn't,\" Ralph said, \"but it seemed like a good guess and it got the cops here pronto like I wanted.\"\n\nWe took Annie home. I guess we were still a bit scared or, at least, unnerved. It seemed better to stay with Annie that night than leave her alone.\n\nWhen we got to the bar Saturday night, Kurt showed us several signs that he'd found taped to his doors when he and Danielle had arrived. Most were too vile for me to repeat, but the gist was that whites and blacks should not be naked together. One said, \"Free Kyle and Blaine, prisoners of the liberal-n****r pigs.\" That made us more determined that Jessie and I dance together again that night. \n\nAround 11 o'clock, Brie said there were several very rough young men in the bar, drinking heavily. Kurt had contacts in the sheriff's office whom he called. The deputies loved calls to the bar because, well, because of Denise, Annie, Danielle, Alicia, Jessie, and Nadine naked. There were five deputies inside the bar by midnight and, we were told, sobriety check points on the road outside the bar's entrance. \n\nJessie and I danced that night but the grim-faced young men standing along the bar eliminated the joy. We dispensed with the after closing time drinks and left as fast as we could. Turning onto the road from the bar, Denise, Annie, and I saw several of the rough young men sitting inside cruisers at the checkpoint.\n\nThe weekend's experiences rattled us, but it wasn't until Wednesday that we understood what it meant. Danielle called that afternoon to say that she and Kurt were at the bar. Someone had set off dynamite outside the bar's front door overnight. Danielle said that the barroom was mostly destroyed. The bar was closed until further notice. \n\nThe bar never reopened. Kurt had property insurance, but his company refused to pay, saying the bombing was an \"act of terrorism\" excluded under the policy. I represented Kurt and had to file suit. Over a year later, Kurt settled with the company for 50% of his loss. The bombers were eventually convicted. At trial, they justified the bombing as necessary to \"preserve the purity of the white race.\" Sick! \n\nDenise and I missed being exhibitionists. Annie missed that and the money she earned at the bar. I never saw Jessie or Nadine again. \n\nWe lost our dancing but got a rewarding case from another of my high school buddies, Ron Morgan. Ron had a cousin, Eve Holgrew, who studied business and cooped at the University. Eve spent a coop semester at Stoth Metals, Inc., the last steel manufacturer left in our region. Eve was an attractive young woman and caught the attention of Stoth's 33-year old owner and CEO Bennett Stoth. Eve was naïve and flattered by Ben Stoth's attention. She started having sex with Ben and eventually agreed to some \"home movies\" with him, just for their personal enjoyment. \n\nEve went back to school the next semester. Her class schedule kept her from fucking Ben Stoth as often as he wanted. Stoth became threatening. Eve stopped answering his calls. Soon, one of the \"home movies\" was posted to a popular porn website. You couldn't see the face of the man whose dick was variously in Eve's pussy, mouth, and ass but you could see Eve's face clearly. To avoid any confusion over the star's identity, Eve's name, cell phone number, and e-mail address were posted with the video. Eve found out when she started getting abusive calls and e-mail. Someone e-mailed copies of the video to every publicly available e-mail address at the University. That led to stories in the campus and city newspapers. It was all too much for Eve Holgrew. She killed herself. \n\nRon said Eve's parents were devastated but he thought there should be something done. He was sure Stoth was involved and told me that a guy who used to work in IT at Stoth Metals, and who had known Eve, had offered to help. The guy was scared to death of Ben Stoth and refused to do anything publicly, but said he had information we could use to go after Stoth. I thought it was worth looking into. So did Vanessa. \n\nI met with the guy who'd worked in Stoth IT at a bar. He wouldn't give me his name, so I'll call him John. John told me it was an open secret at Stoth Metals that Ben Stoth persuaded or coerced any attractive woman working there to have sex with him and Stoth video-recorded the sex. So far, that was nothing too out of the ordinary and none of the women had complained, although Stoth Metals did have high turnover of female employees. \n\nWhat John told me next made the case unusual. John said that it had always seemed to him that Stoth had more server capacity than it needed for its business. John was out drinking with his boss one night and asked about the extra capacity. John's boss said that those servers hosted a website where Ben Stoth posted the videos of his sex with the staff. You could subscribe to the site and watch what Ben Stoth did with his female employees. John had not seen the website and didn't know its address, but he was sure it existed.\n\nAnnie was an expert at finding things on the Internet. We hired her as a consultant and asked her to find Stoth's website. After a few days, Annie found what she thought was the site. We couldn't access the main site without subscribing, which we didn't want to do. There were free \"preview\" videos of three different women. Annie took screenshots of those. I set up a second meeting with John to see if he could identify any of the women.\n\nJohn came through, identifying two women as former Stoth employees. He didn't know the third woman. Denise tracked down the two women whose names we had. I asked Annie to do an image search to see if she could identify the third woman.\n\nAnnie came back to me a couple of days later. \"Harry,\" she said, \"you may have trouble believing this, but I'm pretty sure your mystery woman is a local lawyer.\" Annie showed me a bar directory picture of a young lawyer named Megan Crosby. She put it next to the screen shot from the porn site. It looked like the same face to me. \"Megan used to be at Coughlin & Moore,\" Annie said, naming a prominent local environmental law firm. \"She left there about a year ago for no apparent reason and is now at a consultant, Valley Environmental.\"\n\nI asked Annie, \"Is there any way to download the entire \"preview video\" of Megan?\"\n\n\"I don't know,\" Annie said. \"I'll try.\"\n\nA day later, Annie was back in the office with a flash drive. \"I got it,\" she said. \"There's something I want you to see.\"\n\n\"I'm not sure I want to watch a porn video of another local lawyer,\" I said.\n\n\"I don't think it's really her,\" Annie said. \"Let me show you.\" She plugged the flash drive into one of our computers and started the video. \"Watch the face. Her facial expressions don't match up with what her body's doing.\" You had to look carefully but Annie was right. There were times that the body was doing things, like being fucked hard, that would produce some facial reaction. However, Ms. Crosby's face was expressionless or bored. \n\n\"Can you take a video of one person and superimpose another person's face?\" I asked.\n\n\"Yes,\" Annie replied. \"It takes some AI to get it even this well synchronized, but a sophisticated technician with the right equipment could do it.\"\n\nI didn't think it was smart for a strange man to call Megan Crosby about this. I asked Denise to contact her, explain that we were looking into theft of private videos, and ask Ms. Crosby to look at this video. We made a copy from our copy. Denise called Crosby and met her after work, just long enough to deliver a flash drive with the 25 seconds of \"preview\" video. \n\nMegan Crosby called us the next morning. I answered the phone. Crosby was beyond pissed off. \"Where did you get this?\" she screamed. \"This isn't me! Did you create this?\"\n\nI calmed her down, some. She agreed to meet Denise and me that night at a quiet bar Downtown. When we identified ourselves to her in the bar, Megan's first words were \"This video came from Stoth Metals.\"\n\n\"How do you know that?\" I asked.\n\n\"Stoth cost me my job at Coughlin & Moore,\" Megan said. \"They do Stoth's environmental work. I'd never worked on a Stoth matter before, but I was sent up there to review discharge records. The state EPA found nasty chemicals near one of their Middleburg plants. I get there and the in-house environmental guy immediately takes me to meet Ben Stoth. Stoth made some very inappropriate comments about how I looked. Later, I was alone in a room going over the records. Stoth came in and closed the door. He became very explicit about what he wanted to do with me. I was afraid he was going to attack me, and I screamed. Stoth got pissed but someone started banging on the outside of the door, so he opened it. I went to the office and told the partner-in-charge of Stoth work what happened. A couple days later, I was called into a meeting with him and the managing partner. They said they'd talked to Ben Stoth, that Stoth denied everything, and they had no choice but to believe their client. They said they couldn't have attorneys making \"unfounded accusations\" against clients. I was fired. Then, they gave me six months' severance.\"\n\n\"Ok,\" I said, but how do you know Stoth made this video?\"\n\n\"First,\" Megan said, \"that isn't my body and I can prove if it I have to.\"\n\n\"How?\" Denise asked.\n\n\"I'm a natural blonde,\" Megan said. \"The body in the video has dark pubic hair. That video came from Stoth because what the guy is doing to the girl is exactly what Stoth said he wanted to do to me. I'll never forget that. Also, Stoth has security cameras everywhere. That is how I wore my hair when I went to Stoth. I changed it just after I was fired. Salon therapy.\"\n\nMegan Crosby turned an investigation into a potentially good case. Most of what we knew about Eve Holgrew came from her own journal, which was probably inadmissible hearsay. Denise had talked to the other two women we'd identified. They said they'd had sex with Ben Stoth while working at Stoth Metals and knew Ben was making videos but denied consenting to the videos being on any website. I thought that Stoth probably had access to their signatures and could forge consents. Moreover, a jury might feel that they'd been stupid agreeing to be recorded and had \"asked\" for what happened. \n\nMegan was different. She hadn't done anything wrong or exercised bad judgment. She was pure victim. She was articulate and very attractive in an understated way. She was the perfect lead plaintiff. Megan agreed to strip naked for Denise and Annie. They confirmed to me that the body in the video was definitely not Megan Crosby's body. After thinking about it for, maybe, ten seconds, Megan agreed to let us represent her in a suit against Ben Stoth and Stoth Metals. We filed the case in April.\n\nThat started a year of tough fighting. In short, a court order gave us access to Stoth's servers. Of course, they'd been wiped clean. Vanessa's boyfriend, Jason Monaghan, an investigator for the Illinois Attorney General, hooked us up with a topflight, extremely expensive, computer forensics specialist. The computer guy retrieved virtually the entire website from the Stoth servers; videos, logins and passwords, and payment records. Over a couple of years, Stoth had grossed about $ 300,000 from his website.\n\nThe Stoth case was nasty. As more women in the videos joined the case, Stoth's lawyers accused us of soliciting clients. We expected that and had documentation that the women had asked us to represent them, not vice versa. We also had documentation that we'd given each woman the names and numbers of two other lawyers, not connected with us, whom we knew were willing to represent them. We had the solicitation charge beaten, but it was no fun being attacked.\n\nAs the case reached its first anniversary, Annie was spending a lot of her time with Sean Dunn, a Ph. D candidate in economics whom she'd met at the University. Sean became very important in Annie's life and, consequently, in ours. Given our intimate relationship with Annie, Denise and I tended to be proprietary about her. We scrutinized Sean intensely and he passed with flying colors. More important, Annie was falling in love with him.\n\nSean was very bright but not at all arrogant about that. He was funny, kind, and, unlike Annie's previous boyfriend Colin, very considerate of Annie. I don't think Sean is an exhibitionist like the rest of us, but he had no hesitancy getting naked with us and anyone else who happened to be around. Annie assured us, and we later verified by in-person observation, that Sean gave her very good orgasms. Annie said that she'd told Sean about her relationship with us early on and he treated it as perfectly natural. I came to learn over the years that Sean Dunn and I shared at least one very strongly held opinion: Denise Hines and Annie Gentry are the two most desirable women in the world.\n\nIt had been more than a year since Kurt had been forced to close the bar in New Bethel. Denise, Annie, and I had not had any real outlets for our exhibitionist urges. Denise, Annie, Sean, and I went skinny dipping in the lake by Annie's grandmother's house. Amanda and Greg joined us occasionally. That was just getting naked with good friends (how else does one dress with close friends?). It wasn't really showing off.\n\nVanessa came to our relief. She had a friend in Chicago, Karen Bloom, who aspired to design jewelry. Vanessa said Karen's designs were very good. However, Karen couldn't find anyone willing to manufacture and market her jewelry. As Vanessa put it, \"Karen peddled her ass in New York, Miami, Chicago, San Francisco, and LA and didn't get shit.\"\n\nKaren's final effort was to do a fashion-show style exhibition of her work in her hometown. She borrowed a lot of money to have several of her pieces manufactured. Vanessa fronted money to rent a ballroom in a Downtown hotel, for catering, and for an open bar. The shtick was that the models would walk the runway wearing Karen's jewelry and nothing else. The problem was that Karen didn't have the money to hire professional models.",
        "Vanessa asked if we would be the models. Karen wanted at least three women and one man. Denise, Annie, and I were happy to do it. Vanessa wanted to be the third woman but thought that would hurt her growing reputation as a lawyer in Chicago. Only a handful of people in Chicago knew us. We asked Alicia, who had a schedule conflict. Danielle agreed to be the third woman. Danielle always claimed that dancing nude was just part of her \"artistic expression.\" In fact, Danielle was at least as much an exhibitionist as the rest of us.\n\nThe show was on a Friday night in June. Admission to the show was invitation only. Vanessa told us 75 people RSVP'd: jewelers, department store buyers, and media. Reporters were coming from the Tribune, Sun-Times, Chicago magazine, even, I think, from the Daily Northwestern. A TV station, maybe WLS, was sending a crew. I wondered what they'd get that they could air.\n\nKaren showed us the pieces we'd be modeling. The things she'd designed for the women made, at least some, sense. The pieces I was to wear were, I thought, just dumb. More about that later. The show would start at 8:30 p.m. and run until 10:00, meaning we'd spend a lot of time on the runway. The show would be followed by an hour-long reception in the same room. Denise, Annie, Danielle, and I were supposed to mingle during the reception, naked except for bits of Karen's jewelry.\n\nThe four of us stripped off and Karen put the first round of jewelry on us. The women got things like chokers, bracelets, and ankle bracelets. My first item was a ring. I had to walk the runway naked, holding my right hand up in front of my chest. My second items were bracelets that went around my biceps, suggesting ancient Rome, I guess.\n\nYou expect me to say it, but it was true: walking the runway naked was a blast. People were seated on both sides and at the end of the runway. Their heads were roughly level with our feet. The light from the TV camera made it hard to see individual faces, but it felt great to know that all those people were looking up at our naked bodies.\n\nThe last piece I wore was a diamond encrusted cock ring. As Karen put in on my dick, I said, \"Karen, you know this is really stupid.\"\n\n\"They aren't real diamonds,\" she replied.\n\n\"No,\" I said, \"I mean the concept. I couldn't wear this to have sex with anyone. I'd cut the poor woman up so badly she'd be in the hospital.\"\n\n\"I know,\" Karen said with some frustration. \"This is purely for shock value, to grab attention.\"\n\nI walked down the runway with light glinting off the stones that encircled my dick. I thought the cock ring was more stupid than shocking, but it was fun knowing that everyone in the room was looking at my dick.\n\nAs I came off the runway, Denise stood ready for her last turn. She wore a gold chain which circled her neck and ran as a single strand down her belly, between her legs, between her hips, and up her back to her neck. It looked better than my description makes it sound, probably because it was on Denise. Denise said, \"I like how this rubs me as I walk.\" With that, she walked down the runway.\n\nAs I've said many times, Denise is stunningly beautiful wearing anything and much more beautiful naked. She looked especially beautiful as I watched her on the runway that night. When she turned and walked back towards me, she looked proud and confident. I could also tell from her face that Denise was having the time of her life. All the years I've known her, Denise has always enjoyed people seeing her naked. That joy was never more evident than that night in Chicago. As Denise came off the runway, we hugged. \"If I could live the rest of my life without ever putting on clothes again, I'd do it,\" Denise said. I wasn't sure how, but I intended to make Denise's wish real.\n\nThe reception was interesting. We models were supposed to mingle wearing the last pieces we'd worn on the runway. That meant I was mingling with men in suits and women in dresses while I wore only that idiotic cock ring. At least we were allowed a couple of drinks. Understandably, Denise and Annie got the most attention; from men and women. I was interviewed by a mildly attractive woman from the TV station. For most of the interview, the camera was on my face. Before she ended the interview, the interviewer insisted that the cameraman film my dick with the cock ring. That would never go on air, but I figured it would make the rounds internally at her TV station.\n\nAnnie, Sean, Danielle, and Kurt were staying at another hotel where Vanessa had gotten a deal. Vanessa was fronting the money for those rooms. The four of them were going home Saturday morning. Vanessa, our employer, wanted to meet with Denise and me Saturday morning. We were staying that night and the next with Vanessa and Jason.\n\nVanessa owned a five-story building a few blocks north of the Chicago River and a few blocks west of Lake Michigan. The building looked old. I don't know what it had been. Now, the first floor housed a popular restaurant. The second floor was empty to buffer the floors above from the kitchen smells. The third floor was Vanessa's law office. The fourth and fifth floors, connected by an internal staircase, were where Vanessa and Jason lived. \n\nVanessa had recently added a patio to the roof of her building. It was a warm night so the four of us stripped off and went up there after we finished at the \"fashion show.\" Vanessa's roof was overlooked by other buildings. She said they only went nude up there at night and the lighting was very low, so Vanessa didn't think her neighbors would be a problem.\n\nDenise and I were both horny as hell after the \"fashion show.\" As we sat together on a lounge chair, talking with Vanessa and Jason, we were fondling and fingering each other. Finally, Vanessa said, with a slight chuckle, \"It's ok. Do what you want to do.\"\n\nThat was all the permission we needed. Denise and I have made love many places. On the roof of a building on Chicago's north side that night was one of the best. \n\nThe next morning, the four of us went, nude of course, to Vanessa's office to talk about work, primarily the Stoth case. Jason had a full-time job with the State, but Vanessa had a contract with him to be an investigator for her office in order to preserve confidentiality when she discussed cases with him. Jason was intelligent and an experienced investigator and trial witness. He brought a lot to the discussion.\n\nWhen we finished business, Vanessa said, \"I want to show you two something.\" She led us out of the office into the vestibule where clients and others stepped out of the elevator. On the wall opposite the elevator was a framed photo, roughly three feet high by two feet wide. It was a frontal picture of Vanessa, nude, from below her knees on up. It was lovely.\n\n\"Who did that for you?\" Denise asked.\n\n\"Jeff,\" Vanessa answered, \"the photographer in your building.\" Denise gave me a look that said we should make an appointment with Jeff.\n\nThat afternoon, Vanessa and Jason took us, clothed of course, to a Pirates-Cubs game at Wrigley. That night, the four of us went to a small skinny dip party hosted by friends of Vanessa at their home in Kenilworth.\n\nHome after a fun trip to Chicago, Denise and I were back into the Stoth case. As we'd discussed with Vanessa, we had great evidence that Ben Stoth was a shitty person who'd used his company to shit on the women who were our clients. Where we had problems, apart from Eve Holgrew, was in proving damages. None of the women, not even Megan, had lost a job, a boyfriend, or a spouse because their videos (fake video in Megan's case) were on the Internet. Of course, it was very distressing to find out someone was selling videos of you having sex (enthusiastically and energetically in several of the videos). But the women hadn't found that out until we told them. We hoped a jury would be angry enough at Stoth to award a big number without nitpicking what harm Stoth had caused. We really hoped for a settlement.\n\nVanessa took the initiative to create pressure. Despite the lurid facts, the media had paid little attention to our case. Vanessa called her contacts in Chicago who, in turn, called contacts in the national business press. Stoth Metals was the largest privately owned steel and metal manufacturer in the country. Ben Stoth had a seat on an ad hoc business advisory council created by the President.\n\nFinally alerted, the national business press made a big deal out of the scandal at Stoth Metals which bled over into the general media. That was when we found out that Ben wasn't sole owner of the company. Ben had cousins in Boston and Marin County who each owned twelve and a half percent. We learned that when the cousins sued Ben in federal court alleging that Ben had breached duties owed to them as minority shareholders by using Stoth Metals for his own gratification and enrichment, diminishing the value of the company and, consequently, devaluing their shares.\n\nAbout five weeks after the cousins sued, Ben's lawyers called us. The cousins wanted our case settled and had buyers for Ben's 75% of Stoth Metals at a price just over a quarter billion (yes, billion) dollars. The offer was for Ben to keep $ 10 million and pay the rest of the purchase price to settle our case. Our clients wisely said yes.\n\nThe sale of Ben's shares in Stoth Metals closed two weeks later. The next day, Megan Crosby, Eve Holgrew's parents, the other women in our lawsuit, Vanessa, Denise, Annie, and I waited in our office in The Overlook. A lawyer from the firm representing Stoth brought an envelope. We gave her a different envelope. The envelope we gave contained releases signed by all our clients. The envelope we received contained several cashier's checks in eight figure amounts. Most of our clients hurried to their banks, richer than they'd ever imagined. \n\nAlthough, or because, she'd just gotten a check for $ 24 million, Megan Crosby stayed a few minutes longer to thank us. As Denise and I walked Megan to the elevator, she stopped and pointed to the wall opposite the elevator door. \"I really like that picture,\" she said with a smile. No one else had mentioned it. We had hung a framed picture of Denise and me like the one of Vanessa in her Chicago office. In the picture, Denise and I were facing the camera each with an arm behind the other's back. The picture showed us from the tops of our heads to mid-way down our calves. We were both nude.\n\nAfter the clients left, Vanessa held up the largest single check from the settlement: to Gibson Law Offices for our one-third contingent fee. Vanessa had already agreed to split the fee 50-50 with Denise and me. We were going to give Annie a $ 1 million bonus for her work. Even after deducting that and taxes, Denise and I would have a lot more money than I'd expected to gross over my whole life. We'd hit the jackpot. It didn't seem real.\n\n\"What do we do next?\" I asked Vanessa. \n\nVanessa said, \"Jason and I have talked about that. How do you two feel about warm climates?\"\n\nSeveral things happened following the Stoth settlement. About ten days later, Denise told me that Megan Crosby had called and, based on that call, Denise had made an appointment for the three of us with Jeff, the photographer downstairs. The appointment lasted a couple of hours and we all had fun. I saw firsthand that the body in the sex video purportedly of Megan Crosby was nowhere near as attractive as Megan's real body. The takeaway for Denise and me was another photo like the one in our elevator vestibule, except this one had Megan standing nude between us.\n\nA week after our photo session, Denise and I flew to Portland for a wedding. The former Lena Mann was marrying Denise's brother, now Lieutenant Colonel David Hines. That was a clothed wedding. Two weeks later, Denise and I were naked, as were the bride, groom, and other guests, at Vanessa's wedding to Jason. The wedding was very small and held in the backyard of her Kenilworth friends. The reception, at a hall in Niles, included many of Vanessa's former clients. You had to be there.\n\nVanessa and Jason didn't immediately leave for a honeymoon. Instead, Denise and I flew with them to Ft. Myers, Florida. We changed airports and took a prop plane to a small barrier island in the Gulf that had a landing strip and about fifteen very nice houses, but no road access from the mainland. Vanessa wanted us to see two adjoining homes on the Gulf side beach. Vanessa had found out that, while Florida beaches on the mainland were mostly public, homeowners on the island owned the beach down to the mean low tide line. \"That means, we'll have our own nude beach,\" Vanessa gushed. One house was up for sale and the four of us offered a premium to buy the other house too. \n\nDenise and I took title to one house and Vanessa and Jason to the other. We then deeded both properties to the four of us as joint tenants with right of survivorship. The idea was to create a single enclave over which we'd all have equal control. The last deed contained a restriction stating that none of the four of us nor any future children were permitted to wear any clothing except footwear anywhere on the property at any time unless \"weather or other conditions make clothing necessary to avoid injury or extreme discomfort.\" It was as close to Denise's dream of living the rest of her life nude as we could get.\n\nAfter buying our new homes, Vanessa and Jason left to honeymoon in Europe. Denise and I went home for yet another wedding. I'm not sure what Wes Gentry really thought about walking his naked daughter Annie \"down the aisle\" to marry her naked groom Sean. I'm not sure what Wes or his wife Carla thought about the fact that their other daughter, Amanda, and Denise were the nude bridesmaids or that Amanda's husband Greg and I were the nude groomsmen. However, Wes and Carla took their daughter Annie's nude wedding to Sean Dunn in seeming good humor.\n\nThe last wedding was, for me, the most interesting. I remember the warm breeze on my bare body as I stood in the backyard of Kurt and Danielle's house watching Dave walk Denise \"down the aisle\" towards me. Dave's civilian suit emphasized Denise's nudity. Standing beside me, also nude, were Sean, Greg, and Kurt. To the right of the very progressive minister who'd agreed to perform the wedding were Annie, Amanda, and Alicia. They were also nude and looked very beautiful in the mid-day sun.\n\nDenise and I had gotten a hotel room for the night after our small reception. Our apartment bed wasn't big enough for what we had planned. Denise and I had already undressed when Annie, Sean, Amanda, and Greg knocked at our door. Annie had two bottles of champagne. Our friends undressed. We opened the champagne and toasted our three marriages and our friendship. Giggling, Denise, Annie, and Amanda lay down on the bed on their backs. Annie, in the center, was rubbing shoulders with Denise and Amanda.\n\nSean, Greg, and I stood for a moment looking at the three beautiful women. Then, we each got on the bed above our own wife and began making love. The six of us called it our \"consummation of marriage and perpetual friendship.\" Denise and I slept on our wedding night in bed with Annie, Amanda, Sean, and Greg.\n\nIt is time to finally end this memoir. The law firm, Gibson & Stone LPA, still exists. It is now managed by Megan Breaden (nee Crosby). Denise and I spend most of our time now nude on the island. It is a joy every time our daughter Gwen comes home from college to see her strip off her clothes and run into the surf naked like she did growing up. Jason fell victim to cancer, but Vanessa still lives next door and is the island's grande dame. Denise, Vanessa, Gwen (when she visits), and I still abide by the deed restriction requiring us to go nude on the jointly owned property. \n\nAs I mentioned in a prior chapter, Denise, Annie, Sean, and I spend every Christmas night together making love to the other spouse. That was challenging while Annie and Sean lived near New York. Annie and Sean bought their own house on the island a few years back. Denise and Annie are still the two most desirable women alive. Proximity means that we make love to each other's spouses more often than just Christmas but only, ever, when all four of us are present. \n\nDenise, Annie, Vanessa, Sean, and I never wear clothes anywhere on the island. Gwen, Annie and Sean's son Ross, Amanda, Greg, and Amanda and Greg's daughter and son-in-law all stay nude when any of them visit. The other island residents have never complained about our nudity and, more and more, are going nude themselves.\n\nRoss is also in college. He and Gwen try to time their trips to the island to coincide. It is heartwarming to see the two young people nude on the beach holding hands or hugging."
    ],
    "authorname": "HStoner",
    "tags": [
        "exhibitionist",
        "exhibitionism",
        "nude modeling",
        "partner swapping",
        "public nudity",
        "nudity",
        "group",
        "group sex"
    ],
    "category": "Exhibitionist & Voyeur",
    "url": "https://www.literotica.com/s/her-second-job-ch-07"
}