{
    "title": "A New Way of Seeing Things Pt. 04 Ch. 03",
    "pages": [
        "Standard disclaimers.\n\nThis is a story about sexual exploration and, open relationships. Open relationships can and do happily exist; but they are not for everyone. If you do not believe it is at all possible for open relationships to exist without damage to any and all involved parties, please do yourself a favor and don't waste your time reading this.\n\nAlso, this story takes place in a world where STDs don't exist and only babies planned for and wanted do—in other words, a fantasy world. Any resemblance to real-life people is purely coincidental. \n\n*****\n\nThe text Tim had sent from the driveway warning of his delay did little to dampen Charlie's displeasure and none of his impatience. \n\n\"This time of day I'm gonna have to park the trailer in the fuckin' boonies after I unload the boat,\" his friend grumbled as Tim pulled his truck up driver window to driver window a distance up the lake's access road. \n\n\"The walk'll be good for you.\" \n\n\"Fuck that. You're the one that's late. Go park your truck then get down there and help me get the boat in. I'll stay with it while you go park my fucking truck.\"\n\nFair trade for a good fuck, Tim thought and said no more. In the end, the walks weren't that bad, but it was probably good he was the one who had taken them—it would have been more of an effort for Charlie and would only have only pissed him off more. A steady diet of fast food and lots of beer had added quite a bit of weight to his friend's frame since high school, and it was finally catching up with him.\n\nHis mood did not noticeably brighten once they were on the water, Tim good-naturedly listening to the muttering about all the best spots being taken, the fish having already risen to feed, and the melting ice in the cooler. Finding one of their favorite areas unoccupied did help.\n\n\"You're never late,\" Charlie grumbled as he began casting. \"For anything. Especially for fishing. What the fuck happened?\" \n\n\"I was twenty minutes late. It's not like I made you wait all morning.\" \n\n\"Half an hour. Close enough.\" \n\n\"Christ, is this going to piss you off all day? What's your problem? You sound like you are in sore need of a blowjob.\"\n\nThe big man began to laugh, unable to keep up his surly front. \"I'm always in need of a blowjob, just not from you!\" He watched his next cast strike the water, nodding with satisfaction at the placement. \"Everything okay?\" \n\n\"Yup, fine. Something came up with Gwen just before I was getting ready to leave.\"\n\nCharlie's voice took on a tinge of concern. \"Uh-oh. That don't sound good. She's not pissed you're fishing today, right?\" \n\n\"Nope, she's good, too. Matter of fact, I woulda been later but she knew you were waitin' for me and hustled me out the door as soon as I was done.\" \n\nCharlie's focus was on the empty lure he was reeling in. \"And whatever the hell it was couldn't wait 'til you got back?\"\n\nTim's first instinct was to give as neutral an answer as possible, like he always had when talking about his sex life when there hadn't been anything to talk about, but that had changed. On the other hand, he had spent many mornings on the lake listening to Charlie describe his bedroom feats in great detail. Now that he had the stories of his own, Tim couldn't resist the urge to brag a bit, to give back at least half as good as he had gotten from his friend all of those years. He couldn't talk about last night, but this morning was fair game... \n\nTim continued to look out across the water. \"I was gettin' laid.\"\n\n\"The fuck you say!\"\n\n\"Yup. Good enough for ya?\"\n\n\"Shit! Why didn't you say so? That's an excuse I can get behind! So what happened? You wake up with morning wood and make Gwen take care of it for ya?\"\n\n\"How long have you known Gwen? Do you really fucking think I can make her do anything? It was her idea.\"\n\nCharlie smiled mischievously. \"Okay, so you begged her to take care of yer mornin' wood and she felt bad for ya?\"\n\n\"Fuck no. I didn't have morning wood.\" Cricket took care of that the night before, he thought. \"I was all ready to get in my truck when she backed me up against the sink, dropped my pants and went down on me.\"\n\n\"No shit? She gave you a blowjob and you didn't have to ask her for one?\" Charlie said slowly, the doubt in his tone mixing with hope. \"Okay...so then what? You gonna tell me she got you off like that?\"\n\nTim felt an irrational urge to squash the idea that Gwen called the shots even in their sex life and made up a little white lie. \"She probably would've if I wanted her to, but I bent her over the table instead and did her that way.\" \n\n\"The table?\" Charlie's vivid mental image of the master bathroom Gwen was on her knees in didn't contain that particular piece of furniture. It suddenly dawned on him which room had both sink and table...the vision in his mind smoothly shifted to the spot where he had sat many times enjoying more than a few beers. \"You were doing her in the kitchen?\"\n\n\"Told ya, I was just about out the door...had my coffee and everything.\" \n\n\"So she started it and you finished it...yeah, I woulda been late, too. I might notta showed up at all.\" Charlie wanted more detail for his imagination. \"What was she wearin'?\"\n\n\"One of my t-shirts.\" \n\nGwen went from sprawled across the table naked to sprawled across the table with her shirt flipped up over her ass. \"Yeah, that would make gettin' to her pussy easy enough,\" he sagely agreed as if solving a vexing puzzle. \"Good thing her friend didn't stay over,\" he added with a laugh.\n\nTim was surprised at how much fun he was having watching his friend try to digest all this and couldn't resist adding fuel to the fire. \"Cricket? She did. She was still in bed.\" He left out whose. \n\nCharlie's eyes grew wide. \"No shit? And Gwen still wanted to polish your knob in the kitchen? Wouldn't she have freaked if you got caught?\" \n\n\"Maybe,\" Tim lied again with a shrug. \"I guess she thought it was early enough we wouldn't get interrupted. Her friend sleeps late.\"\n\n\"She probably thought that since you're a minuteman it was only gonna take a few seconds anyway,\" the big man guffawed.\n\n\"I could have gone a lot longer than I did,\" Tim retorted, remembering how tempting that little pucker winking up at him had been, \"but like I said, Gwen knew you were waitin' and didn't want to make me too late.\"\n\n\"Well, you tell her that was damn nice of her to be thinkin' of me when you was doin' her. Ya did stay long enough to get her off too, right? At least try?\" Charlie asked, his voice dropping lower.\n\n\"I was gonna, but like I said, she didn't wanna make you wait.\"\n\n\"Look, I know you're kinda new at this whole fucking thing, so remember that ya always gotta make sure to try and get 'em off,\" Charlie patiently offered. \"Even if you don't make 'em come, they like that you didn't just pump and dump 'em. \n\nTim smiled to himself. Charlie sounded like he was giving pointers on how to frame a wall to a new hire he liked. \"Thanks, I'll remember that.\"\n\n\"And as far as getting' 'em off, I figured out a long time ago that just havin' a big cock ain't enough so ya gotta do other stuff. Me, I got good at eatin' pussy,\" he said with pride. \"Your cock's gotta be a lot smaller than mine so I'd guess you're gonna have to get real good at that to make up for it. She does let you eat her out, right?\" \n\n\"Yeah, she does.\"\n\n\"Ya like it?\"\n\n\"Yup.\"\n\n\"Then practice as much as she'll let ya. Yer tongue'll get tired but her pussy'll thank you,\" the big man chuckled.\n\nI got twice the practice last night, Tim silently replied. Still, he couldn't resist tweaking his friend a little. \"But the time's gotta be right, right? Practice before I fuck her? Not after?\"\n\n\"Whatever floats yer boat,\" Charlie replied with a noncommittal shrug while staring out across the water. \"I ain't gonna judge ya by how thick and salty you like your pussy juice.\" \n\nThey were silent for a while, the boat nearly motionless in the still water, the shade slowly retreating from their spot as the sun began to climb overhead. \n\n\"If you don't mind me sayin' so, I think you got a—whaddya call 'em—exhibitionist on yer hands.\"\n\n\"What do you mean?\" \n\n\"You know, exhibitionist—a girl who likes to show off her stuff, really likes to show it off. I mean between the picture at the country club AND doin' it in the locker room, and your kitchen, I think she wouldn't mind bein' seen. Somethin' ya might want to encourage, know what I mean?\" \n\nTim grinned. \"Yeah, maybe. I know I'm seein' plenty.\" \n\n\"Speakin' a which, you get any pictures?\"\n\n\"You mean of this morning? Of me and Gwen?\"\n\n\"No, of the sunrise. Shit yeah, you and Gwen. Mainly Gwen, but if you're in 'em I'll try and not laugh at yer dick.\"\n\nTim looked over to Charlie studying his latest cast. \"No, no pictures. I was kinda in a hurry, you know.\"\n\n\"Yeah, I get it...you ever take pictures of you two goin' at it?\"\n\n\"Naw, I'm busy enough when we're doin' it without havin' to handle a camera.\"\n\nCharlie laughed. \"Yeah, that took some practice for me, too. So, you got any more pictures of Gwen where you're not goin' at it?\" The big man turned to look at Tim, suggestively raising an eyebrow.\n\nTim had not shown his friend the pictures Gwen had allowed him to take of her spread wide and on all fours yet; the time had never been right, and he wasn't sure now was, either. He did have some others, though, some that were more anonymous. He chuckled and shook his head. \"Just of her new haircut.\"\n\n\"Gwen got her hair done? I don't think I ever seen her with nothing but a mom cut and a ponytail.\"\n\n\"Yup, she cut it short—real short.\"\n\nCharlie groaned in disappointment. \"Short? I hate when girls get their hair cut too short—makes 'em look a guy with tits.\"\n\n\"Naw, she definitely still looks like a girl.\" \n\nThe big man sighed. \"Well, lemme see what she did to that pretty little head of hers. Hopefully she left enough for you to grab on to when you got her bent over.\" \n\nTim reached for his phone, working to keep his expression neutral. \"Got a before, during, and after picture.\"\n\nCharlie wedged his rod between his foot and the side of the boat and reached for the offered phone. \"I like a ponytail to grab—\"his lament was cut off mid-sentence and his eyes widened, staring at the first picture, then up at his friend. \"Whoa.\"\n\nTim maintained his air of indifference. \"Yeah, it was getting' kinda long, not that I cared.\"\n\n\"Holy Shit, is this Gwen?\"\n\n\"No, it's me. Who the hell do you think it is?\" \n\n\"Whoa. That's what you mean by haircut? It kinda looked like she was shaved in the picture you showed me from the country club, but it was hard to tell since you wouldn't send it to me so I could get a closer look.\" \n\nTim ignored the jab. \"She had it trimmed pretty short in that one, but kinda let it go for a while after that.\"\n\n\"Yeah, she's a little furry. Not bad though, I seen way hairier. Looks kinda smooth and soft like that, like it'd feel good to pet.\" Charlie had to will himself to swipe to the next photo, fearing that once gone he might never see this sight again. Shaving cream now obscured his view, but the hips, waist and spread thighs of a naked woman—Gwen Nelson, he reminded himself, Gwen-fucking-Nelson—were still there in all their glory. He swiped back to reassure himself the first photo was indeed still there, then swiped forward twice. \"Ho-lee shit,\" he murmured, pinching the screen to enlarge it. The result was a little grainy, but still very recognizable as freshly-shaved cunt, a mound of bare flesh sitting above two puffy outer lips, just the hint of the inner lips peeking out between them. \"Ho-lee shit,\" he repeated, \"I do love me some bare pussy! When you said short I didn't know you meant this kind of short!\" He laughed self-consciously. \"Yer right—she does look like a girl!\"\n\nTim nodded, an easy smile finally breaking through. \"Yup.\"\n\nThe pictures were flipped back and forth again and again, each one enlarged until the image quality made it difficult to recognize what he was looking at. \"Fucking hot,\" he murmured, studying them intently. \"Never thought I'd see that. You're a lucky sumbitch. But I still think somebody stole the old Gwen and replaced her with this one.\"\n\n\"Still the same Gwen,\" Tim disagreed. \"Loves her horses and her kids and will fuck up anyone who messes with either of 'em. She just decided that sex ain't all that bad, I guess.\"\n\n\"And the world's a better place for it,\" Charlie replied somberly before chuckling. He waggled the phone. \"Can I have 'em?\" \n\n\"I told you, Gwen doesn't know I'm showing 'em to you. If they got out, she'd go apeshit and cut me off.\" \n\n\"Swear to God, she won't find out,\" his friend pleaded. \n\n\"What do you want 'em for, anyways?\"\n\n\"Let's just say I'm a collector of fine art.\" \n\n\"You're gonna jack off lookin' at 'em, aren't you?\"\n\n\"Can't promise I won't...that don't piss you off, right? I mean, you told me you jack off to the ones I send you.\"\n\n\"I didn't tell you that.\"\n\n\"You didn't say you didn't when I asked, so that means you did.\" Tim had to admit his friend's logic was sound. \"It's not like I'm gonna hit on her or anything, just pay her tribute in my own special way.\" \n\nTim chuckled and shook his head. \"You're gonna jack off thinking about the pictures anyway, whether you got 'em or not.\"\n\nHe shrugged. \"What can I say? Sorry, I got an active imagination. The pictures are just to refresh my memory.\"\n\n\"Why don't you get a girl to work out that imagination on? This is the longest I've ever seen you go between girlfriends.\"\n\n\"Too busy at work, man,\" Charlie groaned. \"You know that. Hell, I ain't even been making it down the titty bar.\"\n\n\"You need to cut back some,\" Tim warned. \"You're killing yourself.\"\n\n\"Gotta go hard when times are good to get you through when times are bad,\" he retorted. \"You know that.\"\n\n\"Keep it up and you won't make the next bad time.\" \n\n\"Fuck that. I'll be around to kick the next bad time's ass. Now c'mon, how 'bout them pictures?\" \n\nTim looked at him intently, studying him. \"You got your phone?\" \n\nCharlie scrambled to find it. \"Yeah?\" \n\n\"I'm going to send you these. Then I'm going to watch you save the pictures and delete the e-mail so nobody knows it came from me. If you show them to anybody—and I mean anybody—I will tell everybody about that time you told that girl to stick a carrot up your ass. We good?\"\n\n\"Hey, I didn't tell her to, she did that all on her own. I told you she was horny, I passed out and she got pissed...the pictures are private use only, swear to God. I'm a fine arts collector, remember?\" \n\nTim began to type. \"You want all three? The middle one doesn't show much.\" \n\nCharlie laughed. \"Yeah I want it. Shows enough, and I can pretend the shaving cream is my jizz.\" \n\n\"You really don't give a shit that's my wife's pussy under the shaving cream, do you?\" \n\n\"I very much give a shit. Hey, if I thought you were pissed that I was beating off to your wife I would—\"\n\n\"Not tell me you were beating off to my wife?\"\n\n\"Well, yeah, probably not,\" Charlie admitted with a laugh. \"But hell yeah I give a shit. It's fuckin' hot to finally see what yer slippin' yer dick in to after all these years. But that's it. I just look, I don't touch. Hey, I seen plenty of pictures of other guys' women, but have you ever seen me make a move on 'em?\"\n\n\"Other guys have shown you pictures of their wife?\" \n\n\"Made some trades. I sent them some, they sent me some. See how that works? Wives and girlfriends and one night stands,\" Charlie clarified. \"Saved every one, Got a decent collection. And not just pictures, movies too. And I didn't even tell you and don't even ask who I got. See? I keep that shit private.\"\n\nTim thought for a moment. As his friend had pointed out, he had never seen him go after someone he knew was in a relationship, even if he knew the relationship was in bad shape. In fact he could remember times when Charlie had pulled off of his target the moment he had realized she was someone else's girl. He did seem to have an almost admirable respect for those boundaries.\n\n\"There's no way in hell I would ever make a move on another guy's woman, and I sure as hell wouldn't do it on Gwen. If I didn't give a shit I'd be over to see her first chance I got, trying to get her to show me more. But I do give a shit, so I'm happy with the pictures and knowin' that you're finally getting' the real thing on a regular basis. Like I said, I got a healthy imagination, but I don't do nothin' more than make shit up in my head. Ya gotta admit, a beautiful woman like Gwen is prime stroke material.\" \n\n\"Everything with a pussy is stroke material to you.\"\n\n\"Some are a lot easier to stroke to than others,\" he admitted with a chuckle and looked at the message he had just received. \"'Course, I been getting home from work so late I've been fallin' asleep before my dick can wake up for a workout. These,\" he waggled the phone at his friend, \"are worth staying up for.\" \n\n***\n\n\"Sorry I'm late,\" Tim offered as he stepped into the kitchen. Gwen was at the kitchen counter cutting up vegetables for dinner, dressed in one of her t-shirts. Unlike the one of his she had been wearing that morning, it wasn't long enough to cover her naked rear end, a view that always made him smile.\n\n\"You didn't say when you'd be home, so you're not late,\" she reasoned, turning her head over her shoulder to accept a kiss. \n\nHe pulled a beer out of the fridge. \"Charlie wanted to head back to the landing at about 1, but I kinda made him stay out later. I knew he was gonna go back to do paperwork right after and he needs the break, whether he wants it or not.\"\n\n\"He may have his faults, but he's always been a hard worker.\" \n\nTim chuckled. \"You're right about both his faults and his work habits. When did Cricket leave?\"\n\n\"About an hour ago.\"\n\nHe wrapped his arms around her waist and looked over her shoulder. \"What'd you guys do today?\"\n\nGwen rubbed her ass against his jeans. \"Oh, the usual. Chores in the barn, rode...\n\n\"Anything before you went out to the barn?\"\n\n\"Breakfast,\" she teased.\n\n\"Anything else?\"\n\n\"Well, I did go back to bed after you left...\"\n\n\"I'm guessing you didn't go back to sleep?\"\n\n\"Not really...\"\n\n\"So I guess you don't need me to finish what we started this morning?\" \n\nShe laughed. \"I didn't say that. Let's just say you have time to go take a shower, we can have dinner together, and then see what happens.\" \n\nHe released her, playfully slapping her bare butt and getting a mild squawk in reply. \"Shower. Right.\" \n\n\"Want to tell me what you did after you went back to bed?\" Tim asked with a smile after they had finished dinner on the deck. \n\nGwen smiled mischievously. \"In a bit.\"\n\n\"In a bit,\" Tim agreed with a grin. \"Okay, so what'd you two do after you both got up?\"\n\nOh, you know, like I said, chores in the barn, breakfast, went for a ride over the hill, stopped at the picnic table to eat lunch, came back and went for a swim.\" \n\n\"Just a swim?\"\n\n\"Just a swim.\" \n\n\"Did you wear suits?\" Tim growled suggestively with a raised eyebrow.\n\nGwen laughed. \"Do we ever any more? I swear we've become a regular nudist colony up here!\" \n\nHe smiled and shrugged. \"I got nothing to hide, and I think I'd be very happy if you never wore clothes ever again.\"\n\nIt was her turn to raise an eyebrow. \"It does occasionally get cold here you know, and I don't think running around naked during business hours would count as an act of professionalism.\"\n\n\"Yeah, yeah,\" Tim agreed with a dismissive wave. \"It would be a hell of an incentive, though.\" \n\nA pleasant silence descended around them in the early evening air. \"Was Charlie upset that you were late?\" she asked softly.\"\n\n\"He was until I told him why,\" he answered slowly. \n\n\"Oh! You mean you told him...everything?\"\n\n\"Pretty much. Just about this morning, though, not about last night,\" Tim quickly added.",
        "\"Oh—okay, that's okay...\"\n\n\"I should also probably let you know, Tim said softly, \"I showed Charlie the pictures you sent me the other day—you know, the ones of you shaving?\"\n\n\"Oh.\" Gwen felt a surge of nervous excitement and did her best to remain calm. \"What did he think?\" \n\n\"He liked 'em. A lot.\"\n\n\"Well, that's okay too, I guess.\"\n\n\"I, uhh, sent them to him, too—I made sure he deleted the e-mail so nobody knows they're from me, or they're of you. But I really don't think he's gonna show anybody else,\" he hurriedly assured her. \"He said they're for his own personal use.\"\n\n\"If you trust him, then so do I.\" Gwen rose from her chair and knelt in front of Tim, the deck's wood planking still warm against her knees. She reached for the front of his jogging shorts and pulled them down to reveal a freshening erection, her fingers delicately wrapping around the girth. \"Did you like showing him my pictures?\" She dared to believe she knew the answer from the hard length she was holding. \n\n\"Uh, yeah, I guess I did? Gotta be honest, it's kinda fun seeing the look on his face when he sees you like...that, like he's seeing something really rare and off-limits.\" \n\n\"Fun, indeed.\" She gave the tip of his cock a reverent kiss and rose. \"Ready to go in?\" He hurried to his feet in reply.\n\nHer t-shirt and his shorts were unceremoniously discarded on the floor as they hopped on the bed and into each other's arms. Neither was in a hurry to reach the point where their arousal could no longer be contained and shared long, sensual kisses while their hands explored. Tim could not resist focusing on her recently bared skin, appreciating the smoothness of her mons as his fingers slid over it on the way to her equally bare cleft, finding her already very wet. \n\n\"What do you think he meant by 'personal use'?\" Gwen asked after breaking their kiss to stifle a gasp as a callused finger slowly dragged over her clit. \n\nTim's mind snapped back from where it was wandering in the intoxicating slickness of her pussy. \"Oh—uh, you mean Charlie?\" \n\n\"Yes—what do you think he meant by that?\" She breathed, her hand gently playing with his balls.\n\n\"I know exactly what he means. He's gonna, uhh, gonna use 'em for his own pleasure when he's looking at 'em. You okay with that?\"\n\n\"You mean masturbate?\" She quickly processed the confirmation of her suspicion, feeling the perverse thrill of it. \"That's what guys do to pictures of naked women, right? Do you really think he will, though?\" \n\n\"I know so. He told me he was going to.\" He shivered a bit as her hand continued to slowly travel up and down his length, and he thought he could detect a hint of hopeful expectation in her voice. \n\n\"You two certainly do talk about every little detail! I always thought men didn't like to admit they masturbate.\"\n\n\"Well, yeah, you know, Charlie's never had a filter when it comes to sex. He says that every guy does it, and those that say they don't are lying.\"\n\n\"You would think he would be too busy with all the girls he knows to have much time for that.\" \n\n\"Too busy with work. He told me he's even been too busy to make it down to the tit—to Scandals.\"\n\n\"That IS busy,\" Gwen said seriously. \"He's working too hard. That's not good for him.\"\n\n\"Yeah...so you sure don't mind that he's going to do that to you?\"\n\n\"To my pictures,\" Gwen clarified, \"and it's too late now if I wasn't. But, yes I'm alright with it. I will even admit I'm a bit flattered that he would think mine are worthy of such a thing.\" The fact that the erection she held had lost none of its potency told her what Tim thought of his friend's admission. \n\n\"He also said,\" Tim continued, gently thrusting against the pressure around his cock, \"to thank you for getting me out of the house so quickly this morning, but that I should have stayed to make sure you were taken care of, too. Said it's important to make sure the woman is satisfied. He also thought I probably needed some practice, so...\" He smiled and began to kiss his way down her body.\n\n\"Well, thank him for his concern,\" Gwen said with a gentle laugh as she released her grip on him. \"But neither myself or Cricket had any complaints about your technique last night!\" \n\nIs Cricket okay after last night?\" he asked while pausing at her breasts, his tone more serious. \"She seemed to uhh, handle it better.\"\n\n\"The first time was because you shoot that stuff so hard it's like drinking from a hose,\" she laughed. \"This time she was ready for you. As a matter of fact, I think she's acquired a taste for it.\"\n\nTim looked up, confused. \"For what? Oral?\" \n\n\"What you hit her in the back of the throat with last night. This morning, I didn't, uh, clean up after you left, I just went to bed with some of you still in me.\" And some on the floor, both Lady and Slut reminded her. \"She wanted to kiss me down there, and I wanted to go clean up first, but she asked me not to and said she wanted to taste you and me together.\"\n\n\"Did you let her?\" \n\n\"Mm-hmm,\" she purred as Tim resumed kissing down her stomach. \"She spent quite a while getting it all.\"\n\n\"Did she make you come?\" he mumbled, his lips pressed against her skin.\n\n\"Mm-hmm...I was pretty excited after you and that...it felt so, I don't know, perverted?\"\n\n\"Huh. Would've loved to have seen that...\"\n\n\"Maybe some other time,\" Gwen replied with a smirk. \"Don't tell her I told you, though. I think she was embarrassed to even ask about me letting her doing that.\" \n\nTim soon reached her sex, his tongue happily playing in the wetness it found. Gwen's hips began to twitch, and her breathing was a bit more forced. \"Did you tell Charlie you could have been even later this morning?\"\n\n\"Nope,\" he murmured into her pussy, \"just told him I had you bent over the table. I bet he never even imagined we did it other than the way we did.\"\n\n\"Well, you don't have to be anywhere now,\" she breathed. \"Would you like to try it that way this time?\" \n\nTim looked up and grinned. \"Sounds like fun.\" He ambled to the bathroom, grabbed the lubrication and returned to find Gwen on all fours looking over her shoulder while presenting her ass to him. \"That looks beautiful,\" he announced while bending to plant a kiss on her upturned pussy, \"but I got something I wanna try if you're up for it.\" He moved on to her side of the bed, retrieving his replica and the Magic Wand from her nightstand drawer, plugging the vibrator in before tossing them both on to the bed and putting one knee on the mattress to reach for his pillows. Gwen took the opportunity to capture his bobbing length between her lips and give the glans a quick tonguing. \"Keep that up and this'll be over quick,\" he warned with a chuckle.\n\nShe let him pop from her mouth. \"Sorry.\" \n\n\"Don't ever apologize for sucking my dick,\" he replied with mock seriousness. \"Lay on your back, put your ass on top of those,\" he ordered, pointing to the pillows he had stacked at the end of the bed. Gwen complied, giving him a quizzical smile as she maneuvered herself into position. \n\n\"First things first,\" Tim grumbled, firmly spreading her legs and moving between her knees before reaching for the dildo. He casually lined the length up with her opening and pushed it forward, the bulbous head splitting her apart and disappearing inside. Tim grunted in amused fascination as her pussy swallowed the length, the faux testicles finally bumping up against her and preventing the length from going any deeper. \"Feel okay?\"\n\nGwen wiggled her hips. \"Feels wonderful.\" \n\nHe stepped back to briefly study the situation, and Gwen felt herself blush at the scrutiny. Tim stepped forward, grabbing the lube and snapping the top open with his thumb. A healthy drop of fluid was squirted on the tip of his extended finger and then gently spread over her rosebud peeking up from above the pillows. Another drop was applied to his finger and then it was back, this time probing at her crinkled muscle as if testing its resolve to stay shut. It eventually yielded, allowing the invader to advance up past the first knuckle, then the second, rhythmically flexing as Gwen willed herself to relax and accept it. \"Okay?\" Tim's voice showed some cautious concern.\n\nShe closed her eyes, preferring to focus on the thing filling her other opening. \"Mm-hmm.\"\n\n\"Ready for something a little bigger?\" \n\n\"A lot bigger, and yes.\" \n\nThe finger was withdrawn, the muscle snapping shut behind it, and Tim applied some lube to his shaft, fisting it once or twice to spread it evenly. He stepped forward, rotating the cock already lodged in her to move the testicles out of the way, then brought her legs up, calves across his shoulders. He blindly tried to line himself up, his body blocking the view, rubbing his length up and down, freezing when the head seemed to lodge in a depression. \"There?\"\n\n\"Close.\" Gwen reached down and gently took him, adjusting his aim ever so slightly and holding it in place. \"There.\"\n\n\"Ahh, okay. Thanks. Ready?\"\n\n\"Uh-huh.\" Her hand continued to hold him at the base of his shaft, leaving enough room for his head to push her open as he applied pressure as gently as he could. \n\nTim stopped when he felt crown surrounded by tight muscle, anxiously looking at Gwen's face and her grit teeth. \"Want me to stop?\" \n\n\"Just for a minute, let me get used to it...\"\n\n\"Maybe your vibrator might help you relax?\"\n\nShe smiled. \"Maybe.\" This is in pretty good, she thought of the cock she was holding and let go to reach for the wand. The humming filled the quiet room, then became muffled as she slid it between her thighs to lightly push against her clit. Tim could feel the muted vibrations tickle his tightly lodged glans. \"Okay, you can go a little deeper, if you want.\" It took one more stop before he was fully in her, his fake balls pressed against his belly, his real ones brushing against her lower ass cheeks. She was tight, incredibly tight, and the little puckered ring continued to flex against his girth. \"Slow, okay?\" she asked in an almost pleading tone.\n\n\"Yup.\" Tim was true to his word, pulling her thighs to him to leave no space between their bodies, and began thrusting carefully, slow, smooth motions back and forth. It was actually easy for him not to get carried away; the tightness, the muted vibrations of the wand, and hardness of the other cock above his own were more than enough to bring his orgasm to the boiling point. The depravity of the act was also a factor...\n\nGwen's body was actually beginning to warm to the invader, the feeling of fullness in both holes giving her the pleasant impression of being stuffed, the two lengths separated by a few layers of tissue. Tim was being such the gentleman, if that was even possible when his penis was up a woman's rear end, taking her gently, treating her with care. He certainly looked like he was enjoying it, and that alone made her happy. She wondered if having Nearly Neal in her instead would be too much...she also wondered what it would be like to have Tim's replica replaced with a real one, not to mention having the body it was attached to pressed against her. \n\n\"I'm pretty close,\" he announced, his features tightening in concentration. \"Want me to pull out?\"\n\nGwen's vibrator-induced climax was building, but still a ways off. \"No, in me,\" she grunted. \"I want it in me...all in me...just not too hard, alright?\"\n\nTim obliged, his gentle rocking motion nothing like the pounding he sometimes gave her cunt when he was close. A withdrawal of his cock nearly dislodged it from her before again pushing forward was enough to set him off, and he buried himself as deeply as he dared without causing discomfort while he unloaded. \n\nSpent, he withdrew, his length gliding wetly from her and flopping on the pillow beneath, a dollop of his seed following it. Tim stepped back, gently putting her feet back on the edge of the bed. Gwen responded by using the newfound leverage to thrust her hips out and upward at him, thighs lewdly falling open to give the vibrator more room to work and her husband a better view. \"Push on it,\" she groaned, \"push it deep into me.\" \n\nTim stepped forward and placed two fingers on the flat end of the dildo. \"This?\"\n\n\"Yes, please!\" Her hips thrust up at him again as if to emphasize the request. He pushed on the already-buried length, the flared end flattening her pussy lips as the Wand ground into her clit. \"Like that, keep it like that, just like that...\" Her thighs abruptly snapped shut and she rolled to her side, Tim's hand sliding out from behind as she pulled her legs into a fetal position and the orgasm struck. Her convulsions vaguely reminded him of horseback riding, her knees pulling forward towards her chest then spasming back down to repeat the motion. Must be a good one, he thought, noting the soft grunts she was allowing to escape her throat. And then with a deep breath she was done, Tim wondering what to do next as she lay there, limp and bringing herself back under control. He reached to help her up as she struggled to sit. \"Ohh, I'm going to walk funny tomorrow,\" she said with a rueful smile as she stood. \n\n\"Sorry, I—\"\n\n\"Don't be,\" Gwen quickly replied. \"I enjoyed it. it's just not something I could do every day. I especially liked that you seemed to enjoy it, too.\"\n\n\"Well, yeah, but—\"\n\n\"Good,\" she interrupted. \"I think I'd like a shower before bed. Would you like to join me?\" \n\nThat was a no-brainer. Tim's body was thoroughly soaped and rinsed, and while he attempted to return the favor Gwen stopped him at her rear end, choosing to handle the delicate task herself. They helped each other dry off, then returned to the bed. She pointed to the large wet spot they had left on his pillow. \"Let me get a new pillowcase.\" \n\nTim smiled and flipped the pillow over, then gathered both and put them at the head of his side of the bed. \"Maybe tomorrow. A trick I learned when I was single,\" he said with a smile. \"Pillows have two sides, you know.\" \n\nThe Lady insisted on an entirely new set of fresh linens but was ignored. She lay down on her side, waiting for Tim to do the same. \"And what were you spilling on your pillows that made learning that trick necessary?\"\n\n\"Well, uhh, when you're young and you haven't take care of business for a while, if you know what I mean...\"\n\nGwen smiled mischievously. \"You mean, masturbate? See you don't like to admit it, do you?\"\n\n\"Okay,\" he said with mock defiance, \"when I was younger I would mas-tur-bate—\" he said each syllable slowly and carefully—\" and sometimes I would get some really good distance on my shot. Sometimes I'd hit the pillow so I'd flip it over so I didn't roll over into the wet spot after I fell asleep.\"\n\n\"Ahh.\" Gwen craned her neck to kiss him. \"Did you ever hit the pillow after one of our dates?\"\n\nTim flashed an embarrassed grin. \"More than once.\"\n\n\"I'm flattered.\" She looked down, suddenly unwilling to make eye contact. \"Do you think Charlie...masturbated...tonight?\" \n\nTim laughed. \"Charlie? Probably as soon as he got home.\"\n\n\"He really liked my pictures?\"\n\n\"He really liked that they were pictures of you.\" It was his turn to look down. \"I, uhh, probably shouldn't tell you this, but you know the one with the shaving cream?\"\n\nGwen looked up his body. \"Yes?\" \n\n\"He said he wanted that one because he was going to pretend the shaving cream was his stuff.\"\n\nGwen shrieked and giggled. \"You mean his come? Really?! Men can't produce that much, can they? I mean, I think you come a lot but not like that!\" \n\nTim chuckled. \"No, I don't think guys have that kind of output, but in Charlie's mind he probably imagines he does, and it sounds like he's been saving it up...\"\n\nShe looked down his body again, noting his length pulsing firmer with each beat of his heart, impressed that he seemed to be recovering so quickly. \"Can I see how much you have right now?\"\n\n\"You did a pretty good job of draining me today, but I'm not gonna stop you if you want to find out what's left.\" \n\nMuch to his pleasure, she was eager to. The distance wasn't much, but the puddle she coaxed onto his stomach was not too bad at all."
    ],
    "authorname": "BusyBadger",
    "tags": [
        "exhibitionist",
        "exhibitionism",
        "pictures",
        "voyeurism",
        "wife",
        "husband"
    ],
    "category": "Exhibitionist & Voyeur",
    "url": "https://www.literotica.com/s/a-new-way-of-seeing-things-pt-04-ch-03"
}