{
    "title": "Ægir’s Bride Ch. 08",
    "pages": [
        "Kirsty looked around the cabin where she had been their 'prisoner.' No, even captive seemed a bit strong after...him. Bjorn. She bit her lower lip and smiled secretively remembering that she had seduced him that first time. His first time. \n\nBut there had been other firsts here too. When Mikael had... She blushed just at the thought of his darker head buried between her thighs. But he had teased and tormented her with his mouth. Pushed her to the very edge of her release and then pulled back leaving her hanging. Until he had not drawn back and sent her body flying over the very edge of the universe with his mouth and fingers.\n\nOf course, the very first had been him. Here that very first day after their coffee. \"Pleasant memories, Kirsten?\" that deep, accented voice asked as he took his coat from about her shoulders. At least this time he was not demanding she get naked. Yet. \n\nShe smiled up at him and nodded. His hands caressed slowly up and down her arms for just a moment. For a heartbeat, she almost believed he would say something, but then he merely turned his back and walked to the toy box. When he came back, he held a small brown box, the kind that online company used. Her blush deepened as she remembered a similar one that her flat mate had delivered to her room one evening...a gold bullet vibrator. \n\n\"Open it,\" his voice always seemed like a caress. His accent was thicker than his brother like English was not as easy for him as it was for Mikael and especially Bjorn. \n\nHer fingers trembled as she pushed aside the flaps that had already been cut open. She was not sure what she expected, but what was there made her inhale sharply. Her eyes grew wide at what lay cushioned on the bubble wrap. \n\n\"A full set,\" he said as he lifted the first and smallest from the box. He held it up and turned it slowly for her to examine. She shivered as he ran the soft almost transparent silicon down her face. \"We will begin with this one tonight.\"\n\nShe could barely breathe. His voice sounded so far away as she listened to him speak. \"Every day for a couple of hours at first, you will wear it. We will gradually increase the time a bit every day. Until that sweet virgin ass of yours can easily accept my finger buried deep inside of it while I fuck you from behind.\"\n\nHer eyes flared wide at his bold words. Part of her was disgusted, frightened, even terrified. Anal had definitely not made her fetish list. But she remembered too how she had... when he... last time. He had told her then that he would 'train' her. She just had not expected this.\n\nHe picked up the last one, the largest of the three. Although it was tapered at each end, it flared in the middle. It was as thick there as... Yes, it was every bit as large as. \n\nHis rich, deep laughter that she loved so much echoed around the small cabin. \"Yes, I so love the way your pretty face shows everything you are thinking and feeling, Kirsten. Yes, by the time we reach this one. By the time you can easily accept it inside that tight little butt of yours, then you will be ready for something else.\"\n\nIf she had hoped he would have the good graces to leave off the dirty talk there, she was too be disappointed as he once more leaned in and ran the smooth surface of it across her cheek until it reached the corner of her mouth, \"Open for me,\" he commanded.\n\nKirsty blushed as she stared up into those blue eyes. She was light headed. Perhaps from trying to breathe fast enough to keep up with the pounding of her heart. Perhaps from the very, very naughty things that this man was saying. Because as much as she was shocked by such dirty things as butt plugs and anal sex, she was also incredibly turned on. \n\nHe ran the cool silicon across her bottom lip as he bent in and whispered, \"Then you will be ready for me to fuck that sweet virgin ass, my wife. And don't deny that the idea turns you on. I can smell how worked up you are even now. And you will be even more worked up with my baby brother buried deep in that wet pussy while I push you forward on to his chest and enter your ass from behind.\"\n\nHer mouth was dry. Her heart was pounding so hard inside her chest that she knew he must be able to hear it. There was no way that she could make even a sound as he pushed the thing just between her lips. Her mind was on auto-pilot as she opened them and it slipped deeper. \"That's right, sweetheart. Suck it. Because you know there are three of us. While baby brother fucks that sweet cunt and I take your ass, Mikael will bury his cock in your throat.\"\n\nShe was not sure how she was managing to stand then. Her mind was reeling. His words painted such a realistic...such a naughty picture. Not even Raquel Graffen's book had been so blunt when describing that very act. \"Are you going to tell me that you don't want that? All three of us? Taking you at once? If I put my hand between those sweet thighs right now, what would I find?\"\n\nShe blushed and looked away rather than answer him, because the truth was that she could actually feel the wetness dripping down the inside of her leg. \n\nThen she was reeling a bit as she struggled to stand. It was only then that she realized his arm had been about her waist. Her body pressed against his the whole time he spoke of such intimacies. And now without him to keep her upright she teetered for a moment. Her knees were incredibly weak but somehow she managed to remain standing as he crossed the cabin and picked up the coat he had discarded earlier. \n\n\"But first we have to train that sweet little ass of yours.\" He chuckled, \"And my brothers and I need to learn to share our toy without killing one another. That may take some time, sweetheart. But it is so much fucking fun to mind fuck you with the idea.\" \n\nHe slipped on the coat and came back to stand in front of her, \"But, Kirsten, it will happen. One day. For tonight though, you can simply imagine it. The plug filling your tight ass as I fuck you. I might not be as good looking as baby brother...or as sweet talking. But I intend reminding you that there is something to be said for experience over youthful enthusiasm.\"\n\n\"I may not be able to wile away half the damned day in bed with you tomorrow morning, but I promise you I'll let you sleep in...after I spend the whole night fucking you and coming inside that equally sweet cunt. Over and over.\" \n\nHe brushed his lips against the side of her face briefly as he whispered, \"I will get us supper from the house. I am sure at some point during the night we will both need the break, to renew your energy.\" He shrugged, \"And let the others know that once more I have taken you as Ægir's Captive. I am sure that is just going to thrill baby brother,\" he laughed sardonically. \n\n\"But blame my beloved mother for keeping the lovers apart this night. She should have fucking known that with your honest face you could never keep the family secret from Bjorn. Don't worry though, by morning you won't remember your own fucking name. Let alone the oh-so tragic circumstance of my baby brother's birth and the demise of my father.\"\n\nHis hand found its way between her legs somehow. Without any preamble, two of his fingers thrust deep inside of her. Her response was instant and visceral as her body began to pulse and throb around them. She felt liquid heat explode as her juice coated them and he added a third finger. She leaned her head into his shoulder. She bit her bottom lip until she tasted cooper. Anything to keep from screaming as his fingers plunged deeper and faster inside of her cunt. \n\nHis mouth covered hers and she released all the pent up energy as she screamed into it. By the time, those fingers stopped their assault her knees were jelly. She was pressed completely against his hard body. Against his equally hard cock that throbbed just behind the zipper of his rough jeans. \n\nHe gave her that devil-be-damned smile as he lifted his fingers to the same lips that had kissed her. He licked her juices from his fingers, cleaned them completely as he silently held her gaze. \"Delicious, although that reminds me...certain things I have not shown you...\"\n\nKirsty could feel her face darken even more as she realized what he meant. He chuckled once more, \"I see my brother, brothers?\" he asked. \"They have not been so remiss. Yes, well, I am sure that I shall find some way of pleasing you. But for now, there are instructions on the table. Explicit ones. Follow them. All,\" he used that tone which always sent the butterflies scurrying in her stomach. \n\n\"I will be back soon. So do not waste time. Assuming of course that I do not need to fight my way back here. But do not fear, I will be back. Maybe a bit bruised and bloodied, but nothing...and no one...not even my beloved brothers are going to keep me from this night with my captive bride.\" Then he turned and was gone. \n\nIt took her a couple of moments to steady herself. To slow her breathing and heart rate enough to walk the short distance to the table. The table were they had all shared dinner that first night. The table where they had explained her Fate, her destiny, her future. \n\nWhen her trembling fingers finally lifted the sheet of paper, she forced herself to read the bold masculine handwriting twice. She shook her head and looked around her blushing. The man could not be serious. She could not. But even as she thought it, pushed the bubble wrap aside to discover what else that box contained, she knew that she would. \n\nPartly it was her submissive nature that did not want to disappoint. Partly it was her own curiosity. She really did want to explore this...thing. Even more as she thought about the images he had planted in her mind. Yes, she was panting and almost tempted to relieve herself, even though he had just given her an incredibly intense orgasm, she wanted more. She wanted it all...all of them too. \n\nBut partly it was him. Petrine...or Rachel was right. She wanted, almost needed, to reach this man. Her Atlas with the weight of the world on his shoulders. She needed that as much as she needed his brother's love, which he so freely gave her. As much as she wanted to chip away those walls of pain that Mikael hid behind. Yes, she wanted them all. \n\nTonight though was his. His alone. And as hard as this list was, it was as good a place as any to begin this fight. The battle to win more than just his lust...but his heart too.\n\n***\n\nSven looked around the living area. His family. His crazy, wonderful fucked-up family. His responsibility, he sighed. But right now, she was his first concern, his biggest responsibility. \n\nMikael was once more trying to engage with his daughter, using that sign stuff she was teaching them. He smiled, baby brother had been right about the Russian girl, having a child did not make you a mother. Then again they should have learned that lesson from this little girl's mother. \n\nHer on the other hand? She had just stepped in and already as subtle as they were, he could see the differences in his niece. She was going to make one hell of a mother. To his son. He breathed deeply. Now was not the time to dwell on those thoughts though. \n\nHis uncle frowned as he turned from where he and his mother were serving dinner in the kitchen. \"We were wondering where you had gotten off to.\"\n\nBut it was his youngest brother, who looked up from the table at him, as he demanded, \"Where is she? You went to find her and mother. So where the fuck is my wife?\"\n\n\"Your wife?\" Sven felt the tension inside of him rise at Bjorn's words. \"Decided already that sharing ain't as much fun as you thought. Well too fuc...,\" he looked across the room at his niece and stopped himself even as his hands fisted at his side. \"Too bad, baby brother. This was your idea. You, you and Mama,\" he added as he turned shaking his head in the direction of the woman who at that moment he was madder at than he could ever remember. \n\n\"You and Mama who drug me and Mikael into this. Who convinced us that the old way was best. But now that you had a taste of...\" he cursed under his breath. He was not about to say this in front of his niece. She might not speak, but that did not mean she could not hear. Did not understand a far sight more than they realized. This was no place for this conversation. No, he had come here for one purpose, well, two actually. \n\nHe turned away from his brother and joined his mother and uncle in the kitchen area. \"Kirsty and I will be spending tonight on Ægir's Captive,\" he said loudly enough that his brothers could hear. \"I just came to let you know so that you would not worry...and to get some food for later.\"\n\nHe kept his back to his brothers as he searched in the cupboards for containers. He lowered his voice so that only his mother could hear as he whispered, \"What the hell were you thinking, woman? You know that woman cannot hide a single thought, emotion.\"\n\nHe found what he was looking for and crowded the woman over a bit. He felt a twinge of regret as he noticed for the first time that her eyes were swollen. It had been so many fucking years since he had seen that he had almost forgotten the knot that it always made in his stomach. He had just come to expect her strength, her stubbornness. It was an odd reminder of that other time...those dark days. \n\nHe sighed as he shook his head, \"I am keeping the lovers apart tonight, Mama. But you know as well as I do what you have to do. One look at her and he will know something has upset her. How long do you think it will take for him to get it out of her? It's not her place to tell him, you know that,\" he whispered. \n\nHis mother nodded her head slowly, but before she looked down he saw the tears gathering in her eyes. He noticed her hands trembling with the bowl and ladle too. Once more he was a twelve year old boy watching as the man he thought of as his father carried her pale, motionless body to the boat. The man he had thought was invincible, but that day he had seen tears running down his weathered cheeks. That had scared him more even than his mother's lifeless form. \n\nIt had been years since he thought about that day. About the months and months of silence that reigned in this house. Silence broken only by the sounds of her sobs. How many times had he seen them all scurry at the sound? Andreas grabbing the vodka bottle. Stig reaching for his coat and disappearing to work on that damned greenhouse. \n\nIt was always left to Olaf and him. His uncle would go to her. While he was left to care for Mikael, to try and reassure his brother that all would be fine...when he was not even sure it would be. But that was behind them. They had put it all behind them. All rallied around her...and that little baby. They had rebuilt their lives. \n\nUntil her. Until she came. He shook his head, \"If you cannot tell him, Mama, I will,\" he sighed. \"But it has to be done. You know that?\"\n\nBut it was not his mother, who spoke but his uncle as the man wrapped his arms about his mother from behind, \"We know, son. We will handle it. You just see to her tonight.\"\n\nSven nodded slowly as he finished filling the container. He could only nod with the tightness in his stomach that he had almost forgotten over the years. He tried to smile at them before turning and heading up the stairs for the other things he had come for this night. \n\nBut Bjorn blocked his way by her door. He shook his head and prepared for the battle, though if it were to get physical it might have to wait, not that he was opposed to burying the kid's handsome face in the cold mud a time or two. Weather and night be damned. But right now he could think of better ways to burn off that kind of physical energy.\n\n\"You will not hurt her,\" he growled.\n\nSven chuckled, \"You forget, baby brother, that is what we do. Who we are. And you want to forget that she likes it. Needs it.\"\n\nBjorn frowned at him, \"You know that is not what I meant. She is our wife. Not one of your fucking married subs getting a little excitement behind hubby's back. And far more than just a piece of meat. A prize heifer to be bred by the bulls.\"\n\n\"Oh, you have it bad, baby brother,\" he chuckled. \"Let me remind you of some truths then. The ones that I didn't say down there because of our niece.\"\n\n\"This is all your fucking doing. Mikael and I wanted no part of it, remember? He wanted something more traditional. And maybe that did not work out so well, but who knows if we had given him time. Time to really heal, to get over that bitch, maybe he would have tried again...for Monika's sake if nothing else is I think how you sucked his ass into this mess, isn't it?\" \n\nNow that his anger was unleashed he was not holding back. \"And me? You knew fucking good and well I had no interest in commitment. That's why I liked my women married...they rarely expected anything more than what I was willing to give.\" \n\n\"I have a wife...Rán. Remember her? The cruel and greedy bitch of the sea who took my father before I was even fucking born. You think I want to bring a woman, any woman into this life? You think I wanted to subject them to the kind of pain that Mama has known?\"\n\nHe gritted his teeth, \"But no, you, baby brother, had to fucking point out the obvious. That without doing just that to some poor helpless woman our way of life ended with us. It was you who reminded me that like it or not, I needed sons. Sons to feed that greedy bitch. Sons to appease Njörður.\"\n\n\"But now that she has gotten under the little virgin's fucking skin, now that he knows what he has been truly missing all these years, well, you give new meaning to pussy whipped, baby brother. So you first go after Mikael on the boat and now me?\" he shrugged as casually as he could with that much anger coursing through his body. \n\n\"Here is a bit more of honesty for you. Do you think that you can bait us? Draw me and Mikael into this mess that I watched almost tear my uncles apart and then just change your fucking mind? Neither one of us would have objected if you wanted to marry her the 'normal' way. Hell, we would have danced at your fucking wedding.\"\n\n\"But if you think you are the only one that has acquired a taste for that sweet, tight cunt of hers, then you are crazy. And if you think that either Mikael or I are going to just move aside so you can have her all to yourself...go fuck yourself, baby brother. You started this...so fucking learn to live with it.\"\n\nHe drew in a deep cleansing breath and forced his hands to loosen from the fists that he had been clutching at his sides, \"So move the fuck out of my way...in more ways than one, baby brother.\" \n\nBjorn shook his head, \"She deserves better than this, big brother.\"\n\nSven laughed, \"Hell, yeah, I am not arguing that with you. The woman deserves a hell of a lot more than our fucked up asses. But you choose her. I wanted the Russian cunt. At least she would have known the score. At least...\" \n\nHe shook his head as the truth hit him...at least she would have been safe. She would not have made him feel...not like this. Not like her. \n\nBjorn just shook his head, but he moved out of his way...away from the door at least. Damn him to Helveti. Damn him for choosing her. And damn her... \n\nBut it was him who was truly damned. Damned by those blue eyes that could not hide anything from him...from them. Damned by that oh-so-fucking sweet submissive nature of hers. Damned by her tight cunt and welcoming warmth that haunted his dreams...on those nights that he was forced to share what had first been his. If he were being honest he wanted her all to himself as much as baby brother did.\n\nHe was not going to let those thoughts control him now though. Now he was wasting precious time with her on his brother. No, he had come here for one thing...rope. The lengths in the toy box on Ægir's Captive were not long enough for what he had in mind this night. But he was determined that if he could not yet bind her to him as he wanted...he would bind her sweet body in other ways.",
        "Then he would bury himself in that tight, wet cunt over and over again...until he did at least have the son that would tie her to him...even if he never had her love the way baby brother did. So why suddenly did what he had once thought was all he wanted or needed from the woman feel like nothing more than a consolation prize?\n\n***\n\nKirsty bit her lower lip as she knelt naked on the floor next to the bed. It was not the chilly night that had her shivering. Not even anticipation of what was to come her. It was as it always was...shame. Why did his carefully written instructions not include the corset again? The whole damned thing had been challenging to say the least, but this? This was the worst. Anything but naked. If she still was not comfortable being naked with Bjorn, even less so with Sven...or Mikael. \n\nThey were all so fucking hot. Why did they have to be so damned stunning? Especially when they were naked. And her? Dumpy was the kindest way of putting it. Plus sized, freckles and ginger...how much more unattractive could she get? Whatever had they seen in her? Maybe in her dreams she could buy that Bjorn really did see her through the rose colored glasses of love. But Mikael and Sven? Why? What did any of them see in her?\n\nAnd the rest of it? She had followed his instructions exactly. Showering and shaving was easy enough. But the other? She was not sure that she was ready for this. As sexy as it had been when he had played...there...the last time she had been with him. As erotic as the images he had whispered seductively into her ear then. Following those instructions had reminded her of how messy these things could be. It was something she would have never... \n\nBut she had...for him. Although she still was more than a touch angry with him, felt used. But Petrine's story had touched her. She had made a choice. She had chosen to stay...not once but twice. And staying meant not just loving Bjorn, which as his mother said was easy. It meant learning to love Mikael and Sven too. And right not...trying was damned hard. Maybe too damned hard...\n\n\"Lovely,\" his deep voice caressed her mind. But damn, did she find his accent sexy. She had from that first moment she had heard it at the train station. Her body had gone into overdrive then and still was...even now. Especially now it seemed.\n\n\"Did you follow my instructions?\" he asked.\n\nShe began to nod her head but almost instantly caught herself, \"Yes, Sir.\"\n\n\"All of them?\" his voice was closer...and deeper. More seductive.\n\nShe swallowed as she thought about those instructions, about what she had done. \"Yes, Sir,\" she whispered nervously.\n\nHe chuckled, \"We shall discover how well in a moment. Inspection time, my dear wife. Get on the bed.\"\n\nKirsty trembled as she rose slowly from kneeling and crawled onto the bed. But before she could get into it fully, his hand around her ankle stopped her. \"Not like that,\" he positioned her so that she lay across the bed, her head almost against the wall and her leg dangling off the edge. Then he lifted her legs, placed her heels on the mattress, spread her legs as wide open as he could. \"Scoot that cute butt lower.\" \n\nShe tried, but the position was uncomfortable. Made her feel even naughtier, more vulnerable. His bare hand connecting with her inner thigh just above her pussy got her attention though. \"All the way to the edge, Kirsten.\"\n\nShe bit her lip again and pressed her eyes even tighter shut than before, but she obeyed. Until her bottom practically hung over the edge of the bed. The way her legs pressed outwards, almost parallel meant it was not an easy position to maintain. That helped a bit. If she had to concentrate to keep her heels on the edge of the bed, if the muscles of her inner thighs strained a bit at the extreme angle, then her mind could not concentrate fully upon how fucking open she was to him at that moment. \n\n\"Look at me.\"\n\nDamn him. Why? Why could he not just allow her to hide even that tiny little bit? But maybe the more important question was...why did she not tell him 'no'? Tell him to fuck off. Of course, part of it was her own submissive nature. But she had had no problem telling other men, those who had insisted on sending her disrespectful messages repeatedly to 'fuck off.' \n\nBut from that first challenge, she had not been able to deny him...them...anything. This included as she reluctantly opened her eyes. \n\nHe was kneeling on the floor between her thighs. The coat, shirt and boots were gone. The only thing he wore still was his jeans and the button of those was already done. He might not have the perfect pretty-boy good looks of 'baby' brother. There might already be a touch of barely noticeable grey hairs interwoven with the blond. Hell, even the fine lines around his mouth and eyes just added a touch of sex-appeal to the man. \n\nOh, he was rougher...more mature...than either Bjorn or Mikael, but he was still sexy as hell. Sexy enough to have captured her interest from that first photo. Yes, Petrine was right. She would not have been as comfortable answering that first message if it had been Bjorn's photo. His had been more than intimidating enough. As intimidating as the man himself at that moment.\n\n\"Shall we see just how well you followed my instructions then?\" He smiled and the butterflies took flight in her stomach as he lowered his head. She thought that she would surely loose her precarious footing on the bed as his tongue made contact with her clitoris for the first time. But somehow she managed to keep them firmly planted on the mattress, even with her toes curling towards the floor. \n\nShe was not just biting her lower lip, she was fucking chewing it. He was nothing like either of his brothers when it came to this. The man was a tease. A cunt tease. His light strokes and half nibbles were driving her insane. But it only had her wanting more. Whimpering and moaning. This position though did not allow her to thrust her hips up...not without risking falling right off the edge of the bed. And it was another kind of falling that she wanted from him just then. \"Please,\" she whimpered.\n\n\"Please what, Kirsten?\" he smiled up at her. His chin resting right on her shaved Venus mons. She could actually see her juices glistening on his face as he turned his head and kissed first one inner thigh and then the other. \"Yes, so far, you did an excellent job. Your cunt is so fucking smooth.\" He licked softly just across the top of her slit before he winked, \"Shall we see how well you followed the other one though?\"\n\nKirsty could not breathe. She felt like an elephant had suddenly sat right in the middle of her chest. She was not even certain what he had in mind. Could not fathom how he might...'inspect'...that. Once more he lowered his head and licked softly at the top of her slit, but this time he did not stop there. His tongue softly outlined first one of her labia minora and then the other. It flicked only lightly at the opening of her cunt...reminded her of one of Bjorn's butterfly kisses...but on a totally other kind of lips.\n\nHer heart stopped. Literally skipped at least two, maybe three beats, when his tongue continued its path...lower still. Her heart started slamming wildly against her breast bone though when that tongue began to swirl her other hole. \"Fuck,\" she whispered under her breath. As impossibly naughty as this was, it was equally as intense. This was something way beyond her wildest...her absolute wildest fantasy. \n\nHis hand covered her mound. His thumb forced her open on one side of her outer lips as his finger began to dance across her wet clitoris. That she could manage, but what his tongue was doing...there. There? She was not ready for this...but it was happening anyway. And she was... Loving it? Especially when she felt his tongue not just flicking this time but trying to actually penetrate her...the way he had said his cock would one day.\n\nThe pressure on her clit increased just the tiniest little bit. It was still more like a feather tickling her there. But even that was enough as her body tensed and arched off the bed. She whimpered as she felt one foot slip from the bed. His tongue slipped from her dark hole even as his finger slipped from her clit to just inside of her wet cunt. The result was a very unsatisfying half orgasm that left her whimpering and moaning on the edge. \n\nShe had not even come down from that though when she felt the sharp sting of his bare hand against her outer thigh. \"I would punish you for that...except I think you did a damned fine job of punishing yourself. Now turn over. Assume the position I showed you the other day. And that damned ass better be up nice and high, my sweet wife.\"\n\nKirsty kept her mouth shut, but gave him a dirty look for the punishment comment as she rolled over onto her stomach. Her knees now rested on the edge of the bed as she did her best to get 'her damned ass' as high into the air as she could. But his hands stayed her when she tried to bring her arms behind her back. \"No, out in front of you this time. They will help you stay balanced better.\"\n\nShe nodded and whispered \"Yes, Sir,\" as she stretched her arms in front of her. Like this, she could almost touch the wall on the other side of the bed. \n\n\"Very good, sweetheart. And yes, you followed those instructions very well too. But as sweet as your virgin ass is I could eat it all fucking night and still not get you wet enough for what comes next.\" She felt the sting of the blush on her cheeks as surely as the one of his hand on her bottom. \"Do. Not. Move.\"\n\nShe closed her eyes and took stock. This is embarrassing...intensely so. Way more than anything that she had ever done. But at the same time, she could not forget how easily he had made her come...or start to. Damn it, her body was dancing and sparking like a live wire without a ground. She needed to come so fucking badly just then. \n\nShe could not even manage to finish that thought though as she felt something very cold sliding down her crack. \"Oh,\" she moaned as she jumped a bit in shock at the unexpected sensation. That was only followed by another slap to her other butt cheek. \n\n\"Be still.\" In this position, she could not see anything he was doing and that intensified the experience. Especially when she felt something equally wet begin to probe at her bottom. \"Relax. Breathe in and out very slowly, Kirsten. Listen to the sound of my voice. Cue on it. Do you understand me?\"\n\nHer breathing was shallow and her heart pounding as her fingers began to clutch the sheet in front of her, \"Yes. Yes, Sir.\"\n\n\"That is my good girl. We will begin simply with my finger, do you understand? Your ass is so fucking tight that I do not dare try even the smallest plug...yet,\" she felt her cheeks flame at his bold words. She was glad that he could not see her face just then. \n\nShe nodded her head and whispered, \"Yes, Sir.\" But it was barely audible. Whether he heard her or not did not matter as she felt something slowly push inside her tight ass. Her first reaction was to tense up to push out something that clearly did not belong...there.\n\n\"Breath with me, Kirsten. In...one, two, three four,\" his finger stilled not yet breaching her hole, just putting a gentle pressure against it. \"Now, out. I want you to push back against my finger as you breathe out, sweetheart. Slowly...very, very slowly. One...\" \n\nShe willed her body to relax as his deep voice, that sexy as fuck accent that made her hot from that first hello...she focused upon those. Allowed him to almost hypnotize her.\n\n\"That's right, just like that. Two...\" She gently pushed back against his hand. Allowed her body to almost fall backwards knowing he would catch her. She caught her breathe as she felt his finger slip inside her. Not deep...only an inch maybe. \n\n\"Good girl. Just hold right there...no rush. Three...\" She breathed out slowly and even though she did not push back this time, she felt his finger slip forward just the smallest fraction as her muscles relaxed once more. \"Beautiful,\" he whispered and she felt his breath warm against the cheek of her ass.\n\n\"When I say four, I want you to exhale completely and push back as hard as you can. Can you do that for me, Kirsten?\" She felt the roughness of the stubble on his cheeks against her bare bottom as she nodded. \n\n\"Yes, Sir,\" she promised though she was not sure she could do what he asked. Any more than she was sure she could be the strong, loving woman that his mother asked her to be with them all. She could only try. \n\n\"Four...\" he whispered as his lips made gentle contact with the cheek of her ass. \n\nShe breathed out, expelling all the air that she had been holding in her lungs as they played this little game. As she did, she felt herself open to him. Felt her bottom flower open like a morning glory at the first warm rays of the sun. Her weight carried her back then as his finger just slipped all of the way inside of her. \n\nHis lips so soft against her bum pressed hard. She could feel the rumble in his chest as he growled, \"So fucking perfect.\"\n\nShe was not sure how long they stayed like that. His face pressed against the round curve of her derrière. His finger buried completely inside of her ass. Her whole body thrumming with need and desire. \"Sven,\" she whispered at last.\n\n***\n\n\"Say it again, Kirsten,\" he growled against her warm skin as his finger began to very slowly move inside of her.\n\nNot Sir. But his name. \"Sven,\" she moaned softly as he gently stretched her open just a bit more. \n\nHe would punish any other submissive for breaking protocol, coming out of role. But her? She got him painfully hard just by whispering it. Was it because in that instant he knew...knew it was him and not baby brother that she wanted? Some recognition that he was the one she needed in this moment. That he was not merely 'Sir' but a man. \n\nWhatever it was, it was driving him insane. He fucking needed to bury himself deep inside of her. Fuck her until she was screaming out his name. Then empty himself inside of her welcoming cunt. And that had very little to fucking do with reproduction and everything to do with how easily this woman got under his damned skin. \n\nHe inhaled deeply, fought to regain control of his emotions as he shed the only thing between them, his jeans. He chuckled at the thought he even had them. Oh, yes, baby brother was most definitely right. She was not one of his safe married lovers sneaking around and cheating on her husband for the excitement, the kink or the sex. He had never given a damn about any of them...they came and they went without notice. They were essentially interchangeable. \n\nBut not her, never her. He cursed under his breath as he slowly withdrew his finger, stretching her open just a bit more. He had meant to repeat the whole damned process with two fingers before attempting the plug. But she had done so much better than he had anticipated. Relaxed and opened herself to him completely. \n\n\"Do you think you can take the plug for me now, Kirsten? I do not want to hurt you. Want you to enjoy this too,\" he pleaded. \n\nHe felt her tense just a bit and his hand caressed the small of her back, moving slowly over her ass. \"We can go slower. Two fingers this time. We will take this as slow as you need,\" even if it fucking killed him...and at that moment he felt like it might. \n\n\"No, let's try,\" she whispered though he could barely hear her with her face buried in the bed. He suspected that embarrassment was getting the better of her. He had known that this particular fetish of his would. \n\nHe moved onto the bed next to her, reached for her and although she was a bit reluctant coming into his arms she did. He brushed the still damp hair back from her face and placed a gentle kiss on her forehead. \"We can stop for a bit if you need.\" He shook his head. What the fuck was he doing? He would have never gone so soft on any other sub. \n\nShe shook her head against his shoulder, \"No, I don't want to...\" She was looking down but the deep lines in her forehead told him that she was frowning. Whatever was in that pretty little head of hers was not a pleasing thought. \n\n\"Don't want what, Kirsten?\" he probed as he brushed another kiss on her forehead. But she still did not answer, only shook her head again. \"Don't want to disappoint me?\" he asked. Her damned submissive nature was much deeper than the occasional role players that he usually took as his lovers. It would be too easy to push her too far, too fast. She would make no attempt to stop him. \n\nHe chuckled as he remembered her almost feeble attempts that first day. Did she realize yet that it had been herself she fought more than him? That the fear was more of the unknown than of him, the things he did to her body. Would she come to see that one day? Even if she never loved him as she did his youngest brother. Even if they never shared the common bond that she and Mikael had found in her work with his niece. \n\nIf he were being honest, that was more than a bit of the whole baby thing...if they shared that bond. If he gave her a child? He breathed deeply realizing once more how deeply he had gotten sucked into this whole thing. When the baby was more about binding her to him in a way that his brothers had not than the legacy that his brother had used to draw him into this fucking mess. \n\nShe shook her head and whispered, \"It wasn't as bad as I thought it would be actually.\"\n\nHe laughed and kissed her shoulder, \"Is that the polite British way of telling me you liked it, my shy little wife?\"\n\nShe kept her head down but he loved the way that the pink tinge seeped down her neck all the way to the very tips of her breasts. \"Maybe a little,\" she whispered. \n\n\"Enough to keep going?\" he asked and waited.\n\n\"Yes...please,\" her fingers played lightly at his chest. Traced something right over his heart actually. Could she feel how fast it beat? Faster than it did for other women. More experienced subs. More beautiful women...was there such a thing? \n\n\"Turn around then,\" he whispered as he arranged her as he wanted her with her top leg bent and out from her body. His hands moved lightly over her shoulders and arms, kneading and caressing the tension from her. \"Relax for me, Kirsten. Just relax,\" he whispered as he kissed across her shoulder.\n\nBut when he brushed her hair back rage knotted in his gut. Dark nasty purple with touches of green and yellow beginning to appear around the edges. Teeth marks. Not his either. Were they Mikael's? There would be more green and yellow, wouldn't there? His finger traced the imprint, but then that light a touch caused her to jump a bit in his arms. He noticed the small scabs forming on the four corners where the canines had broken the skin. \n\nNot that he objected to biting, especially her. He remembered the sweet taste of the swell of those tits that first time. What bothered him was that it was not his mark. Had Bjorn meant to? Was it a challenge? Another reminder of the fact that this woman had been his choice? Belonged to his baby brother in some way that she never would to him? \n\nWho was he kidding? This woman would never really be his. What the hell did he even have to offer her? Certainly not baby brother's sweet talking, intelligence or good looks. Mikael's wounded bad boy routine and perfect father routine had women lining up even when he never noticed it. Him? All he knew was the sea. And that had always been enough. Until...\n\nThis was getting him nowhere. He needed to keep it simple. This woman was his wife. This was about one thing...a son. Leave the rest of it for his brothers. They needed that shit. They could handle it. He breathed deeply as fought to reign it all back inside. Focus upon one thing...this night...this moment. It was all he had. All he might ever have with her. \n\nAnd to do that, he had to ignore his brother's marks upon her body. Which was easier said than done as he noticed the faint red lines that criss-crossed her shoulders, \"Bjorn introduced you to the floggers?\"",
        "She nodded her head but said nothing more. Flogging had never been his thing...or pain for that matter. He preferred simple domination, not that there was anything simple about it. Getting into someone's mind, discovering their secret desires and deepest fears and then pushing those to the very limits. \n\n\"Breathe deeply, Kirsten,\" better to get back to that...to what he did best. He reached for the bottle of lube and the plug on the floor. He rubbed the lube over the plug and then once more slowly massaged some into her tight ass...her virgin ass. \n\nHe wanted to say fuck it with the damned plug. Fuck the training...he had never been so foolish before and he was not about to act upon the impulse but the fact that it was there was alarming. What he really wanted was to sink his cock deep inside of her, claim that too. There was time, he reminded himself. She was theirs now. Even if he might never have her love the way his brothers did, he could and would enjoy her delicious body just the same.\n\nHe moved the plug between the warm cheeks of her ass. \"Breath in. Deeply. One. Two. Three. Four,\" he coaxed her. \"Good girl. Now push back again. Just like you did with my finger. You can do it. I know you can,\" he coached though he could feel her tensing a bit at the foreign invader. \"Breathe out very, very slowly as you push back, do you understand, Kirsten?\"\n\n\"Yes, Sir,\" she nodded as she shifted a bit against his body. His cock throbbed once more. He promised it that it would not be much longer, not much longer at all. As soon as he had the plug inside her ass, he was taking her. Hard and fast. He needed to take the edge off. To disperse some of the energy that had been coursing inside of him. Since...since the last time he held her. \n\n\"One,\" he began the count very slowly this time. His other hand ran the length of her arm until his fingers laced through hers. \"This is just the beginning, Kirsten. The plug is much smaller than my cock. You know this. Two,\" he continued as he felt some of the tension release from her body as she opened just a bit. He gently pushed the plug forward just the tiniest little bit in answer to her body. \n\n\"Good girl,\" he whispered against her shoulder. \"Three,\" he felt the plug breech her just as his finger had. Just as one day...hopefully soon...his cock would. \"Breathe out completely this time, Kirsten. Breathe out and push back as hard as you can. Four.\" \n\nHer body shivered and tensed as the plug sank completely inside her. \"Very good girl,\" he kissed her shoulder as his fingers squeezed hers. \"Now relax and breathe in deeply again. Let your body adjust. How does it feel?\"\n\n\"Full. Strange pressure,\" she whispered.\n\n\"Pain?\" he loosened his fingers and began to run his whole hand gently up and down her arm again as he buried his face between her shoulders and fought for even the semblance of control. His cock demanded that he keep that promise...bury himself so fucking deep inside of her and fuck her until they were both mindless. \n\nShe shook her head, \"Not really...just full and a touch uncomfortable.\"\n\n\"That is only because it is something new. Which is why the plugs and training are so important. Like I said, that plug is much smaller than my cock.\" His fingers pushed gently at the smooth end of the plug which curved and fit perfectly over the back opening. \n\n\"Remember why, Kirsten? Do you remember why I want to train your ass?\" As jealous as he was of his brothers, he knew exactly what to whisper into her ear as he rubbed his hard cock between her legs from behind. \n\nShe nodded slowly and he could hear the catch in her breath at his words. \"Why? Why, Kirsten? Tell me. Tell me what you want.\"\n\nThe silence stretched so long that he feared he had pushed her too far. He opened his mouth and was about to answer as she spoke. \"So I can...\" her shoulders even began to turn pink he noticed. \n\n\"So you can... We all can...\" she stammered.\n\nHis fingers brushed her chin and turned her head gently to face him. She cast her eyes to the side as she sought to avoid his gaze. \"Look at me, Kirsten. Look me in the eye and tell me.\"\n\nShe trembled as she inhaled deeply, but her eyes met his. \"So that you can fuck my ass...while Bjorn...\" She paused and her eyes went very wide as the head of his cock breached her wet cunt. He slipped just inside. \n\n\"So he can fuck your wet cunt, sweetheart?\" He slid in to the hilt, filling her tightness. \"Do you want that, Kirsten? Both of our cock deep inside of you? Your cunt and ass full of our hard cocks...fucking you deep...taking you...\"\n\nHe felt her cunt begin to clinch and tighten around his cock. He knew she was incredibly close as he began to move slowly inside of her, \"Beg me to fuck you, Kirsten. Beg me to fuck you and come inside your sweet cunt while you imagine it. Two cocks inside of you...\"\n\n***\n\nKirsty clutched the sheet tightly in her fingers as she thrust her hips back to meet his too slow thrust. \"Fuck me,\" she was shocked at how deep and earthy her voice sounded. Like some demon...or succubus howling its darkness. \n\nBut still he was too fucking controlled. His body moving slowly and smoothly within hers. She wanted him to lose control. She needed him as greedy for her as she was for him. \"Stop playing games and fuck me, Sven,\" she demanded.\n\nHis hands shifted on her body. His fingers laced through her damp hair at the base of her neck. Pulled her head back until she was staring straight into those intense blue eyes. \"You are forgetting something, our darling wife.\"\n\nShe shook her head. Right now she could forget her own name so that was no surprise, \"What? What am I forgetting?\"\n\nHe chuckled and she felt his cock twitch inside of her, \"Who? You have three husbands, my sweet little wife.\"\n\nHer eyes widened as his words hit her, ignited her senses. If the image of him and Bjorn both taking her at once was nirvana, his reminder of Mikael transformed it into heaven itself. She could not stop the gentle moan.\n\n\"Yes, Kirsten, just like that,\" he whispered as he plunged his cock fully inside of her at the same time he slipped two fingers between her open lips. He worked them in perfect time with his cock inside her depths. Of course, that only intensified the sensation of the plug in her bottom. Full. She felt so incredibly...\n\n\"Full. Stuffed. Crammed full of all three of your cocks. Is that what you want, our beautiful little wife?\"\n\nHis words were all it took as she felt her whole body splinter and take flight. She cried out around his fingers as he fucked her harder and deeper. His other hand pulled her hair even harder. Turned her head so that she faced him. \"Look at me. Watch me. Watch me fuck you. Watch me come inside of you. Inside your sweet fertile little cunt. Min!\" \n\nShe cried out even louder as pleasure and pain mixed once more when his teeth sank deep into her shoulder. Directly over his brother's. She saw stars from sensation overload even as her orgasm intensified. For a moment, she thought she would lose consciousness it was so fucking overpowering. Then she felt him swelling inside of her. \n\nEven as she tried to pull away, he forced her back into his arms, driving his cock into her to the hilt as she felt him begin to explode inside of her. She willed herself to open to him fully. She thought of his mother's words...remembered that he needed her love too. \n\nBut it did not fully erase the sting of betrayal. As if she were cheating on the man she loved. Even if she knew their ways were different, her mind could not reconcile giving her body, taking such pleasure from his brother. \n\nHer body though did not seem to give a damn what her befuddled brain thought as it pulsed and convulsed around his cock that had emptied itself as he said into her unprotected cunt. And that word, it was close enough to English to leave no doubt. He was claiming her as his. Perhaps differently than his brother had...but no less real. And his teeth pressing deeper and deeper into her already bruised flesh left no doubt...he meant to do just that. \n\nIn the end, her mind could not manage to calculate the dissonances that were tearing her apart. Her body wanted this man...every bit as much as it had from that first email...as much as it had from the moment he pulled her through that turnstile...even more than that first time in this very bed. His. His bed. \n\nHis fingers that had been inside her mouth trailed down her chin. Her neck. Across her tits that were hard and oh so fucking sensitive. Until his hand came to rest over her lower abdomen. Even with his face buried in her shoulder, she knew exactly where his thoughts were just then...and she fought back the rage. \n\nAt being used...once more he had used her. Turned her body against her. When would she fucking learn? He wanted only one thing from her...and as much as his mother wanted to believe otherwise...it was not her love.\n\nShe tried to pull away but his arms locked her tightly to him. \"We have just begun,\" he promised. \"I am not wasting a moment of my time with you, dear wife.\" He said as she felt his bare hand slap her thigh. \"Do not move.\"\n\nShe whimpered as she felt him slip from her wet cunt. She tried closing her eyes and breathing deeply, but found herself fighting back tears. Ambivalence...indecision...cognitive dissonance. Whatever the fuck you wanted to call it. She wanted to try...to be the strong, caring person that Petrine said she was. \n\nBut she simply could not. Laying on her side in the same bed where this man had first taken her...she wanted to crawl into a ball and cry. How the fuck could she love one man and still want two others? His brothers no less. \n\nAnd what was bothering her most was the warm wetness that she felt leaking between her thighs. The what-if's of that alone was shattering her whole world. To love one and want his...and to be nothing more than a breeder to the other. She choked back bile. \n\nShe needed time...time to come to terms with it all. The boat lurched the tiniest bit and she smiled...yes, time to get her sea legs in this strange new world of theirs. And his cold, aloofness was not helping. Even if he could not give her Bjorn's loving care, she would prefer Mikael's angry bad-boy...to Mister Cool. Mister This Is Just Business...making a baby was not just business...not to her anyway. \n\n\"Open your legs,\" his calm voice behind her commanded. \n\n'Never let me see you cry again,' it was her mother's voice that she heard. She breathed deeply and obeyed...simply because that was who she was. Even as stripped raw as her emotions were just then, maybe especially as vulnerable as she was then...submission was what came easiest. Losing herself not in her thoughts, but simply turning control over to someone else. \n\nAnd damn him, this man took that control so fucking easily.\n\n***\n\nSven fought to concentrate on the knots, the rope, the pattern against her soft, warm skin. But it was only how natural that all was that was his saving grace. He felt the stiffness in her body. Another reminder...you will never have her. Not the way you want. Not the way he does.\n\nThe further she pulled away, the tighter the rope became. But it was not enough. All the lengths could not really bind her to him the way he needed her. He re-positioned the intricately woven pattern that was the anchor between her legs. It formed a tight thong of sorts covering her from bare mons to past the plug which he had left in place. \n\nThe rope wound up her back, across her shoulders, then tightly around her tits that were turning the most enticing shade of purple. It laced down her tummy through the loop at the end of anchor then round her waist. It was the very type of artwork that he knew thrilled her. And still it was not enough. \n\nHe checked her circulation once more, running his nails along her skin until the lines shone white then watching and counting as they faded. It was perfect. Not as perfect as her pale skin that pinked around the edges of the tight rope. Not as perfect as the woman he...wanted, that was safe. \n\n\"Too tight?\" he asked even though he knew the answer,\n\nShe shook her head without looking at him. \"No, Sir,\" she whispered. But her use of the title was only another reminder. It was his name upon her lips that he wanted to hear. \n\n\"Over my knee then\" he said as he guided and positioned her exactly as he wanted her so that the round globes of that gorgeous ass was raised high in the air. \n\nHis hand came down on her right cheek. He smiled as it shook lightly from the blow and turned a light shade of pink. He repeated it on the left one. Alternating between them with light blows designed to warm the flesh...and other things. Her soft moans said that it was doing both. \n\nThen he increased the power of his downward stroke. Her skin flamed redder as she jumped a bit on his lip. His other hand on the small of her back steadied her, \"Do not move, Kirsten.\" He landed another and although she stiffened, she did not jump this time.\n\nHe delivered another dozen in rapid succession until her bottom flamed as brilliantly as her hair. And each blow was met with a deeper moan. He could hear and feel the pain in each one...but there was pleasure there too. Gods...she was perfection. \n\nHe delivered one final solid spank right in the center of her ass, \"Do you feel it? The plug moving inside your ass with each of them. It excited you, did it not?\"\n\nHe heard her soft whimper, \"Yes, damn it, yes. Is that what you fucking want to hear? Yes, I fucking want you. Yes, you fucking play my own damned body against me.\" She rolled over, stared at him and those blue eyes glistened with unshed tears. \"Is that what you want to hear, Sir?\"\n\n\"Not even fucking close,\" he growled as he laced his fingers through her hair and pulled her head back. He turned her over and shoved her backwards on the bed as he loomed over her. But he would have to settle if that was all he could have, because this woman had become his fucking addiction. \n\nHe reached backwards for his jeans on the floor. He found his knife in the pocket and opened the blade. He was not wasting fucking time untying the damned mess. It was only rope. And right then it stood between him and what he needed. To bury himself deep inside of her wet cunt. To fuck her until her screams echoed in the dark night. \n\nIf that was all he could be to her, then damn it he would make damned sure that she remembered every single moment of him inside her. Every orgasm he gave her. He would store up every moan, whimper and scream. Like treasure his ancestors pillaged. Like money in the bank. He would store them all up. Save them for the times when she... \n\nDamn it, he did not want to even think about it. A quick flick of the blade at the loop or rope just above her pubic bone and the whole thing began to unravel. What had taken him time to craft, to create...was gone in an instant. It reminded him how precarious life could be...over in an instant. Just as his father's had been...before he was even born. Just as his could be. And what would he leave behind? To show for living...\n\nHe pushed her back on the bed. His hands clinched tightly in her hair as he held her down. His mouth pillaged hers. He felt her push against him, try to dislodge him. He plunged deep inside her in a single stroke. \n\nThen her fingers were not pushing him away but curling into shoulders, drawing him closer as her too fucking tight cunt came on his cock. That only drove him harder, maddened him as he thrust repeatedly inside of her. He gave into all of the demons that had haunted him. Until they consumed him. Until she swept him away in her responsive body. Until once more he emptied himself...his very fucking soul it seemed this time within her. And still it was not enough, he thought as he rolled off of her. \n\nIt would never be enough, he knew and he drew her reluctant body back against him. He fell into sleep but his dreams were haunted with death, darkness and loss. \n\n***\n\nKirsty waited until his gentle snoring told her that he slept. She tried to move away at least, but his arm about her waist would not release her. She fought the tightness in her throat. The tears stinging the back of her eyes. \n\nDamn him, damn this man to hell. Damn that first message. Damn that photo of him on the control deck that entranced her from the beginning. Damn him for the way he had drawn her through that turnstile and handed her artic wildflowers...that he picked himself. Orlaya grandiflora...white lace. Damn him for this too. Damn him for how easily he could slip past her defences...turn her own body against her. \n\nShe felt the tears spill from her eyes silently. Damn him because it would never mean the same thing to him that it did to her. To him it was just sex. Biology. Reproduction. Spiced with kink. Her fingers gently caressed his arm where it wrapped about her waist. Why could it not be to her too? \n\nBecause as much as he angered her, she cared for him. Wanted to believe Petrine's words that he too needed her. That she might one day be more to this man too than simply a fuck... She choked back the tears at the thought...the mother of his son. She swallowed the bitter bile at the cold clinical assessment. \n\nThen she chuckled as she shifted in his arms as she thought...well, at least she had managed to chip away that Mister Cool veneer. Though how she had no idea. Yes, she liked the heat...his heat as she rubbed slowly against him and drifted off into a restless sleep."
    ],
    "authorname": "Tara Cox",
    "tags": [
        "butt plug",
        "anal",
        "sexual intercourse",
        "dirty talk",
        "polyandry",
        "romance",
        "love",
        "rope",
        "bondage"
    ],
    "category": "BDSM",
    "url": "https://www.literotica.com/s/ashgir-s-bride-ch-08"
}