{
    "title": "The Twelve Tables Ch. 28",
    "pages": [
        "Authors Note: Thank you to everyone left comments or sent me feedback about previous chapters of this story. Thank you again to Margaret who proofread for me. ~ellie\n\n\n\n Peri had enlisted the help of Bridgette, who had been overseeing both the nannies and cooks downstairs, as well as the upstairs staff. If she was honest, she hadn't wanted the woman in the kitchen with her as she cooked, feeling self-conscious about doing it in front of the woman who fed them, day in and day out. Bridgette ran the household as if it was her own and Peri often felt like an intruder in certain areas of her home, especially the kitchen.\n\n She had sent Bridgette down to meet with the nannies and get the final list from Kathy, of which children needed to return to school and where, as well as what was needed to get them all back to school. She hoped when Dante came home she could make a case for going home to the country house and enrolling Emily's children at the small school there until they left for boarding school. Even if Emily recovered enough to leave the hospital, she would still need a lot of support before she was ready to take control of her family again.\n\n She was fortunate that Angelina was the oldest of Ben's children and the only one to be going off to boarding school. When Ben returned, she would talk to him about being the one to take her to orientation day. It was important to Angelina, and he should be there. She had planned to call Rosanna, assuming that Arianna would already attend the boarding school and ask for help, but she knew it had to be Ben or herself, maybe even both of them that accompanied her.\n\n She hadn't seen Josh for the entire afternoon and had assumed he was downstairs playing with his nephews. She had no idea that he was working in the study and having conversations with his parents, to negotiate the changes that needed to be made in his household. He had planned to tell his mother not to asked Peri to cook on the spur of the moment, like she had earlier. What he had discovered was his mother's disapproval of Bridgette's attitude toward the family she worked for, and that the woman acted like she was a lady of the house, to the point of making other staff, guests and even Peri uncomfortable. His mother pointed out just how much Peri would struggle with all of the demands placed on her as the year progressed and have little time for romance if the household staff was not taken in hand.\n\n The pasta she had made for dinner had been enjoyed by both of her in-laws. They had lingered over coffee, despite Josh's obvious hints that he and Peri wanted to get downstairs to say goodnight to the children and help feed the babies before they went down for the night. Antonia chatted on happily until finally, Joseph practically ordered Antonia from the table, claiming they had plans for the following morning. Peri could see the question and confusion in Antonia's expression.\n\n They'd taken their time downstairs making sure all of the children were settled. Particularly Angelina, who still seemed to be missing Emily and to some degree trying to take her place with her younger siblings and causing Kathy distress at the same time. Peri knew that Emily had grown up with a family of the tables and had trouble not being seen as the perfect mother, she employed the bare minimum of staff preferring to look after her house and children on her own. Peri knew this couldn't continue even if she regained her health. She had been contemplating how she could broach the subject with Ben. Carmen should return just in time for her children's return to school and Peri promised herself that she would make sure they were ready when Josh took her hand and led her out of the nursery.\n\n \"You've been deep in thought all night,\" Josh murmured. \"Tell me what's going on in that amazing mind of yours. I want to know every little detail.\"\n\n Peri took a deep breath and unburdened her worries onto Josh, who visibly seemed to relax before her eyes. She had been trying to protect him from the mundane worries of looking after the children in the absence of their mothers, and she realised he had misread her preoccupation after her phone call with Dante.\n\n Josh embraced her and kissed her deeply. She could feel his need for her and his struggle to hold that back as he took her hand, again, after they had made sure the babies slept soundly. He led her upstairs and rather than going directly to the bedroom as she had assumed he would, they went to the office, and he sat her in one of the rich upholstered chairs and went to sit on the edge of the large timber desk, breaking the physical contact between them.\n\n \"Let's talk consequences for your actions today,\" Josh said in a serious voice making her look at him with widening eyes. She had assumed any punishment would be physical and sexual this was entirely different from the consequences Josh usually gave her and she turned her head looking around the room to get her bearings before focusing on him again with a worried expression.\n\n \"I spoke with Dante earlier, and he is in full agreement, given the current situation,\" Josh continued studying her as she entered new territory.\n\n \"I don't understand,\" she whispered. \"What situation?\"\n\n \"You are an intelligent, beautiful, capable woman who has always taken her responsibilities seriously and managed them independently. I have had to push you to accept household staff and trust the nannies to look after the babies, and I have realised today that you appear to defer to them rather than the other way around,\" his voice was stern as he spoke.\n\n \"I like to do things by myself, I'm not built to be a lady of leisure, and a little work around the house never hurt anyone,\" Peri said defensively.\n\n \"You do, I agree. I would never stop you from doing the things you enjoy, but it's come to my attention that you don't cook because Bridgette makes you feel like an intruder in your own kitchen,\" Josh's anger at the situation began to creep into his voice. His mother had been concerned about Bridgette's attitude throughout the day. \"When was the last time she ran through a weekly menu with you? Has she ever done that?\"\n\n \"Well, no, but she does such a good job that it's never been necessary,\" Peri said softly wary of the anger creeping into his voice.\n\n \"At work you are on top of everything. Each of the people working for you on the biographies reports directly to you, even when you're not physically there via emails, and you have a manager in Darius who you trust to oversee the team and give you a highly detailed run down on anything you haven't had a personal hand in doing. True?\" he asked.\n\n \"Yes,\" she said confused by where this conversation had gone. \"That is work, though, and I have to be on top of every little thing, because we are dealing with the other families and I don't want any mistakes that might reflect on you or your families standing within the tables. It's important to manage those interactions and progress down to the last detail.\"\n\n \"You couldn't do it on your own, though, you put people you trust in key positions, and you have managed it even from a distance. You're able to do that because you know exactly how you want it to run, and you have been able to share that vision with your team,\" Josh led her down the path of enlightenment seeing the confusion on her face.\n\n \"Yes,\" she nodded. \"It works well, and the team is very good at doing the reports and updates for me.\" She was proud of her team at work and what they were accomplishing in her absence. Each time she talked about them she couldn't wait to go back and start working on the biographies herself.\n\n \"Isn't our family and household just as important?\" Josh asked startling her. \n\n \"They are hardly comparable Josh,\" Peri shook her head.\n\n \"Let's see about that, shall we? We have a staff that needs to be managed. We have kitchen staff testing out recipes from the family cookbooks. I imagine there are volumes there that need to be edited and sorted through with preference given to those favourites that Dante and I enjoy,\" he let a small smile tug at the corners of his mouth, \"Like the pasta we just ate. Then there are the volumes on interior design and housekeeping, so that those who do the work know what needs to be done and the standard that needs to be maintained. Also a whole range of childcare books, again so things are done the way we want, not how the people doing the work think it needs to be done.\" Josh looked at her shocked face and softened his voice marginally.\n\n \"You can't do all this by yourself, Peri. You aren't the wife of a tradie or a man who works nine to five in a boring office job. You are Peri Donati, the mother of a vast family and the demands on your time and attention are only going to increase. If you don't put key people that you can trust in place, you will end up burnt out within a year, and I won't let that happen,\" despite the softening of his voice she could still hear the hard edge of it as she tried to process what he was saying.\n\n \"Bridgette helps me with so much that it's manageable,\" Peri said softly.\n\n \"If manageable means having to leave our home and children to have any quality time with each other then you and I have very different understandings of the word,\" His tone had become hard again with a trace of bitterness. \"We should have been able to retire to our rooms this afternoon, but you had no one in place to delegate what needed to be done to,\" he accused.\n\n \"I sent Bridgette down to make sure the information I asked for was being compiled,\" Peri said becoming defensive again.\n\n \"Did she come back with the information you needed and report to you or did she come back having made decisions for you?\" Josh knew the answer but needed her to say it. He needed Peri to realise that Bridgette had placed herself in the role of lady of the house and was running it behind Peri's back and wielding authority she didn't possess. She may even think she was helpful to Peri, but all she was doing was undermining her position and eroding the respect the household staff should show Peri.\n\n \"She had the information I asked for and made some suggestions,\" Peri said carefully trying to get a handle on whether she had given Bridgette too much authority and gotten the woman in trouble.\n\n \"She has to go, Peri. You need someone with more experience at running households like ours who will keep you informed and ask for your opinion, not make decisions for you. Bridgette is acting as though she is the lady of the house with full authority over the rest of the staff and you. We took her out of the nursery because she had become overbearing with the babies, particularly Eden. I will admit she was what you needed when we began assembling the people who we would trust to run our house and help raise our children, but she has crossed the line, and she can't stay,\" Josh said in a tone that said he was not going to argue that point.\n\n \"Oh Josh, you don't mean it, do you?\" she said with a sinking heart knowing the tone of his voice told her otherwise. She felt guilt at having caused this problem by relying too heavily on the woman.\n\n \"She signed her contract with Mama, not with us, and it was Andie who had championed the woman when Mama had reservations about her suitability. She will return to the farm with Mama tomorrow, and a temporary replacement will fill in until we interview for more staff. You will also need a personal assistant as well as a household manager. Over the next year, D. and I are going to be busier than ever, and I can't be worrying that you are overdoing it and wearing yourself out trying to take on too much for too many people,\" he lectured her. \"This is not negotiable, D. and I are in full agreement.\" He had spoken to D. a second time that afternoon after speaking at length with his mother about Bridgette and her attitude to the family, as well as the staff she ruled over as if she owned their contracts.\n\n Peri felt the tears prick at her eyes as she realised how ill-equipped she was to be the mother of this family. She knew the moment he had admitted he worried about her not coping with the responsibility that she had let him down, and she blinked trying to will away the tears that threatened to spill from her eyes.\n\n Josh fought an inner battle with himself. He wanted nothing more than to go to her and wrap his arms around her and give in to what she wanted but he knew that he needed to be firm about this. He was doing this to make her life easier, better, happier in the long run. He admitted he had more selfish reasons for putting new measures in place. He hated having to share her with the family, but that was their life now, but when he was home, he wanted her attention focused squarely on him and to a lesser degree Dante.\n\n \"I'm sorry,\" Peri whispered into the silence feeling miserable and overwhelmed by everything he had said. She wasn't from his world and not for the first time she felt totally out of her depth. A tear rolled down her cheek as she hung her head, realising this was the first time Josh had made her feel that he was disappointed in her. These consequences were hard to take, and she longed for the harsh punishment that gave them both release, mentally and physically. It was their love and need for each other that made nothing seem insurmountable. With the physical distance between them, she felt the weight of being his overwhelm her.\n\n No matter the problems that had arisen between them she had always felt his love and admiration but as he kept his distance and continued to speak in a lecturing tone, she knew she'd let him down badly. She'd only been playing at being the wife of the new leader of the family, letting others take the lead instead of supporting him in all facets of their life. He shouldn't be having to worry about the running of the house or looking after the children. He had so much that weighed him down already without having to shoulder her responsibilities as well. She let out a sob, and her tears began to flow freely. Josh was there then, kneeling beside her and cradling her in his arms. \n\n \"I love you. I need you more than you could ever possibly know, and I can't do this, any of it without you. You are the reason I am where I am today, and I would die if anything happened to you. You can't let yourself be run ragged. You need help from good people who will support you like you support me. You can't do it all on your own and be there for me the way I need you to be,\" he kissed her wiping the tears from her face. \"I'm trying, Peri. I don't want to share your love and attention with everyone, but I have to even though I need you like I need oxygen,\" He spoke softly rubbing her back and kissing her tears away.\n\n \"I'm so sorry Josh, I love you so much, and I just don't know what I'm doing. It's so much to take in, and I never want to let you down or have you be disappointed in me,\" she cried softly, her heart heavy in her chest. \"I'll do better, I'll fix it,\" she promised.\n\n \"You are amazing, and you haven't let me down. You've placed your trust in the wrong person, and we are going to remedy that, together. I know you love Bridgette, but she's taking advantage of your friendship to boost her sense of self-importance. This isn't about me,\" he lied. \"This is about you and being able to trust people to do what you have asked without deciding that they know better. Your team at work would never do that, running this household is no different.\"\n\n Peri blinked. She had been so overwhelmed by his tone and lecturing that she hadn't made the obvious connection he had outlined when he had brought up her work team earlier. She'd never in her wildest dreams thought of her home as a workplace, but she had the staff to manage, and she could suddenly see what he was saying. She'd made Bridgette part of the family. She loved her like she would a close aunt if she had ever had one and deferred to her age and experience rather than treating her like an employee. She treated Madeline and Heather the same way, but she could see in her mind's eye the respect they still showed her which was lacking in Bridgette's conversations unless Josh or Dante were present.\n\n She understood what Josh had been lecturing her about, and she realised she needed to have more control over this part of her life. Her work team needed very little supervision once she had put all of the structures in place to make it run exactly as she wanted and it had freed her up to have her babies without worrying about what was happening there in her absence. More control in the household would have the same effect she realised, and she would have less anxiety about upsetting Bridgette with any changes to their routine. She acknowledged that Josh was right, and she had allowed Bridgette too much latitude to expect to take it back from her now. \n\n Josh saw her eyes become distant as she worked over the consequences of being too busy with family to spend the afternoon with him. If she had a head nanny, head cook and Butler to oversee them all life would become infinitely easier for her and in turn him. Once she had a professional assistant to tie all the various facets of her life together, she would be able to make him, Dante and the triplets her priority again. There would be no need to run away for weekends in the chalet, no matter how appealing that was to him tonight, rather than given her this lecture as a consequence of becoming overwhelmed by the needs of the extended family.\n\n \"Does Bridgette know?\" Peri whispered dreading that she would have to be the one to speak to her about leaving their household, but feeling responsible knew that she should do it.\n\n \"Not yet I wanted to talk to you first. Mama will remind Bridgette of the definitions of her contract and inform her of her return to training on the farm tomorrow after breakfast. If you wish she will add that she may reapply to return to our household after that training time,\" Josh said soothingly knowing this was difficult for Peri who preferred to think of the staff as employees rather than servants who were contracted to serve the family within its traditions and laws.\n\n \"It's my fault,\" she admitted. \"I understand what you said about her taking advantage of our friendship, but it was me that treated her like family instead of an employee. Now she must suffer the consequences of my mistakes.\"\n\n \"You know that's not true,\" Josh admonished. \"You treat Heather and Madeline the same way, yet they know their place and haven't put themselves above the other nannies who have taken up residence downstairs. They respect your wishes and although Madeline is young she has taken on everything Heather has told her as the more experienced of the two. Bridgette never respected Heather's experience and knowledge of the family and what it means to be looking after the heirs to the Donati table.\"\n\n Peri nodded having had the same thoughts. She had friends and a huge family she didn't need to make the people who worked for her as close as family, but she did need friendship with them on some level. She had that with her team at work, now she had to do that with the people who worked to keep their home ticking over like clockwork, whether here or at the country house as she had begun to think of it.\n\n \"Upstairs and downstairs,\" she mumbled almost to herself making Josh cock his head and frown. \"There is this old television series called Upstairs Downstairs,\" she explained. \"It was about a rich family in the Victorian era. Upstairs were the family, the ladies' maids, valets, and Butler. The Chef and Housekeeper went between both up and downstairs, I think nannies were the same. Then downstairs were the rest of the staff, like maids and footmen and chauffeurs.\" She explained. \"The names of the positions may have changed, but I guess the hierarchy hasn't, I just hadn't thought about regarding our house and its growing staff.\"",
        "\"That's true, I guess, but I would not have put it in those terms,\" Josh agreed loving how once more her mind was working to make sense out of why she was being chastised. \"And was soon to be punished,\" he thought to himself enjoying the anticipation that had been growing within him since she had told him she was too busy to retire with him for the afternoon.\n\n Peri gave him a small, timid smile. She could understand why she was being given the consequence of losing the person she relied on the most here. She could see that it was a lesson she had to learn if she ever hoped to be as in control of the vast Donati clan as Antonia was. She wished she had have been savvy enough not to make the mistake in the first place but maybe in time Bridgette could forgive her and return.\n\n \"I'm sorry I keep making mistakes that you have to worry about and fix,\" she said quietly. Although calmer now tears still prickled her eyes as she looked at the man she loved and saw the same love mirrored back at her. \"You are dealing with so much at the moment, and you have to put up with me being totally out of my depth and overwhelmed,\" she admitted just how badly she felt.\n\n \"I love you, and we're a team. You, me and D. We will always be there for each other when one of us stumbles to make things right again. Trust me; I almost made a very big mistake when I couldn't get hold of you the other night. I'm learning, just as you are, what it means to be the chair, the leader, the father, the brother, and the husband of one of the most powerful women in the country. As much as I want to, I know I can't keep you all to myself,\" his voice deepened, and his eyes darkened as the desire he felt for her shone in his eyes.\n\n \"You're my everything,\" Peri whispered and placed a soft hand on his cheek feeling him nuzzle it into it. \"I love you.\"\n\n Josh groaned standing to pull her up with him and pick her up in his arms. He walked purposefully from the office through the living room where his parents sat smiling indulgently at them and into their bedroom. He didn't stop however walking through the bathroom and closet into the playroom before placing her on her feet. \n\n His demeanour had changed Peri noted, and she saw the heat and desire fill his eyes and meld into his features as he gazed at her. That gaze went straight to her core turning it into jelly and butterflies begin to flutter up and down her spine sending delicious tingles through her body. She knew this Josh well. This was the man she had fallen head over heels for within the first weeks of their relationship. The dominant in control man who made her feel like she was most desirable of women and sent her soaring to pleasurable heights, she had never believed possible as a naïve, mousy young woman. Now she gazed back at him, her body quivering with both dread and anticipation from that look.\n\n Josh bent his head to kiss her unzipping the back of the light summer dress she wore and pushed it from her shoulders. He realised the zip was not long enough for the dress to drop over her hips and he stood back. Reaching for the hem and pulled it off over her head. He took in the sight of her and groaned with need. Changing his plans, he grabbed her by the arm and led her to stand before one of the leather couches.\n\n \"Don't move,\" he murmured hotly into her ear before biting her earlobe. He stripped quickly and practically tore her bra and panties from her before pushing her down to kneel as he sat. His cock stood up begging for her attention, and he watched as her eyes fell on it and he could see the hunger in them as she almost dove forward to kiss and tease at his cock running her lips up and down his shaft. Enjoying the sensations, he tilted his head back and closed his eyes. He would let her give him the release he so desperately needed and then he would take his time and pleasure in punishing her for making the weekend plans without his approval.\n\n She knew he needed control in his world and the consequences of her behaviour driving him crazy with the loss of that control. If she had thought he had been mellowed by how busy their lives had become or Dante's addition to their intimacy, then she needed the reminder he was giving her tonight that he was still the dominating man who had stolen her heart.\n\n He opened his eyes to watch her as she took the head of his cock between her pursed lips and drew him into her mouth. He was pleased to find her looking up at him as if for approval and he groaned loudly, his cock stiffening even more at the thought of what a long night this was going to be for the beautiful woman who knelt at his feet and worshipped his cock. \n\n Peri could feel the burning desire in his eyes and wondered at his seeming change of mood from when he had first brought her in here to the position they were in now. He had seemed to begin to take things slowly at first and then as if unable to hold back he had moved rapidly to this more familiar position. She wondered if he had planned to punish her for all her transgressions this weekend finally and then changed his mind in favour of the familiar pleasure they both got from her sucking his cock.\n\n She felt the fingers of one of his hands wind into her hair, and she lifted a hand to the base of his shaft and balls. He moved grabbing her hair with both hands and pulling her head off his cock to force her to look up at him.\n\n \"No hands,\" he growled. \"Open.\"\n\n She opened her mouth, and he pushed her head down onto his cock until she gagged slightly. He controlled the tempo from there, moving her as she got used to the feeling and rhythm of his movements until she swallowed around the head of his cock taking him as deeply as she could. Her nose became buried in his pubic hair, and he held her there for long moments waiting for her to squirm before relenting and pulling her off his cock to gaze into her face. Her eyes and mouth were wide as she gulped big breaths, long strands of spittle hanging from her chin.\n\n \"So fucking beautiful,\" he groaned and pulled her head down over his cock again. He went through the same routine until she took him all, and he held her tightly only this time when he let her up to breath he stood up pulling her up slightly in her kneeling position and pushed his cock back into her wide gasping mouth. The tears, drool, and muted cries only drove him on further as he fucked her face. Like this in here she was a sex crazed slut, he thought pleasurably, and he loved every moment of her submission. He had even grown to love her submission to Dante and revelled in their private debauchery. He almost wished Dante was there fucking her ass, so she screamed around his cock making the delicious vibrations that made him come so explosively.\n\n The thought of it alone pushed him to the edge, and he pulled out of her mouth tilting her wet face up to him and came spurting jets across her nose and cheeks before letting her suck him dry. He collapsed back into the chair knowing she would follow him without his guiding her movements. She loved this nasty, dominating side of their sex life as much as he did. He and Dante had been talking to her recently during their post-coital glow about testing and expanding her limitations in the playroom. \n\n Peri cleaned Joshes cock thoroughly before sitting back on her heels and scooping a finger full of come from her face and sucking it from her finger knowing how the crude act affect the man she knelt before. It seemed like Josh and Dante fed each other's darkness in here, and the sex had become rapidly rougher, dirtier and mind-bogglingly good. They always spoke with her about anything new they wanted to add or the things they did to make sure they never went further than she was comfortable with.\n\n Josh passed her a cleansing wipe when she had cleaned most of the come from her face with her finger, and she wiped the rest away. She smiled and leant her head down onto his thigh as they both took a few minutes to rest as both their thoughts rolled through their minds about this room and her submission to the men she loved. \n\n Outside of this room, or she guessed the bedroom in general, she was the mother of the Donati who needed to show her strength and intelligence to all those around her. Inside this room, she revelled in being a highly prized, sex slave who embraced the pain and pleasure of their darker desires. She even found that the names they called her at times only made her hotter because she knew they were practically overcome with lust and need when they did use them.\n\n \"Now,\" Josh crooned softly feeling relief from the sense of urgency his need had built up in him. His hand stroked her hair softly as he continued speaking in the same smooth, gentle voice. \"You've been very naughty lately. Let me make myself very clear about not liking surprises. You above everyone, tell me what a control freak I can be and yet you thought I would enjoy having plans made for me, without any consultation at all?\"\n\n Peri swallowed realising this was at the heart of the matter this weekend and what he had been battling with internally. She remained silent realising he did not require an answer from her.\n\n \"You've known since our first dates that I need to be able to contact you at all times, and yet, you thought it a good idea to go sailing, again without any consultation,\" he accused.\n\n \"I'm sorry,\" she whispered. He seemed to be counting off her misdemeanours she realised.\n\n \"Every time I leave town on a business trip I assume D. is fucking you senseless there is no need to protect me your growing relationship. Have I not shown that I am happy about it? Encourage it even?\" The question was again rhetorical. \"I never wanted to share anything in my life, especially not you but circumstance pushed the three of us together. No one is more surprised than me by how much pleasure I get from seeing you submit to him. I can't explain it, not to him and not to you adequately enough but trust me when I say I fucking love it.\"\n\n Peri picked up her head and looked at him stunned by the admission. \"Try to explain,\" she prompted. \"I want to know, please.\"\n\n \"He doesn't intrude on us or force us apart. He compliments us. If that makes any sense,\" Josh said after a moment's thought. He took a deep breath. \"He never tried to take you from me or exclude me from your relationship with him. It's not like we have a relationship and then you have a separate relationship with him. We, the three of us have a relationship now, and I would never stop you from spending the time to get to know him better on a deeper level. You didn't have to take him away from where we all live together to a place that would be just yours, just as you didn't have to take me to where there was no trace of him.\"\n\n \"Oh God, that's exactly what I did, didn't I?\" she admitted realising that she had been separating their relationships and how wrong that was after Josh's admission about their three-way relationship. Though she didn't know that was how he felt at the time. She had assumed he wouldn't like that they spent time alone like that without him but for all the wrong reasons.\n\n \"I know this hasn't always been the case, and I didn't treat your concern about formalising his relationship with you by a ceremony of some sort with the same attitude I have now. It was new then, and we didn't know it would be this easy between us once you properly submitted to him. Believe me, he can fuck you stupid, take you on romantic date nights whatever you like, just let me know, so I don't have to worry about where you are,\" he said simply. \"You can even have the ceremony if it will help you realise how happy I am to have D. in our lives.\"\n\n \"I don't need it now but thank you,\" Peri whispered.\n\n \"Talk to D. he might like the idea,\" Josh said again showing his comfort with his brother's love for her. \"Just tell me don't make it a surprise I hate surprises.\"\n\n \"I can remember one time when you liked a surprise I had for you,\" she said quietly trying to ease the tension between them.\n\n \"That was different and you know it,\" he growled knowing exactly what she spoke about. \"That surprise came with a shotgun wedding attached to it. I was hardly going to get angry about you wanting to marry me whatever the reason.\" Josh admitted.\n\n \"You always make me feel so wonderful when you say things like that,\" she smiled. \"I still have trouble believing you wanted me when you had dated so many gorgeous women.\"\n\n \"You are the most gorgeous woman I have ever met, inside and out. I was just killing time with them until I found you,\" he ran his fingers over her cheek. \"I love you, I need you, I want you in every way possible. I was chosen as chair because of you, not because I was any better than Ben or Romey, but because of who you are.\"\n\n \"That's not true,\" she admonished frowning at him. \"I'm the woman who is always making mistakes that everyone else has to fix. You are lucky they didn't take that into account when they chose you for being the good and kind man you are.\"\n\n \"Ah yes, your mistakes now where was I?\" Josh said brought back to what he had been doing by the sudden desire to spank some sense into his wife. \"I covered my need for control, hating surprises, loving Dante, what was next?\" he mused enjoying the startled look that crossed Peri's face as she realised she was about to be punished.\n\n \"Stop putting your mother on a budget when it comes to your wardrobe,\" Josh smirked. She has good taste, and you have said yourself she has chosen well for you. You are wealthy, one of the wealthiest women in the country if truth be known. You don't have to scrimp and save every penny or be concerned with how much a dress costs,\" he sounded exasperated. \"She calls me, you know, if she goes over the monthly allowance you have given her for clothes.\"\n\n \"She calls you?\" Peri asked in surprise.\n\n \"Yes, she calls, sometimes she finds something fabulous like that new year's gown and she knows I will love seeing you in it, but it costs far more than you given her, so she asks before buying it,\" he said in annoyance. \"You can have whatever you want, just ask or go shopping. While I don't want you to go out and spend millions on a shopping spree, we could afford it if you did. You don't have to be so budget conscious with everything. This week get some nice bras, those horrible maternity ones are worse than the boulder holders you used to wear. Have the bras made if you can't find something sexy to hold these puppies,\" He reached under her and fondled her breasts?\n\n Peri nodded her agreement thinking over what he had said and realising why Cherise had wanted to marry without a prenup. She had no idea they were that wealthy. She had seen that the planes and big houses told of wealth but spending millions on a shopping spree, she couldn't even imagine it. He tweaked her nipple bringing her attention back to focus on him and the lecture he continued to give her.\n\n \"You need a PA before I even consider talking about you returning to work. I'll let you find one yourself, but I am happy to choose for you if you take too long. It would be better if it were a family member or someone who understood our family and the way it worked but if you find someone who is willing to sign a non-disclosure contract we can discuss the appointment further. They will link home and work for you, as well as whoever D., and I employ as our PA's. It would be better if they lived with us most of the week and were available at all times. Your PA won't have a normal nine to five job as our lives get busier, so they will need to be committed to you professionally and personally.\"\n\n \"Gosh who would want to do a job like that?\" Peri asked appalled by the demands he was making.\n\n \"If the salary is high enough you'd be surprised how long the line will be for applicants and people willing to sell their souls to work for you. D. and I get the final say, though. Security checks will have to be made.\"\n\n \"I have a steward in place at the house, one of my cousins. He is not a servant, but he works for us as a caretaker and oversees the permanent staff at the house. He will interview for a new chef and household manager and narrow down the choices to three or four for you to interview unless you know of someone better within our household staff. This is not negotiable. Heather has experience, and she is infinitely loyal to our family. I suggest we make her head nanny. She won't push herself forward, but she has all the credentials and knowledge to be an asset to you in that regard.\"\n\n \"This is all stuff I should have known,\" Peri said sadly overwhelmed by Josh having to worry about the household staffing when she should be able to have it under control.\n\n \"No, this is stuff you must learn about, and you have a lot of people to help you now. Talk to Mama and any of the Zia's you feel comfortable with, talk to Lucia or Carmen. You don't have to do any of this on your own, that's why you have the other wives to help you. Learn to use your resources wisely. No one will blame you for not knowing, but they will blame you for not addressing a problem and fixing it.\"\n\n Peri opened her mouth to speak but closed it again. It seemed somehow ludicrous to be sitting at his feet naked, in this room and having such a normal conversation about the running of their household.\n\n Josh tilted her chin up and looked into her eyes. \"Tell me,\" he murmured.\n\n \"I think we should move back to the house this week and let the children run around and play properly they've been cooped up here long enough and had no adventures during their summer break. I also think we should talk to Ben about letting us send his younger ones to school out there because even when Emily recovers enough to come home, she isn't going to be in any shape to look after seven children on her own, even with the help of a nanny. Then there's the issue of Angelina, and I need to talk to Ben, can you help me organise that tomorrow night. I know it's the right decision for everyone. Especially the kids.\"\n\n \"And that my love is why you are the mother. Your first thought is not to defend yourself from what I have said but to look after others,\" he smiled. \"Yeah I'll make sure Ben comes and talks to you about it all tomorrow night, but tonight you are mine, and you have to admit you've been very naughty lately,\" he smirked at her, watching her nod reluctantly. \"And what happens when you're naughty?\"\n\n \"You punish me,\" she said, and the familiar quiver that was a mix of anticipation and dread rolled up and down her spine, and his smirk turned into an evil looking smile.\n\n Josh stood, leaving Peri where she knelt and moved behind the chairs to where she had to strain to see him and what he was doing. He seemed to be gathering some pieces of equipment and toys before returning to where she knelt. He pushed the two footstools together and helped her kneel on them positioning her at one of the wide edges. He took his time wrapping soft leather cuffs around her wrists and ankles then around her elbows and knees. Josh continually stroked his hands over her soft skin and kissed her as he prepared her for the scene he had been creating in his mind all day.\n\n \"It has been some time since I have been as angry as I was on Thursday night,\" he said in a deceptively mild voice. \"Despite all of the things we have spoken about the fact that I couldn't reach you messed with my head,\" his voice turned into a growl, and he stopped and shook his head. He didn't want to do this being blinded by the anger that seized him again as he remembered that night. Not trusting himself with the cane or crop he had picked from the equipment stores he pulled her from the footstool and sat, laying her over his lap.\n\n Peri let out a squeak of surprise which had formed from having held her breath as he spoke. She wasn't afraid of him she knew he would never hurt her in anger, but he seemed to have been holding some part of him back since she had seen him at the chalet Friday afternoon. It was as if she had been waiting for his explosive outburst, preparing for it even. When his hand landed on her ass, she almost bounced with the force of the impact and let out a loud whimper her leg curling up almost in defence. Then his hand began to rub and soothe the burning sting of her skin.",
        "\"Do you have any idea what it did to me when I saw you in that Battaglia hospital?\" his hand landed again on the other cheek leaving a large red print. \"How could you? You refused to see me or speak to me for weeks after that,\" he lifted his hand from its rubbing motion and spanked her again. \"I had to be patient and give you space and wait until you were ready. Did you think about what it was like for me at all?\" He spanked her again. He was angry, but he kept tight control of the spanking he was giving her. He knew she could take the hard spanking, and he needed her to understand that she had to stop taking such big risks, if not for her sake then for his.\n\n This was pure punishment, Peri thought. Any eroticism was erased by the power of his words, and she opened her mouth to protest when he spoke again.\n\n \"Lio died, Nik died, D. got shot, and you fucking disappear off the planet!\" he raged losing his battle with his anger as he continued to spank her severely. Her frightened voice finally broke through the blood throbbing in his ears.\n\n \"Red! Red! Josh Stop! Red!\" Peri shouted in panic and as soon as she felt his grip on her relax she rolled from his lap to the floor and knelt up to touch his face. \"Josh, I'm sorry,\" she sobbed hearing the pain in his voice and understanding why he had lost control.\n\n \"You safe worded,\" he said as if in a daze.\n\n \"You sounded so angry. I got scared,\" Peri admitted. \"Josh, I'm so sorry, I didn't know you were feeling that way. You never talked to me about Nik's death or that you were that affected so badly by Dante's injury. You should have told me.\"\n\n \"You safe worded,\" he said again as if he didn't quite believe it. \n\n \"Josh talk to me please,\" Peri implored him. She stroked his cheek watching his eyes which still seemed glazed. He'd seem so strong and in control over the deaths of his siblings. The only time she had seen him break down emotionally had been at their engagement party when she had tried to leave him again. Had he believed he had lost her again when he couldn't contact her? She wished Dante were here and considered getting up to call him when Josh's eyes seemed to clear as he looked at her.\n\n \"I'm sorry I scared you,\" he said softly. \"I would never harm you. You are the most precious thing in my life,\" Josh murmured pulling her up into his arms and holding her tightly. \"I couldn't bear to lose you and after what happened to D., even with the added security you're still vulnerable every time you leave this house.\"\n\n \"I was with Dante,\" she said soothingly. \"Dante and at least six men loyal to your family.\"\n\n \"I didn't know that at the time. I didn't know where either of you were and with both Lio and Nik, being where they should have been safe and still having their lives cut short,\" he shook his head. \"You take risks that aren't necessary. You seem to think nothing bad will ever happen. You trust people too easily. You never seemed willing to say no to anyone who asks you to do something,\" he closed his eyes taking a deep breath. \"But you safe-worded with me,\" he said sadly. \"I'm the one person in the world that scares you?\"\n\n \"Josh I love you I know you'd never harm me. You were frightening me with what you were saying. What was happening just then had nothing to do with pleasure for either of us. You were punishing me for not considering your feelings, and I'm sorry, I didn't know that was how you were feeling. I won't do it again. You can't keep all of this bottled up the way you do.\"\n\n \"I don't bottle things up,\" he denied the accusation. \n\n \"My ass says otherwise,\" Peri smiled softly. \"I had been waiting for that explosion since you got back yesterday. I didn't understand why you were acting so weirdly. I tried to ask how you felt when Nik died. All I thought about was how you weren't showing any emotion at the time. I didn't nag you because Dante promised me you were fine. You two left me out of the whole grieving process, and I let you because I didn't know how to feel at the time.\"\n\n \"I don't think any of us knew how to feel,\" he stopped short of admitting that he felt enormous relief that he hadn't had to send his sister into exile or worse. He had known sending Nik to the Papillo would have been a fate worse than death for her, but there had been no real choice. He remembered making the decision to have her killed and end her madness himself before he knew of his father's plans to send her to the Papillo. He'd felt relief that the decision had been taken from him, but he also felt the overwhelming sadness of knowing that her fate would kill her just as surely as an assassin would have.\n\n Here was the biggest difference between the two men she loved, Peri realized. Dante wore his emotions on his expressive face. She rarely had to guess what he was feeling especially as she had got to know him on a deeper level. Josh had a temper but over the last twenty-four hours he had kept such a tight rein on it, she hadn't known how to deal with his anger except to apologize not fully understanding why.\n\n \"Josh I used the safe word because of what you were saying. When it is about mutual pleasure, I can take anything you dish out. I love you and trust you with my life, but you sounded so angry that it felt like pure punishment, and the pain seemed somehow harder to take. I know I endure a lot in here for you but I'm not a total masochist,\" she stroked his cheek. \"You sounded like you were losing it.\"\n\n \"I know,\" he admitted. \"When I was restraining you I felt some of that control shift which is why I stopped and pulled you over my lap.\" He had picked up her hand looking at the cuff still wrapped around it. \"I didn't trust you to stop me if I did lose it, especially if I was using something other than my hand on you. You did stop me, though, and I am happy about that,\" he stroked her face. \"Maybe you're not as reckless as you appear to be,\" he gave her a lop-sided grin. \n\n \"You always seem so willing to put yourself at risk, that it terrifies me into outbursts that are fueled more by the memory of you in the hospital, barely alive and telling me you didn't want me near you ever again, than by what is happening at the time. When Romey got out his phone the other night and showed Carmen and Emily that photo, I was almost sick. I don't want to ever feel like that again,\" he admitted. \"It was so hard to get you back and the thought that someone or something could take you away from me again,\" he shook his head pulling back the tight rein on his emotions that threatened to slip again and crushed her against his body.\n\n \"You did get me back,\" she smiled up into his face. \"You were patient and kind and understanding, and you're right, it was all about me and my recovery. I assumed with your family being there for you and the counselling we both agreed to, that you had worked through those things,\" she noted a sheepish look on his face. \"You did go to the counselling didn't you?\"\n\n They had both attended trauma counselling after their engagement party and her attempted flight from him for a second time. They'd never gone together, though, and Peri realized at that moment that they should have, so they could see the real damage deep inside that they kept hidden from each other and the world. They were married and had children now, and he seemed to be talking about it as if the hurt of her actions was still fresh.\n\n \"I was fine. You were healing and loved me again. That was all I ever needed, your love,\" he murmured tilting her chin up and kissing her deeply.\n\n \"Josh, you should have gone. You've been hanging onto all that baggage. We can go together,\" she offered.\n\n \"Have you met my family? The new chair needs a shrink after just a few weeks as a leader, no thank you,\" Josh flat out refused.\n\n \"Fine then,\" she said after a few minutes of silence as she considered him and his implacable face. \"Then we make a proper time to sit down with Dante and work through this,\" she said with an implacable face and tone to match his. \"I'm not a risk taker anymore Josh, I'm wearing the tracker, there's probably one in my phone I don't know about. I have two security guys, and I never go anywhere without at least one of them, unless it's with you or Dante. You can't keep me under lock and key Josh, and I'm frightened that will be your next move. Especially after your announcement that you won't even talk about me going back to work unless I have a live in PA. You have to let me live Josh. I will shrivel up and die otherwise.\"\n\n Her words had the desired effect on him, and he looked horrified for a split second before he pulled back, and his handsome face relaxed back into the unemotional immovable Josh that didn't like being given ultimatums.\n\n \"It's time to put what happened between Nik and me behind us. For my sake Josh, I need that as much as you do,\" she tried to coerce him by putting it in terms of her welfare.\n\n \"You drive me crazy,\" he growled and kissed her. \n\n \"So that's a yes then?\" She smiled sweetly. She could feel the last remnants of the tension flowing from his body as he chuckled.\n\n \"With D.,\" he specified. \"No shrink.\"\n\n \"With Dante,\" she smiled and kissed him again pressing her breasts against his chest and feeling the heat between them ignite again as the kiss deepened and his hands ran down her body. Crisis averted, she smiled inwardly feeling the need to reconnect with him physically. \n\n Josh picked her up and moved her back to the footstools before him and considered her for long moments. She was everything he had ever wanted in a wife. His desire for her had never wavered since that first startling meeting where she had stood toe to toe with him and argued in the face of his wrath. He no longer felt the need to punish her. Now he wanted only to savor the gift of her submission. He ran a hand down over her body deciding how to play with her soft, pliant body as she lay face down her legs dangling off the edge too far for his needs.\n\n Peri felt him move away from her and turned her head to watch him search the tall cupboards for what he needed. When he came back soft R&B style music was playing, and he placed an adjustable stand with a small padded seat near her head, taking his time to adjust it. Slapping her still red ass he murmured, \"Sit up before I decide to spank you again for making me crazy,\" His voice was deep and gruff but held humor.\n\n Josh took his time using a length of soft rope to create a bra-like structure around her breasts all the time fondling and kissing them as he worked. They weren't bound so tightly that they immediately swelled and discolored but tight enough to push the large soft globes of flesh up and out from her chest. \n\n He helped her to lie down, turning her face down on the padded surface and placing her head on the adjustable stand so that her breasts hung slightly and were not squashed uncomfortably beneath her. His hand roamed over her back and once again smacked her ass. Her knees rested on the edge of the stool now, and he bent her legs almost double to dangle her feet above her brightly colored ass. His hands gently smoothed over the bare skin of her thighs, as he spread them widely, his fingertips teasing at the outer lips of her cunt, making her whine and lift her hips seeking more of his touch.\n\n \"Such a hot piece of ass,\" he grinned and smacked her again before picking up one of the spreader bars he had left there earlier. He locked it between her knees and spread it widely watching as her lips parted revealing the deep pink inner folds. Her muscles moved, and he heard her soft whimpers as he locked it in place and ran his hands up her legs again barely touching the glistening heat of her open cunt.\n\n Peri was beside herself, all of the touching and teasing was making her body tingle with need as he positioned her with a maddeningly slow pace. She heard the whirl of the pulley system and strained to look back at him from where she lay. It seemed to go on forever and then he was beside her again caressing and kissing her back, ass and thighs.\n\n \"Up,\" he smacked her again, and she awkwardly walked her hands beneath her and backwards to accommodate the spreader bar between her knees. Josh took his time again teasing and fondling her as he wrapped rope around her waist, hips and secured the firm rope bra to the pulleys above her. He walked around to where she could see him then, and he bent to kiss her before guiding her down to lie on her belly again. \"Comfortable?\" He asked with small smile quirking his lips.\n\n \"So far,\" she whispered breathily.\n\n \"I'll soon fix that,\" he kissed her deeply, groaning softly before standing and pressing a glass butt plug to her lips. \"Warming this up a little before I use it, might help,\" he slid it into her mouth as he returned to her side. Seeing him pick up a something else from the equipment he had put on the other chair earlier she knew the discomfort was about to increase. His version of \"fixing that\" was not as promising as it had sounded.\n\n Peri felt the small bullet shaped toy make contact with her hot wet cunt and jumped. It was already vibrating in a slow, soft rhythm as he pressed it to her clit making her whimper and squirm in her bonds. He pressed it into her forcing it deep as his fingers continued to move and tease her until she trembled, then he stopped abruptly and withdrew his hand slapping her ass again without any force. His hand remained there smoothing the hot red skin for a few moments before spreading her cheeks, and she felt the cold wetness of lube trickle down between them.\n\n Josh watched mesmerized by the sight and sound of her as the tight anal ring of her ass slowly gave way to his oily finger. He took his time preparing her for the large plug, eventually fucking her ass with two fingers as she whimpered and squirmed. He saw her thighs begin to tremble as she neared her orgasm and stopped once again. He pulled his hand away and retrieved the plug from the warmth of her mouth and fucked her with it for several long minutes before embedding it securely into her ass. Her begging for release and the impending climax she had been building to over again was music to his ears but he was far from finished with her, and he didn't want her floating off into clouds of bliss just yet.\n\n Peri was beside herself. The long drawn out way he had been restraining and teasing her had made her so hot and needy she was begging for more, begging for him to spank her, use her, fuck her anything if he only let her come. The climax she felt building was so close she would feel it in every nerve ending, yet it still seemed so far away each time he stopped and changed his attack on her senses. She felt him lift her knees and place a leg presumably a knee on the edge of the footstool holding the spreader bar up with his body as he reached forward and maneuvered her feet back further over her ass.\n\n The second spreader bar was placed behind the rope that attached her hips to the ceiling, and her ankles were secured it as Josh took the weight of the awkward position of her knees with his body until she was secure and her hips lifted from the padded surface below her.\n\n \"Just beautiful,\" he murmured tapping her cunt with his open hand enjoying how she jerked and whimpered at his touch, though he hadn't tapped with force, he knew it was hard enough for her to feel the light pain he intended to inflict. Josh began to move quickly then knowing the position was going to cause her more than a little discomfort and eventually some pain. He moved up her side pulling first one arm back and attaching it to the same bar as her feet, then the other pulling her shoulders back and her chest from the stool making her raise her head.\n\n Peri saw him come into view before her now. His cock tantalizingly out of her reach just above her head. His hands seem to smooth her hair pulling it back into a ponytail and forcing her to look up at him. Her eyes left the object of her desire and travelled up his body to his face and the dark, hungry eyes he watched her with. He braided her hair and tied it tightly pulling her head back further as he secured it to the rope holding her shoulders up.\n\n Once again the whirl of the pulley sounded interrupting the heavy bass beat of the music, and she found herself lifted until only the barest amount of her belly remained supported by the stools below her. When Josh appeared again before her, she stared straight at his hard cock. She licked her lips parting them in her willingness to devour him.\n\n \"I love how flexible you are,\" he murmured hotly, his hands running over her back and around her ribs to her breasts. He teased her lips with just the tip of his cock as he fondled her nipples. Then he squatted down before her and kissed her swallowing her cries as his fingers pinched and twisted the swollen buds. He broke the kiss as he attached the clamps he held to her nipples being careful of their position. He licked a tear from her face and kissed her deeply, his hand gently cradling each side of her head as she hung, her body bowed by the hog tie.\n\n \"I may share you with D., with the children, with the whole fucking family but you have always been mine. My love, my wife, mine,\" he said with passion and kissed her again. \"You became mine at that chalet, and it was the last place that you were totally mine. Mine alone before the Battaglia, before the family involvement, before Dante.\" He tried to make her understand his mood when he had arrived on Friday afternoon. \"It was where I stayed when you left me,\" he admitted. \"If you had chosen anywhere but there I wouldn't have reacted as badly. Now we've wasted a whole day, and you my love are paying the price.\" Josh practically growled the last sentence and his dark eyes smoldered as he gazed at her stunned expression. \"I'm going to make you remember just how it feels to be fucked senseless,\" he lips quirked into a smile, and he stood.\n\n Peri's mind reeled at his admission. She had no idea. She had been so wrapped up in her misery and recovery that she had given little thought to his during that time in their lives. His words only served to heighten her arousal, though, and she watched as he stood and moved his cock just within reach of her lips. She couldn't move, not even rock towards him, and she strained to take more of him into her mouth. He stepped agonizingly slowly forward feeding her his cock little by little until unable to control his need any longer he began to saw in and out of her mouth\n\n He felt his climax rising too fast and he pulled away with a loud groan breathing heavily. Picking up a light flogger he colored her back and ass once more as he regained some control but mindful of the clamps and restraints he made his way down to where her ass and cunt were on open display to him. He landed the flogger several times between her legs watching her body jerk and twist in the tight restraints. With her hips upturned and inviting his cruel use he landed it once more with some force and savored the cry, she let out.\n\n He rearranged the footstools giving him more space to between her thighs and pulled the vibrating egg from her. Wrapping the hand holding the egg in around her thigh he pressed it against her clit as he rammed his cock into her hard feeling the hot wetness of her insides melt around him. \"Fuck he groaned loudly drowning out her cry of pleasure.\n\n Peri almost came on that first thrust, her body shaking hard within her bondage. A moment later the clamps were ripped away, and she screamed as he pounded his cock into her again. Her nipples and clit sang in a discordant chorus of exquisite pain as he fucked her hard buffeting the big heavy glass plug in her ass. She lost track of time her whole body seemingly one large mess of painful ecstasy. She couldn't move one limb without putting pressure on another, and he continued to fuck her like a machine as he began to float on the endorphins that coursed through her body on wave after wave of her ongoing orgasm. She barely felt the plug leave her ass and Josh transfer his cock to her tightest of holes. He wasn't cautious, ramming more and more of his big beautiful cock into her ass with each thrust.",
        "A guttural growl came from Josh as he buried himself completely in her ass relishing the tightness of her as her body shook and jerked around him. He reached forward finding he barely had to bend in this position to grab at her breasts while he fucked her ass. Her body shook uncontrollably between spasms, and he could tell she was floating away from him as the tension went out of her straining limbs. He fucked her even harder, then pulled her cheeks apart to watch the point of impact as he felt his come surge up and explode deep within her. His heart thumped in his chest, sending blood throbbing painfully in his ears, as he staggered back and collapsed into a chair, his eyes never leaving the sight of the woman he loved hanging in bondage and at his mercy.\n\n\n\n*****\n\n\n\nPeri woke alone. She stretched grimacing at the tendrils of pain that ran through her whole body. She was sore all over and feeling an urgent need to pee she got up gingerly and padded to the bathroom. Her mind relived the night before as her body protested her movements and she smiled. It was worth it, and she would be fine once she walked around a little.\n\n There was an envelope taped to the mirror in the bathroom, and she looked at it curiously as she washed and dried her hands. She pulled on a robe as she walked back into the bedroom and opened the blackout blinds letting the sunlight stream into the room.\n\n Sitting on the bed she opened the envelope and took out a letter. She smiled as she saw it was from Josh and read:\n\n \"My beautiful, amazing, desirable, wife,\n\nStay in bed, that's not a request. Stay in bed until at least lunchtime you need rest after last night. It took a lot out of you, not only physically but emotionally too.\"\n\n Peri stopped reading and checked her watch. It was after ten already. She wondered what time he had finally put her to bed. She remembered nothing of being unbound or going to bed and she smiled realising he had cleaned her and brushed her hair out. She continued reading:\n\n \"I took everything that you said yesterday to heart and you were right about it being unfair to the kids to keep them cooped up all summer in this apartment. My pirate crew and I have found a ship, willing to take us on a daring rescue mission to save the Papas and Zio D. from the dreaded Overlords who hold them prisoner on their magical two hulled ship. Do not fear for me my love as I sail into battle. I shall return a conquering hero for you to swoon over.\" Peri laughed out loud and wondered how he had organised a boat and everything else he needed to take the kids sailing for the day.\n\n \"You have the house to yourself for the day, Mama and Papa have come for the adventure with us. Timo and our three angels are at home with the nannies for you to play with when you finally rise. I'd like you to talk to Heather about being head Nanny. Bridgette has not taken the news well about returning to the farm and has been confined to her room. She would like to see you, but I have asked that she wait until this evening. You will find a security man posted at her door. I'm afraid this is necessary, and I need you to respect my wishes on this matter.\"\n\n Oh dear, Peri thought sadly. She understood why it was necessary, but she wished it didn't have to be like this. She wished even more that Josh hadn't asked her to wait to speak to Bridgette, but after their talks last night she would do as he asked. She sighed and picked the letter up again.\n\n \"I've put Zara in charge of the kitchen today and given her a menu for dinner tonight. Carmen's cook, Gail will be in charge of the downstairs kitchen, but Zara will oversee her. I'd like you to sit down with both of them and work out menus for the week tomorrow morning. Rae will step up and supervise the maids for now. That should get us by until we find a housekeeper that we like and trust.\"\n\n \"How did he have time to do all this and then sit down and write me a letter of instructions,\" she laughed softly to the empty room. \"Sure stay in bed until lunchtime but then here's a list of jobs to do while you're relaxing and having the house to yourself for the first time this year.\" She shook her head.\n\n \"I know what you're thinking, and all I have actually asked you to do is stay in bed until lunchtime and then when you do go down to see the angels talk to Heather, it needs to come from you. The rest has already been done or can wait until tonight or tomorrow. I know you have a finger twirling in your hair, and your mind is working on the staffing issues but stop worrying. Rest and relax this afternoon you deserve it. \n\nWe'll all be home late this afternoon before dinner. I look forward to the aforementioned swooning. It wouldn't hurt if you helped it along with a tight corset but given how you must be feeling this morning I won't insist.\n\nI love you. Last night was everything I needed to clear my head and relax. Thank you for loving me the way you do. You are the light and love of my life, and I adore you even when you are driving me crazy. \n\nYour husband, aka: King of the Kids.\"\n\n\n\nShe clutched the letter to her chest and smiled. This was the Josh she knew and loved. Control freak extraordinaire. Of course, he sorted out the staffing and left her the nice or fun jobs to do. Of course, he's decided on her timetable for today even though he's not here. Of course, he's protecting her from having to face Bridgette alone and not being able to send her away. Of course, he crowned himself King of the Kids after their conversation yesterday. She couldn't love him any more if she tried. Still smiling she got up to have a shower and dressed. \n\n \"Hello Zara,\" Peri smiled walking into the kitchen. \"Could I have a glass of juice and a small bowl of muesli and yogurt?\"\n\n \"I have some nice fresh blueberries if you wold like a few of those with it,\" the woman seemed to snap out of her startled expression as Peri entered and addressed her by name.\n\n \"That would be fabulous,\" Peri enthused, she was starving after missing breakfast this morning. \"Do you think one of the girls could find Rae for me?\"\n\n \"Yes Mrs. Donati,\" Zara said with a smile and nudged one of the girls who was prepping vegetables. \n\n Peri almost asked her to use her real name but decided Mrs. Donati had a nice ring to it and was much better than the usual Ma'am she received. She took a sip of her juice and saw Rae hurrying toward her with the kitchen assistant close behind.\n\n \"Rae, I'm sorry to interrupt your morning's work, but I have a few questions if you don't mind,\" Peri smiled and turned to Zara as a bowl was placed on the counter top she sat at. \"Thank you,\" she smiled. \"Would you mind if I ate while we talked. I'm starving because I slept so late. Zara would you mind joining us, please?\"\n\n \"Not at all Mrs. Donati,\" Rae and Zara said almost simultaneously and walked with her to the dining room, taking a seat at the table only after Peri insisted.\n\n \"Wonderful,\" Peri took a small mouthful of the muesli and chewed happily. \"Here is what I know. You both came to work with us last year after the tragic loss of Lio, Emilio Donati. What I would like to know is whether you were his housekeeper and cook or did you have other roles and why you chose to come to us or if it was forced on you because of proximity?\" Peri took a big mouthful of her muesli and looked at the two women. She noted that Zara deferred to Rae with a look and folded her hands in her lap.\n\n \"The truth is we worked for both Mr. Emilio and Mr. Dante Donati. They lived in the same house until moving here to the apartments. I have been with them slightly longer than Zara. I have been their housekeeper and was once the cook as well until they grew discerning taste buds and realised my culinary skills were somewhat lacking,\" she gave a wry smile as if remembering an event. \"In their younger days, I also stepped in as a medic when necessary. I was with them for almost twenty years. Now I serve Mr. Dante's new family by choice. There was no coercion involved.\"\n\n Peri could hear the affection in her voice as she spoke of Dante and serving his new family. This was not what she had expected at all. She said nothing, turning her eyes on Zara who had smiled hearing Rae's recount of her history with the family.\n\n \"I came to work for the Donati brothers when they still lived together as well. It was Emilio who accepted my contract. He enjoyed having dinner at home. He liked to cook and would often be in the kitchen with me, learning new techniques,\" she said before being interrupted by Peri.\n\n \"You didn't mind that? I love to cook. I'm not that good, but I would like to learn,\" she said enthusiastically. \"Antonia is sending me her mother's Christmas and Easter baking recipes do you think you could help me with those?\"\n\n \"I would like that Mrs. Donati,\" Zara replied once again startled by the young woman who sat eating one of the simplest, healthiest breakfasts she'd ever served in this house.\n\n \"I'm sorry I interrupted you, please go on,\" Peri encouraged.\n\n \"There is not much else to say, when we moved to these apartments, I remained downstairs with Mr. Emilio and his partner, but I made sure the refrigerator up here was always stocked with good food and refreshments,\" she added.\n\n Peri couldn't believe the wealth of information these two women would have about Dante during his younger adult years, but she restrained herself from pumping them for information.\n\n \"Rae and I both chose to come here. No one forced us. In fact, we were worried that after Mr. Emilio's passing that we would be sent away so we asked to become part of your household even though it meant we couldn't keep our positions. Mr. Dante said he couldn't interfere with the way you chose to run your house, and we understood.\" Zara explained.\n\n \"You must care for him a lot,\" Peri said wondering if Josh had known these women and their positions in Lio ad Dante's lives or if they had just shone above the others in their daily roles and that is why he had given them extra responsibilities. \"My husband spoke to you this morning about added responsibilities?\" she asked.\n\n \"No, Mrs. Donati, it was Mrs. Donati Senior who sought me out and said she had been impressed by my attention to detail and protocol. She explained that Bridgette would be leaving, and you would require a responsible maid to ensure that everything remained on schedule,\" Rae explained, and Peri nodded realising for the first time that Antonia would have handled this for Josh.\n\n \"It was the same for me, but she said she liked my pleasant personality and willingness to do whatever needed doing,\" Zara added.\n\n Peri was impressed. They were here because they felt genuine affection for Dante and never once sought to rise above the position they had been given but by doing their jobs well, they had risen to the top and been singled out by the Queen of the Donati's herself which said a lot for both of them.\n\n \"How have you found the travel between the two houses? I'm afraid that's going to go on for some time while we work out the schedules in our busy lives,\" Peri asked.\n\n \"I love the country house. Its kitchen is beautiful, and there is space outside the door there for a small farmer's garden. Nothing tastes better than fresh produce,\" she smiled widely.\n\n \"I like it there too, all the fresh air rather than air-conditioning all of the time,\" Rae agreed, but these apartments are just as big and beautiful. I think it is just the outdoor aspect that changes the work we do. I could beat a rug there rather than having to send it out to be cleaned. That's a very satisfying chore,\" she gave a small laugh.\n\n In less than half an hour Peri had fallen in love with these two women and couldn't think of anyone better to run her household and take into her confidence. She spooned the last of her breakfast into her mouth and sat back looking at the two women who seemed to have relaxed somewhat during the conversation.\n\n \"I feel the need to know the people who work closely with me and for them to understand me,\" Peri began. \"I know that is not typical of the Donati's, but I was not brought up in a family like this, and I tend to do things my own way. I suffered some trauma last year, and when Bridgette came to work for me, I needed her to take on a bigger role than she probably should have for someone with very little experience with this particular family. I am fully recovered now though and have needed to take control of my family, household and career for some time and found it difficult to find that balance.\"\n\n The two women nodded knowingly, accepting her words at face value and understanding the reason for Bridgette's ugly scene this morning with Antonia. It was as if the woman believed the apartments belonged to her. During the argument, she had acted as if she was the family matriarch rather than Antonia, who had been formidable in cutting the woman down to size without even raising her voice.\n\n \"This is difficult, so I am just going to lay it all out there for you to digest and ask any questions you may feel necessary,\" Peri said in a stronger voice than how she felt inside. \"I love them both, Joshua and Dante Donati. I'm truly, madly, deeply in love them. I am married to Josh, but that doesn't diminish Dante's place or authority in this house. We are three, a team, a trio and the next leaders of this family though that is not widely known as yet I don't think,\" she paused and frowned. \"Each of us are the parents of those children downstairs.\"\n\n \"We know,\" Zara said softly. \"We see how happy you all are together and how much laughter fills your home. We know,\" she smiled kindly. \"If you are asking for my loyalty to you and the ones you love rest assured you have it as well as my affection for the happiness you have given Mr. Dante who rarely smiled until you.\" Rae echoed Zara's word making Peri blush.\n\n \"Well, then, you will be happy to know that I have asked for us to return to the country house this week before the children return to school so they can have some adventures. I am thinking picnics and maybe a water day with a big slide and general controlled chaos. Josh has asked me to sit with you and the cook from Carmen's household; I keep forgetting her name, and I feel awful about that...\"\n\n \"Gail,\" Zara supplied.\n\n \"Yes Gail, thank you. If you and Gail could put together some ideas for next week with that in mind today, that would be great. Not too much sugar but not boring salads and veggies either, more like sausage sizzles and kid-friendly meals for the kids and maybe one or two evening barbecues that the men can do with their children, we can pool our idea's in the morning and put together a shopping list,\" Peri said. \"Maybe Pizza, we could get on one of those big pizza ovens maybe?\"\n\n \"That sounds fun would you mind if I sit in on the meeting I am good at organising, and the household staff may be needed to assist. You will also need to get the steward on board. I'm not sure what's happening with the landscaping,\" Rae said carefully not wanting to intrude.\n\n \"Are you kidding? You have to help now!\" Peri laughed. \"I hadn't considered that at all. This is why I need good kind people I can trust to help me do things, not just do them for me. I need to learn, and I can't do that without people to show me how with a family this big.\"\n\n \"What time would you like to meet so I can let Gail know,\" Zara asked. \n\n \"I should know tonight about when we will return home, so why don't we meet first thing after everyone has left for work, say nine thirty in the office,\" She smiled. \"Thank you, ladies, you have made my whole day brighter already.\" They smiled and stood to go back to their respective work. \n\n \"Rae, can I ask for one more moment of your time before you go back to work. Is there a guest bedroom anywhere with a big window that isn't being used? Any room that has a big window and isn't being used would do,\" she asked.\n\n \"Several, Mrs. Donati. May I ask what you would like it for?\" she enquired.\n\n \"I'd like a little haven of my own that I don't have to share with anyone else. Somewhere I can get away from the chaos without actually leaving the apartment and worrying Josh and Dante.\" She admitted. I'd like to make it like a comfortable sitting room with bookshelves and maybe a small desk.\"\n\n \"I could show you a couple of spaces, but as we are going back to the country house this week maybe you should do it when you have more time here at the apartment,\" Rae seemed reticent about the idea and seemed relieved when Peri's phone started to sing its melody disturbing them.\n\n \"I'll talk to you about it tomorrow,\" Peri let Rae go as she was distracted by the familiar melody of the facetime app sounding from her phone. \n\n \"Hey you,\" Peri smiled seeing Josh's handsome face distorted by an eyepatch.\n\n \"This was meant to be your wakeup call, what are you doing out of bed?\" he grumbled. \"Can't you do anything I ask?\"\n\n \"I'm not planning to go near Bridgette, and I just interviewed our new housekeeper and cook who are fabulous by the way, I want to keep them both forever and ever, and I even ate breakfast,\" she said proudly.\n\n \"Well, that something I suppose,\" he said, sounding pouty.\n\n \"Well that's a sad face, is something else wrong?\" she asked finding it hard to take his pout seriously while he was wearing a pirate costume. \n\n \"Dante's teasing me about having to bring my Mama along to keep me safe,\" he grumbled. \n\n \"Did he forget that she's his Mama too, and he's the one she is checking on after getting himself shot in the leg?\" Peri asked and heard Josh's genuine laughter ring out through the phone. \n\n \"Hear that ya scurvy dog?\" Josh turned the phone slightly toward Dante who was sitting beside him on the couch rolling his eyes.\n\n \"Dante, how could you not tell me how fabulous Zara and Rae are?\" Peri asked peevishly. \n\n \"It's bad enough I have to share you with him, don't make me share them with him too,\" Dante groaned. \n\n \"They're mine now and I'm keeping them, thank you,\" she said happily and blew him a kiss through the phone. \n\n \"For you anything. For Captain Josh Sparrowfart here, nothing,\" he said scowling at Josh.\n\n \"What is wrong with you two?\" Peri laughed. \n\n \"He's grumpy because I didn't bring you along and he misses you. My relaxed exuberant demeanour and your wake-up call this late are probably not helping that at all,\" Josh chuckled.\n\n \"I love you, and there will be much swooning for both of my heroes of the high seas when you return,\" She smiled. \"Speaking of which I thought I might call Andie or Louisa and take Phillipe and Gerrard corset shopping for an hour or two is that okay?\"\n\n \"Are you sure Phillipe would look any good in a corset?\" Dante asked. \"I mean Gerrard, yes, but he has the legs for it but not Phillipe,\" he shuddered making her laugh.\n\n \"Keep your phone on you at all times and only go to known reputable places,\" Josh ordered as his way of agreeing. \n\n \"And take photos in the fitting rooms, lots and lots of photos,\" Dante grinned into the phone screen.\n\n Peri laughed as they told her they loved her and the call ended. Putting her phone away she walked into the office to find a card from a lingerie boutique she had liked, but couldn't remember which shopping precinct it had been in. She was sure she had put the card in the antique writing box with her journals, but she rummaged through the box and couldn't find it. She'd crammed too many things into this one box. She needed a space of her own where she could get organised. She wondered why Rae was suddenly reticent to show her a suitable space when she had asked. Her mind wandered back over the conversation.\n\n She gave up on finding the card and called her mother who knew the shop just by its description. It was closed on Sundays, but the owner would open for them just by dropping their name, her mother assured her. Peri went to spend a little time with the babies promising to make up her lack of attention to them during the week and left the house with her security team.",
        "Andie and Peri walked into the exclusive city arcade and the lingerie shop while Gerrard and Phillipe stood uncomfortably outside. They had the run of the shop and hearing what has happening aboard the boat that Charles was on with his nephews, Andie decided to try on outfits with Peri. As always Andie had an eye for putting outfits together and got creative with some billowing short nightgowns and highly decorated corsets, scarves for bandanas and fishnet stockings. Peri had to admit these were some sexy pirate outfits.\n\n They took photos with each other's phones and took one together. Andie dragged her out to stand with the stoic dark-suited security men who steadfastly refused to pose with her. They sent pictures to their respective lovers aboard the ship.\n\n \"What happened to the busty wench that was going to swoon excessively upon our return?\" Josh replied to one picture. \n\n \"Are you still pouting?\" She asked.\n\n \"Yes Dante got a better picture than me,\" came the text making her laugh.\n\n \"Holy fuck! That's my new screen background.\" was the reply she got from Dante.\n\n \"Don't you dare!\" she replied\n\n \"Oh, I dare. Believe me, I dare!\" Dante sent punctuated by several emoticons.\n\n \"They left the shop in disarray sometime later after finding a suitable swooning outfit for Peri who insisted on buying the corset Andie had fallen in love with and several new bras. Josh had said she could shop, so shop she did. She felt guilty about the exorbitant amount of money she spent in one boutique, but he had insisted she get used to the fact she could get whatever she wanted and not worry about it, so she tried not to think about how much she had just put on her credit card.\n\n They walked out of the small arcade still laughing about the men's reactions to their impromptu photo shoot and not paying attention when Peri walked into the path of another woman and stumbled almost falling except for the fact that Gerrard had reached out and grabbed her with his long arms hauling her back towards him. The other woman did fall and got up apologising immediately.\n\n \"Sorry, I don't know where my head was just then, I didn't even see you,\" she said without looking up as she dusted off her knees and began picking up the bags she had dropped.\n\n \"Sabrina?\" Peri asked shaking off Gerrard's hands and standing straighter.\n\n \"Do I know you?\" Sabrina got to her feet and finally looked at who she had crashed into. \"My God, Peri! You look amazing! I would never have recognised you. At least you know I didn't do it on purpose this time,\" she gave a sad smile.\n\n \"I never thanked you for testifying against Nik,\" Peri said her voice barely above a whisper. She was stunned to come face to face with someone who had treated her so badly so long ago.\n\n \"It was the least I could do. I was such a bitch to you. I was a bitch to everyone back then but mostly to you. I really am sorry, Peri,\" Sabrina said. \"I know you probably don't want to see me, let alone talk to me, but I would very much like to buy you a coffee if you have time, and your mother, and umm the men in black?\" She surveyed Phillipe and Gerard as she spoke.\n\n \"Ignore them,\" Peri sighed. \"I think it turns them on when beautiful women ignore them.\" She gave a crooked smile.\n\n The corners of Phillipe's mouth quirked up into a smile for a second before he regained his composure. Which made Peri laugh. She knew she owed Sabrina nothing but what happened, in the end, had nothing to do with Sabrina and yet she still came to help put Nik away at the trial. Her mother had told her why she had been there and why her testimony at trial was necessary. She had gone to see Nik in prison to bait her into confessing, and Nik had been cruel and dismissed the friendship between them as a waste of her time and energy. Nik had not held back in the way she had taunted the woman about how easily she had used Sabrina's gullibility, that she would never be good enough for Josh.\n\n \"How's your business Andie, I wish I could afford your services, but good jobs are hard to find when your living down a reputation like mine,\" Sabrina turned to Andie after Peri didn't accept or refuse her invitation.\n\n \"It's wonderful. I'm so busy I'm thinking of taking on a partner,\" she smiled. \"Who would have thought I could make a living just by shopping. I think I'm in heaven.\"\n\n \"That's great, so coffee?\" Sabrina invited again.\n\n \"As long as you can bear the men in black scrutinising our every move,\" Peri accepted unsure why she had agreed as soon as she said it.\n\n \"I can ignore them as easily as any other guy who looks my way,\" she laughed and looked up at the tall men. \"Don't get too excited now, gentlemen.\" Gerard smiled at the joke and Peri gasped.\n\n \"My God he does have teeth I've been wondering about that for weeks now,\" she said incredulously. Phillipe cleared his throat in an effort not to laugh, and Peri fixed her eyes on him. \"Is there anywhere close by that you approve of or will we just take pot luck?\"\n\n \"Follow me, Mrs. Donati, Ladies,\" Phillipe nodded and walked toward the end of the mall and led them into an Italian bakery that had tables and chairs. The smell was divine and it made Peri aware that she had skipped lunch totally.\n\n \"Do you mind if I grab something to eat as well, I skipped lunch, and I'm suddenly starving,\" Peri said. \n\n \"Sounds good to me,\" Andie agreed easily.\n\n \"Please guys have some lunch, you can sit between me and the door, there is only one way in or out of this place. We'll be just as fine if you are sitting as when you're standing.\"\n\n \"Thank you, Mrs. Donati,\" Gerard said seriously. \"We'll blend in better if we sit.\"\n\n \"Yeah like that's ever gonna happen,\" she murmured under her breath feeling the restrictions of her life as Mrs. Donati chafe.\n\n \"You married Josh after everything that happened. Congratulations!\" Sabrina said sincerely. \"I'm really happy that it all worked out, I felt so bad when I heard you'd stopped seeing him during the trial.\" She looked into Peri's eyes and took on a serious expression. \"I was vain and arrogant and dumb. I never want to be that person again. I don't want friends like that, and I certainly don't want a life like that anymore. I saw the worst of it in that courtroom, and it scared me. I don't want to be that person, not ever again.\"\n\n Peri was taken aback by Sabrina's honesty and sincerity. It was hard to believe this was the same woman who had dismissed her as a frumpy, shy woman who would never amount to anything let alone gain Joshua Donati's attention. A waitress came to take their order, and they talked about the changes in their lives over the last year over a late lunch. Sabrina was astounded to hear that she'd had triplets.\n\n \"Look, here's my card,\" Sabrina said at the end of the lunch. \"I'd like for us to be friends. Real friends are hard to come by, and I think the world of how you have handled everything that was thrown your way last year. I'm not sure I would have been as gracious as you have been today if the roles were reversed.\"\n\n \"Thanks,\" Peri took the card not offering her number or anything. She still wasn't sure how she felt about the woman and wanted to think about it a bit more. \"I'll call you soon and then you'll have my number.\"\n\n \"No pressure,\" Sabrina said. \"I better get going. Thanks for not brushing me off. I appreciate that more than you know.\" She turned and walked out before Peri could reply.\n\n \"That was unexpected,\" Andie said.\n\n \"Joshua is heading into the marina now,\" Phillipe informed them. \"Perhaps if you plan to be ready to swoon we should leave now,\" he suggested.\n\n \"Thanks for coming in Mum, I'm sure you had better things to do on a Sunday afternoon,\" Peri said as they reached her car and waiting security man.\n\n \"Nothing is so important that I wouldn't come when you need me,\" Andie hugged her tightly. \"Like Sabrina, I don't ever want to be the woman who let you down and hurt you ever again.\" She kissed her cheek and got into the car. \"I love you, baby.\"\n\n Peri brooded over both Sabrina and Andie's words about the changes they had made in their lives. She had seen the dramatic changes in her mother over the last year. Could Sabrina have changed that much as well?\n\n *****"
    ],
    "authorname": "xelliebabex",
    "tags": [
        "sbumissive",
        "d/s relaionship",
        "safeword",
        "brothers"
    ],
    "category": "BDSM",
    "url": "https://www.literotica.com/s/the-twelve-tables-ch-28"
}