{
    "title": "New Moon Pt. 07",
    "pages": [
        "It was in the evening, almost a week after her infection, when Mother finally came out of her room. I had been out and about all afternoon, buying groceries and other needful things, and got home probably about 7 or so. Right about sunset. A sunburst of pale pink stretched across the sky, and pale stars were already peeking out of a canvas of deep purple. The house was entirely too quiet when I stepped inside. The silence was deafening. The crunching of the grocery sacks seemed to echo throughout the house. \n\nI figured my brother was out somewhere. I feared at Mrs. Bickers. Mom must have been still been upstairs. I took it almost as a matter of course, she had been up there for so long. I began to empty the sacks, a weariness sinking into me. How much longer would this last? This abysmal nightmare of strange behavior was weighing upon me heavier and heavier everyday - especially since I had no one to turn to. Except that crazy professor. I hunched over and began to restock the refrigerator. As I was sliding in the milk and such, I suddenly heard a clear, sparkling voice behind me. It startled me in the quiet and I nearly jumped out of my skin. \n\n\"Hey, there pumpkin! How wonderful of you!\" \n\nIt was Mom. I slowly turned around, having no idea of what to expect. \n\nA lump jumped to my throat. My mother stood before me in the kitchen, dressed only in black Bra and Panties, melding tight and smooth against her pale flesh. Her new body seemed to glow, her stomach muscles stood out, hard and strong as steel. Her black hair tumbled and rippled down her soft pale shoulders like a waterfall. Her eyes shown out brighter than usual, their color deepened and twinkling with fire and intensity. Her new breasts still defied gravity, gigantic, lush, just aching to be squeezed. Freckles highlighted their quivering magnificence - a soft plenty of succulent flesh, sexy but still maternal and blasting my senses with symbolic fertility, screaming to be nursed by children - or a lover. My penis jutted against my pants, making me wince in pain. \n\n\"I'm glad you've decided to take up your responsibilities and become the man of the house.\" She winked. \"Here let me help you.\" She picked up some other items from their bags, and began to place them into the fridge. She slid up next to me, and I felt her soft skin gently tease my own. She moved the side of her hips back and forth against me as she put the groceries inside, rubbing herself against me like a cat waiting to be petted. Her scent, not perfume but the warm, hypnotic maternal scent of her skin multiplied by a thousand, began to beat against my nostrils in a wave. I had never smelled anything like it before. Probably not since I suckled at her breasts in childhood. She was looking at me out of the corner of her eyes, smiling. She knew the effect she was having on me, and was enjoying it. She was playing with me, like a cat plays with a mouse. My hard-on pressed against my pants, screaming in agony for release into the air. She was still smiling at me. \n\nShe placed the last items into the fridge, then turned around and faced me. She leaned in, pressing her warm body against me. Those incredible, indescribable breast pressed into my chest, the only thing separating me from her luscious nipples was a thin piece of black fabric. Her breath was slow and languorous. It smelled sweet as she leaned in closer to me. \n\n\"Thank you so much for taking care of me. I don't know what I would do without you, love. The last few days have been so very strange and painful, but everything is alright now. I\"m just so incredibly thankful that you are here....with me.\" \n\nShe smiled again and gently took my hands into her own. Her long fingers danced through mine as she played with them. \"I love you so very much. You are everything I care for in the world - my first baby. My first born son. You and I have a very special bond.\" A hand came up and began to caress my cheek, light as a cool breeze. \"We have a very special love. You are the first fruit of your daddy and mine's love. You are the first human being that I created in my womb... brought into the world... and nursed at my breast. You are part of me.\" Her eyes seemed to glow in their intensity. She began to inch her face closer and closer to mine. Her eyes filled my senses and became my world, my universe. I could feel her breath tickled the hairs on my face. The soft petals of her lips brushed against my ear with tenderness. \"Flesh of my flesh.\" I felt her nipples harden underneath her bra and ripple against my chest. \"I want us to become one again.\" Her breath burned, pouring into my ear as her lips caressed it with hunger. I felt her move against me as she began to unsnap her bra. \n\nI looked down towards her breasts. I stared in wonder as she yanked off her bra and tossed it across the kitchen. The beautiful motherly flesh consumed my vision, possessing my brain. Her breasts filled my brain with damnable thoughts and the sweet scent of her skin stabbed my nostrils. Her body wrapped my nose in its scent - musky, sweet, indescribable. \n\nMy mouth flooded with saliva as I stared at her long nipples, already swollen with heat. Suddenly, she tossed her head back, laughing, her hair playing about her face. \n\nIt was the face of Mother. All but her eyes. There was a hard light burning from behind her pupils, hard as flint. Her eyebrows, their dark hair all merged together into one long ridge, arched seductively. It was the most horrible thing - as if some demon wore my mother's face as a mask, and I could feel it's presence beneath the skin. Her pouting lips smiled with a mixture of motherly love and lust, a god awful mixture. She smiled and her tongue rolled over her teeth. \n\n\"Do you want to feel them?\" She thrust them towards me and pressed herself into my chest. So warm and soft. Her nipples tickled mine through the fabric of my shirt. I felt her hands take mine and bring them up to her bosom. \n\n\"Please, Mom, Please don't....\" I whispered. \n\n\"Shhhhh...don't be shy. Feel them.\" She squeezed my hands around the perfect globes. Her fingers massaged my fingers into her flesh. They were soft and lush. She took my thumbs and began to trace circles around her areola. I watched in wonder as pressure seemed to build behind her pink nubs, stretching them to the breaking point. A moan welled up in the bottom of her throat. Her cold eyes stared at me as she continued to move my thumbs around and around. Her breath tickled my face. The heat burned the hairs on my face. She smiled and leaned forward to press her lips to mine. She ground them against me, her tongue stabbing into my mouth. Her breath exploded with volcanic heat into me, consuming every rational thought like tinder. I began to kiss her back, my own hunger attacking her mouth with a savage need. \n\nHer hands dropped my own, and she wrapped her arms tight around me, holding me in a grip of steel. Demonic strength seethed through her small, soft body. Her nails, longer than I remember, raked at the shirt I was wearing, digging into my skin. I didn't notice the cloth ripping under her attack, not till much later. I felt the sharp sting of her nails as she pressed them into me, tugging at my body. She held me trapped together in our unholy embrace. As her tongue and lips explored every inch of my mouth and face, her hands began to work their way down to pants. I heard my pants zipper as she yanked it at it. What was happening to us. What was I doing! I began to pull my face away from her, my rational thought desperately beat against my head, fighting against the evil stirring in my loins. \n\nShe realized I beginning to fight her again. A deep growl of anger and frustration bellowed into my ear as her tongue bathed it in her saliva. \"Don't stop! Momma didn't tell you to stop!\" She shoved me with the strength of a full grown man across the room. I bashed against the wall and crumpled to the floor in utter surprise and fear. She leaped on me, and thrust her full weight into pinning me to the floor. She was a cat above her bird, ready to toy with it - then devour it. \n\nHer new perfect breasts shook above me in their freedom, so large and soft and perfect, jiggling like jell-O as she moved into a sitting position. Her brown nipples pointed out into the air, elongated and gorged with blood. Her tongue ran across her lips and those hard eyes bored into my brain. \n\n\"I've been fantasizing about this, sweetheart. Ever since you starting becoming a man, I wanted to show you how to please a woman.\" Her breathe dripped huskily from her mouth. She began to run her fingers around her areolas. \"I think you need to be nursed. Are you hungry? Want to nurse from me like when you were a baby?\" She began to lean down closer and closer to my face. Her breasts drooped over me, hovering, tantalizing me, the nipples pointing like darts at my face. She was pressing them closer and the heady scent poured from them like milk, drenching my senses in a flood. Then the two massive pillows of flesh mashed themselves into my face, smothering my senses. \n\nHer breath was hot and wet in my ear. \"Take my nipple, love. Suckle me.\" The warm hard flesh forced its way into my mouth. Her scent was overpowering. I began to suck, but no milk came forth - my soul was not lost by drinking her poisoned essence. I sucked harder and harder, and rolled my tongue around her areola. \n\n\"That's good my love....yessss...take my other one...\" She fed me her other breast, and I began to lick and suck savagely at it. I grasped the other breast and brought it over to my mouth. I began to make love to her two breasts as I held them before me - trying to swallow them in my hunger. I licked, sucked, and nibbled at every part of them. Those two white globes were my world now, every jiggling inch my sole source of reason. \n\n\"Sweet baby....my baby...mommy loves you so much..\" She ran her long fingers through my hair, her nails gently raking my scalp as her breath tickled into my senses. \n\n\"I wish I had milk for you....Do you want me to make milk for you? Do you want mommy to nurse you....to pour my love into you?\" \n\n\"Yes!\" I almost shouted, though my mouth was still wrapped around her freckled breast. I was panting, for there was little room to breath. \n\nTo my startled frustration, she suddenly jump off me, jerking her breasts from my face. Her beautiful face looked down at me with that perverse mix of lust and motherly love that tore at me so brutally. Her hard blue eyes glinted. \n\n\"For me to make milk, you must first do your part. What a man is supposed to do to a woman... to his woman.\" She ran her tongue across her teeth, and her hands began to tug at her panties. They dropped and my heart leaped into my throat. Her black hair lay in a lush triangle before my face now. Her smile widened, and she winked knowingly. Then like a cat, she slunk down onto the floor next to me, almost purring. Her buttocks thrust high into the air. \n\n\"Mount me, my baby. My son. And plant your seed. Then I can give you milk...milk for you....and our own...\" Her long fingers began to stroke my aching manhood though my pants. \"Looks like you're more than ready.\" Her blue eyes burned like ice, and seemed to consume me. I was aware of nothing else but her breath on my face. \n\n\"Give...me...the...seed....\" \n\nHer fingers grabbed at my zipper and tugged it down. More fingers dove into the opening and I felt her warm, soft skin, soft as silk, wrap around my hardness. The feeling was indescribable - like an electric shock surging through my body, throwing me into a seizure of ecstasy. I couldn't hold back any longer. I had not \"relieved\" myself for days now. Even after my encounter with the Grandmother, I had never finished and my time since had been consumed with my worry for Mom. And now my mother, my own mother, held my penis in her hands, gently squeezing it, preparing me for what only beasts do. Breed with their own family. It snapped something deep and primordial within me. All my pent up frustration, my desires, the wicked churning in my loins, broke down my dike of self control and erupted high into the air! I was a volcano, violently spewing white molten magma into the warm grip of her hand. Never had I let loose with so much. It spurted and spurted - it dripped and oozed around her clenched fist. A groan strangled in the back of my throat, but I still managed to whisper, \"Oh, mom. Momma, momma! Can't believe...my own....momma....\" My very life seemed to be draining into her hand. \n\nThen it was over. My heart bashed against my chest, thumping in a rapid machine gun fire. Gradually, my breath came slower, and my heart began to slow down. I could now feel the sweat running all over my body - my forehead was like a delta - with rivers of salt sweat dripping over my skin. Her hand still tightly held my manhood, held it as it shrunk. Then slowly, she let it go. It flopped down against my stomach, free of that wonderful sheath of fingers. I cracked open my eyes and looked at her. I had closed them tight as the waves of orgasm had thrown me about, and now I looked at her. Her eyes were still hard, but her face did not look as lusciously brimming with lust as it had been. She looked very irritated. \n\n\"Baby,\" her voice came laced with steel, \"you came too early. All this wonderful seed was for planting, for breeding. And now it's all wasted. So much beautiful, youthful seed...\" Her voiced drifted for an instant. Then she glared hard at me again. She held her hand close to my face. A pool of thick, gooey, rich semen pooled in the bottom of her palm. There was so much - you could not see her palm through the pearly liquid. The smell of it was strong and tingled my nostrils. I had never smelled my own essence before. \"Next time I'll make sure to mount you early, so I won't have to see such a waste again. You might enjoy that more anyway, pumpkin.\" She smiled again and then snaked her tongue out...out toward her palm. \"Just think,\" she whispered, \"this could have been another brother or sister for you.\" Then...then...she licked her palm. Her tongue ran through the seed, smeared it, lapped it up like a dog, licking with a feverish glow in her eyes, drinking up every bit of her own child's sperm, licking her hand and sucking her fingers like cocks. My soft penis twitched and I groaned with inexpressible arousal. I suddenly realized that I would be ready to mate again, very soon, and this time she, my own mother, would take me as her mate and mount me. Like the Bickers woman. I think I was more than ready to resign myself to my incestuous fate. \n\n\"MOM! MOM! WHAT ARE YOU DOING!\" The scream was from my brother. I tore my gaze from the succubus that now inhabited my mother's body, and saw my brother standing on the other side of the kitchen, his face twisted in a grimace of disgust and jealous hatred. \n\n\"WHAT DID YOU DO TO MOTHER!\", he screamed in heart-broken agony. \n\n\"It's not what it looks like!\" I told him, not believing it even as I said it. \n\n\"WHAT THE HELL DO YOU MEAN!\" His eyes glowed in their venom. \n\n\"Believe me, he hasn't done anything to her yet!\" We all three turned as a family to see Mrs. Bickers standing at the entrance to the room. Her exquisite body stood draped in only a swimsuit. It was the color of blood. The lascivious smile on her face would have impressed the Devil himself.\n\n\"What's wrong tiger? What's got you so upset?\" she purred at my brother, walking up to him, her hips swaying. \"I think Danielle has made a change for the better, don't you? She used to be so sweet, and icky icky innocent, completely naive to the absolute power of a Goddess that lay within her.\" \n\nShe looked over at Mom, who sat upon the floor, her face no longer filled with lustful ferocity but contorted with confusion. The succubus in her was receding. \n\n\"Now, she's more beautiful, more passionate, certainly more loving.\" She giggled. \"And more fertile too.\" She left that hanging in the air with a pregnant pause. \n\n\"She's changing into the perfect woman. Without blemish. Just like you boys wanted.\" \n\nMy brother and I saw both whispered \"What!\" in disbelief. Diana was now standing right before my brother, her body heat bouncing off his nervous body, her scent wafting about his head, sending the hairs on his body prickling. I noticed the bulge in his boxers slowly twitching awake. I flashed back to that night in the hallway, seeing his enormous erection swelling to magnificent, godlike proportions. It was beginning again. I looked over at my mother. Her eyes were glued on her son's growing desire as well. Her eyes were vacant in their hypnotic fascination. Her lips parted and the pink tip of her tongue flecked across their pouting surface. Her nostrils began to flare, and I knew the demon was beginning to resurface. I had to do something! \n\n\"You have no business here, you disgusting whore! You've done nothing but bring evil into my family since we've moved here! Now get out before I throw you out!\" \n\nMy brother dropped his jaw in shock, my mother eye's bulged in surprise. Diana's face showed no emotion for a few seconds, as silence hung about the kitchen. Then she laughed. Her laughter cut through us all like a blade. \"I've done nothing to any of you that you didn't really want - NEED. I didn't force you or your brother into my bed. I didn't force your mother to nurse from my breast. Your father being gone all the time, her insides burned with desires she did not know she had. But she took my love instinctually. She is what she is now, because she wants to be. It's what she was born to be!\" \n\nHer baleful eyes, glowing green with triumph, drifted over to where my mother had finally brought her self to her feet. She stood their unsteady, her knees shaking. Her eyes still churned with confusion. My brother barely muffled a groan as he took in her naked form - it was the first time he had a good view of her newly changed body. I saw his boxers straining, ready to explode under the pressure. \n\n\"What are your saying, Diana?\" she whispered. \"I didn't want any of this to happen. How could you think that....I'm possessed by something evil, something perverse, something I don't want any part of!\" \n\n\"Please, it didn't look like you were particularly struggling there with your oldest on the floor, trying to mount him. It looked to me like you were having a grand old time!\" \n\n\"Mother....\" my brother was glaring at her, his jealousy had returned, now mixed with his arousal at her naked body. \"How could you do that with him....with James...mom's aren't supposed to do that.\" \n\n\"I don't know sweetheart, I couldn't control it. It was as if something was inside me, moving my body like a puppet. I knew what I was doing but IT was making me do it, and making me enjoy it...\" she broke into a guilt ridden sob of horror. \n\nJacob's eyes were filling with tears as well, tears of anger at the way his mother was acting. Diana rolled her eyes in exasperation. \n\n\"Oh for goodness sake's, people! You act as if you just murdered someone! You are embarking on a new and exciting lifestyle, in a new and thrilling form. Ecstacy should be coursing through your bodies right now, but your are fighting it too damn much!\" There was a faint glow behind her eyes, and her voice was beginning to deepen. \"Embrace what you are becoming! Become what you were meant to be!\" Her voice was now the deep horrible snarl of an animal, nothing feminine about it anymore - nothing human. Her eyes were glowing now, the green of her eyes blazing emerald hellfire. She smiled her basilisk smile, and we three could see her canines begin to strain through the flesh of her gums. Mother gasped in horror, and Jacob gasped in shock as Diana's hand grasped his manhood through the boxers. \"Seems as if I will have to help the two of you along.\" She laughed deep and mockingly. Then she dropped to her knees. ",
        "\"Get away from him!\" I yelled, bounding across the kitchen towards the couple. Diana reached up from where she was on the floor, and with one powerful shoved from her muscled arms, I was thrown back against the oven. Her flesh flowed with the strength of the beast. I lay there dazed, the room swirling around me and my cracked head. \n\n\"Watch as I pleasure your son now, Danielle. You'll be doing this soon, so take notes.\" Her pink tongue arched from her lips and began to lick and lap, slowly and mercilessly teasing his manhood beneath the thin fabric of his boxers. \"Hmmm....how 'bout we get rid of those.\" With a quick pull the shorts were down at his ankles and the enormous phallus of some pagan god sprung into the air - stretching as an offering towards Mrs. Bicker's open mouth. Without pausing to admire the youth's new equipment, her steaming mouth impaled itself upon the monster, plunging Jacob into an electric ecstasy of churning saliva and dancing tongue. He grasped the counter to hold himself up, his face contorted in the horrible agony of it. The woman's tongue danced and rolled and undulated over his shaft as her hand massaged his scrotum. She could feel the wealth of sperm swollen in his glands, begging for explosion. She mercilessly teased his pee hole with her tongue. Diana raised her mouth off his straining need, gently tugging a long strand of spit up from the swollen head of his penis. She looked into my mother's face. Mother was mesmerized, and I could see her nipples sprouted at full attention. Her face had that vacant look again. \n\n\"Won't the real Dani come out and play?\" She pouted her lips and sucked the bridge of spit and precum into her mouth. Jacob hissed between his teeth. Diana grinned up at him and ran her tongue over her voluptuous mouth of fully sprouted animal teeth. \n\nI watched in terrified wonder as the faint beginnings of a smile begin to play across the lips of my mother. Her nostrils were flaring and her eyes began to twinkle with a presence I had seen there before. \"I can smell him,\" she whispered to herself. She began to slink across the kitchen in the their direction. She was gently manipulating her breasts, tweaking her own nipples as they rose in fierce arousal. Her breath came in short pants. I would have risen to stop her, but my head still swam with pain. \n\nDiana smiled her savage smile, and plunged her horrible bestial mouth upon my brother's manhood. Her tongue churned and worshiped over its impossible length, and it still seemed to be stretching somehow in length, centimeter by centimeter attaining mind boggling proportions. He groaned hoarsely and closed his eyes. Mom at last had made it over to them and stared with magnetic fascination at her son's organ. \"I can smell him, Diana,\" she whispered. \"I've never smelled anything like it.\" She licked her lips, drool beginning to pour over the rim of her mouth. \n\nDiana looked up from her oral masterpiece and nipped at the head. Jacob winced in pain. She laughed, deep and devilish. \"You smell his need, Dani. He's sending out his musk for you, calling you to bed, for joining. It's a call as old as creation - the man calling his woman to become one and to take his seed into her body. A call for the goddess to create a new life from the offering of her devotee. Your body longs for that offering, doesn't it?\" \n\n\"Yes, I need the....I need the seed.......\" \n\nMother's voice was deepening and taking on a harsh and metallic edge. The drool dripped like a water fall from her mouth and eyes took on a strange glow. The succubus was controlling her again. She dropped to her knees. Her eyes, burning with a strange yellow light, looked up at my brother. Her lips pouted, like a innocent baby. \"Mommy needs it so bad, sweetheart. You don't understand it. I need it so bad, my body hurts. The pain in my empty womb....it's calling for you. Please, I need you to come back. Come back to where you came from. Back to where I grew you.\" \n\nMy brother, through a veil of bewildered tears, gasped, \"Yes, yes, I'll do anything for you, Mom. Just make this feeling go away. I'm about to explode! I love you so much - I want to be your husband....\" \n\n\"Not mommy's husband,\" corrected Mrs. Bickers, \"but her mate. Her breeding stud. Her worshiper.\" \n\n\"Yes,\" Mother's face began to twist and contort into a mask of pure animal hunger and lust. \"Breed your mother - Stud me.\" Then lowered her mouth with it's searing heat upon the head of her youngest child's penis, engulfing it in agonizing slow motion. There was a light smile written on her open mouth. My brother's body shook in a seizure of pleasurable torture, feeling her mouth bathe his manhood in saliva and begin to taste and lightly lick his straining need. She was teasing him with her skills, skills she had not used since college, coming back to her in a wave of absolute and indescribable freedom. It washed over her body, sending shivers over her own flesh. She licked the underside of his head with wild abandon, looking up into his face and giving him a wicked wink. She wanted him to cum, and flicked he tongue underneath his tool's head in an awful dance of flesh on flesh, coaxing his need to cum spewing forth. She pulled back suddenly from her son's tool, spit splattering across the floor, and threw her head back to let loose the snarl. It was an invitation. \n\nHis great tool of creation began to shoot its pent up seed, spewing like a burning geyser. It bathed my mother's face in a thick coat of sperm, covering every inch of her face in a hanging web of it. He yelled in his exultant relief, \"Mom, Mom, it's all for you!\" It continued to pump and pump onto her face and into her gaping mouth. A deep pool of seed swelled upon her tongue. \"For you, mom. For you...\" he moaned between gritted teeth. At last he finished ejaculating his sea of youthful sperm all over the upper torso of his goddess. She looked up at him through a mask of his essence and closed her voracious lips - slowly for all to see. She swallowed with a loud smack of delicious satisfaction. Then, a rapacious smile spread across that defiled face that had once belonged to my mother, and she let loose a howl of savage ecstasy - like a rabid animal that has just felt the sweet taste of fresh blood across its tongue. \n\nAnd I knew I had just lost my mother - forever."
    ],
    "authorname": "GrimmsOtherBrother",
    "tags": [
        "incest",
        "mature",
        "lycanthropy",
        "mind control",
        "horror",
        "werewolves"
    ],
    "category": "Erotic Horror",
    "url": "https://www.literotica.com/s/new-moon-pt-07"
}