{
    "title": "Victoria Pt. 02: The Housewife Hex",
    "pages": [
        "It had been a few months since Rick had been turned. His parents were surprised when they came back from Europe and he told them that he and Victoria were now dating. As strange as it was for them at first they started to like Victoria as they got to know he better so it didn't take them long before they came around. They never knew the truth of what happened while they were away or about what they both were but Rick and Victoria knew it would be better that way.\n\nRick was now living with her in the house next door to his parents which he still found awkward sometimes but it was better than living there. He was over there so often that it just made sense. It took him a while to get used to what he had become but Victoria helped him along the best she could. As much as they both came to terms with what they were it was still a struggle finding a balance even after all this time but their passion for each other was stronger than ever and neither one of them had ever been happier.\n\nThey had their fun going out at night and find an unsuspecting victim however they would never physically make love to anyone. They learned early that if they invaded the victims dreams they could easily take what they needed from them because even though they were sexual demons they still didn't want to fuck anyone but eachother. This made it difficult for them sometimes but they were constantly finding new ways to deal with the matter. \n\nVictoria spent a lot of her time reading up on Succubus spells to find new and kinky ways to get what they needed while making sure their victims were left mostly unharmed. Their main issue was if they sucked someone's energy to the point of death they wouldn't have to feed again for at least a month, however they both had only one rule and that was they would never kill anyone and would only take what they needed and then share it with each other but it would only sustain them for days so it was becoming increasingly difficult to get what they needed.\n\nRick came walking in after helping his parents with some yard work and headed upstairs. Victoria was lying in bed in a T-shirt and panties after just getting out of the shower. She was reading her book and found a spell she wanted to try when she saw him walk into the room covered with sweat. His shirt was sticking to him showing off his physique which had tightened up a lot since he turned.\n\n\"Hey sexy!\" She said looking him up and down.\n\n\"Hey yourself, what are you reading about?\" He asked laying down on the end of the bed before he began rubbing her leg.\n\n\"I found a spell in here I really want to try.\"\n\n\"Oh, is it good?\"\n\n\"It's interesting, It's a sort of hex, apparently I can hex someone so when they have sex they absorb the energy from their partner and transfer it to me.\"\n\n\"Interesting, so what do we do?\"\n\n\"Don't worry, we can keep ourselves entertained during the process. I think it was created by a lazy succubus, but something about doing that to someone just turns me on a little, besides it might help our feeding problem.\"\n\n\"So how does it work?\"\n\n\"Well I cast the Hex on a woman by invading her dreams like we usually do, but instead of sucking energy from her I seduce her and put the spell on her.\n\n\"Sounds sexy.\"\n\n\"It can be, then when she awakens she will start to feel very sexy and confident about herself along with being very horny, and it will make Her husband, boyfriend, girlfriend or whatever begin to notice it as well.\"\n\n\"How so?\"\n\n\"Well according to this she'll start looking sexier to him as her skin begins to look younger, her age marks and imperfections fade away and he will start to lust for her until he finally gives in and falls into her trap, or our trap.\"\n\n\"That does sound interesting, she won't kill him right?\"\n\n\"Awe, you never let me have any fun.\" She said pouting at him. \"But no, not if I do it right.\"\n\n\"God you're sexy when you pout. So who were you thinking of trying this on?\"\n\n\"I was thinking Mrs Thompson down the street.\"\n\n\"Jennifer Thompson? She's a nice looking woman already, she doesn't need any help from us getting Jonathan's attention.\"\n\n\"Well that might not be entirely true, I think her and Jonathan aren't doing so well anymore, apparently he doesn't find her as attractive as he used to.\"\n\n\"Really? How do you know?\"\n\n\"From his dreams, I think Jonathan is thinking of cheating on her.\"\n\n\"Are you sure? I know them both and I don't think he's the type.\"\n\n\"I don't believe he is cheating yet but I know he's dreaming about it, he has an attractive secretary and..........\" she said starting to get a little angry.\n\n\"Woah woah, calm down, he's not the type to cheat, I'm sure of it.\"\n\n\"I thought the same thing about my husband.\"\n\nHe took her hand in his \"Hey, that's over, you know you are my whole world right.\"\n\n\"I........ I'm sorry, just still a sore spot for me........., besides you dream cheat on me all the time\" She said jokingly trying to change the mood.\n\n\"Well so do you, but what were you doing in his head? I thought people we knew were off limits?\"\n\n\"I didn't fuck him, I was more or less curious after I found this spell.\"\n\n\"So does that mean I can invade her dreams?\"\n\n\"Not if you want me to rip your balls off.\"\n\n\"Okay then, moving on, so you want her to absorb his energy out of revenge for something he hasn't done yet?\"\n\n\"No, I have another motive here, I was actually thinking it might save their marriage if I did this.\"\n\n\"Well well, little miss succubus trying to bring people together?\"\n\n\"Hey I'm not a total heartless bitch like my mentor was.\"\n\n\"That's what I love about you, but I do find you sexy when you're up to your little schemes.\"\n\n\"You always find me sexy, I could sit here and say nothing while reading a book called \"how to kill your boyfriend and get away with it\" and you'd still be all over me.\"\n\n\"And?\"\n\n\"Nothing, just love it that's all.\"\n\n\"Haha, well can I at least watch?\"\n\n\"Watch what, me putting the spell on her or her banging her husband?\"\n\n\"Either or.\"\n\n\"You pervert!\" She said smiling at him.\n\n\"That's partially your fault.\"\n\n\"Yeah I guess it is.\"\n\n\"It totally is, but I'm gonna go take a shower.\"\n\n\"Not before I'm done with you.\" She said grabbing him and pulling him down on top of her and pulling of his shirt.\n\n\"Are you sure? I'm filthy and sweaty.\"\n\n\"Just the way I like it.\" \n\nShe pulled her shirt off smiling and biting her lip as she looked up at him. He loved it when she was being playful however she never had to put much of an effort to get him turned on. Being what they were came with a certain amount of sex drive and most of the time unless they were getting a meal they couldn't keep their hands off each other. Most succubi and incubi have an insatiable lust for human prey which they also had but they had a lust for each other that was stronger which was not normal for their kind. This lead to some issue's that they were dealing with daily.\n\nVictoria had a dark side to her as did they both which was partially because of their condition but because she had been corrupted by Nessira so hers was a bit stronger. Rick struggled with his sometimes which is why he still lived next door to his parents as seeing them and spending time with them every now and then helped keep him centered and still feeling human which in turned helped him keep Victoria centered as well. Victoria had also drank the blood of Nessira who was a daughter of Lilith which had made her a little more powerful than him but she loved him more than life itself which gave him a certain amount of control over her. She didn't think of him as her master just as the one person she never wanted to disappoint and she knew the harder she tried to behave for him the easier it became for him to control his urges.\n\nThe most human thing about the both of them was how they felt about each other. They were both good people at heart but sometimes their desires and their hunger made them do things without caring about the consequences. Victoria had this problem more than him but he still had his moments as well. He almost killed a woman one of the first times he fed after Cindy and even though Victoria wanted to watch him drain the girl dry as the idea of it turned her on a little she still convinced him to stop worried that even if he forgave her for not stopping him he would never forgive himself had he killed the girl. \n\nThey balanced one another and knew they would be lost without each other. Even though Victoria had those moments where she almost seemed evil to some extent it actually turned him on sometimes. He would look into her eye's and see the beast inside who just wanted to fuck but In his heart he knew who she was. He loved her and was not willing to let her turn without a fight.\n\n-----------------\n\nVictoria studied the the spell carefully wanting to make sure she got it right and there were no adverse effects. She made sure she had memorized every word of it and its English translation so there were no mistakes. The best way to cast the spell was to invade Jennifer's dream and seduce her which both Victoria and Rick were looking forward to.\n\nThe night arrived and she used a simple dream to distract her. Nothing too fancy just something that would make her think it might be a dream and drop her guard a little so Victoria used her skills on her which Rick was looking forward to watching. When the dream had a lot of familiar things for him including a bright blue light from the moon shining in every room. He stood there in the living room of their house with Victoria by his side as he looked around at the interior of their house.\n\n\"So hey what's with the moon light, always showed up when you were invading my fantasies.\"\n\n\"I always liked moonlight, you don't?\"\n\n\"No I do, just wasn't sure if it was a dream thing or a you thing\"\n\n\"Yeah, you should start using it as well, sometimes the dreams you give people are so dark and creepy I'm afraid you're going to scare someone to death.\"\n\n\"Well you will have to teach me won't you, so now what?\"\n\n\"Now she will come walking downstairs to get a drink any time now and that's when I'll make my move.\"\n\n\"Will she see us?\"\n\n\"Not until I want her too, and she'll only see me, well at least a blurry dreamy version of me anyway.\"\n\n\"I like the dream version of you, some of my favorite memories of you.\"\n\n\"Okay seriously pull back a little because you're getting me turned on.\"\n\n\"Wouldn't it make more sense to disguise me as her husband and let me do it?\"\n\n\"No, besides you don't know the spell, and I thought you wanted to watch?\"\n\n\"Good point, you're right never mind go ahead.\"\n\n\"Shhh, here she comes.\" She said as he saw her walking down the stairs.\n\n\"What do you mean shhh, she can't see us or hear us.\"\n\n\"Just shut up will you.\"\n\nRick couldn't help but look her over. She was in her early 40's but she still looked amazing. She was wearing a black nighty and he couldn't help be stare at her legs and he began to wonder how her husband wouldn't be attracted to her any more. She had brunette hair with not a single gray in it and she was still in amazing shape. As he stared he suddenly looked over at Victoria who was watching him. Her eyebrow was raised as she eye balled him. Rick felt a little guilty and looked around aimlessly for a moment before she stepped towards him and kissed him while Jennifer walked pass them into the kitchen.\n\n\"Well, it's show time, just keep your hand out of your pants okay?\"\n\n\"I make no promises.\" He said before he grabbed her and kissed her before letting her go and watch her walk into the kitchen behind Jennifer.\n\nShe walked up behind Jennifer and ran her hands along her shoulders. Jen seemed a little shocked at first but soon tilted her head back enjoying Victoria's attention like she hadn't been touched in a long time. She began to kiss the side of her neck and it wasn't long before Jennifer was turned on and letting Victoria have her way with her. As Rick watched it seemed pretty obvious that Mrs Thompson had figured out she was dreaming as she turned around to face her before Victoria slid the shoulder straps off of her letting her nighty fall to the floor. Rick looked Jennifer over in awe as she was a very sexy woman. He knew her son as they had gone to school together and was happy that he had moved away while he was at college so he wouldn't be around to see the results of this spell provided it worked.\n\nVictoria was wearing the same red nighty she wore the night she came back after Rick had just had his way with Cindy. He often thought about that night and how he never really saw Cindy again after that. They had brought her home and she seemed convinced that it was all a dream but that fall she left for college and that was it. He didn't really have any feelings for her but he felt bad fucking her even though Victoria knew he had to do it to complete his transformation, and he also felt bad for what he did to Cindy but he tried not to dwell on it.\n\nHe cleared his mind realizing he was missing the show. He was so turned on watching his girlfriend make out with Jennifer as she began to work her way down her body. Jen was leaning against the counter as Victoria traced her tongue down her stomach getting lower and lower. Jen looked so ready for attention and Rick could tell that she he hadn't had any in awhile.\n\nRick was so turned on a part of him wanted to jump in and join them but he knew he couldn't get involved. He watched Victoria explore her with her tongue, her breasts heaving as she took deep breaths while Vic pleasured her. Every now and then Victoria would turn to Rick and smile and wink before going back to work. As he watched he saw Vic starting to chant something while she waved her hand in front of Jennifer's pussy making her moan. Rick was curious about what exactly was going on but was shocked when he saw Jens pussy begin to glow a strange red color while she writhed and began feeling her breasts like the spell was giving her pleasure. He almost envied her knowing what it's like to be seduced by Victoria in his dreams.\n\nHer chants continued and Jennifer's body shook as it seemed like she was about to climax more than she had in years while the light got brighter and brighter between her legs. Her moans grew louder as she had a look on her face like she was about to cum in a way that she wasn't sure she was ready for. Jen began to moan louder and louder grabbing the counter like she was holding on for dear life until suddenly Mrs Thompson let out a scream of pleasure as she shot up out of bed feeling her orgasm soaking through her panties. Her scream woke up her husband who was very confused by what all the nose was about.\n\n\"Woah, what? Honey are you alright?\" He asked his wife as she sat upright panting and covered with sweat breathing heavily.\n\n\"Huh.......... yeah.......... yeah I'm fine..... just a.......... bad dream.\"\n\nHe put his arm on her shoulder wanting to make sure she was okay before he looked over and noticed the sun was up and his alarm was about to go off.\n\n\"Well I might as well get up and get ready for work, are you sure you're alright?\"\n\n\"Yeah I'm fine, but I think I'm going to stay home today, I just........... I just don't feel right.\"\n\n\"Okay, just relax, do you want me to stay home with you?\"\n\n\"No, I'm okay really.\"\n\n\"Alright, but don't hesitate to call me if you need anything.\"\n\n\"Okay.\"\n\nJonathan got up and showered before getting ready for work. Jennifer headed downstairs to make herself some coffee still trying to process the crazy dream she had just had. She sat down at the counter drinking her coffee remembering what had happened in that very room during the dream feeling herself getting turned on thinking about it. She began to envision Victoria as she seduced her and she could feel herself getting wet between her legs again. She wasn't even sure who it was in the dream as everything seemed fuzzy to her. Victoria did that on purpose not wanting her to think anything if they ran in to each other.\n\nJonathan came walking downstairs a little while later and walked into the kitchen pouring himself a glass of coffee before turning around seeing his wife breathing heavy and licking her lips with her eye's closed.\n\n\"Jen, Honey?\" He asked confused.\n\n\"Huh, oh sorry.\"\n\n\"Are you sure you're alright?\"\n\n\"Yeah I'm fine, really.\"\n\n\"Okay, but like I said call me if you need anything alright, you just seem a little..... off today.\" He said walking over and giving her a kiss goodbye.\n\nWhen his lips hit hers she grabbed him and pulled him tightly. He took the moment to enjoy it as hadn't kissed his wife like that in years. She tasted amazing and he actually felt a little turned on all of a sudden. He finally pulled away from her surprised by the kiss but enjoyed it very much.\n\n\"That was nice?\" He said as she smiled at him a little.\n\nHe stared at her for a moment as something about her seemed different but he wasn't sure what it was. The way she looked at him seemed different, there seemed to be a lust in her eyes and she just seemed sexier to him all of a sudden, like he had been going blind for years and had suddenly gotten a new pair of glasses. He had almost forgotten he had to go to work before he looked at the clock realizing he had to leave.\n\n\"Oh shit I gotta go but um, I'll see you tonight.\" He said grabbing his keys.\n\n\"Can't wait.\" She said smiling and kissing him again before he left.\n\nJonathan walked out the front door and got into his car and took a deep breath as he was almost tempted to call in sick and just stay home with her. He had to adjust his briefs a little as he was half cocked but still had to get to work. He began to back out of the driveway when he stopped letting a blonde girl pass by who was out jogging. She smiled and waved to him as she went by to which he waved back but even as attractive as she was he couldn't stop thinking about his wife.\n\nVictoria continued her jog as she headed home with a smile on her face. She walked in the front door seeing Rick in the kitchen drinking coffee to which she gave him an odd look as she walked over to him. He looked her up and down loving her jogging suit as it hugged her body.\n\n\"So what's with the coffee?\" She asked grabbing a bottle of water from the fridge.\n\n\"Old habits die hard, besides your drinking water?\"\n\n\"Still gotta hydrate, besides I don't want to fuck you until tonight and this helps.\" She said licking her lips with a certain amount of excitement in her eye's\n\n\"So did it work?\"\n\n\"The look on Mr Thompson's face said it all, he didn't even check me out.\"\n\n\"Really? Are you sure his eyesight isn't messed up?\"\n\n\"Haha, no he's only got one thing on his mind right now.\"\n\n\"Nice, now are we sure this isn't going to end badly?\"\n\n\"Will you stop worrying, trust me if he dies he is going to die a very happy man.\"\n\n\"Not very reassuring.\"\n\n\"Don't you trust me?\" She asked him walking over looking very pouty again.\n\n\"With my life of course I do, it's other people's lives I'm a little iffy with trusting you with.\"\n\n\"I haven't killed anyone since I met you, well except you and Nessira, but I brought you back to life, and you know I would never kill anyone right?\"\n\n\"I know, I just worry about you sometimes.\"\n\n\"You worry about me?\"\n\n\"Of course I do, I watch you struggle daily with your urges and every time you learn more spells and become more..... Succubus, I feel like I lose you a little, and I don't ever want to lose you.\"\n\nShe smiled at him feeling a warm feeling in her heart after he said that to her before she walked over to him. \"Whatever happens, what ever I do or become, I will always be yours, I promise you that.\" She said rubbing up against him and sliding her hand up his face and pulling him in for a kiss. \n\nHe felt her tongue in his mouth and held her in his arms. He enjoyed her taste, her scent, everything about her that his senses could process he absorbed. After a moment she released her lips from his and looked him in the eye.He pulled her in tighter as their lips touched tasting each other. They had wanted to wait for the spell on Jen to take hold but they couldn't keep their hands off each other as he hooked his hand under her ass pulling her up and sitting her on the counter as she wrapped her arms around his head. It wasn't long before the started pulling each others clothes off throwing them on the kitchen floor as he picked her up again and carried her over to the couch throwing her down on it before climbing on top of her.",
        "\"You know....... we really should........ wait until......later!\" She said between kisses.\n\n\"No, I want you right now!\" He said as he began kissing her neck working his way down her chest.\n\n\"Well you make a compelling argument.\" She said as he worked his way down lifting her legs around his head as he buried his face between them. \"Oh fuck!\" She yelled as his lance like Incubus tongue slithered its way inside her.\n\nShe grabbed his hair as she thrust her pelvis up towards him. His tongue was inhuman and she loved it when he did this too her as it went so deep he could tickle every part of her. At times like this she didn't feel as bad for turning him into this creature but deep down she always regretted it a little. She had made her choice long before she met him and he had forgiven her many times as it was the only way to save his life but she knew the burden and the lust that come with this condition and still felt bad. \n\nHer thoughts quickly changed as he wiggled his tongue almost torturing her with pleasure. After another moment he retracted himself before pulling her up towards him. She was sweating and panting which made him feel good to see her to see her this way. He moved her hair out of her face and kissed her before lowering her on to his throbbing member as she let out a lustful moan without releasing his lips.\n\nOnce she was impaled on him she pushed him back against the couch trying to take control of the situation which he allowed her to. Once he got her turned on some of her more primal instincts took over and she would ride him like a wild animal becoming more aggressive which he always enjoyed. He loved everything about her, the feeling of her skin and the taste of it. \n\nHe loved how the sex was so wild as it was the only time they could both let themselves go a little and give in to the dark creature that lurked inside them both. Her eyes would turn black and her fingernails would grow sometimes even digging into his back like he was prey that she had caught. He would fight it as long as he could but eventually he would begin to transform as well. \n\nHer tail sprouted from behind her before it hooked underneath wrapping around his balls squeezing them which only made his pleasure more intense. As his sprouted he would curl it up and tickle her asshole sliding back and forth between the two holes which would always make her moan out with approval. The wings they always tried to keep contained as spreading them could cause damage but there were times he wanted to spread them and pull her into the air fucking her up above for the whole world to see and not care about what they were.\n\nHer tail squeezes around his cock as he was about to blow his load. She could always tell when he was ready as he always did his best to know when she was so they could cum together. They both let out a scream that sounded demonic and low as they both shared their animalistic passion before his cock exploded inside her filling her with his demonic cum sharing his lifeforce with her while she continued to milk his cock for every drop he had to give. Her tail squeezes the juices out of him and made his pleasure last even longer while his tail remained tickling her clit.\n\nShe collapsed against him breathing heavily as they both began to return to normal. The sweat poured from them both as they held each other tightly enjoying each other's scent as theirs bodies still shook from orgasmic delight. He wrapped his arms around her and rested his head against her chest as she laid her head on top of his.\n\n\"Don't ever stop doing that to me!\" She said as his cock was still inside her.\n\n\"If I ever do, you have my permission to stab me....... again.\"\n\n-----------------------\n\nJennifer had just stepped out of the shower and wiped off the mirror. She felt different and even looked different as she examined herself. Her skin seemed smoother and tighter as she opened up the towel to get a better look. Her breasts were firmer and more plump looking better than ever. She eventually dropped the towel on the floor looking her whole body over. She felt sexy and she hadn't felt like that in a long time. She thought about the kiss she had with Jonathan that morning and how passionate it was. She didn't know what had come over her at the time but she wanted him and wanted him badly. She started to run her hands along her body feeling herself as she got more turned on. She had no idea what was done to her or what was she was going to do to her husband later but she was fully intending on having her way with him when he got home.\n\nAs her hand slid down between her legs she couldn't help but begin to feel herself. Her finger ran across her clit and she felt a jolt of pleasure surge through her body making her jump a little. She had never been that sensitive there before but it felt so good she couldn't help but continue. Something felt strange inside her like there was a lust she hadn't felt in years that was suddenly released and she needed Jonathan to come home.\n\nJonathan found himself distracted most of the day. Even his secretary Samantha who he had always found a little attractive did nothing for him today as he couldn't get his wife off his mind. He kept thinking about Jennifer sitting at home waiting for him and it was hard for him to concentrate.\n\nHe pulled out his phone and wrote her a quick text message just checking in on her. \"Hey Jen, you feeling any better?\"\n\nJen was still feeling herself when she heard her phone go off. She saw Jonathans name on the screen and a smile came over her face as she reached for it and began to type her reply.\n\n\"Much better....... I miss you.\"\n\n\"Don't worry, should be home normal time today.\"\n\n\"Could you come home sooner?.\"\n\n\"Why, is everything okay?\" He asked and waited.\n\nJonathan had to take a call and put his cel phone down. He wasn't sure why she wanted him to come home sooner but after a few minutes his phone went off again. He picked it up and saw a little download box to which he clicked it and waited for it to load. When the picture finally opened he saw a selfie of her wearing black lingerie that he had forgot she had even owned. He almost fell out of his seat when he saw it as she looked incredible. Her breasts filled out the bra beautifully looking better than he remembered. He had begun to feel a little ashamed of himself wondering how he could have forgotten how sexy his wife was.\n\nAfter another minute his phone went off again. There was another picture of her pulling down the front of her bra showing off a little more cleavage but no nipple. The next picture had her completely topless with her arm covering her nipples, followed by another of her completely naked but using her arm and crossing her legs to cover everything. He had a full boner hiding under his desk as he waited for more pictures but when his phone went off again it was just a text that read \"you'll have to come home to see the rest ;)\"\n\n\"Samantha, cancel my afternoon meeting, I have a um........... family emergency I have to take care of.\" He said grabbing his briefcase using it to hide the issue growing in his pants.\n\n\"Yes sir, hope everything is okay?\" She said confused by his sudden exit.\n\nAfter sitting in traffic for about 40 minutes he had finally arrived home. He got out of his car and was heading into the house when his neighbor Bob waved at him from the other side of the fence while trimming the hedges.\n\n\"You're home early John, everything alright?\" Bob asked.\n\n\"Yeah Bob, just uh,\" he paused not sure what to say. \"Just a little under the weather that's all.\"\n\n\"Ah I see, well my wife has a recipe that helps with...\"\n\n\"Sorry Bob can't talk.\" He said finally getting his front door open and stepping inside.\n\nHe dropped his briefcase and looked around not seeing her anywhere. \"Jen, I'm home?\" He called out but got no response.\n\nHe headed upstairs and didn't hear anything but headed down the hallway to his bedroom where he found the door shut. He grabbed the handle and turned it opening the door and was blown away when he saw Jennifer sprawled out on the bed waiting for him. There were candles lit on the dresser and the nightstands and she just stared at him with a seductive look in her eyes. She was still naked but covering herself with a sheet that showed off the curves of her body. She looked absolutely incredible lying there waiting for him.\n\n\"Jen, you look...... wow!\"\n\n\"You mean this old thing?\" she said referring to herself. \"I thought you didn't find me sexy anymore?\"\n\n\"Jen you're..... I mean wow, you look\"\n\n\"You seem confused, why don't you come get a closer look.\" she said luring him closer.\n\nAs he got closer she smiled at him and reached out and grabbing him by his pants pulling him close before she began to loosen his belt. He had never seen her like this before but he was curious to see how far she was willing to take this. She unzipped his pants and slid down his underwear pulling his cock out which was hard as a rock as she ran her fingers along it. Jonathan couldn't believe what he was seeing as she stuck out her tongue and used it to push his foreskin back revealing the tip of his cock before she started licking circles around it. He could barely keep his balance as she lubricated his cock kissing the tip of it before sliding her lips down his shaft giving him a few slow sucks. Her hand cradled his balls lightly caressing them while he wobbled trying to keep his knees from buckling.\n\n\"Oh shit!\" He said as she continued to please him.\n\nJonathan was enjoying himself but he wanted to return the favor. He waited a little while longer still enjoying the feeling of her lips around his cock until he pulled away and began to kneel down in front of her gently separating her legs. She smiled knowing what he wanted and got into a better position for him as he lowered his face.\n\n---------------------\n\nBack at Rick and Victoria's house they were lounging in the living room after cleaning themselves up from their romp hours ago. Neither one of them expected to notice anything from the Thompsons until later in the afternoon but Victoria suddenly felt a jolt of something making her spring up from the couch. \n\n\"Woah there.\" she said surprised.\n\n\"What's wrong?\" Rick asked watching her jump.\n\n\"I think um, I think Mr Thompson came home from work early.\"\n\n\"Oh really? How do you know?\"\n\n\"It's strange, apparently the spell connected Jennifer and I in more ways than one because..... oh shit!\"\n\n\"What is it?\"\n\n\"I think he's eating her out right now...... oh fuck!\" She said placing her hand on her crotch like there was something going on down there.\n\nRick was getting turned on watching her writhe as if being pleasured by an invisible tongue but at the same time he felt a little left out even though they had just had sex a little while ago. She unzipped her pants sliding them off before looking at him and motioning for him to come closer to her. He slid down the couch to he as she reached out pulling his pants off.\n\n\"Are you okay?\" He asked enjoying her current state.\n\n\"You need to fuck me again, oh god, just fuck me right now.\" She said as she got his pants open and climbed into his lap. \"Oh holy fuck!\" She yelled out as his cock slid inside her.\n\n\"Enjoying yourself?\" He said with a smirk.\n\n\"Have you ever been fucked and eaten out at the same time...... Holy shit!\"\n\n\"Can't say that I have.\"\n\n\"Just shut up okay!\" She said as she began to move her hips riding his cock and enjoying the double sensation.\n\nHe leaned in and began to kiss her neck and chest as he pulled her shirt off. He was already extremely turned on and fully ready to take advantage of her current state. He made sure he pleasured her as much as he could as she seemed like she was getting fucked by two people at once.\n\n-------------------------\n\nBack at the Thompson house Jennifer was on the bed with her husband's face buried between her legs as he continued to lick every inch of her trying to make sure she was satisfied. Her moans and whines were music to his ears as she wiggled enjoying his touch.\n\nJennifer was loving the attention but she began to feel a little strange the more he pleasured her. She began to feel a deep animalistic lust start to fill her as she pulled him up towards her face kissing him before she grabbed him and threw him down onto the mattress with force that surprised him a bit. She stood at the end of the bed before leaning down and climbing on to his legs. She ran her tongue up along his shaft as she slid further up towards him. He watched his cock disappear between her breasts before he felt the skin of her stomach sliding against it the closer she got to him until she was face to face. He could feel her slit right against the tip of his cock as it slowly began to engulf him whole making him moan as the warmth slid around his member.\n\nShe kissed him again and smiled as she started moving her hips milking his cock. He had been waiting for this since this morning and he still wasn't sure what had suddenly come over her but he was enjoying it. This was the best sex they had had in years and he honestly didn't think a passion like this still existed between them. His cock felt so good inside her he wasn't sure how much longer he could hold on as she continued to ride his quivering member.\n\nHe ran his hands up her body feeling her soft skin in his palms before cupping her breasts. He could feel her nipples perk up as he touched them before she grabbed his hand and squeezed them letting out another moan. Sweat began to pour from her making her hair wet as she began to whip her head around letting out moans that almost sounded unnatural as her pussy squeezed around his cock getting him ready to explode. At one point she made a sound that he could have sworn was a growl of some sort. It was a bit odd to him but the feeling was so amazing he almost didn't care.\n\nShe looked down at him with a smile that seemed sinister. Her eye's were filled with a crazed lust that aroused him and frightened him at the same time as she continued to motion her hips trying to suck every last drop from his cock. He pulled himself up wrapping his arms around her sucking the skin on her chest. As strange as this was and as strange as she was acting he still couldn't help but enjoy himself. Her sweat tasted amazing as he licked it off of her before he looked up and kissed her to which she bit his lip to the point there was a little blood.\n\n\"Ouch!\" he said pulling away as she laughed a little continuing to fuck him relentlessly.\n\nHe looked into her eye's and something just seemed wrong. As beautiful as she was and as she had always been this animalistic creature he was fucking didn't seem like his wife. This was easily the best sex they had ever had but as good as it felt this was not the woman he married. Her pussy squeezed his member like she would never let him go. He heard another growl come from her that was both sexy as hell but deeply disturbing as she continued to milk his member. She put her arms around his head and forced his face into her chest as she rode him faster letting out moans that didn't sound human.\n\nJonathan couldn't hold out anymore as he let out a yell and his cock squirted everything he had into her as she continued to bounce on his member letting out her own scream of satisfaction. His cock shot more and more cum into her to the point he was a little surprised he was still going. It felt so good as she sucked every last drop out of him along with a strange warm feeling that swept over his body almost flowing into his genitals making his experience even more intense. After a few more moments his cock finally stopped and Jonathan lyed there covered in sweat and struggling to catch his breath as Jennifer tilted her head back enjoying the after effects of her orgasm. He ran his hands along her legs placing them on her waist. \n\n\"That was amazing.\" He said as she still had her eye's closed. \"I love you so much.\"\n\nShe smiled and looked down at him with that same lustful look in her eye's. He blinked a few times trying to make sure he was seeing what he saw. Her hair was soaked making her look even sexier but her eyes had changed and had turned an almost red color as she continued to stare at him with a mischievous smirk on her face. He tried to focus to make sure he wasn't seeing things but he was torn between her sexines and the strange look in her eyes.\n\n\"Jen, Honey are you alright?\" He asked a little concerned placing his hand on her cheek before she leaned down and pressed her lips to his.\n\nAfter a moment of her sucking on his lips which he did enjoy she let go and looked at him again before she said \"I want more!\"\n\nHer pussy clamped around his cock and would not let go. It didn't hurt but he could feel the tightness and started to get a little scared as she started riding him again while letting out an almost evil sounding laugh.\n\n\"Jen, what are you....... oh shit.... what's wrong with......\" he couldn't say much as the pleasure began to grow again and he could not move.\n\nHe tried to flip her over but it was like he was no match for her strength. She pinned his arms down above his head as she shook her amazing breasts in his face almost taunting him with them. The feeling was still amazing but he knew something wasn't right as she continued to milk him for more than he had to give. He tried to pull himself up towards her looking her in her eye's trying to figure out what was wrong with her.\n\n\"Jen, please stop this.\" He asked trying to free his hand as she took it and put it on on her face before taking his fingers and sucking on them like she wasn't listening to him and just wanted to keep fucking.\n\n--------------------------------------------\n\n\"Uh oh.\" Victoria said as her and Rick were on the living room floor naked after having their own little sex marathon.\n\n\"What is it?\"\n\n\"I think something is wrong.\"\n\n\"What?\"\n\n\"She's fucking him again.\"\n\n\"But, I thought the hex was only good for one?\"\n\n\"Shit!\" She said getting up and heading to the bedroom which was difficult as she could still feel the affects of what Jen was doing to her husband.\n\nShe kept stumbling as she could feel Jonathan's cock between her legs which was making it hard for her to walk. Rick picked her up and carried her upstairs himself before dropping her on the bed. She grabbed the book trying to find a way to break the spell before Jen fucked her husband to death.\n\n\"Oh god! It's hard to concentrate when you feel a cock inside you going to town.\" She said trying to find the page\n\n\"Let me.\"\n\n\"No, I cast it so only I can break it, let me see........ FUCK!...... shit this feels good.\"\n\n\"Concentrate Vic, before she kills him.\"\n\n\"I know, let me see?\" \n\nShe found the page and the words to sever the connection. She began to speak them which was hard as her pussy was being filled by an invisible cock at the moment which felt amazing. She continued to say the incantation that would break the connection.\n\n-------------------\n\nJen continued to rape her husband as the Succubus connection had released her primal sexual instinct so she wasn't even in control of herself anymore. She had tasted the energy she had absorbed from him before it had flowed into Victoria and now her body wanted more. If she didn't stop soon she was going to kill Jonathan without even realizing it.\n\n\"Oh Fuck.... Jen......... I can't........... Oh god!\" Jonathan pleaded with his wife who wasn't even really his wife anymore.\n\n\"Haha, more, give me MORE!\" She said as her voices changed becoming almost demonic.\n\nThe pleasure mixed with his fear was a whirlwind that was hard for him to process. He was so over stimulated by the pleasure and her beauty that he was almost willing to die just to feel the pleasure this sexual beast that used to be his wife was giving him. Whatever this creature was only had one thing on her mind and that was to fuck. The consequences didn't matter, Jonathan didn't matter, just the pleasure.",
        "Jonathan yelled out as his cock exploded one more time into his wife's tight warm pussy. As much as it was wrong the pleasure was still insanely good as he bucked his hips filling her with everything he had. His orgasm lasted even longer than the first one and he could feel himself slipping away. He enjoyed one last final blow before falling unconscious under Jennifer who was enjoying the sensation herself. She was still sitting on his cock enjoying what had just happened and still smiling about it until she began feel normal again and regain control of herself. She was looking around a little confused by what had just happened. She looked down and saw Jonathan out cold and barely breathing. She placed her hands on his chest shaking him trying to get him to wake up not exactly sure what she had just done to him.. \n\n\"Jonathan?\" She said shaking him harder. \"Honey wake up, Wake up!\"\n\nJen was starting to worry a little. She had no idea what had happened or what she had done to him and was in a panic trying to wake him up. \n\n\"Jonathan, Wake up!\" She yelled before finally slapping him across the face.\"\n\nHe took a deep breath but was barely conscious. He struggled to breath and was coughing a little like something wasn't right. He finally looked up at her seeing her eye's looking more like the woman he married and placed his hand on her face.\n\n\"Jen........... Is that you?.\" He said before dropping his hand and passing out again.\n\nHe was still breathing but still didn't seem right. She tried to wake him again but with no luck. She was so worried she ended up calling an ambulance to take him to the hospital concerned for his health. She was still very confused and freaked and had no idea what exactly had happened or why. The only thing that mattered to her now was making sure he was alright.\n\n----------------------\n\n\"Did it work?\" Rick asked as Victoria was lying in the bed breathing heavy covered in sweat.\n\n\"Just in time I think, right before he blew his load I disconnected so she didn't absorb anything except a ton of cum.\"\n\n\"Okay good, what went wrong?\"\n\n\"I don't know, could have been something simple like a single mispronounced word.\"\n\n\"Well that was a close one. maybe too close.\"\n\n\"I'm sorry.\" She said looking really concerned all of a sudden feeling she had disappointed him.\n\n\"It's alright, we just have to learn to be more careful.\" He said putting his arms around her to comfort her.\n\n\"I'm trying Rick, I really am.\"\n\n\"I know you are, it's one of the things I love about you.\"\n\n\"Really?\"\n\n\"Vic I can't help but be turned on by the carefree attitude of what you are, sometimes I just want to give in to it myself.\"\n\n\"It's so tempting isn't it?\"\n\n\"Yeah, even you putting that spell on Jennifer making her seduce her husband like that luring him in just to drain the life from him, I mean why would he suspect anything from his wife? I don't know why but it got me so turned on.\"\n\n\"I know, it's just so........... Kinky isn't it?\"\n\n\"I know you struggle because I do to sometimes as well. Honestly there are moments I want to see you break free and become the Succubus Goddess I know you are but I'm afraid of that version of you, and If I let you succumb to that I don't know how long I would last before I have into it too.\"\n\n\"Rick, I want you to know something. No matter what I become I will always love you.\"\n\n\"How do you know?\"\n\n\"Because I feel it, even when I let go and give in a little my feelings for you don't change. If I do turn and become the Goddess you described me ass I would still be right by your side, forever.\"\n\n\"I love you so much!\"\n\n\"And I you. No matter what happens I am yours, weather I'm your girlfriend struggling with my humanity or lose control and become a demonic sexual goddess, I will still be your demonic sexual goddess.\"\n\n------------------------\n\nHours later inside an apartment building a few miles from Rick and Victoria's house on the edge of the city was a man sound asleep after a horrible day. His name was Gary and he had lost his job, his girlfriend and wasn't going to have a place to live pretty soon. He had no family and few friends so he wasn't sure what he was going to do. He wasn't sure how but he had fallen asleep which was hard with everything happening in his head. He didn't realize he was dreaming at the time as he saw a bright blue light shining through his window.\n\nHe got out of bed looking out over the city as the light showed every detail when he saw something frightening. A large winged creature began to speed towards his window with glowing red eyes like it wanted to kill him. He closed his eyes and fell backwards expecting something to smash through the glass but nothing happened. He pulled himself up trying to regain his balance wondering what he had just seen. It had freaked him out a little but he began to assume he was dreaming and decided to go back to bed. When he turned around he let out a gasp as someone was lying in the bed. At first glance it looked like Tina his ex girlfriend.\n\n\"Tina? Is that you?\"\n\n\"It is baby, I missed you.\" She said as her face was covered by shadow.\n\n\"But I thought you didn't want to be with a jobless loser?\"\n\n\"Come here, everything is going to be alright now!\" She said taking his hand and pulling him into bed with her. \n\n\"Tina, I missed you!\"\n\n\"I know, I want you to make love to me.\"\n\n\"What really?\"\n\nShe slid off her nighty and pulled him in for a kiss. He wasn't sure how but he was suddenly naked as well as she began to lick the tip of his cock getting him hard as hee hand gentlt caressed his balls makingnhis whole body shiver as she pleased him. She had never been this giving during sex before but he was not complaining as he enjoyed the sensation. His cock stiffened as her mouth wrapped around it sucking on it with more force than he was used to.\n\n\"Holy shit Tina, this feels incredible!\"\n\n\"Good, I want you to feel good.\" She said releasing his cock before gently pushing him down on to the bed and climbing on top of him.\n\nHe felt his cock slip inside her as her pussy was warm and tight around his member. She grabbed his hands and placed them on her breasts letting him rub her nipples as she slowly and gently moved her hips. Everything felt so good as Gary lyed there and enjoyed the sensation. They had sex in the past but something just felt better this time. He began to wonder if he was dreaming but it didn't matter.\n\nHer moans grew louder and louder as she bounced on his member trying to milk him for everything he was worth. His cock was seconds away from erupting as he began to feel a little strange. The pleasure grew and grew as his body began to feel warm and tingle a little.\n\n\"Tina..... this feels so....... I can't...... I can't hold on much......\"\n\n\"Then don't, just relax and enjoy.\" \n\nGary began to feel like something was wrong. Tina was never this generous in the bedroom or with anything for that matter. She was actually kind of a controlling bitch who only seemed to want a boyfriend not realing caring who he was as long as he was bringing in cash for her to spend.\n\n\"Tina, why are you here?\" He said suddenly distracted from what was happening.\n\n\"Just enjoy yourself baby!\" \n\n\"No something........ oh god...... something is wrong here.\"\n\n\"I said sit back and relax! She said as her eye's suddenly turned red.\n\n\"Woah, what the hell is happening?\" He said starting to panic at what he was seeing.\n\n\"Haha! It's too late, you're mine!\" She said as her wings and horns began to sprout.\n\nGary's cock felt amazing but he was suddenly frightened for his life. He tried to get out from under her but she was too strong and it was no use. He was almost ready to cum when he began slapping himself in the face trying to wake himself up. All he could hear was Tina or whatever this creature was laughing as she continued to milk his cock. He felt something strange as he looked down and saw what appeared to be a tail wrapping around his balls which felt amazing as it squeezed but he still tried to escape. \n\nWith one last hard slap he looked around the room and he was alone. The light coming through the window seemed normal and he was fully clothed with the blanket up over him.\n\n\"It was just a dream, holy shit, it was just a dream.\" He said to himself trying to catch his breath.\n\nMoments later he heard something and looked up. He looked all over but there was nobody there but he could have sworn he still heard that laugh again. He tried to calm himself down but then it got even louder like it was happening in his mind.\n\n\"What the fuck is happening?\" He said to himself.\n\nGary felt something strange as he looked down and saw his blanket being pulled off his bed. He wasn't sure what was happening but his sleeping pants suddenly slid off of him flying across the room leaving him lying there in his boxers.\n\n\"You fool, you thing waking up makes you any safer from me?\" The woman's voice said again as his boxer shorts suddenly ripped open leaving him there with his cock still fully erect.\n\n\"What the fuck!\" \n\nHis cock began to bob before the skin on it started moving on it's own sliding up and down like it had a mind of it's own. He was still extremely turned on from the dream so it didn't take much before the pleasure built in his cock while the laughter continued in his head.\n\n\"Oh fuck, oh god! What are you doing to me!\" He said as the pleasure grew faster than before.\n\nHis cock finally erupted squirting what felt like gallons of semen into the air before splashing back down staining the bed and shooting everywhere like it was possessed. He felt a warm feeling swirling around inside him that also seemed to be flowing down and out through his cock. A strange purple light began flow from the tip of his cock into the air to his shock not sure what was happening. The pleasure was so intense it almost didn't matter to him as his heart began to slow. He suddenly didn't care about his Ex or anything else for that matter as everything went dark around him and his life was over while his cock still twitched for a few moments. His body laid there with a smile on it's face but Gary was no more.\n\n----------------------------------------------------------------------------\n\nBack at home Victoria moaned in her sleep enjoying the sensation as she absorbed all of Gary's life force into herself before she awoke feeling satisfied. She looked over at Rick who was still asleep next her and she smiled to herself as she leaned over and kissed him on his cheek. she threw her arm around him getting comfortable but also feeling a little guilty at what she had just done. She knew she could never tell him about this which made her feel even more guilty because she did love him, more than life itself but she knew he refused to take a life and she knew she had to find another way to get enough energy to slake her lust and keep them both alive, but for now this was the only way.\n\n\"Rest my love,\" she said stroking his hair as he slept. \"I hope one day you can forgive me for what I have to do, but just know I do this for you.\""
    ],
    "authorname": "maestro84",
    "tags": [
        "wife",
        "succubus",
        "spell",
        "corruption",
        "supernatural",
        "loving wife",
        "absorb energy",
        "incubus",
        "blow job",
        "hex"
    ],
    "category": "Erotic Horror",
    "url": "https://www.literotica.com/s/victoria-pt-02-the-housewife-hex"
}