{
    "title": "Mira Ch. 12",
    "pages": [
        "Darius wrapped his cloak around his shoulders and tried to ignore the unnatural cold. Strange weather, difficult terrain, and wild animals plagued the march from Noviodunum since they started the trek to the Circle. The men were becoming steadily uneasy and young Marcus Novanus was beginning to falter in his resolve.\n\nChildren. The fool boy will ruin this for me. It's been too long and too much hard work. Darius was in the middle of working out a plan for disposing of Novanus and managing to keep the footsoldiers for his own purposes, when an alarm cry went out. \"What now,\" Darius snarled as he turned and stalked back into camp. He interrupted the urgent conversation between Marcus and a guard.\n\n\"How many?\" Marcus only glanced at Darius, as he approached.\n\n\"Six, milord,\" the guard said, rubbing his head. There was a bloody gash along his forehead.\n\n\"Were we attacked,\" Darius asked with concern, looking around for further commotion or at least the person who had bloodied the guard.\n\nMarcus turned on Darius with an authoritative tone that could only come from a child of Tiberius. \"You were not spoken too, druid.\" After the reprimand, Marcus returned his attention to the guard. \"Why,\" he growled angrily at the man.\n\n\"The men are uneasy milord,\" he replied nervously. \"They say that the curses which have followed us from Noviodunum will only worsen if we continue. They say it's not worth the little pay they are given. There is fear of what we will face when we reach the Circle. I fear more will run if our luck does not appear to shift soon.\"\n\nMarcus began pacing. He didn't know what to do. He was having a hard enough time controlling the troops in Noviodunum. Now men were deserting him. Father would never allow this. They wouldn't even consider running from Tiberius.  \n\nDarius could see that Marcus was losing his self control, possibly his mind. Not only that but they boy was becoming obstinate and difficult to control. His brothers were too young to be of use and had been left at home. If things continued in this vein then he would have no army left when they reached the Circle. I wonder how much of the strange occurrences were arranged for us by the Circle. The things they are capable of and yet they force our people to live in squalor, contemplating nature and stars. When I control the Circle&hellip; Darius broke himself from his vengeful musings and managed to persuade Marcus to retire for the evening.\n\nOnce inside the large lavish tent Darius approached a heavy wooden table in the center of the main entrance. Pouring out wine for himself and Marcus, he waited patiently for the boy to ask his advice. He always did. Darius tapped his ring impatiently on the rim of Marcus' cup, watching the surface of the warm red liquid ripple and the brown dust disappear into the drink.\n\nAs Darius tipped his own cup to his lips, Marcus stepped up to the table and grabbed the other cup for himself. \"So what do you suggest druid,\" the boy said snidely, tipping the cup up and downing half the wine in one swallow. \"The men desert my cause and I admit that the circumstances of this march have been unnerving. The animals of the forest attack randomly and without warning. The night is unseasonably cold. Trees and brush seem to bar our path. Men grow ill with no cause.\" Marcus finished the rest of the wine in his cup and stepped to the table to pour himself another. \"Even an unsuperstitious man would see this march as cursed. What do your fellows do to us and how do we stop it? Or are you as useless as my father used to say?\"\n\nDarius had been losing his patience steadily as Marcus had become increasingly insulting and demanding. \"Firstly, milord,\" Darius answered, glaring at the boy, \"your father never kept any man around who he did not see as worth something. Secondly, the animals may attack because of the cold, the cold may be because a local village paid no sacrifice as proper to the correct Gods, once a man believes he is haunted then all manner of things can be frightening, including plants overwhelming an unkempt path, and men in new places grow ill. Your father would have been able to offer such explanations to these men and control their fear before they allowed their imaginations to run them off.\" Darius sipped his wine, staring into the boy's eyes. \"Unfortunately for both of us, you are too young and inexperienced to think of such things.\"\n\nMarcus felt the wine seeping into his mind more quickly than usual. Darius' droning voice slipped to the back of his mind and he stumbled toward his large chair. The room was already spinning. Suddenly Darius' face was directly in front of his own.\n\n\"That is why you have forced me to take the situation in hand. One way or another I need to reach the Circle with enough troops to take control. You couldn't have been just a nice compliant young man could you?\"\n\n\"Compliant young man,\" Marcus echoed hollowly.\n\nDarius smiled. \"That'll do. Go to bed, get some sleep. We have a speech for the morning march. Then I want to gain some ground. They have to know I'm coming by now.\"\n\nWithout a word of protest Marcus stumbled to his feet and followed Darius' command. \"I should have done that to him months ago,\" Darius growled and then left the tent.\n\nAt the main entrance he stopped and leaned toward the guard. \"He doesn't wish to be disturbed. Lord Novanus wants to sleep until morning. Summon me when he awakes.\" The guard nodded and Darius walked away from the large tent to go and find his. \n\n<p align=\"center\">* * * *</p>\n\nAris realized her wrong turn when the rough hewn cave walls went on too long with no promise of turning into carved stone. \"Mira said it only took a few hours of walking for her to find the right tunnels. I think I've been walking at least that long. And there's no closet with a lantern.\" The sound of her whispers echoing in the darkness offered little comfort.\n\nCollapsing against a cold damp wall, sharp stone bit into her shoulder. Aris ignored the pain and wrapped her arms around her shivering frame. It didn't really matter how much Mira had explained, Aris was cold, hungry, thirsty, and terrified. \"This must be what it's like to be blind,\" she whimpered.\n\nFirst she considered trying to fall asleep, like Mira had. \"That would make time pass more quickly.\" But every little sound in the darkness drew her attention. \"That was probably just a mouse,\" she whispered at a shuffling near her feet. \"That was just a bat,\" she cried at a shrieking noise echoing in the black. Aris turned sharply to look down the cave tunnel in the direction she thought she came from. \"Footsteps,\" she asked into the darkness. Aris strained to stare into the emptiness, trying desperately to see something, anything. Suddenly she realized that he may be coming to get her.\n\nTurning Aris began running. She only managed a few steps before tripping on something on the floor and sprawling on ground. \"Hello,\" she barely managed to squeak out. Scrapping her hands on the ground, Aris scrambled back up against the wall, tears streaming down her cheeks. \"Please,\" she whimpered. \"Lord Tiernay?\"<br/>\n\nRillan nearly left her there. I don't know what I expected. As if anyone could be capable of instilling Mira's soul in one of these sacrifices. Even Mira. No amount of training will change what they are.\n\nRillan knelt next to the girl and stared at her, knowing that she had no idea how close he was. For the first time in his existence he considered putting her out of her misery without waiting for permission. I don't have time for this. I need to get out and inspect the so called army coming for me. To do that I have to feed. Somewhere in the back of Rillan's mind was a futile hope that the army may actually be go enough to end all this.\n\nRillan stared into the girl's wide, tearful eyes with disgust. Uncertain as to whether the annoyance he felt was for himself or the new girl, Rillan forced the beast down and reached out for the girl.\n\nA terror-filled scream like nothing Rillan had ever heard echoed in his ears. \"By all the Gods, girl,\" Rillan snarled, taking a several steps back from her and covering his ears. \n\nAris scrambled to her feet, feeling along the wall.\n\n\"Calm down girl,\" Rillan growled harshly.\n\nFlinching at the sound of his voice, Aris considered her options for running. \n\nRillan could see the frantic look on the girl's face and the desperate way she was cringing away from him. \"Don't be stupid girl. Come with me. There's food and rest. We'll deal with your inadequate training when you've had some time to think clearly.\"\n\nMention of food seemed to register with the girl. Rillan waited for her to gain some composure before reaching out for her again. She didn't say a word as he walked her down the halls toward the main tunnels. This is why they get left in the labyrinth for days, groused angrily on the way back to his rooms. \n\n<p align=\"center\">* * * *</p>\n\nMira stared sadly at the pile of flowers that the girls were gathering and weaving into wreaths and garland to decorate the stone circle for the ceremony. Helen pointed in different directions and girls went running to take care of her orders. Mira's head was spinning. Helen had proven to be a most efficient planner. From the flowers to the clothing, even the handfasting cord.\n\nHolding out the cord for Mira to see, Helen waited for the lavish thanks and praise that she believed she deserved. The cord was woven from pearl white silk thread and speckled with tiny flowers and ivy. Helen beamed with pride. The cord was exactly what she wanted when she finally chose to be handfasted. She couldn't imagine that any woman would not see the beauty in the simple cord.\n\n\"Thank you Helen,\" Mira said softly. \"It's beautiful. If you hadn't taken this all in hand I don't know that it would have been accomplished so quickly.\" Mira's voice trailed off as she spoke. Standing, shakily turning the cord over and over in her hands Mira began to cry.\n\nHelen smiled with pride, believing that the tears were of appreciation. She leaned in and hugged Mira gently. \"I know how difficult it has been for you to come back to us after what happened. Even if Liam hadn't asked me to help you I would have wanted to.\"\n\nPulling away from Helen as gently as she could, so that it wouldn't be misinterpreted as an insult, Mira nodded, wiped the tears from her cheeks and headed back to the round house and her bedroom. At least there, with the door closed, she could get some peace. All she wanted was sleep. \n\nAt this rate we'll be ready for the ceremony in a matter of days, she thought. The idea made her sick to her stomach. Closing the door behind her, Mira began sobbing. She threw herself down on her small bed, wrapped her blankets around herself, and closed her eyes. Sleep was long in coming, but a welcome reprieve to her thoughts.\n\n<p align=\"center\">* * * *</p>\n\nRillan considered his next step carefully. He could tell, after the centuries of dealing with sacrifices, that this one was going to take a lot of coddling and he simply didn't have the patience or ability to wait for her to come to him on her own terms. \n\nStanding in the shadows of her doorway, he watched her sitting at the dressing table brushing her hair. She had been brushing for over an hour; sitting, staring in the mirror. Her manor and demeanor annoyed Rillan and reminded him of why he had taken to doing things as he did. Closing his eyes he allowed himself the torment of imagining Mira waiting for him, smiling at him, and wanting him.\n\nThoroughly disgusted with himself, Rillan stepped out of the shadows. Catching site of Rillan in her mirror, Aris dropped her brush and gasped. Aris whirled around to face Rillan abject terror streaking her features.\n\n\"Take off your clothes and lie down on the bed girl,\" Rillan growled callously.\n\nAris shook her head and backed up into the dressing table. \"M&mdash;Mira said you would wait until I was ready,\" she blurted.\n\n\"I would. If I had time. Unfortunately I have an assignment. I've waited as long as I'm able,\" he growled. Frustrated, Rillan let his better half through, in the hopes of reassuring the girl. \"I'll make it as short as possible. Just do as you're told,\" he added in a softer tone.\n\nThe change in his approach appeared to comfort Aris some. She reluctantly began to undress. A blush started in her cheeks and spread across her entire body. Rillan was far from immune to the sight of the beautiful young girl standing naked in front of him. His eyes caressed her flesh in a way he knew his hands could not. \n\nRillan took in her brown hair and dark blue eyes. Her flawless pale skin was deepening to a dark pink as he looked her over. \"Lay down on the bed,\" he said gently.\n\nTimidly Aris moved over to the bed and crawled to the middle. The basest side of Rillan's animalistic tendencies always enjoyed watching them crawl across the bed. He considered the curve of her back, her soft thighs, and the innocent way her sex peeked from between her legs as she moved to the middle of the bed. Just like all the others, when she realized what he was looking at she sat down and lie back, closed her eyes and waited in embarrassment for what would happen next.\n\nRillan pulled his shirt off and tossed it across the chair. He didn't know how far he was going to take this, but he hated cleaning blood off his clothes. Kneeling on the bed next to the naked girl he realized that he had never asked her name. Staring down into her fear marred faced he knew that he didn't actually care what it was.\n\nAris felt the weight on the bed and lay trembling in anticipation of what he would do to her. She kept telling herself, Mira said to keep your eyes closed. Don't open your eyes and just wait. He'll make the pain worth it. He's a good man. He only needs sympathy. \n\nThe smell of fear assailed Rillan's nostrils, he could hear her heart racing in her chest, her breathing was raged and choppy. Stupid girl is going to hyperventilate. The human portion of his soul hating the smell of fear and knowing that he was the cause, retreated and the vampire stole control of Rillan's body. Black bled from his pupils until it filled his eyes sockets. His skin pulled taught to his features, paper thin and pasty white. His lips pulled back from his teeth causing the needle filled mouth to illustrate the vicious predator that lie within. Leaning down what little humanity that was left in his control at that moment touched her gently, in an attempt to warn her that he was going to start.\n\nWith the touch of his hand on her shoulder, all thoughts in Aris' mind went blank. Her eyes flew open and she stared wide-eyed into the face of the vampire about to feed on her. Tears welled in her eyes and spilled down her cheeks. The odor of fear became overwhelming and that was joined with the reek of ammonia. She peed herself, he thought angrily. All sympathy fled and Rillan grabbed the girl by her shoulders.\n\n\"You want something to fear? I can easily oblige,\" the vampire growled. Holding her squirming body down, Rillan reared back, giving Aris a full view of the mouth that was about to rip her shoulder apart. Bending down, Rillan bit hard on the join between her neck and her shoulder.\n\nAris shrieked. Pain seared through her body, followed by an intense burning. \"Please,\" she begged, in between breaths. The protests and screaming only seemed to spur him on. This isn't what Mira said it would be. This isn't what Mira said it would be. This isn't what Mira said it would be. Aris' mind whirled with fear and confusion until finally it went blank.\n\nRillan finished feeding and stood up. Looking down at the girl, he threw a blanket over her body, grabbed his shirt and stomped off down the hall. He had duties to perform, before he left.\n\nDressing to leave for the approaching army, Rillan stared at the two small packages on the chest at the foot of his bed. He had been debating when he should give them to her. In case I don't come back from this, he thought. Picking up the two small packages, he shoved them into his pockets and strode down the hall. He couldn't decide if the idea of not coming back was comforting or disturbing.\n\nThe halls echoed with is footsteps as he made his way out: Mira's room, the rooms he had left the new girl in, the library and study. As he left the caves, no wind stirred. There were no clouds. The moon shone brightly enough to give the feel of day to Rillan who was so used to the total black of his caves. The moonlight made it an easy thing for the vampire to slip through the ancient forest, into the small druid town, and to the round house that had forever been home to the sacrifices.\n\nRillan was sure if Mira was in the round house, but he figured it was the best place to start. If he had to search ever house in the small town he would find her before he left. Fortunately his guess had paid off. He felt as though he was drawn to her. Circling the round house he peered into each of the small windows until a figure in one of the beds caught his attention. \n\nRillan knew Mira's frame, even covered in blankets. Slipping in through the window, Rillan stood next to her bed, staring down at her tear streaked face, wondering what had hurt her and caused her to cry herself to sleep. All he wanted was to find the source of her pain and destroy it. He felt so helpless standing there, looking down at her, and knowing there was truly nothing he could do to fix what had hurt her. \n\nAt length he tore his eyes from her quiet form and looked around for a place to leave the packages. The room she slept in was small. It was made even smaller by the piles of ceremonial decorations strewn about. In one corner, carefully folded and draped across a small chair, Rillan spied an intricately embroidered chemise and skirt. Walking over to the clothing he felt as if his chest had been ripped open and his heart torn out. A handfasting cord lay across the top of the pile of clothing.\n\nClosing his eyes Rillan took several deep breaths. This is why you sent her back, he told himself. You knew that she would be wanted. She'll be able to have children, live in the sun, and be happy. Rillan opened his eyes, half hoping that when he did the clothing and especially the cord would have vanished. But there they were, gleaming in the moonlight.\n\nReaching into his pockets he withdrew the two carefully wrapped packages. He placed them atop of the cord. Before he left, he walked back over to Mira's sleeping form. Bending down he placed a small kiss on her lips, smelled her hair, and whispered softly, \"All the blessings of the Gods be on you, sweet one.\"\n\nMira's eyes shot open. Touching her lips, she just couldn't believe that it was a dream. \"Rillan?\" She sat up in bed and looked around the room, her eyes examining the shadows for any sign of him. Nothing. As Mira lay back down and closed her eyes, more tears squeezed out from beneath the lids. I could have sworn I heard him. I must be going insane, she thought. It was several hours of laying in bed with her eyes squeezed closed and her thoughts churning, before she fell fitfully back to sleep.\n\n********************\n\nTake a second and vote!\n\nMira's almost done, so that means I'll be going back to writing Leader of the Pack soon. The first one was published in e-book over the summer and will soon be available in print! Yay! I plan to publish the revised version of Mira as well. So for all the people who have been asking me about the various plot issues and chapter repetitions&hellip; All the revisions will be in the published version. As I've said before, I only post first drafts on Lit. Send me a feedback if you want more details and can't find the info yourselves. It should all be posted on my web page. Thanks for all the support! ",
        "secret"
    ],
    "authorname": "secretme",
    "tags": [
        "druid",
        "vampire",
        "vampyre"
    ],
    "category": "Erotic Horror",
    "url": "https://www.literotica.com/s/mira-ch-12"
}