{
    "title": "The Witch's Dollhouse Pt. 02",
    "pages": [
        "When he woke up Philip just stared at the ceiling for a few minutes. His mind was still groggy and his body was reluctant to make any kind of move.\n\nHe was completely naked, his clothes had vanished and yet he felt cleaner compared how he was when trapped under a horde of horny living dolls.\n\nMaybe they bathed him before leaving him? That is, if there was any trace of sanity left in them.\n\nPhil was doing his best to keep his eyes open as he lay in the bed, even blinking flashed images of those glazed eyes drowning in lust, the twisting bodies in their carnal dance atop his cock, and the mother and daughter from the picture that old crone showed him.\n\nThe old crone...what did she say again? Be on your guard and leave as soon as possible.\n\nGreat advice, but there was something else. A brief worry fluttered into his thoughts and lingered just beyond his reach. Something the crone said that had confused him at the time but was beginning to make sense as he lay there numb and dazed.\n\nAh right.\n\nIf you're the one she has chosen...\n\nShe?\n\nA flash of purple invaded his mind, the memory of a spellbinding gaze cast from violet eyes.\n\nThe girl in the attic was by far the most captivating enigma the mansion had revealed to Philip and even now he couldn't understand why.\n\nWhat little glimpse he caught of her was brief as he would pass out almost immediately afterwards and yet his brain refused to write her off as a simple mirage created from an exhausted state.\n\nHe rubbed his eyes and sat up in the bed, regardless of how many mysteries surrounded the house, it was clear that he was in danger and needed to escape.\n\nAs he looked around the room his eyes rested on a figure standing sentinel in the corner of the room. He didn't flinch nor did he startle but a creeping unease settled over him as he watched it, goosebumps broke out over his body, he broke into a silent sweat and he felt his dick harden as he remembered the things the doll and it's kind did to him before he fell unconscious from exhaustion.\n\nThe doll was like the others of it's kind, pale skinned, slender and beautiful. The only thing separating each doll from each other were their hair styles and colour as well as their eyes. \n\nThey were practically indistinguishable from a regular human if not for the visible ball joints on it's elbows, knees and waist.\n\nThough it wouldn't have mattered since they must have been human at one point.\n\nPhil remembered the two dolls that joined in his reverse rape that bore a tragic resemblance to the mother and daughter that recently went missing after entering this cursed placed.\n\nNormally Phil felt he should have written it off as a coincidence, or that whoever was responsible was simply pulling a macabre joke by making the dolls' likeness equal to the missing victims.\n\nHe felt like it would have been natural to do so, if only to deny the reality of a strange, absurd world he was currently trapped in.\n\nBut a part of himself knew, not guessed or assumed; knew, that these dolls were humans. \n\nThat this is the fate of all women who come into this home.\n\nHe approached the doll, a young lady with light brown hair that exploded into curls and small hazel eyes, freckles surprisingly dotted her cheeks and across her breasts.\n\nShe was holding a small card, the front had written on it in elegant font;\n\nTwo more attempts remain, good luck.\n\nPhil felt his cheeks flush, was that orgy his first failure? What counted as a failure? The act of being caught or the act of falling unconscious?\n\nHe flipped the card around to reveal another message on the back;\n\nJourney to the basement and kiss the bride.\n\nOn the bright side the instructions were simplistic, though that only served to fuel his nerves more.\n\nSurely there was a trap waiting for him, another group of dolls ready to molest him or something worse?\n\nPhil left the room and walked down the corridor, though he was the only person present in the house he felt rather uncomfortable walking in the nude so openly but couldn't find an alternative way to dress without hindering his movement should he need to make an escape.\n\nHe passed more dolls on his way to the foyer staircase but none of them appeared to wake up or attack him. \n\nPresumably, the dolls would leave him alone until he had the key but it was better to remain cautious regardless.\n\nHe made it to the basement door without incident, or rather what he assumed was the basement door.\n\nIt was an iron door he saw when he first came into the manor. It was unlocked but heavy, and it swung inward revealing stone steps that descended into the gloom, a stuffy, oppressive atmosphere loomed over the staircase.\n\nPhil left the door open and descended, using the light to help guide him down the steps as much as possible.\n\nThe stone was deathly cold against his bare feet, each step sent shivers up his body as he walked practically blind into the yawning abyss.\n\nDeeper and deeper he went, beyond the guardian gaze of the light until he reached yet another heavy iron door.\n\nHe pushed it open, the metal scraping unbearably loud against the cobbles revealing another dark room abandoned by light.\n\nPhilip paused for a moment before returning to the foyer. After looking around he found the best light source he could; a single wax candle unused and ready and a box of matches before returning to the darkness armed with a feeble flame to help him see.\n\nThe room was expansive, it was impossible to tell in the gloom but the room could have easily stretched the entire expanse of the mansion for all he knew.\n\nBecause for all intents and purposes it looked like an endless dark void of nothingness. But voids are empty and this room wasn't.\n\nPhilip never considered himself a timid or nervous boy but after his experience with them before, he practically screamed when he bumped into another doll in the dark.\n\nAfter a brief panic attack which almost had him drop the candle and his only source of light, Phil a few deep breaths and, steeling himself for his nervous journey, pushed on into the darkness.\n\nThe doll he saw had the same physical properties as the previous dolls he encountered, the same fair skin, pupil-less eyes and ball-joint connectors between their limbs and their torsos, however certain physical properties were more than obviously tweaked.\n\nFor one thing, the doll was much larger than the previous ones, standing 7-8 feet tall and towering over Philip. Also, her breasts and ass had received a cartoonish boost in mass too, juxtaposed to the slender waist and delicate features, the sight was too absurd for words, like one of those tacky porn artists had brought their oversized bimbos to life, he couldn't help but laugh at what he was gawping at.\n\nBut that laugh died in his mouth as quickly as it was summoned. He knew exactly what these dolls were made for and the level of assertiveness they used to dominate their prey, a behemoth like this would would drain him in a far more rapacious manner than the previous inhabitants showed.\n\nPhil also took note of several other things; the first being was that there were many more dolls of equally comical proportions lining the entire walls of the room, their lifeless stares and glassy eyes added a hauntingly sombre tone to the infinite silence of the basement.\n\nA tone enhanced when Philip began lighting the wall mounted lanterns to get a more stable light source in the gloom and noticed that each doll was chained up to the wall.\n\nBlack iron chains coiled from ringlets bolted into the cobble walls and fastened themselves to rusty anklets on each of the enlarged dolls. In the light of the dancing flames, it was as if the chains were swallowing the light shining onto them instead of reflecting the glow back.\n\nThe other thing that set them apart from the upstairs dolls was that unlike them, these dolls all looked the same.\n\nThe same raven black hair, falling low to their calves and melding into the darkness around them.\n\nThe same dark blue eyes like a bottomless ocean that drew you into it's unfathomable depths with the intention of drowning you.\n\nThe same physique, the same face, they were all carbon copies of one another.\n\nAnd that they each looked far too familiar for his comfort, every time he saw them his chest tightened and his body flushed with heat. He could feel his body break out into a cold sweat like it was remembering something his mind was ignoring.\n\nPhil traversed the walls of the basement, taking care not to stray to close to the dolls in case they \"activated\" and only got close to light any lanterns he found.\n\nEventually Phil made a complete circuit and found, to his annoyance, that not a single doll gave any indication that it was the \"bride\" he was searching for.\n\nPhil then switched his attention to the still unlit centre of the cold room, the shy flames around the walls struggled to reach the no man's land shrouded in a blanket of darkness but every so often, they would offer a glimpse at a large shape that sat patiently in the gloom.\n\nIt was either a structure that would offer another clue or, more likely, another doll.\n\nPhil made his way back to the door he came from and opened it slightly, enough for his skinny frame to slip through and dissuade any oversized pursuers from following if he needed to make a quick break for it.\n\nThen, steeling his nerves, the young fool plunged into the obscure void.\n\nHe walked slow and quietly, afraid of bumping into something in the dark and of the dolls' reaction to any loud noise, he still had no idea what exactly caused them to awaken specifically last time and wasn't intending to chance fate.\n\nAs he got closer, his dying candle managed to pick out a jagged and thin entity dangling from the ceiling to the ground before looping back up to the unseen heavens like a lifeless serpent.\n\nPhil reached out and grabbed the chain, the iron colder than the touch of death itself, there was no knowing the outcome of pulling the chain and there's was no reason to suspect the house conformed to a natural sense of logic or architecture. \n\nIf humans can be turned into dolls within this mansion then anything could potentially be possible.\n\nThat being said, his candle was ill effective and the lanterns were too far to make for any useful source of illumination so there must have been at least one other source of light for the middle ground.\n\nPhil took the chance and pulled on the chain, ready to bolt if the shapes bound to the wall began to shift in any suspicious manner.\n\nThe heavy chain made lazy progress and complained ingloriously loud but Phil didn't need to pull it much, just enough to confirm the machination's meaning.\n\nNo sooner did he begin did a blade of light pierce the darkness next to him, it's radiant aura was small but dispelled much of the surrounding gloom regardless. \n\nPhil took a brief moment to analyse his surroundings, so far the dolls weren't stirring but who knew how long it would be before that changed.\n\nTaking a few deep breaths, Phil pulled the chain as hard as he could, bracing himself not only against the weight the chain seemed to carry but against the fear that the dolls would attack at any moment. He focused on the light that was growing in size has he worked and not on the dancing shadows that surrounded him, nor on the ceaseless clamour of the chains and cogs above him, creaking on like a siren to rouse the sleeping sentinels from their daze and urge them onto their meal.\n\nPhil didn't realize how badly his muscles were aching until the chain stopped budging.\n\nPhil reflexively relaxed his grip for a moment only to tighten it again when the iron links fled from his grasp, swallowing the light with them.\n\nLooking around, Phil found an anchor point bolted to the floor and secured the chain as tight as he could. When he determined that the chain wasn't budging any time soon and that he wasn't in danger as of yet, he turned his focus to the shaft of light.\n\nIt came from a grate in the basement's ceiling, a heavenly eye peering into the abyss, becoming a shaft that extended up to an opening leading outside, likely to the expansive lawn in front of the estate building.\n\nHe contemplated briefly on climbing up the chain to reach the grate but wasn't particularly confident in breaking the wood and iron bars from their secure lodging.\n\nWhile the hole itself wasn't very large, the light it emitted was illuminating the whole basement, washing over the orange dim of the lanterns without competition and granting a better look at the occupants of this cobbled crypt.\n\nAt the centre of this luster, Phil managed to get a better look at what was in the middle of the room.\n\nA large circular bed, complete with red silk sheets dominated the empty space, behind it were too wooden frames in the shape of an \"X\" with a small bench inbetween carrying dubious instruments and erotic equipment.\n\nAttached to each of the frames and on the bed were three women.\n\nNot dolls, human women.\n\nThey were still breathing and there were no markings on their body to indicate they were injured but there were definitely not given any VIP treatment either.\n\nThe two women bound to the wooden frames; one was maybe as old as he was, 18 if not a little older.\n\nShe was pretty plain looking in a cute sort of way except her dark hair which had a rebellious streak of orange lining her fringe. It was a hollow attempt at looking like a rebel but it definitely set her aside from her otherwise ordinary appearance.\n\nThe other woman was definitely older by a few decades, the tell tale crows feet creasing her tanned skin spoke louder than words.\n\nShe had a well kept body, nothing olympic-like but toned enough to show how outgoing she was, maybe she had been travelling when she stumbled across this manor. \n\nBoth girls were completely naked aside from a gag fastened around each other's mouths and a pair of white panties each, both of which bulged around the crotch and anal regions and stained a dark grey with femcum, a puddle of lewd origins surrounded their restrained forms and a low hum could be heard from their nether regions.\n\nOn the table between them, Phil spotted what he expected; several sex-toys were arranged, some were unused, some, coated in slick translucent juices, had clearly been used already and judging by the empty space available, many were already employed. \n\nThere were beads and plugs, egg vibrators, nipple clamps and various other things that seemed out of place in a manor that originated a few hundred years ago.\n\nWait, how old IS this place actually?\n\nHe stifled the question when he noticed several similar looking dildos on the table, at least 7 inches each and thicker than a natural penis, they looked too detailed to be an ordinary sex toy.\n\nUpon touching the object, he found it to be disturbingly fleshy and soft, like the texture of the doll bodies; distinctly close to a human's body yet also clearly not the same.\n\nFurthermore, the base of the penis seemed to open up like a flower bud, the inside of each flap was covered in hundreds of bumpy protrusions that secreted a thick foamy nectar. God knows what that was used for but Phil put the thing down.\n\nHe pulled down the panties of the captive women as far as he could, noting the strands of pussy juice bridging flesh and fabric as he did as well as the harem of erogenous utensils lodged firmly into their lower holes, anal and vaginal.\n\nIt was easy to remove the embedded toys but there was a distressing number of them stuck deep inside, with their exit came a literal flood of orgasming nectar now that it's dam of lust-inducing torment had been removed.\n\nPhil then removed each girl's gag and gently shook them awake.\n\n\"Hey, you two! Come on get up, you're in danger here!\"\n\nThe first sleeping beauty to be roused awake was the younger girl, her eyes flickered open and she looked up, her hair was messy and unkempt and veiled her eyes.\n\nPhil brushed her hair back and looked into her eyes, trying to appear as calm as he could despite his exhilaration at finding a couple of companions in this mad house.\n\n\"Hey, it's ok.\" he whispered gently \"Everything's fine now, I'm getting you two out of here\".\n\nThe girl didn't reply, she simply stared at her saviour with glistening eyes and trembling lips. Poor girl must have been terrified.\n\n\"I'm gonna undo these bindings alright, just hang on.\"\n\nThe girl mumbled something under her breath that he didn't quite catch.\n\n\"I'm sorry what did you say?\"\n\n\"...ed...k\"\n\nPhil leaned in closer, his ear next to the scared girl's mouth, her voices was a sensual whisper at this range.\n\n\"I need cock\"\n\nPhilip frowned, processing her words and felt a wet presence crawl into his ear.\n\nHe jumped back at the touch of her tongue, noting her eyes were now hazy and filled with a certain hunger while her once shy lips were now puckered, her tongue protruding from the opening with a veil of saliva seeping out.\n\n\"GIVE ME YOUR COCK MISTER!!\"\n\nPhil backed up into the second girl, who introduced herself by sliding her hips on his back and nibbling on his neck.\n\nPhi jumped out of her reach and watched the two victims, broken from their torment in the manor, thrash about, struggling against their bonds and writhing in an attempt to satisfy whatever itch they felt beneath.\n\nTheir faces contorted into several sensual expressions focused solely on the man in front of them, their lips pouted and smacked together in whatever seductive manner they could before regressing into a feral bout of sticking their tongues out and drooling all over themselves, all the while screaming demands and coercions for their prey to come to them.\n\n\"FEED ME YOUR DICK!!\"\n\n\"Please mister, just for a little bit!\" \n\n\"Make me feel like a woman!\"\n\n\"It won't stop itching! Please, FUCK ME LIKE A WHORE!!\"\n\n\"I want to make you scream for more\"\n\n\"Don't you dare walk away!\"\n\nPhil tried to get the gags back on but every time he ought it close, they snapped at him or knocked it away, so he put up with their screams for the moment.\n\nLastly he turned his attention to the reason he was down here.\n\nThere was one other woman on the bed, dressed in the honest white of a bride, she looked like a beautiful princess as she slept in her gown, untouched and unsoiled.\n\nHer fair skin, blonde curls and velvet lips accentuated her elegance, she would have looked like the fair lady in any fairy tale if it weren't for the modifications to her dress.\n\nThe dress' skirt had been opened at the front like a showgirl's, revealing the scandalous yet innocent white lingerie beneath, her upper body was covered by a tight corset with a few strings undone and a black chocker with a padlock ornament.\n\nShe looked like a newly wed trying to entice her husband on their first night together, Phil wasn't sure if the modified dress was added for him or if it's what she was wearing when she was captured.\n\nLooking closer, Phil noticed that a key was inserted in the padlock, it resembled the key to the mansion itself. Was this what he was looking for then? Could it really be that easy?\n\nPhil thought about waking the girl up but not only was she the only one fully clothed (well, kind of) she wasn't bound up even slightly.\n\nPlus looking up he could see the two other victims of the dolls hurling abusive threats and sensuous promises in equal measure.\n\nFool me once, shame on me. Fool me twice? Oh hell no.\n\nPhil got on the bed and took the key from it's sheath, realizing that if he was correct earlier then now would be when the dolls would start to-\n\n\"I've missed you darling\"\n\nPhil looked down at the bride, her eyes were open and she wore the loving smile of an honest newlywed.\n\nWith warning bells chiming in his skull, Phil backed off with the sole intent of getting as far away as he could. He barely shifted an inch when the bride's loving expression and elegant features shifted to a slutty gaze and voluptuous grin. She interlocked her fingers behind Phil's head faster than he could react and pulled him close, ramming her tongue deep into his gullet.",
        "Startled, Phil attempted to buck her off of him but she wrapped her supple legs around his waist and tightened her grip. Cocooned by her limbs and assaulted by her french kiss, Phil was too tightly trapped to be able to offer any acceptable resistance.\n\nAny attempt at pulling away was futile, her arms were crossed firmly behind his neck, melding his face to hers as she continued her fierce kiss, the aggressive movements of her tongue were like a cat batting a defenceless mouse to and fro.\n\nPhil managed to manoeuvrer his hands in-between their bodies but lacked any leverage to dislodge his attacker. His hands drifted from the insane spouse's stomach to her chest where it found refuge on her modest mounds. Phil squeezed hard, hoping he could stimulate her into weakening her grip, but all he managed to achieve was to encourage her to act more passionately.\n\nHer screams of blissful pleasure were sent directly down Phil's throat and the taste of her breathe lingered in the space where their mouths connected.\n\nHer assertive tongue made it agonizing to breathe and the kiss was cancelled only for a second of breath before her tongue snaked back into his mouth, the fresh air they took in was shared between them and quickly turned stale and hot in the lewd atmosphere.\n\nUnable to push her away, Phil opted for a plan B and kneaded her breasts with added enthusiasm, the sweat of her body making it easier to entice her mammaries out of their corset prison.\n\nFree to the world, every touch to her breasts begot greater stimulation than before, her moans grew louder and more obscene, filling her lover's head with echoes of lust and making his head spin.\n\nBut he persevered.\n\nTaking her nipples inbetween his fingers Phil twisted and pulled as much as he could, no matter how painful he thought it would get, he needed to throw this woman off.\n\nFortunately this was more than what the lascivious lady could handle, her arms relaxed their grip on Phil's head and she broke off the kiss to indulge in her ecstasy.\n\nPhilip rose from her body, taking in gulps of air as he did so. He caught a glimpse at the other captive women watching with intense focus, their breathing erratic and heavy with lust.\n\nPhil continued to squeeze the bride's nipples for a moment longer before snatching up the key from the bedsheets. He now had what he came for and now it was time to make his exit.\n\nDisentangling himself from the woman's legs, Phil started to crawl off the bed but as he reached the edge, slender arms reached for him from behind, their fingers clawing into his hair and pulling his face into the moist panties of his assaulter.\n\n\"Not yet honey!\" She purred as her hips grinded Phil deeper into her folds. \"I still need more of you. Stay there...mmm...just a while longer...\"\n\nPhil tried to escape but her thighs gripped his skull like a vice, refusing to permit his leave until he had tasted her fully. Her pussy, sealed behind silk and lace, was slick in feminine oils and the natural perfume of perverse want pervaded the air and swamped Philip's senses. Her sweaty thighs scissoring his head, her fingers entwined in his messy locks and her drenched panties smearing his face with her scent, Phil was truly trapped in heavenly-hellish pleasure.\n\nHis nose had speared into her plump labia where it became engulfed in the odour of a harlot in heat, a somewhat surly smell that was more akin to a swamp devouring those that enter and never granting them freedom.\n\nAnd his tongue became familiar with the taste of her body as liquids secreted from the panties where they invaded Phil's mouth and mixed with his saliva, concocting a sinister flavour that had him unconsciously seek out more, suckling at the pussy and prodding it with his tongue to take in more of her essence.\n\nHowever, his conscious mind rebelled, unwilling to accept defeat when escape was so close at hand it attempted to pry the bride's legs off of his head.\n\nWhen that failed he resorted to slapping her, the crack of skin on skin reverberated throughout the stone chamber alongside a short-lived squeal. The slaps steadily increased in ferocity until the young man let loose any inhibitions against harming the bride, who was still, despite everything, a victim like himself, curling his hands into fists and pummelling the young bride.\n\nBut no matter how hard he hit her, it only seemed to entice her further; her moans increased in volume, her grip tightened and her juices became more pungent and bountiful. \n\n\"OH...oh my goooOOOH!! I never...mmmm...knew you were...Oh Yes!!...Such a beast...\"\n\nSuddenly her legs shifted and Phil was dragged further up her body, until his head was lodged firmly between her breasts.\n\nHer legs closed over him again only this time, trapping his arms as well, denying him the ability to retaliate and push her off now.\n\nThe heat of her body made it difficult to breath properly and the salty taste of sweat was present all around him.\n\nWith a giggle, his captor loosened her grip on his head which he greeted with a gulp of fresh air.\n\n\"Get off of me you bi-uurrgh!\"\n\nPhil's complaints were muffled when he was forced back down, this time into one of her breasts.\n\nHis mouth closed over one of her nipples, his tongue automatically sought out the hard nub, flicking at the erect maternal tower and drawing out innocent cries of pleasure.\n\nI can't stop! Phil thought to himself. I want to stop, but it's like my body is in auto pilot.\n\n\"So rough! More my darling. My dear sweet darling. Ravish your bride like a beast would!\"\n\nYou're not my bride! Wake up woman!\n\nWith how deep the madwoman was pressing him into her chest, communication was impossible. Every word came out like a violent mutter which seemed to tickle the vixen to no end.\n\nEvery so often she would allow Phil a moment of respite away from the pillowy tomb of her cleavage but he'd only managed to achieve a single breath before being forced back under, trapped in the valley of her sweaty tits or forced to gorge upon one or the other. Her hips, meanwhile, gyrated on his belly, slathering his torso with her pussy juices. On the lowest point of her hip movements, Phil could feel his glands meet her tender cheeks briefly before they were whisked away by blind lust, each touch more torturous than the last.\n\nIn his struggles to break free, his fervent lover apparently mistook his intentions and rolled with him until she was on top.\n\nSmiling down with a flushed face, the young girl looked more like a predator cornering it's prey than a bride accepting her dearly beloved.\n\n\"Ooooh darling you naughty boy. Now it's my turn to play the brute\".\n\nNow? What about what was happening earlier?\n\nIgnoring his inner questions, Phil tried to reason with the girl, perhaps he could still convince her to stop her madness.\n\n\"Wake up already!\" he yelled. \"I'm not your 'darling' or whatever, I don't even know you! We need to get out of here, please! I have the key! I can save us!\"\n\nThe girl looked down on her prey with a confused look, like the haze of passion had just cleared away and she was thinking clearly again.\n\nDid it work? Was that enough?\n\nPhil let out a moan, a cry of defeat, as the enslaved beauty began grinding on his shaft with renown vigour. Her seductress smirk, like a mask of fanatical desire, taunted Phil and his efforts.\n\n\"What are you talking about silly?\" She whispered into his ear, softer than the faintest breeze.\n\n\"You were always my darling, even before I knew myself. Before I came here, I was ready to marry some guy I knew since my childhood. I even thought I was keeping myself 'clean' just for him\".\n\nHer face softened into one of monomaniacal admiration. Like the mere sight of Phil's face set her heart ablaze with all the greatest joys the world could ever know.\n\nIt was the same gaze shared by the nightmare dolls that had mounted him earlier.\n\n\"But then she made me realize, through the servants' love, that my one true love, my only love, was you. That I was born to be yours, that I could only BE yours and no one else's.\"\n\nPhilip shook his head before the intense confession of pious love.\n\n\"Not possible...there must be a mistake, there's no way it was- arrrghh!\" \n\nStartled, Phil's words caught in his throat as his rapist draped her tongue across his face, taking in his sweat as she went. After that, she leaned into his neck and took a deep whiff of his scent, extending the moment to an uncomfortable period before rising up until she was sitting up straight on top of him.\n\nHer hands wandered up and down her body, one cupped her left tit, clutching the nipple firmly between her fingers, while the other snaked into her practically useless panties.\n\n\"There's no mistaking it\" She panted lewdly. \"Your taste, your scent, your body and voice, even your soul itself. I can feel it...MMMMmmm...it's just as that girl described you to me. You are every bit the man I imagined you to be.\"\n\n\"Girl? What, you mean that bitch with the purple eyes?!\"\n\nHis question was ignored as the woman, now reduced to a bitch in heat, had pushed aside her panties to reveal a smooth, wet pussy, drooling as if in hungry anticipation for the dick it was nestling on.\n\n\"I'm so glad I came here and met you my love. Because now I can show you the hospitality this mansion's servants have been showing me, in my own special way ofcourse.\"\n\nStill pinning his arms down with her legs, she positioned her hungry vagina over the tip of Phil's erect penis, it's lips embracing the head in a sloppy pre-emptive kiss sparking through his nerves.\n\nShe looked down with temptress eyes and a slutty smile, whispering in low, sultry tones: \"Now let me devour you\".\n\nWith that she descended onto him.\n\nHer vagina swallowed his penis completely down to the root while her mouth engulfed his own in another sloppy, aggressive kiss.\n\nHer pussy was certainly tight, nowhere near as snug as the dolls that came before her but it was definitely the untouched treasure of a virgin.\n\nPhil squirmed under her feral hips, bucking up and down in an attempt to dislodge her, but she clung on tight, maintaining her advantageous position on top of him all the while suffocating him in an endless smooch.\n\nThe sounds of slapping flesh was muted against the roar of her moans and serpentine tongue that pervaded his head.\n\nPhil found himself looking up and behind him at the two captives at the head of the bed.\n\nI almost forgot they were there.\n\nThe two of them were thrashing about violently, their threats directed at the girl currently riding him, demanding their own turn, that they \"saw him first\" and such while they squirmed to soothe their empty pussies of their itch.\n\nPhil was very glad he didn't free them earlier, he wasn't sure he could handle all three of these cock starved whores.\n\nThen he heard it.\n\nIt was quiet at first so it was easily masqueraded by the bride's horny assault, but now it was loud enough to be heard regardless and was coming from all over the room.\n\nThe sound of chains jangling and straining.\n\nAll around Phil, illuminated by the lantern fires and the skylight above, countless dolls fixated their eyes onto the two of them...no, just him!\n\nSome of the dolls masturbated right there and then, shoving their slender fingers into each other's hungry pussies or kneading their massive mammaries, their hands sinking into abundant flesh. But there were many, with feral stares and drooling lips, that fought against the chains that kept them from swarming their prey.\n\nCould they even break them? They were definitely stronger than the average human but surely they weren't THAT strong right?\n\nNo. He couldn't risk it, he needed to escape now. If he stayed and they broke out then he'd lose his chance to break free.\n\nFirst he needed to throw off the bride, and there was only one method that sprung to mind.\n\nPhilip began bucking wildly again, not to throw off the girl but to orient himself so that his legs were hanging off the bed. He managed to free his hands now that the woman was bucking her hips like a beast in heat, but instead of pushing her off he grabbed her thighs to maintain their balance as he stood up.\n\nIt was hard, walking towards a line of horny dolls without falling over while a sex-crazed nympho swung her hips back and forth on your cock.\n\nHer deep, sloppy kisses made his head spin and with every step he took her pussy had already eaten his dick down to the root three times. The pleasure was enough to send him stumbling but he persevered. If he wasn't careful, he'd be taken into the dolls with her. \n\nHe was doomed if he waited anyway so he felt it was better to take the risk for the chance of freedom it teased.\n\nWhen he was close enough the nearest doll, who had anticipated their arrival since they left the bed, reached out for her prize only to struggle to grasp Philip's ankle which lay tantalizingly out of her reach.\n\nThe bride continued to bounce on his cock, threatening to either cause him to stumble into the mass of dolls or have him unload into her pussy, he couldn't let this continue much longer.\n\nSuddenly, he felt the nympho jerk back from her kiss.\n\nShe stopped shaking her hips and even looked surprised, then he felt her being pulled back, into the arms of the dolls who had switched targets and were now latching onto her hair, dress and pretty much anything of her that was in range.\n\nShe was yanked away so suddenly with so much force she barely had time to put up a resistance and was soon lost into the writhing mass of flesh.\n\nExhausted, Phil fell back on his arse and watched as his horny jockey was groped molested by busty dolls, numerous fingers snaking into her orifices and plump lips clamping down on her nipples as her once elegant, if a little slutty, dress was ripped apart in the rabid orgy.\n\nPhil trudged back to the bed and found the key, covered in sweat and various other liquids, lying on the bedsheets. He briefly lamented on his erection, painfully maintained as he never got the chance to release what that woman had built up but there was a time and a place for that an a dungeon surrounded by horny sentient sex dolls was not it.\n\nJust then: SNAP!\n\nPhil turned to see a doll stumble to the ground, the chain that connected her ankle to the wall had broken and she was now free.\n\nSNAP! SNAP! SNAP!\n\nMore dolls came loose and stumbled and crawled towards their prey, it was now or never, a do or die moment if there ever could be another.\n\nPhil legged it back to the door, the dolls nearby were also straining against their bonds and one in particular barely brushed against his skin as he ducked into the slim opening he left in the door.\n\nPanic propelled him along, that and the foreboding sounds of the heavy slapping of bare feet against stone getting closer and closer and the sounds of iron bonds snapping in chorus.\n\nWhen he finally broke through to the other side, he turned back just in time to see arms reach through the gap with eyes enriched with desire glaring back at him, the curvaceous figures of his pursuers making it difficult to immediately follow through.\n\nHe didn't bother to wait and watch as they began prying the door open wider so that their bountiful figures could squeeze through, he just took off up the stairs, taking them two at a time as he sprinted up the cobble corridor to freedom, chasing after the light at the top of the stairs, the light of hope that would lead to liberation.\n\nA hope that flickered and died the closer he got.\n\nWhen he came to the top of the stairs, he realized that the light didn't come from the corridor set beyond the heavy iron door, which was now sealed closed with him trapped inside, but from a single lantern he didn't notice when he first entered the basement, dangling above him spitting out the last remnants of light it could muster.\n\nHe pulled at the door, defiance welling up within him, he didn't want it to end like this! But no matter how hard he pulled at the metal frame the sturdy sentinel remained resolutely shut.\n\nHe could feel tears in his eyes, he hadn't cried in six years, not since his first girlfriend rejected him, but here he was practically an adult now crying in the face of failure.\n\nHe turned to face the abyss, his back to the door, he could hear the wordless cries of the dolls creeping out of the shadows in faint echoes and the quiet rumble of many, MANY wet, fleshy bodies stampeding towards him.\n\nHe watched them emerge into the light, practically dominating every bit space imaginable, a tidal wave of meat rushing towards him.\n\nPhil braced himself as the stampede crashed into and consumed him, trapping him between the hard door and the soft pillowy party of dolls in front of him.\n\nTheir boobs suffocated him, every time he freed himself from one, another would just be shoved into his face all the while wandering hands would trace across his body, exciting him further.\n\nHe was dimly aware of being dragged back down into the darkness through the wall of flesh, every so often a new breast would slap his face, a wet nipple on his skin or he'd feel a stray tongue leave a trail of saliva across his body and for the next minute or so it was him trapped in this corridor of blind sensations.\n\nWhen at last they reached the bottom, one of the dolls reached under his arms and hoisted him up sandwiching his head firmly between her two breasts as she strode back to the centre of the basement.\n\nThrown back on the bed, Phil watched as all the dolls filtered back into the room, surrounding the bed in a ring of lust evoking images of a pack of lions surrounding a single defenceless deer before tearing it apart.\n\nA doll at his legs moved first, pulling him towards her by the ankles until his dick was sandwiched between her tits, the sensation approached a tender embrace yet was simultaneously a crushing grip, like getting a bear hug from a peculiarly soft but strong beast.\n\nHis shaft quivered under the pressure of the malleable flesh, already weakened from the pounding it took from the bride previously it was incapable of enduring much more.\n\nPhil growled, an animalistic noise from the depths of his throat as shudders raced through his body, muscles that were tensed from fear and adrenaline relaxed, his body felt a million times lighter as if he were adrift in the air, engulfed in a warm cozy cloud.\n\nAnother doll from behind propped his head onto her lap, her thick thighs working like a springy pillow that coaxed him from his restless worries.\n\nIn that position, another doll ensnared him with her set of well-endowed motherhood, clumsily suffocating him under the weight of her pliable pillows as she tried desperately to lead her erect and leaking nipples into the gaping maw of her guest but Phil didn't mind, his mind was already in a haze of immature sanctity.\n\nHis arms and legs were also occupied entertaining the dolls around him and the ones without anything were left to satisfy each other.\n\nSoon dolls piled onto the bed covering every inch of the frail, complaining frame in an attempt to service their bedfellow, the gentle cloud he lay on suddenly got more and more crowded as even more comforts rushed to smother him in their warmth.\n\nThe violent relief overwhelmed him, drowned him in the love the dolls wanted to share with him.\n\nHis penis was snatched from it's cradle and strangled by another pair of breasts, rubbing and kneading his rod as if to mould it into a tool of pleasure for their use, which may have not been too far off.\n\nThen, when the doll's boobs had reach their lowest and only the head of Phil's penis peeked out from her maternal mountains did the fake girl strike like a cobra, swallowing his entire penis in one go without any resistance.\n\nAll he could do in response was helplessly moan and fruitlessly struggle while being restrained by the nethers of every other doll around him.",
        "His moans were silenced when his mouth was plugged by a doll's breast, though they were jostled constantly and a new teat would take it's place in time.\n\nOften times their clumsy movements merely caused their hefty tits to slap against the poor youth's face, his distressed lips tasted nippleless flesh and oily skin.\n\nBut sometimes they would successfully sneak into his mouth one of the leaking towers and unload a flood of sweet tasting, warm milk which spread throughout his body and flushed his pale skin a bashful pink, sweat forming in places his body felt the hottest and his penis in particular swelled more and more, radiating heat like it was it's own sun.\n\nJust like before.\n\nWhen his cock felt like it was ready to burst, the dolls pulled back and hoisted him up into a kneeling position. In his daze, he had trouble fixating on the doll in front of him who had started bending over, her bubble butt jiggling in rapturous anticipation for his attention.\n\nTwo dolls on either side moved towards the puffed up gate of her maidenhood and spread it open, directing him into the tight pink vortex of lust, the pleats and folds inside drooled clear erotic nectar and pulsated in excitement.\n\nFaced with such a sight, Phil may have responded the same if he were in his right mind.\n\nHe took hold of his dick, burning hot in hunger and quaking for release, a blazing lance ready to pierce the depths of the denizens of the dark lands beneath the mansion.\n\nHe positioned it's head at the entrance of her tunnel and, without hesitation, thrusted the entire length inside as deep as he could. \n\nWhile the doll let out a primal cry of lust, Phil was lost in a silent scream as her maidenhood clamped down and the sudden piercing of her vagina squeezed out a tsunami of femcum from her walls, washing over Phil's groin with the same sense of liberation as a child peeing itself.\n\nPhil's cock, throttled in her narrow pussy couldn't hold itself back and fermented her virgin flesh with his seed, a torrent gushed into her depths and would have spilled out if her vagina wasn't clinging so hard to his penis.\n\nIndeed, it refused to permit it's separation from his manhood and Phil was left to awkwardly bask in his orgasm's afterglow, unable to remain upright but unable to fall down either.\n\nThe restless dolls made their move too, one hugged him from behind to keep him from falling limp from exhaustion while another spread his rear wide before cramming her writhing tongue into his asterisk. Phil lacked the stamina to complain, all he could manage was to gasp and thrust deeper into the doll's depths in an attempt to escape the wriggling flesh.\n\nAs the wet serpent writhed and burrowed deeper into his sphincter, the mountainous ass before him began to slam back into him, allowing the tongue to probe deeper as Phil's hole clamped down on it. Suffering a two pronged attack Phil could do little more than hang limply in their embrace as they did away with him like a toy to vent \n\nout their sexual frustrations.\n\nOccasionally the dolls would switch after a couple of rounds of cum were pumped into them and Phil would find a new tongue tasting his ass and another tight passage consuming his cock in passionate hunger.\n\nWhenever Phil's cock started to grow flaccid, it would be removed from it's lover's sheath and tended to by several dolls pampering the shaft and balls with patient licks, sensual kisses and by loudly, sloppily sucking. Meanwhile Phil would find his mouth full of a nipple or two, whether he refused or not, and a warm, thick milk was fed into his body, dimming his mind and enhancing his sensitivity. It wasn't long before his body, feeling like it was on fire, broke out veil of sweat which the crowd of horny nymphos lapped up like thirsty kittens.\n\nPhil endured this torment in a haze disconnected from the advance of time. The process was monotonous but the care given by the dolls and their eternally tight vaginas made it impossible to resist arousal.\n\nAnd every time Phil felt unconsciousness tug at him into the void, the dolls would swiftly drag him back into awareness either by the force of their immense frames smashing against his or with a powerful slap to the young man's face.\n\nIt appeared as though the lusty effigies refused to let their fun end just yet.\n\nPhil was barely aware of the fact that he was no longer standing, but lying on top of one of the gargantuan ladies, still ensnared in her soft grasp, the desperate caress of the dolls tasting his flushed body, the amazonian weight bouncing on his penis, lubricated by his and countless other erotic fluids, the feel of multiple mouths swallowing his ballsack and two tongues intertwining in his rectum, digging deep as if it was the tastiest cuisine available.\n\nBefore his sight was muffled by another doll's drooling snatch, he noted that the light had faded and that the only source of illumination came from the fickle light of the moon and stars above.\n\nTrapped in this cycle of indulgence, the uncaring day marched on and left him behind, now the lazy night watched over his suffering heedless to his mind's silent cries for mercy as another torrent of white surrender erupted into the womb of his captors.\n\nAnd then finally, when the silver light had bled into a warm orange of daybreak, the young man's body had finally given up, ignoring his hosts' physical abuse it fell deep into the abyss of sleep with the fading cries of insatiable lust and the knowledge that another similar hell awaited him when he woke up pursuing him into the void."
    ],
    "authorname": "KennyCumBuckets",
    "tags": [
        "bbw",
        "femdom",
        "reverse gangbang",
        "busty",
        "amazonian",
        "big ass",
        "big tits",
        "witch",
        "doll",
        "group sex"
    ],
    "category": "Erotic Horror",
    "url": "https://www.literotica.com/s/the-witchs-dollhouse-pt-02"
}