{
    "title": "The Haunted Hotel Ch. 01",
    "pages": [
        "Editor's note: this story contains scenes of incest or incest content.\n\n*****\n\nFall colors flashed past the car window as the narrow road took another winding turn. In the passenger seat, Jenna tried to track their course on the map, but the blue dot kept jumping around erratically.\n\n\"Shit. No signal,\" she said.\n\n\"No problem,\" her brother Mike said, his eyes on the road. \"There weren't any more directions to follow anyway. We follow this road until it ends, at the abandoned hotel, and then we're there. Can't miss it.\"\n\n\"I hope you're right,\" Jenna said. \"Thanks again for dragging me out here.\"\n\n\"No problem,\" Mike said. \"It'll be nice to hang out one more time before you start your new job overseas. Maybe get drunk and tell stories. Like old times.\"\n\n\"Old times? Mike, you're only 21,\" she scoffed.\n\n\"And you're 23. So what? Point is, if you weren't here, it'd just be me drinking alone.\"\n\n\"If you ask me, it was shitty for Lisa to break up with you last week, and it was shitty for all your friends to side with her,\" Jenna said.\n\nMike waved it off. \"It's not like that. They...they just don't want to pick a side right now.\"\n\n\"Still shitty,\" Jenna added. \"But it's cool that you were able to reserve a whole hotel for the weekend.\"\n\n\"Abandoned hotel,\" Mike corrected her. \"Lower your expectations. Remember that castle in Germany? It's like that. We'll be lucky if this place has any part of its roof intact. But who knows? Maybe we'll see some ghosts. The old hotel got shut down after some incident, a gas leak or something, that killed a bunch of people.\"\n\nAhead, an iron gate came into view. It was in surprisingly good condition, and someone had left it open for them. Up the driveway, they found the hotel sitting at the top of the hill, all knotty old architecture. But it didn't look as spooky as Jenna expected. There were other cars sitting out front.\n\n\"Looks like the roof is intact alright,\" Jenna said. \"You call this a ruin??\"\n\nMike pulled into a parking space. \"That's what the listing said, I swear. I'd show you, but I don't have any signal now either. This doesn't look anything like the pictures. And I thought we were going to have the whole place to ourselves.\"\n\n\"It sounds like you got tricked,\" Jenna said. \"What should we do?\"\n\nMike shrugged. \"Let's at least go inside, and see what's actually going on here.\"\n\n---\n\nMike shouldered his bag and led his sister into the lobby. He was expecting the inside to be in disrepair, but it wasn't. There was a fireplace lit, surrounded by high-backed leather armchairs. There were a bunch of staff about, as well as a few other guests. \n\nBehind the front desk, Mike saw a young woman who had to be about his age, but in a very formal uniform with a cap. His first impression was that she was really cute, with her dimpled cheeks, striking red hair, and curves that rounded out the uniform in all the right places. Then it occurred to him that maybe he was attracted to this woman because she reminded him of his ex Lisa. Then he realized he was staring awkwardly and approached the desk, flashing her a smile.\n\n\"Hi,\" Mike said. \"I think there was some mix-up. I was supposed to have a reservation tonight...\"\n\n\"Let me check,\" the woman said. \"What's your name?\"\n\n\"Mike,\" he said, reaching his hand across the desk as he introduced himself. She took his hand in hers, her grasp momentarily warm and soft.\n\n\"Rosie,\" she said, and then both of them realized the awkwardness of what they'd just done, and laughed it off.\n\n\"Uh...sorry...Mike Grimm,\" he added.\n\n\"Right. Yes, we do have a reservation for you. One room, right?\" Rosie asked.\n\nBelatedly, Mike remembered his sister standing behind him. \"One second,\" he said, and turned to Jenna.\n\n\"Well sis, should we just roll with it?\" he asked.\n\n\"Mike, this is weird. We were supposed to have this whole place reserved. And it isn't anything like what you were describing on the way up,\" Jenna said. \"Are you sure we're even in the right place?\"\n\n\"This hotel is in the right place,\" Mike said. \"If there were any other hotels nearby, we would have seen something on the drive up here.\" Mike glanced around, at the decor, at the other young, attractive guests. \"It's not what I was expecting, but it seems really nice, especially for what I paid. Anyway, sorry that we won't be spending the weekend getting bored of each other in some ruin.\"\n\nJenna set down her bags. \"Sure, but I didn't think this was going to require sharing a room.\"\n\n\"Two rooms? Not a problem,\" Rosie piped up from behind the desk, and slid two keys across it.\n\n\"Aw thanks, Rosie,\" Mike said. His sister gave him a mocking look, but he paid it no mind. When Jenna had started down the hallway, Mike leaned over the desk and asked quietly, \"Hey, do you want to have a drink after your shift ends?\"\n\nRosie looked thoughtful for a moment, and said, \"Sure, Mike. I get off at nine.\"\n\n\"I'll see you then,\" he said.\n\n----\n\nWhile Jenna lugged her bags down the hallway, someone walked up beside her. \n\n\"I can help you with those,\" he said, his voice deep but gentle. \"...if you want.\"\n\n\"You know what? Thanks,\" Jenna said, handing him one of the bags.\n\n\"What's your name?\" he asked.\n\n\"You can call me...room 126,\" she said, thinking she'd accept the favor and then have nothing more to do with him. After all, she thought he was way too pretty to be interested in her. \"Sorry, I don't mean to sound ungrateful. My name's Jenna.\"\n\n\"Pleased to meet you. But if you want me to call you room 126, then room 126 it is,\" he said. \"I am Frederic.\"\n\n\"Fred?\" Jenna asked.\n\n\"No no no.\"\n\n\"Derek?\" she asked. He shook his head adamantly. \"Rick?\"\n\n\"That's the least bad of them, but no. Just Frederic, please,\" he insisted.\n\n\"That seems like a lot for a girl to cry out in bed,\" Jenna remarked. \"Oh, I didn't mean to say that out loud!\"\n\n\"So far there have been no complaints,\" he said with a smile. \"But I imagine room 126 would be a mouthful too.\"\n\n\"The name's Jenna,\" she said.\n\nThey walked down a long hallway, and Jenna snuck a glance at her rescuer. He was pretty, with a neatly shaved beard on a jaw that didn't need one, his hair slicked back with a little product. Jenna imagined what that hair would look like, mussed up. The image came to her, of his head between her legs, her fingers running through his hair as he did things to her.\n\n\"Jenna, are you okay?\" he was saying. \"I said, this is your door.\"\n\n\"Yeah, more than okay,\" she said. \"I don't know how to thank you...\" She wondered if that would be too open-ended. What was she even doing? Jenna wasn't the kind of girl to hook up with someone she'd just met.\n\n\"If you were to buy me a drink later, I think we'd be even,\" he said.\n\n\"Sure,\" she said. \"I'll see you at the bar later.\" She didn't want to commit to a time; in truth, she wasn't sure she wanted to go any further with this. She'd let her freshmen 15 appreciate with interest, and her skin had never cleared up since puberty. It was hard to imagine that a man like him would be interested in her. \n\nBesides, she hadn't been expecting to hook up with anyone this weekend. It wasn't like her. But she wasn't sure what was like her. She hadn't really been sure since David broke up with her three months ago. Maybe it was time to find out.\n\n------\n\nAt dinner with Jenna, all Mike could think about was his date later. Jenna seemed distracted too, so at least he wasn't the only one failing to keep their conversation afloat. After, he had time to shower and shave and get out the best of the clothes he had brought, though they were hardly impressive threads.\n\nAt nine o'clock, he walked into the bar, and saw Rosie sitting alone at a table for two. She had changed out of her hotel uniform and into an elegant evening dress. He was struck again by her resemblance to Lisa, and in the flickering low candlelight, it was almost uncanny.\n\n\"Hey, thanks for accepting my invitation,\" he said, feeling awkward.\n\n\"It's no big deal,\" she said. \"I might as well. Where else would I go for a drink around here?\"\n\nThey easily got to talking, and Rosie was like an open book. Mike quickly came to feel like he knew her pretty well, and he was charmed by what he found out. That, and as the night went on, she was sliding closer to him, brushing his arm with hers, pressing her leg against his. Mike felt eager to get somewhere alone with her.\n\n\"Did your parents know you'd be a redhead when they named you?\" Mike asked at one point.\n\n\"They should have,\" Rosie said. \"They're both redheads too. But my last name is almost worse.\"\n\n\"What's that?\"\n\n\"Tanner,\" she said. \"I don't tan at all, I just freckle.\"\n\n\"Well you could change your name, if you found one you like better,\" Mike suggested. He wondered if she'd catch onto his implication, that maybe she could have his, if they...he worried it was too much, too soon.\n\n\"Says Mr. Grimm,\" she added with a smile. Ah, so she had caught on, and hadn't called him out on it. Could she really be thinking along the same lines, already? It was a hope, and yet a somewhat intimidating one. Sure, he'd been mad for Lisa up until the end, but he'd never felt like this before, not with someone he just met. He didn't know what to say, and just shrugged.\n\nEventually Mike noticed his sister Jenna sitting at the bar across the room. When they made eye contact, she gave him a smile and a thumbs up. Then a moment later, a man in a dark-colored jacket came in and took the seat next to her. Mike returned the gesture from across the room. As eager as he was to nurse his emotional wounds in the arms of someone new, it was also good to see Jenna rebounding, finally, three months after her previous breakup.\n\n\"Hey, I hope this isn't crazy, but do you want to go back to my room?\" Rosie asked, getting Mike's attention again. The light shifted, and she looked just like Lisa again. Then the candle flickered, and she was back to the girl from the front desk.\n\n\"Uh, yeah sure,\" Mike said, trying to play it cool, but also surprised at his luck. He followed Rosie down a few turns of the hallway until she stopped to unlock a door. \n\n\"I don't have my own room here,\" she explained. \"I just sleep in one of the unoccupied rooms every night. Tonight it's nothing fancy. Okay, now that we finally have some privacy...\" She pulled him in for a kiss, which he eagerly returned. \"Let me know if I'm moving too fast. It's just that I have an early shift tomorrow.\"\n\nShe started pulling at his clothes. Clumsily, Mike managed to get her dress unzipped, exposing first her collarbone, which he kissed, then her shoulder, which he kissed, and so on. He made his way down to her panties, which he pulled aside and kissed what had been underneath there too. As he lapped at her slit, she was close to orgasm, but not quite there. \n\nTaking a break, he slid up and kissed her on the mouth again, her tongue playfully against his. Where his body came to rest against hers, he could feel his erection pressing into her folds. She must have felt it too, since she started pressing her mound up to meet him.\n\n\"Is this...safe?\" he asked. \"I don't have any condoms with me, I wasn't expecting to get laid this weekend.\"\n\n\"Me neither,\" she replied. \"And yes, I'm on birth control.\"\n\n\"Please don't take this the wrong way, but I've gotta ask...\" he began.\n\n\"It's safe for you too, if that's what you mean,\" she said. \"I've never done this before.\"\n\nMike leaned up to look her in the eye better. \"You mean you're a virgin?\"\n\n\"No, I'm not a virgin,\" Rosie said, laughing. \"I just mean I've never slept with a guest here before. This isn't the kind of thing I do, ever, until you.\"\n\nHis doubts assuaged, Mike pressed his tip into her flesh. When they were conjoined, he looked at her face and saw Lisa's eyes looking back up at him. In the days since she broke up with him, he had missed her touch, missed her body. He had wanted more than anything to make love to her one last time, to give a proper goodbye to what they had. Now it seemed like he had that chance, even if it was an illusion, even if it wasn't really her. \n\nHe kissed her in all the ways he fondly remembered, as he started to thrust in and out. The next time he blinked, it was Rosie underneath him again, taking him deep within herself. Another blink, and the illusion returned. Her limbs, her breasts, it all felt so welcomingly familiar to his touch, that he didn't stop to think about what he was doing. But the weird thing was, as far back as he could remember, sex with Lisa had never felt this good, her muscles squeezing him, drawing him deeper, holding him tight inside her. He was quickly building to an overwhelming, unstoppable orgasm, and he could tell she was too.\n\nBringing his mouth her her ear, he mumbled, \"I'm about to cum!\"\n\nHer hands around his back clasped him tight to her as he pushed as far as he could go, and exploded inside of her. That was what set her off too. Opening his eyes again, Mike saw that it was Rosie under him, feeling him ejaculate inside her, climaxing together with him. Though he was a little sad to have his illusion shattered, in the throes of her orgasm, Rosie was beautiful too. She shuddered and shook, and Mike thought he could feel every beat of her heart, every gasped breath in her body's reaction to him. \n\nLying together afterwards, Rosie was all aglow with her contentment, but she wasn't done either. She wasted no time kissing her way down his body, to his cock, deflated and still slick with their fluids. She took it into her mouth with a wicked smile, and it wasn't difficult to suck him back to hardness. But when he looked down, it wasn't Rosie's head he saw the top of bobbing up and down on him, it was his sister Jenna's.\n\n\"Stop. Stop stop stop! Hang on,\" he said, scooting up to the top of the bed, away from her hungry mouth. She looked disappointed at the sudden change in mood, but Mike saw no choice. Whatever weird mind thing was going on with him, he couldn't cross that line. It made him feel suddenly sick to his stomach, like the drop on a roller-coaster.\n\n\"I'm sorry, I...I have to go,\" he said, slipping into his clothes again. He thought if he tried to explain, she'd think he was crazy, or some sicko who was hot for his sister, or both. \n\n\"Mike,\" she said, trying to talk him down. Somewhere along the line, his vision cleared, and he saw her as Rosie again. But he couldn't go forward, not with whatever weirdness was happening. \n\nShe was still sitting, naked, confused, and unsatisfied when he hurriedly got dressed. Mike felt unsatisfied too, but too bad, he thought. More than that, he was freaked out. He ran out into the hallway and didn't look back until he got to his room.\n\n------\n\nJenna awoke to find a note on her bedside table. \"Thanks for a wonderful night. I've got to run! -Frederic\" She sighed. He had seemed really into her, but sneaking out before she woke was the kind of thing she'd been through all too many times before, last time she had been single. What a jerk, she thought, to use and dash before she woke. Her head was splitting with a headache, and there were enough bottles and cans lying around to explain why. \n\nShe remembered inviting Frederic back to her room, in disbelief that he could actually be into her. She remembered the way he went down on her, just like she'd been fantasizing about. It had been everything she imagined and more. She remembered sucking him off, until his cock pulsed in her hand and spat its load into her mouth. She remembered cumming again on his fingers while they made out, and feeling both satisfied and wanting more. All of that must have been before they finished the minibar. \n\nBut exactly how far things went, she couldn't say for sure. Lying naked in bed, she can feel that her pussy is leaking sticky fluid, but she can't tell if it's hers or his. It sure looked like semen, but she didn't want to believe it. Could she have really had sex unprotected? She'd have to be stupid drunk to ignore the fact that she hadn't taken the pill in the three months since her last boyfriend. Maybe she had been stupid drunk, but she didn't want to believe it.\n\nShe went to breakfast and saw her brother there, eating alone, and sat down with him. \n\n\"So you and the front desk girl. Good to see you processing your break-up with Lisa already,\" Jenna said, tearing into a bagel.\n\n\"I guess so,\" Mike said, less enthused than Jenna expected him to be. \"You too. Finally over what's-his-name?\"\n\nDavid. His name was David. They had been together for a year, and not once had he met her family. Jenna knew now that it should have been a sign that he didn't respect her, didn't see what they had ever going anywhere. In the three months since, her friends had told her plenty of times to go out and have a one night stand, but Jenna just hadn't felt like it. Now she had hooked up with some random hottie at a hotel. But did she feel more over David today than the day before? The jury was still out.\n\n\"It's...whatever,\" she said. Mike didn't have a lot else to say, and actually seemed kind of anxious to finish his breakfast and leave.\n\nAfter breakfast, Jenna still felt off-kilter from the drinking last night. She felt like the only thing for it was some fresh air and exercise. She changed into her leggings and sneakers and went out for a run in the forest. She had gone about a mile, when she saw Frederic coming up the trail in the opposite direction. It was hard to concentrate on her footing and not stop to marvel at his form.\n\n\"Good morning,\" he said, stopping to talk.\n\n\"So this is what you meant,\" she said. \"Gotta run.\"\n\n\"Oh. Yes, I'm up here to train, I thought I mentioned that last night.\"\n\n\"Um...sorry, this is awkward...so we had sex last night, right?\" Jenna asked.\n\nFrederic looked stunned. The color drained from his face. \"Oh my god. I'm so sorry. I could tell you were kind of buzzed, but if I had any idea you were black-out drunk, I never would have...\"\n\n\"Frederic, I'm not blaming you. I just wish I remembered...\" Jenna said. Looking around, she checked that there wasn't anyone else in sight. \"So what did we do?\"\n\n\"Okay. To put it plainly, we had oral sex, mutual masturbation, and eventually intercourse...\"\n\n\"Ah, okay, yup,\" Jenna said.\n\n\"Is that all okay? Are you okay?\" Frederic asked.\n\n\"Yes. Yes, I'm okay. Don't worry, I don't regret any of it,\" Jenna said. \"And thank you too for a wonderful night, even if I can't properly appreciate it, which is my own damn fault.\"\n\nTheir breath was visible in the cold forest air, making it clear how close they already were. Then Frederic, leaned in to kiss her, and Jenna met his lips with hers.\n\n\"I should go shower,\" he said finally.\n\n\"Me too. Want to use mine?\" Jenna asked, worried it was too forward.\n\n\"Absolutely,\" he said, and followed her back to the hotel. \n\nIt was hard to keep her hands off him until they reached her room. When the door shut, she started frantically undressing him. Again he pushed her back onto the bed, and leaned down to lap at her slit tenderly. Reaching down, she ran her fingers through his hair, now slick with sweat, pressing his head into her mound, pushing her hips up to reach him. It wasn't long before she reached her climax, with her eyes closed, arching her back up, as it roared in her ears.\n\nWhen she came down from her peak, she felt satisfied, but at the same time, felt like there was something more she needed from him. An aching void deep inside herself. She couldn't remember ever feeling like this before, her sexual appetite ever being so strong, even when she was a teenager. \n\nShe knew she shouldn't fuck him. She shouldn't have the first time either. Last night was a mistake, but she had been drunk, and maybe she had decided she could sort out the consequences when she got home on Sunday. Having already crossed that line, Jenna decided to cross it again.",
        "\"I need you inside me,\" she said.\n\nHe moved up on top of her and pressed his tip to her hole. She slid herself down the bed a little to meet him, grabbing his waist, pulling him, guiding him in. She felt herself open up to him, as he pressed deeper into her with a sigh. They melted into each other until they were as tightly conjoined as they could be, and he gently pressed his mouth to hers, inhaling as he started to withdraw. In slow deliberate motions, he thrust in and out of her, and she could feel her body lighting up to his touch against the mounds of her breasts, against the curves of her thighs, against the walls of her vagina, everything in her pulsing with him, constricting around him, while his muscles tightened against her too. This was something the like of which she'd never felt before, though she couldn't put her finger on what made it feel so different, so much more intense with Frederic.\n\nShe closed her eyes and let him take her, caressing the back of his head. His thrusts sped up, and she hung onto him, starting to moan in time. This was the kind of fuck she missed, the kind she had been aching for, for the past three months, fingering herself and dreaming of. Her hand on the back of her head slid up, and found a bald spot, just like David's. But Frederic didn't have a bald spot. She opened her eyes, and saw Frederic's deep brown irises staring back at her with a look of awe David never had for her. He slowed his thrusts again, the pressure between them mounting with each one, until she wasn't sure how she hadn't orgasmed yet, but knew it was going to be a huge one. That's when she felt the entire length of him grow thicker, harder, hotter all at once. A half-breath later, his semen splashed against something deep inside her, igniting her fuse all at once. The contractions were uncontrollable as they merged themselves, tightly gripping each other, their fingers leaving marks.\n\n\"Oh my god,\" Frederic gasped at last.\n\n\"Mine too,\" Jenna said with a smile. This contentment was different somehow. Now she felt full, warmed from within.\n\nEventually they got up and hopped in the shower, and started in making out all over again in the steam and falling water, before they'd even rinsed off from what they'd done. Jenna still couldn't believe that this athletic hunk was into a curvy, pudgy girl like her with ruddy skin. She reached down and started stroking his cock, hoping to get him erect again, the memory of him cumming inside her fresh in her mind. She kissed his neck, his muscular chest, kneeling down to crotch level, but when she looked up, it was her brother's face looking down at her.\n\nSuddenly it didn't matter if he was erect or not. In fact she'd prefer it if he wasn't. Suddenly it didn't matter whether she had teased him. She suddenly felt decidedly unsexy as he gazed down at her. She stood back up and took one last turn into the spray of the shower to rinse off. \n\nFrederic stood there confused, but in a few thundering heartbeats, Jenna was out of the shower, drying herself off.\n\n\"I'll just finish showering and head out, if that's okay,\" Frederic called to her from the shower.\n\n\"No problem. I mean, of course,\" Jenna said, trying to get her mind straight. Seeing her brother's eyes looking down at her had reminded her of something from the previous night that she had forgotten. Maybe it wasn't entirely the alcohol, maybe it was also because she had wanted to forget. Now the image came back to her. When Frederic had been inside her, for just a moment, it had looked like her brother instead. \n\nTrying to shake the image from her mind, Jenna got back into her running wear and headed out again, leaving Frederic alone in her room. What was going on with her? Where were these unwanted images coming from? She just knew that she needed to take time to work this out, and she needed to be alone.\n\n----\n\nMike spent much of the day in the lounge, reading a book next to a roaring fire in the fireplace, while a jazz record played on the nearby turntable. It was soothing, even if it wasn't at all what he had expected to spend the weekend doing. \n\nAnother girl settled into the armchair across from his, her hair in braids, her long, slender legs folded under her. She was playing a game on her phone, but looked up to flash him a smile, her teeth bright against her dark skin. Mike smiled back. Gosh, this hotel was full of friendly, attractive girls. He felt like he could flirt with any of them, though he was drawing a blank on how to start a conversation. And the more he thought about it, the more he felt like what he really wanted was another chance with Rosie. He blamed himself for running out on her like that, just because his mind was playing tricks on him. He was really kicking himself for messing that up, after that mind-blowing sex.\n\nHe remembered that exquisite moment, of cumming inside her while she writhed in orgasm. It had been like fucking Lisa one more time, only even better than he remembered sex with Lisa ever feeling. But he also remembered looking down and seeing his sister Jenna as the one sucking him off.\n\nWhere was Jenna now, he wondered? This was supposed to be their last hurrah before she moved to Dubai or whatever. Mike got bored, and walked down to his sister's room. He stopped outside the door, about to knock, but he heard her moaning inside. From the rhythm of her moans it was clear that she was hooking up with that runner guy again. Why did she get to have uncomplicated sex? Despite the fact that it was Jenna behind the door, the sounds started to get to him. The image of her going down on him came back to his mind. He knew he had to leave.\n\nHe walked on down the hall, and started exploring the hotel. All the corridors had their own interesting decorations, but after a while, Mike found himself turned around, unable to find his way back or out. He found a courtesy phone on a stand and picked it up.\n\n\"Hello, front desk?\" Rosie's voice answered.\n\n\"Hey Rosie, this is Mike,\" he said. \"I'm...lost I guess. Can you help me out here? Can you tell where I am?\"\n\n\"No, but hang on...\" she said. \"I think I can hear you. Can you hear me? Can you follow the sound of my voice? Mike!\"\n\nHe pulled the phone from his ear, and yes, he could hear her voice from down the from down the hall. She kept calling \"Mike\", as he got closer, and he imagined her gasping his name from underneath him. By the time he reached the front desk, he was starting to get aroused at the thought.\n\n\"Oh good, you made it,\" she said. \"Don't worry, people get lost in the hallways all the time.\" She was in her grey hotel uniform again, which Mike thought looked cute.\n\n\"Thanks. And I wanted to say sorry, for last night,\" he said.\n\n\"No need,\" she replied. It sounded very professional.\n\n\"No, I should explain. When for a second there, while we were...together, when I looked at you, it wasn't you that I saw. I saw someone else in your place, if that makes sense. Gosh, does that sound weird? I really don't know what's going on with me.\"\n\n\"Oh, it must be the curse!\" Rosie said. \"I've heard rumors about this. Ghosts in this place playing tricks on people, disguising one person as another. I didn't know it was real, until now apparently.\"\n\n\"Huh. Yeah, that explanation does seem to fit. Though I don't really believe in curses,\" Mike said. \"Anyway, I felt like I owed you an apology. No hard feelings?\"\n\nRosie leaned in and said quiety, \"No, if I recall correctly, you were the one left with hard feelings.\"\n\nMike laughed, though he couldn't get a clear read on whether Rosie was still into him, and he felt like this wasn't an appropriate conversation to be having with her while she was on duty. \n\n\"Well, I should get going, and let you get back to work...\" he said as he backed away.\n\n\"Sure, see you,\" she said.\n\n------\n\nStill hot-blooded from her run, Jenna felt better, her mind cleared, her blood pumping in her veins. She stood in the bathroom, looking at her naked body in the mirror. She had just came in to wash up and get changed before dinner, but lingered to stare at her reflection. It still came as a surprise that someone like Frederic could want her, though now she tried to see in herself what he might be seeing in her. Her full lips, round eyes. The soft bulge of her breasts, her nipples firm as she cupped them in her hands. Her eyes drifted down to her belly, which she felt self-conscious about. But she remembered the way Frederic kissed it, caressed it affectionately, in a way David never had. She ran a finger across the sensitive, ticklish skin of her stomach, thinking too about what lay within. And then her hand descended, to the thighs he had held so tight, and where they came together.\n\nShe still couldn't believe she had let him fuck her unprotected, let him cum inside her. No, to be honest, that wasn't an accurate way to put it. She had fucked him bareback, she had brought him to orgasm inside her. It was incomprehensible, knowing that she'd been off birth control long enough to be fertile again. Knowing it could get her pregnant. It would be crazy to get pregnant from some random guy she met in this remote hotel, and it would throw all your plans off course to bring a new life into the world. Still, looking at her body in the mirror now, she saw her full breasts, her wide hips, her muscular thighs. If anyone was shaped and primed for motherhood, it was her. It wasn't hard to imagine a baby growing in her belly, its roundness adding to her own. \n\nWhy was she thinking about this all of a sudden, she wondered? If she remembered correctly, her last period had been a couple weeks ago, so she was probably ovulating. That, and maybe the intense, passionate baby-making she'd been doing, after her long dry spell.\n\nSunday, she reminded herself. Sunday, after they left, she'd get herself a morning-after pill, and no one, not even Mike, would be the wiser. And if she was having fleeting fantasies in the meantime about getting knocked up, that was okay. There wasn't anything she could do about it until Sunday, and then she'd have to decide whether to let those fantasies become a reality.\n\nHer hand was working her clit, and she felt an orgasm approaching when there was a knock on the door. \n\n\"We're meeting for dinner, right?\" Mike called, through the door. \n\nJenna glanced at the clock. She had lost track of time. But the image of Mike while she was naked and horny as hell was the last thing she needed. \n\n\"Just a second!\" she called out. Quickly she splashed some water on her face, trying to quench her desire, and then she threw on the first outfit she could find.\n\n\"Sorry about that,\" she said, pulling the door of the room closed behind her. \n\nThey went down to the hotel restaurant and got a table. Right after they sat down, Mike pointed. \"Hey I recognize that guy, you were hanging out with him last night, right?\"\n\nFrederic was sitting at the bar with his back turned. \"Oh right, I think I did talk to him,\" Jenna said.\n\n\"Well, should we invite him to join us? It's fine with me,\" Mike said, a teasing edge to his voice.\n\nAt the bar, Frederic happened to look their way. He spotted Jenna, and smiled and waved, but didn't approach them. She wasn't sure whether to be relieved or disappointed.\n\n\"No, thanks. It's not like I even asked if he could join us,\" Jenna said.\n\n\"Jeez. I guess that was short-lived,\" Mike said.\n\n\"I don't know,\" Jenna replied. \"What about you and front desk girl?\"\n\n\"Same thing. I don't know,\" he said. \"You know, I heard rumors about a curse over this place. It's like a trick of the light or something, you look at one person and you see someone else.\"\n\n\"What do you mean?\" Jenna asked. \"First ghosts, now a curse...I assume you're telling me this because you think you're cursed now? Who did you see?\"\n\n\"There was a moment when I looked at Rosie...\" he said, and paused. \"Um...and who I saw was...Lisa.\"\n\n\"Seriously?\" Jenna asked. She felt like she had experienced that herself. But her brother had just mistaken his fling for his ex, which seemed innocuous enough. Jenna had seen her own brother in a sexual situation. She wasn't sure what to think of that, curse or no curse.\n\n\"I mean, yeah. It happened. It was like it was actually Lisa,\" he said.\n\n\"That sounds...unsettling,\" Jenna remarked.\n\n\"To say the least,\" Mike added. \"You think you're...talking...with one person, and then suddenly it's someone else.\" Jenna wasn't sure why Mike found it so disturbing to have a vision of Lisa, but she didn't probe into it further. She figured he was being vague for a reason.\n\nAfter dinner, they said goodnight, and went back to their respective rooms. Jenna thought about going out again, but she remembered waking up and feeling awful from how she drank last night. She didn't want to do that again. Plus, she felt like she had some unfinished business with herself.\n\n------\n\nMike was sitting in his room, close to 9 PM, and starting to doze off. The room phone rang. He scrambled to pick it up.\n\n\"Hey Mike, this is Rosie,\" she said through the phone. \"So...tonight I've got a vacant honeymoon suite all to myself. I was wondering if you wanted to come check out the hot tub...\"\n\n\"Oh, I didn't bring a swim suit,\" Mike said automatically.\n\nRosie laughed. \"Don't be silly. I didn't say you needed one. So, are you in?\"\n\nMike thought back to that blissful moment when he and Rosie had been conjugally conjoined. He felt like he would give anything to feel that way again. \"Yeah, absolutely.\"\n\n\"Okay. Meet me at room 402. There aren't many rooms up on that floor, so I'm trusting you not to get lost, or I'll have to put clothes back on to find you.\"\n\nShe hung up, and Mike jumped up off the bed, with a bounce in his step. He didn't belabor what to wear, knowing he'd just be taking it off anyway. In a few minutes, he was riding the elevator up.\n\nBefore he could knock on the door, Rosie opened it, wearing only a towel, which she dropped as soon as the door closed. She got back in the hot tub, and Mike undressed as quickly as he could and joined her, the warm, bubbling water soothing him and sending shivers up his exposed back.\n\nAs soon as he sat down, she turned to him, and said, \"I've been waiting all day to do this.\" And then she pulled his face close to hers and kissed him deeply. Her body felt so natural, so familiar, but also electrically, tantalizingly new and full of potential, as he ran his hands all over her skin, both above the water level and under it.\n\nShe leaned him back against the edge of the tub, and straddled him, sitting down on his lap, letting her slit come to rest against his erection as they started to make out.\n\nHe was almost unsure how much more teasing outercourse he could take, when she reached down and started guiding him into her flesh. It took her a while to work her way down on him, until her weight was resting on him again, his penis buried deep within her, and they started to move, slightly, apart and together.\n\nBut then she gasped, not a good gasp, and jumped up off his lap, backing away and out of the water.\n\n\"What's the matter?\" Mike asked. \"Are you okay?\"\n\n\"It's the curse. For a second, I saw someone else. Ugh! Someone I would never, ever have sex with. And it felt like it was him inside of me.\"\n\nStill grasping at the situation, Mike said, \"That sucks. I'm sorry.\"\n\n\"Mike, you didn't do anything wrong,\" she said. \"It just killed the mood for me, just for the moment.\" She crossed the hot tub to where he was standing and started to kiss him. \"I'll be okay in a second, if we keep doing this.\"\n\nSoon she was breathing heaving again, and pressing up against Mike's erection eagerly.\n\n\"I've got an idea,\" she said, with a mischievous smile. She bent over the side of the tub, presenting her rear end to him. Mike reached down and guided himself into her from behind, and she pushed back against him until they were in a rhythm together, their bodies slapping together with every thrust.\n\nTo Mike, it felt like heaven. And at first, the curse didn't bother him so much. Sometimes he looked down and saw Lisa's backside before him. Then, it was the thin, dark-skinned girl from the lounge, with her peach-scented perfume. Mike could swear that it even felt different to be inside her, but he wasn't complaining. When he blinked again, it was Rosie, the pitch of her moans rising as she neared orgasm. But then, just before he was reaching his peak, it was Jenna's back, Jenna's buttocks, Jenna's pussy he was shoving himself into. And if he kept going, he was going to cum while his eyes and ears and hands and every nerve ending in his cock were telling him it was his sister he was fucking. Even if it was just an illusion, he wanted that perfect moment with Rosie that he'd had before. He didn't want it tainted by that.\n\nHe pulled away at the last second. Rosie turned to look at him, desperate and concerned.\n\n\"The hot tub's getting to me...and the curse,\" he admitted. \"I'll be okay, let's just move to the bed.\"\n\nRosie led him by the hand and laid him down on the sheets. She sucked him back to hardness, though he'd hardly softened at all. Then she straddled him. \n\n\"You were right that this curse is just a mind trick. It doesn't have any power over us unless we let it,\" she said. \"If you ask me to stop, I'll stop. But Mike, I want you so bad right now. I want you no matter what. So whatever messed up images this curse throws at me, I'm not going to stop for them anymore.\"\n\n\"You're right, Rosie,\" Mike said. \"Whatever happens, I can handle it too.\"\n\nShe took his cock back into herself and started riding him, biting her lip, though it didn't contain her moans. Mike reached up and caressed her breasts. At first he was okay. Whether the curse showed him Lisa, or that stranger from the lounge, or even his sister, he just blinked hard, and most of the time it would be Rosie above him again when he opened his eyes. \n\nTheir rutting intensified, and Mike pulled her hips tight to his. But the curse kept showing him Jenna more often, as she leaned down, pressing her lips to his. It was Jenna's moans, like the one's he had heard earlier that day, in his ear now, as he was approaching orgasm. He kept blinking, as hard and as quickly as he could, trying to get Rosie back, trying to get Rosie to stay, in time for the inevitable release that was coming up fast. When it was Jenna, her breasts felt different in his hands, he could feel her pudgy belly against his. As much as he wished not to notice, even her vagina felt different around his cock, and she seemed to react even more to his thrusts.\n\n\"Oh god, Rosie, I'm about to...\" he said, and blinking again, it was Rosie's hair falling on his face. With that, he stopped holding back, he pushed himself as hard as he could, as far as he could deep inside of her.\n\n\"I'm ready,\" came Jenna's voice in his ear, and it was too late to turn back now. Her words put him over the edge. His penis throbbed deep inside her, and then he felt the flood of warmth of his own load inside her. She grunted a choking sound as orgasm swept through her too, and her pussy began to spasm around him, clenching him tight, sucking the fluid up and out of him. \n\n\"Oh Mike!\" she yelled with pleasure, and it was still Jenna's voice that he heard. And he remembered what it had felt when Rosie orgasmed the previous night. This felt different from that, different from when he'd been with his ex Lisa, but good different, the way he felt her buck and contract, squeezing in time with every jet of his cum. He wished it didn't feel as glorious as it did, wished he wasn't actually glad it had ended up this way.\n\n------\n\nJenna thought she'd find Mike in his room, but he wasn't there. Or maybe he was sleeping already? It was still a bit early for him, even if he didn't seem to stay up as late or drink as heavily as she did. Not that she felt like drinking tonight, after last night. She decided to avoid the bar. But she took the elevator up to the top floor, curious to see if she'd find any of the luxury suites unlocked.",
        "So far, none of them had been. Too bad. As she stopped in front of the next door, she heard someone inside scream, \"Oh Mike!\"\n\nThat had to be where he had ended up. Maybe with the front desk girl again, or some other patron of the hotel? But the weird thing was, Jenna thought it sounded like her own voice screaming that. She tried to dismiss that thought, because it couldn't have been. Still perturbed, she went back downstairs to her own room.\n\nIt was well after midnight when there was a knock on her door. She opened it in a bathrobe, and found Frederic leaning in the doorway.\n\n\"Hi there, room 126,\" he slurred.\n\n\"Hi,\" she said. \"You seem quite drunk.\"\n\n\"I am, yes,\" he said. \"I thought earlier, I must have done something to upset you, so I should leave you be. But as I sat in the bar drinking alone for the past several hours, I decided to hell with that. We might never see each other again, and I'd regret it if I didn't at least try to spend tonight with you. And if you don't want me, that's fine, at least I gave it a shot.\"\n\n\"I think maybe you took a little too long coming to that decision, and a little too much,\" Jenna said with a smile. \"And maybe liquid courage played a role?\"\n\nHe wobbled in the doorway, looking to her for more of an answer.\n\n\"You didn't do anything wrong earlier,\" she said. \"I just had some issues to work out with myself. Actually I thought I had been unacceptably rude to you.\"\n\n\"So is that a yes?\" he asked.\n\n\"Yes. Please come in,\" she said, pulling him away from the door, letting it swing shut.\n\nThey sat on the bed, and started to kiss. She got up and hung up her robe, and helped him undress, but by the time they were both naked together on the bed, he was nodding off. A little disappointed, Jenna tucked him in, and climbed in under the covers, and turned the light off. It was still pleasant to cuddle him at least, as she drifted off to sleep too.\n\nSometime in the middle of the night, while it was still dark outside the curtains, she woke up, and felt him spooning her back, and an erection pressing against the backs of her thighs. She found herself getting quite worked up too, and gently reached down and guided him into her, so that he was penetrating her from behind. Just slightly, she started pushing her butt back at him, feeling him nudge deeper into her. \n\nAt some point he began to awake, his hand reaching around to her front, grasping her breasts, clutching her hip as he thrust into her. Then suddenly he picked up the pace, pushing her and faster into her. This was a kind of fuck she hadn't had in months. It reminded her of the way David used to.\n\n\"Oh, Frederic,\" she moaned.\n\n\"Who's that, baby?\" came David's voice from behind her. A trick of the eye was one thing, but this set her hairs on end. Was it really him inside of her now? She had mixed feelings about that. Sure, she still yearned for him sometimes, but with the distance of time, she saw David now for the jerk he was.\n\n\"Huh?\" she asked, confused.\n\nFrederic sensed her confusion and immediately stopped thrusting into her. \"Jenna, are you alright?\" \n\nIt was definitely his voice this time, to Jenna's relief. And while they were lying still together, his cock nestled deep inside her, Jenna could feel everything. Every contour of it, every pulse, every throb.\n\n\"Yeah, I'm okay. Just lie still,\" she said. And then she closed her eyes and focused all her attention on that feeling inside of her, and very carefully starting flexing her muscles, in ways she didn't know she could do intentionally, until just now. From his gasps and groans, she could tell he was enjoying what she was doing, and it was pushing her towards climax too, feeling him spasm and bulge inside her, feeling the resistance of his muscles against hers in this tender, delicate dance. She was close, and clutched the sheets reflexively, even though neither of them were going anywhere, as a tear fell from her eye. And then with one more swell, she felt him grow bigger inside of her and then flood her interior with his seed. She was already on the precipice, and that made her lose control, clenching around him with every heaving breath, every spurt into her touching off another wave of pleasure.\n\n\"Jenna, that was incredible,\" he gasped afterward. \"You are incredible. But that time we did it your way. I want to do it my way, face to face, as soon as I'm ready for more.\"\n\n\"You will in a sec,\" she said. \"Don't move yet. I've got this.\"\n\nHe was only just beginning to soften inside of her. Even though her vaginal muscles were all loosened up from her explosive orgasm, she tried flexing them around him again.\n\n\"Oh my god,\" Frederic said. \"You do got this. You really got this.\"\n\nAs soon as he was hard again, he slipped out of her, and rolled her onto her back. He even turned on a lamp to get a better look at her. Jenna was in disbelief that anyone, let alone him, would want that, but it made her smile. Then he climbed over top of her and slid his erection back into her slit, where their juices already mixed. And he was right, it was more emotional to be face to face, where his lips could lean down to meet hers, where he could look into her eyes. The problem was, his eyes weren't always his. She tried to focus, to blink away the visions, but increasingly it wasn't Frederic thrusting into her, pressing down on her thighs, it was her brother. She remembered the sound of her own voice calling out his name. She couldn't let this end up that way.\n\n\"Stop. Sorry,\" she said, and she sat up and caught her breath. \"Okay, I have an idea. Lie down on your back.\"\n\nWhile Frederic rolled over onto his back, Jenna leaned off the side of the bed and grabbed his necktie out of the pile of clothes. She straddled his waist and then tied the necktie around her eyes. It might not solve all the problems, but it would at least let her ignore some of them. She guided his cock back into her and started riding it, pushing her weight down on him mercilessly.\n\nThey were both already worked up, and she slowed as she felt her nerves growing more sensitive. Still blindfolded, she leaned down and pressed her mouth to his. She tried to ignore the fact that the face she was kissing was clean-shaven, like Mike's, not like Frederic's or David's. She kissed him hard, and he thrust up into her wildly until she felt him cum inside her again. Before this weekend, she never would have imagined doing this unprotected, and now she'd gone through with it multiple times, now twice in one night. She knew she had to get that pill tomorrow, or maybe just maybe to reevaluate her life. But for now this felt good, too good to be true and too good to be wrong. The overwhelming orgasm pounding in her blood overwhelmed all her doubts about that, and the sneaking suspicion that it was her brother's body under her right now. She didn't care. Whatever mind tricks she had to weather, to be with Frederic this one last time, she would take whatever it threw at her. So it was with passion that she kissed lips that felt like her brother's, as her hips bucked uncontrollably, until she was a quivering mess. Then, finally, she went back to sleep.\n\n-----\n\nIn the morning, Mike awoke alone. Rosie must have gotten up early this time and left him sprawled naked on the bed of the honeymoon suite when housekeeping arrived. \n\nHe found Jenna in line for the breakfast buffet. She was glowing and smiling, and it was a good look for her, Mike thought. He tried not to compare it to how she had looked naked in his visions the night before.\n\nDuring breakfast, they could see and hear the storm raging outside. It was raining hard, and tree branches thrashed against the window panes. The sky was dark, aside from occasional bursts of lightning. The dining room shook with every strike close by.\n\n\"I'm not looking forward to driving home in this,\" Mike mentioned.\n\n\"I know. But we are supposed to leave today,\" Jenna said.\n\nThey packed up their bags and went to check out. Rosie wasn't at the front desk, it was a stern-looking man in his fifties. Mike was disappointed. He had been hoping to say a proper goodbye. \n\n\"Pardon me, we're here to check out,\" Mike said.\n\n\"I have bad news,\" the desk attendant said \"Unfortunately, there are some downed trees blocking the road out of here. We've been calling around all morning, but all of the tree crews are busy. I'm afraid no one's going to be able to clear the road until tomorrow.\"\n\n\"So we're stuck here,\" Mike said.\n\n\"Unacceptable,\" Jenna said. She seemed upset about the situation.\n\n\"Hey, I've been having a good time here,\" Mike said to her. \"I thought you were too.\"\n\n\"I mean yes, but...\" Jenna trailed off.\n\n\"But what?\"\n\n\"Never mind. I'll...deal,\" she pouted.\n\nThe desk attendant gave them a contrite, thin-lipped smile. \"We're very sorry about the situation. You can stay another night free of charge, everything included.\"\n\n\"What other option is there?\" Jenna asked, but she didn't wait for an answer, and stormed off.\n\n-------\n\nJenna went and dropped her bags in her room again. Room 126. Frederic had gotten up early again to go for a run. She wasn't sure how he did it, on such little sleep and probably a hangover. Now she took a walk around the hotel, but she didn't happen to spot him anywhere. He was probably in his room, but she didn't know which room he was actually in. Or maybe, having gotten up early, he had managed to check out before the road got blocked. Or maybe he had gotten caught in the storm. Regardless, Jenna decided it was out of her hands. Though she was disappointed not to be able to spend the extra day in his arms. \n\nBack in her room alone, she thought about all the things she'd done this weekend. If that first night had done it, then it might be too late for a morning after pill by the time she got out of this place tomorrow. Of course she still had options, but if the easy option wasn't going to work, that might change the equation for her. She could get the pill anyway and bet on it working, but then she might miss her next period, and be for sure pregnant before she had to decide what to do about it. Or she could not bother with the pill at all, and just wait and see if her period came.\n\nThinking about how she'd gotten Frederic off with just her vaginal muscles, she squeezed them again, and found herself getting wet. She had never been so strong down there before, or had so much control. Maybe it was another way she was becoming riper for motherhood. She squeezed her muscles again, imaging using that strength to push a baby out of her. She imagined its gentle bite on her nipple, and squeezed one between her fingers, simulating that sensation, and it triggered a spasm in her pelvic floor.\n\nYou know what? I am beautiful, Jenna thought. Sexy. Attractive. Fit. She was getting herself worked up to the point where normally her climax would come, but it didn't. She was aching for it, rubbing herself madly, but it wasn't until she slipped a finger into her pussy, and felt her vaginal muscles clamp down in it, felt the finger nudge into her like the tip of a cock, that the sexual energy building up inside her caught fire. It was a pleasant release, but still nothing like the explosive orgasms she had been experiencing the last few days. She had enjoyed the feeling of a man cumming inside her, from the first time she felt it, but she had never needed it in order to get off, until now.\n\nWhen the sweat cooled on her skin and her head started to clear, she wondered what she had been thinking, fantasizing about a baby, about lettting the baby inside her grow. No, she reminded herself, she could have conceived, but she wouldn't know for weeks yet. And there was still a chance that getting emergency contraception tomorrow could avoid the whole issue. What was she thinking though? She reminded herself that she had a whole career lined up ahead of her, and student loans to pay off, and an approved visa to move to Dubai. She had an exciting life planned out, one that didn't involve coming home from this weird hotel pregnant from a weekend fling. But the events of the weekend sure had made her horny.\n\nGetting dressed again, she found Mike in the lounge. They spent the afternoon playing the old boardgames that were there. It was nice, spending time, normal time, with her brother. Spending at least some of the weekend the way they had expected to, just hanging out. And maybe it undid some of the damage that this curse was probably doing to their relationship. Still, Jenna thought Mike's gaze sometimes lingered on her a little too long. And when their hands happened to touch, like when they exchanged playing cards, Jenna drew hers away like she'd touched a hot pan. Contact with Mike was tainted, at least for now, because it reminded her of sex with Frederic. She worried that if they hugged or sat close or let their fingers linger too long, then her breath would catch, her nipples would stiffen in her bra.\n\n------\n\nThe mood at dinner was somber. Almost everyone there had been planning to leave, and was trapped there by the weather. Mike doesn't see Rosie amongst the guests. If it was her day off, then maybe she took off before the road closed. Or maybe as a member of the staff, she still took her meals somewhere else.\n\nHis hopes weren't high, when he put on a button-down shirt and went down to the bar anyway. The hotel seemed to be full of attractive coeds his age, maybe it didn't matter that she'd gone. He couldn't believe how amazing the weekend had gone. Even with the curse, he'd never had sex this good. Or maybe because of it? Maybe it didn't matter who he hooked up with tonight, because whoever it was would look like his ex Lisa. Or more likely, Jenna. It was a bittersweet idea. No, that wasn't entirely true, he had gotten to know Rosie a little, and genuinely felt something for her, and the feeling seemed to be mutual. So he had alone at his own table for an hour, nursing a gin and tonic and hoping for a miracle.\n\nThen out of the corner of his eye, he saw her. Rosie was wearing the same purple evening dress as before, her red hair spilling down to the neckline. She smiled as they made eye contact. The curse was coming on strong tonight, the contours of her face shifting even as he looked at her, like a glitch. But occasionally his vision stabilized. It was definitely Rosie.\n\n\"You're still here,\" she remarked.\n\n\"Where else would I be?\" he replied.\n\n-------\n\n\"You're still here,\" Jenna remarked. \n\nSeeing Frederic brought a smile to her face. Especially the way he straightened up from a slouch at the sight of her. He seemed to be on his first G & T, so maybe there was still some hope for the evening.\n\n\"Where else would I be?\" Frederic replied. As she had walked up, it had definitely been him, but already the curse was taking hold, making him look like other men. Jenna tried to not let it get to her.\n\n\"I worried you might have left. Or tried to, and wound up crushed under a tree,\" she said.\n\n\"You'd be the first to know if that happened,\" he said. Jenna wasn't sure that was true, but she let it slide. She didn't have any appetite for disagreements tonight. She had other ideas in mind.\n\n\"Would you like to join me for a drink?\" Frederic asked.\n\nThe memory of that first night was still on her mind, and the blackout she'd dealt with the next day. She didn't want to tonight to be a gap in her memory. And a part of herself was wondering if it was time to quit drinking altogether, depending on what might happen next for her.\n\n\"I'd better not. So are you coming back to my room with me or not?\" she asked with a smile. He hopped up from his chair enthusiastically, leaving the drink there to melt, unfinished.\n\n------\n\nMike didn't hesitate. He got up and walked with Rosie back to her room, whichever one she had for the night. Maybe it was the cocktail in his stomach, but he lost track of where they went through the hallways. He wasn't sure how to get back to his room or the common area from here, but that was a problem he could sort out tomorrow. All he knew was, eventually they reached a door and went in. It was just a normal hotel room, like the kind he and Jenna had been staying in.\n\nThe door clicked shut and Rosie pressed him against it, her breasts warm against his chest, even through the fabric of her dress. Her lips sucked at his, her tongue slipping into his mouth, and he pulled her close and kissed her in return, just as passionately. Even so, there was a lingering tenderness when their kisses slowed, as they both knew this was their last night together. Mike didn't pay it any mind when for a moment it was his sister's lips against his. A moment later and it was Rosie again.\n\nShe stepped back and asked him to take off the dress for her. He blinked, and suddenly it was Jenna in that purple dress, her pudgy form filling it out altogether differently, though Mike didn't altogether mind. He unzipped the dress and kissed the back of her neck and shoulders, reaching around and fondling her breasts. Then she turned and undressed him, finding him already erect when she unfastened his slacks and let them fall. \n\nSitting at the edge of the bed, she pulled him close and leaned in to lick him, lubing him up before taking him whole into her mouth. Mike looked down, and Rosie's appearance shifted before him. Now it was Jenna's lips around him, her pudgy cheeks sucking him in, Jenna's throat swallowing him down. He sighed with pleasure, while trying to remember what this had felt like before. What she was doing to him, he wasn't sure he could handle for very long.\n\n\"Hang on, I'm...Oh my god...\" he said, losing control before he could stop himself. Mike struggled to stay upright. She kept sucking him hard while he shot ropes of cum into her mouth. With a moan, she swallowed it all, before pulling his penis from her mouth. She licked her lips proudly as she held her sticky prize.\n\n\"Sorry,\" he said with a smile.\n\n\"Don't be,\" she said. \"It'll come back.\" She sounded absolutely certain.\n\n\"Now if you don't mind,\" he said. \"...I want to taste you too.\"\n\nShe climbed further up on the bed, her naked body stretched out for him. Mike actually didn't mind that it was Jenna's thick, muscular thighs he kissed as he neared his target. In fact, he wondered wickedly how she'd taste, since he'd never get to find out in real life. \n\nHe started gently tonguing her clit, and found her juices enticing and sweet, and started lapping at his slit. But it was when he slipped a finger into her that she really went wild, pushing back against his hand. And the way her muscles clenched around his finger, he couldn't wait to replace that finger with something more. It wasn't long before he was hard again.\n\n\"You're back,\" she said, looking down at him over the hills of her breasts.\n\nTaking that as an invitation, Mike slid up the bed, ready to press himself into her slit.\n\n\"My turn,\" she said, getting up. \"Sit against the headboard.\"\n\n\"We're gonna make a ton of noise,\" Mike said, though he did what she suggested.\n\n\"I don't care,\" she replied. She straddled his legs, and rubbed the tip of his cock up and down her slit. \"There's something I ought to tell you...\"\n\n------\n\n\"There's something I ought to tell you,\" Jenna began. \"I'm actually not on birth control.\"\n\nFrederic looked surprised and a little betrayed, but speechless. Maybe she had lied to him Friday night, that first time that she couldn't remember.\n\n\"And um... The women in my family all get pregnant very easily,\" she added.\n\n\"Huh. The same is true of my family,\" Frederic said. \"So what are you going to do?\"\n\n\"To tell you the truth, I haven't entirely decided,\" she said. \"I don't have to figure it out until tomorrow, or maybe not at all. I just thought you should know.\"\n\n\"Well what do you want me to do tonight?\" he asked.\n\nShe leaned over, bringing her face close to his. \"Just do whatever feels right.\"",
        "In that moment, Frederic didn't look like himself, he had the face, and the body, head to know, of her brother Mike. But Jenna was too lost in her passion to care. She would have Frederic regardless of who he look like or was shaped like. She didn't care that it was Mike's close-shaved face that she pressed hers to now, it felt good, almost too good to be true. She had no regrets then, regrets were for tomorrow.\n\nShe kissed him and a sigh escaped both of them as she lowered herself onto Frederic's rod.\n\n------\n\n\"Just do whatever feels right,\" Rosie said, as she kissed him. \n\nMike's head was spinning. She wasn't actually on birth control? He might have spent the weekend knocking her up? He might be knocking her up tonight? He had never faced this situation before, but it added a certain significance to their every movement.\n\nThen she settled down onto Mike's cock. But it wasn't Rosie's body in that exquisite moment, it was Jenna's. Jenna's lips parting as he pushed into her. Jenna's vaginal walls caressing him as he sank deeper. He realized, to his surprise, that it actually felt better with Rosie when she looked like, and felt like, his sister. He liked feeling the additional weight of her pushing down on him, forcing his penis deeper into her. He liked her larger, rounder breasts, with nipples to match, which he reached up to grab with illicit delight. He liked the feeling of her thick thighs on either side of him, as she rose and fell on his lap. He liked how her pussy seemed to squeeze him harder, and to react more strongly to his every movement. He didn't think he could ever bring himself to actually fuck Jenna, but this was something else. He knew he'd never look at big girls the same way again. \n\nShe leaned in to kiss him. He faintly tasted himself on her tongue, on Jenna's tongue that is, as their mouths came together. His cock was lodged deep within her now, almost as deep as it could go. She moved her hips slightly back and forth, bumping her pubic mound against his, while within her, he felt so much more than that, her vaginal walls slipping and sliding against him with every movement, responding eagerly to his every swell, his every spasm.\n\nShe flattened herself against him, gripping him tight, and he dug his fingers into the flesh of her back. Even having spent himself already, he wasn't sure he could last. He almost didn't want to reach his climax, so that this moment could go on. But if she had brought him back once, she could surely do it again.\n\n\"I'm about to cum,\" he warned her.\n\n\"Me too,\" she gasped. \n\nHe pulled her as hard as he could down on his lap as he drove his hips up into hers. For a long moment, they clung there to each other, until he swelled up inside of her, and then his semen started to flow. It was in that moment that she screamed into their shared kiss, and he felt her pussy tighten around him. The sensation made him swell up and burst forth again, and he felt her contract around him again. The aftershocks of their orgasms fed back into each other until Mike felt like he had little more to give, but the pleasure still overwhelmed him as he lost control and blacked out.\n\n-------\n\nWith every jet of semen into her, Jenna's vagina sprung into action, squeezing it up out of Frederic's penis, her cervix convulsing, dipping into their shared juices, pressing back against him, causing further stimulation. Almost too much in fact, but plenty to set off another explosive orgasm. This was what she had needed and been missing when she had masturbated earlier. It was all she could do to cling to him, while their bodies convulsively combined their DNA. Knowing what might be happening inside her sent Jenna to even greater heights. She hung on to consciousness for as long as she could, but ultimately it slipped away from her, and she slumped down on her partner's chest.\n\nFrom behind her eyelids, Jenna could tell morning had come already. The air felt chilly, but she was cozy under the covers, with her body pressed up against his, her leg across his lap. She could tell by the pressure against her thigh that he was hard again in his sleep, and even while she was half asleep herself, she started to shift herself back on top to straddle him again, until his erection met her moistened slit. It felt like Mike's body under her, but so what? It had been Mike's body most of last night, the curse trying to get the better of her.\n\nShe had started to gently hump him, sliding their organs against each other, when she opened her eyes and saw that something was wrong. Dreadfully wrong.\n\nThis wasn't the hotel room she had gone to sleep in. Or maybe it was, but it wasn't the same. She wasn't in a bed, she was in a sleeping bag on the bare wooden floor. The walls had hardly any paint left on them. She was seeing the light of morning because there were no curtains on the window, and it had only fragments of glass left. \n\nThis was the ruined hotel Mike thought they had been coming to for the weekend. With a sinking feeling, Jenna realized that the man under her wasn't Frederic disguised as Mike, it was actually Mike she'd been on the verge of fucking. \n\n\"Oh fuck, Mike!\" Jenna yelled, clumsily extracting herself from the cocoon-like sleeping bag they had been in. \n\n\"Mmm huh?\" he said, coming the rest of the way awake. \"What the hell? What happened?\"\n\n\"I don't know. I have literally no idea,\" she said. She found her bags in the corner. Her phone was shut off. When it turned on it still didn't have signal, but it showed the date and time. \"It really is Monday, for what that's worth. We were actually here for three nights.\"\n\nJenna felt something drip down her leg. Still naked, she reached down and touched herself, her hand coming away with sticky, milky fluid. \"Mike, I...I have semen my vagina.\"\n\n\"Ew! Gross!\" he replied. \"Let's take this one step at a time. Did we both have memories of this weekend?\"\n\n\"I have memories,\" Jenna said. But she didn't like the fact that she'd woken up in an abandoned hotel, in a sleeping bag with her brother, with a pussy full of cum and no other viable suspects. Had he drugged her or something? \"You first. What's the last thing you remember?\"\n\n\"I was in bed with Rosie,\" he began, and checked that she wasn't lost already. \n\nJenna gave him a nod to continue and started throwing on clothes. She was chilled in the unheated air, and didn't want to be naked in front of Mike.\n\nHe went on, \"...and she told me, when we started to...you know...that she wasn't on actually birth control, and that the women in her family...\"\n\n\"...get pregnant easily. Mike, those were my words last night,\" she said, sitting down on the floor. \"And then you said that the same is true in your family. Which it is, because your family is my family. This is bad. This is really, really bad. Were we actually having sex with each other all weekend?\"\n\n\"Let's compare notes. Other than the last night, Rosie and I had sex shortly after 9 PM on Friday and Saturday nights.\"\n\n\"So not at the same time,\" Jenna said, still very much uncertain.\n\n\"Oh, and I definitely remember being out in the hallway and hearing you and that French guy going at it during the day on Saturday,\" Mike said.\n\n\"Mike, would you look at this place? The hallway you thought you were in doesn't exist. You couldn't have been listening behind the door because there are no doors,\" Jenna ranted, setting aside the image of Mike listening on her having sex. This was no time to worry about that, when the reality might have been much worse.\n\n\"Well, if I'm right, then maybe we only did it the once, and imagined the rest. If you're right, then might have came inside you...six times?\" Mike said.\n\n\"Technically, one time, he...just call it seven,\" Jenna said.\n\nMike got out of the sleeping bag, and walked over to the other wall.\n\n\"Jeez Mike, put on some clothes!\" Jenna said. It really didn't help that his body looked exactly the way Frederic's had, when the curse was making Frederic look like Mike. Or that his erection was taking its time shrinking back down to size.\n\n\"You're going to want to see this,\" he said, and pointed out a plaque on the wall.\n\nJenna went over and read it. It said, \"In this, the most tragic room of all, two lovers were found dead in each others' arms. Rosie Tanner, a hotel employee, was found in bed with Frederic La Range, an Olympic athlete. An autopsy found that Rosie was carrying Frederic's child at the time of the Incident, though they were not wed.\"\n\n\"Maybe we were possessed,\" Mike said. \"That would explain why it felt like I was out in the hallway. Or maybe it's ghost semen.\"\n\nJenna shot him a glare. This was no time for jokes.\n\n\"Well, do you have any more plausible explanation?\" he asked.\n\nShe didn't. Though she was still struggling to comprehend the situation.\n\n------\n\nThey threw the bags back in the car. Mike was still trying to work out how they'd even stayed alive all weekend, when none of the things he had ate or drank had been real.\n\nThe road out was thankfully clear of downed trees. There wasn't much evidence of any storm at all. As he drove, Mike stole glances at Jenna, trying to see how she was taking the shocking revelations of the morning. The thing was, he remembered kissing that face, fondling those breasts, and so on. He tried to bury the thought and keep his eyes on the road.\n\n\"Are you okay?\" he asked.\n\n\"I don't know,\" she answered at first. Then she added, \"First pharmacy you see, I'm gonna need a morning after pill.\"\n\n\"Roger that,\" he said. \"Hey were you serious about considering keeping it?\"\n\n\"Kinda. Maybe. But not now,\" she said, numbly. \"Not my brother's.\"\n\n\"Of course not,\" Mike agreed. \"It's kind of romantic isn't it, that Rosie and Frederic used us to be together one more time?\"\n\n\"I'm going to have to listen to your ghost theories until we get back in range of a radio station, aren't I,\" Jenna said. She didn't sound sincerely annoyed though. \"Then why didn't the two of them get together?\"\n\n\"They did though, by the end. I thought I was with Rosie, and you thought you were with Frederic.\" He went on, \"The way we woke up, it was just like they were found. Maybe even right down to the unborn child.\"\n\n\"You're going to make me sick, Mike. I'm going to ghost-vomit all over your car,\" Jenna said.\n\n\"Must be etherial morning sickness,\" Mike joked, and smiled at her. It was almost back to the way they'd been.\n\nThe thing was, Mike wasn't sure it ever could be back to normal. He had witnessed firsthand the marvel that Jenna's body was. And Rosie might have really been Jenna the entire time. At the very least, whenever Mike had thought it was the curse disguising her as Jenna, it had at least been Jenna's actual smile, Jenna's gestures, Jenna's laughs and gasps and moans.\n\n\"First stop, pharmacy,\" he said. And then he reached across the center console and took her hand in his. He was terrified that maybe he'd been the only one starting to feel this way.\n\nShe didn't snatch her hand away, like she had during the card game the day before. She looked surprised, and conflicted with herself, but there was something else there. A raw desire, as she squeezed his hand back. Then she leaned over towards him, and slid their clasped hands back into his lap, where an erection was growing.\n\nIn little more than a whisper, she said, \"Maybe we should make that the second stop.\""
    ],
    "authorname": "shimm2",
    "tags": [
        "impregnation",
        "possession",
        "brother/sister"
    ],
    "category": "Erotic Horror",
    "url": "https://www.literotica.com/s/the-haunted-hotel-ch-01"
}