{
    "title": "The Reluctant Psychic Ch. 18",
    "pages": [
        "If you are new to the Reluctant Psychic series, this chapter will not make much sense, if any, without the context of the previous chapters.\n\nFor those of you who are returning to the series, thank you for your patience, and I hope you enjoy the story.\n\n* * *\n\nI was afloat in a sea of light. I readied myself to be pulled back to my body in a vertigo inducing moment. But I kept floating. The crisp whiteness of the light started to fade into the sullied color of old snow. As the intensity of the light faded, so did the feeling of weightlessness.\n\nThe light grays turned to dark grays, and I felt pressure surrounding me. I couldn't say on what part of my body the pressure pushed, because I couldn't even tell if I had a body. In this formless gray on gray world, there was no anchor of reality, only unbalanced forces pulling and twisting me.\n\nI tried to concentrate on one streak of gray that appeared darker than the others. But as I watched it seemed to become a lighter gray, or perhaps the surrounding grays got darker. I couldn't tell if I was even looking at the same streak of gray as they moved around, or perhaps I was moving.\n\nWhy couldn't I get back to my body? My mind went in circles chasing after the answer, but it was as elusive as the streaks of gray that faded through each other in this strange place. How did I even get to this strange place?\n\nAnna's room, I recalled. I was talking to her, remembering our first meeting. No, it was after that that the light consumed me. Anna said, \"Then listen to your conscience. Go back to your girls, they need you. Raise your sons and daughters to be strong of body and conscience.\" That was when the light began.\n\nI noticed a streak of red standing out starkly from the sea of grays. My senses latched on to it, only to have it skitter away. Or did the whole world go red long enough to let the streak dissolve into obscurity. Was the color a figment of my imagination, was this whole world a construct of my mind?\n\n\"Of course, it is\" a voice whispered. The sound resonated my entire being.\n\nIf it's in my mind, then I should be able to stop it. I should be able to wake up from the coma. I thought back to the classes I had taken, everything I learned when Anna fell into her coma. A hysterical coma happens when the mind can't adapt to an event or situation. It is a protective mechanism where the subconscious tries to sort everything out.\n\nBut I had sorted things out. Anna helped me realize I had to go back to the girls. I could raise my children to use their powers for good purposes. They wouldn't have to be like me. Once I realized that Anna's room began fading away. So I should be back in my body by now.\n\nThe world turned an angry shade of black as I remembered what Anna asked me moments before the light took me away from her. She wanted to die. The sky turned darker still as another thought occurred to me: the only way she could leave me was through death.\n\nShe didn't want to die, she just wanted to be done with me, leave me alone in the world.\n\n\"You aren't alone in the world, only in here,\" another voice said.\n\n\"Anna?\" I asked the formlessness.\n\n\"She loves you still,\" a voice called from the distance.\n\n\"Who are you?\" I cried out. The void refused to answer.\n\nI was on the verge of cursing the interminable silence when I finally heard, \"Do you love her?\"\n\n\"More than life itself!\" I cried.\n\n\"Her life or your own?\" The voice asked. I felt like a particular dense child being lead to an answer that was obvious to everyone except him. The obviousness of the answer was all the more vexing for being out of reach.\n\n\"Speak clearly! Who are you?\"\n\n\"Who are you?\" the voice asked, very clearly.\n\n\"I know who I am,\" I said, wishing I had arms that I could cross over a chest I also wished to possess.\n\nThe voice left me alone and quite confused. Of course, I'd meant my own life. What sense would it make to love Anna more than her life? How could I love her if she were dead?\n\nHow could I love her in a coma? How could I love a voice in my head, a voice that might not even be Anna?\n\nThe pressure began to ease, and I felt myself floating again. I was at the bottom of an ocean, and the salty water was pushing against me, slowly squeezing me towards the surface. As I ascended, I became aware.\n\n* * *\n\n\"Tell the angel who will watch over your life to pray now and then for a man who, like Satan, believed himself for an instant to be equal to God, but who realized in all humility that supreme power and wisdom are in the hands of God alone,\" I heard Gwen voice say.\n\n\"Am I really like Satan?\" I asked, or tried to ask through a parched throat.\n\n\"You're awake!\" she exclaimed as she hurried to my bedside. I tried to reach out my hand, but my arms felt strangely heavy and stiff. She grasped my hand, and a moment later I felt my other hand being clasped as well. I looked over to see Betsy standing on the other side of my bed, tears streaming down her face.\n\n\"I was so afraid I'd lose you too,\" she thought. I realized that I read her more clearly that I ever had before. I also felt her intense fear of being left alone, as she'd been reliving the horror of her father's coma.\n\nI tried again to speak, but my throat was much too dry. Instead, I clasped her hand and sent my thoughts, \"I'm so sorry that I frightened you.\" As I looked at her, and then Gwen, and saw the depth of their relief I wondered, \"How long have I been out?\"\n\n\"It's been more than a week,\" Betsy said simply. She squeezed my hand then bent down to give me a kiss. \"I have to call the others, Gwen will fill you in.\" Betsy hurried from the room, and I knew she needed time to compose herself as much as anything.\n\n\"The doctors wouldn't let all of us stay. They did the first day, but only because Betsy made them. You would have been so proud of her, she can't do the things you can but she made them let everyone stay anyway.\" Gwen went on to explain that the hospital only allowed relatives into the patient's room outside of visiting hours. So Betsy and Gwen took the night shift, and the other girls had stayed with me during the day.\n\n\"I almost got through the whole book while we were waiting for you to wake up. The nice doctor said that reading to someone in a coma can help. But later I overheard the mean doctor say that wasn't true and they just tell people that so they don't pester the doctors with questions while they're waiting.\"\n\nBetsy came back into the room with a nurse in tow. The nurse gave me a glass of water, and then asked the sort of questions they always seem to ask in a hospital. I answered her questions, said I didn't have any of my own, and took her assurances that the doctor had been paged and would be with me shortly.\n\nAlthough Betsy looked much better than she had when she left, she reminded me all too much of the young lady who I rescued from the hospital a decade before. \"Has it really been that long?\" I murmured.\n\n\"It's more like twelve years.\" Then she added softly, \"almost half of my life.\"\n\nWhere had the time gone, I wondered, as we lapsed into silence.\n\n* * *\n\nDoctor Conners arrived just ahead of a wave of women that didn't believe in the concept of \"visiting hours are over.\" Since it was Gwen's nice doctor, he told the nurse she didn't need to call security. But he did insist that all the girls wait outside while he checked on me.\n\nAs the door closed the girls outside, I said, \"Before we begin, I need to ask about one of your other patients.\"\n\nThe doctor insisted.\n\nI insisted.\n\nThe doctor said, \"Well, you've shown yourself recovered enough to be stubborn. Just promise me that after I answer your questions, you'll answer mine before you go back into a coma.\"\n\n\"I'm not going back into a coma,\" I told the doctor. \"I'll answer all your questions after you tell me about Anna.\"\n\nThe doctor surprised me by walking to the side of the bed and sitting down in a chair. \"I won't ask if you're sure you want to hear about it now, because you have a determination about you that won't tolerate questions.\"\n\nThe doctor took a deep breath and took a moment to gather his thoughts. \"I've been that girl's doctor for over a decade and she's a bona fide medical mystery. There is no reason for her to be in a coma.\" The doctor stood up and started pacing as he said, \"Hell, every test we run says she's not in a coma.\"\n\nHe turned to look me straight in the eye, \"That is until you got here. The second day you were here it all changed and she went vegetative. What do you have to do with that girl? Don't give me any of that legal guardian stuff, because I know it's all a lie. Nineteen year olds don't become legal guardians of other nineteen year olds without chicanery.\"\n\nI couldn't help laughing, even though it hurt my throat. \"You're something else, Doc. I can see why Gwen likes you.\" The doctor handed me a glass of water and waited for me to drink. \"You're right, it was chicanery. The truth is, she's my—\" I stopped for a moment, wondering if I could really say it, wondering if it was really true.\n\n\"She's my fiancée. I proposed the night before she fell into the coma. I had to fake a few things to make sure she was taken care of, since I'm the closest thing to family she has in the world.\"\n\nThe doctor nodded his head. It was an answer he could clearly accept. Even though it wasn't legal, it was in the best interest of the patient, and it looked legal enough. \"But what about the change in her condition? You seemed to know about it before I told you.\"\n\nI looked the doctor over and asked, \"Can I trust you?\" The doctor looked at me quizzically, but didn't answer right away. I could have probed his mind to find the answer, but simply posing the question brought everything to the surface so I wouldn't have to go deep.\n\n\"I'm glad,\" I said before the doctor could speak. \"I'm glad that you were going to qualify the answer so you wouldn't violate your Hippocratic Oath or your faith. I'm also glad that I can trust you, now the question is whether you will believe me.\"\n\nSo, I told the doctor the truth. I told him how I had psychic powers and when I made love to Anna she lapsed into a coma. I told him that Anna talked to me, or at least she had. I didn't tell him all the gory details of my life, but I told him enough.\n\n\"You're wondering if I'm crazy, which doesn't require psychic powers to figure out. But underneath all the skepticism and years of medical training, you believe me. You believe me because it simply can't be a coincidence that I went into a coma, and her coma changed for the first time in years.\"\n\n\"It's an intriguing story that you tell,\" the doctor said. He was struggling to remain skeptical because he actually wanted to believe. He wanted to test the truth, but was afraid. He was partially afraid because I might be telling the truth, he was also afraid of being made to look foolish.\n\n\"You want to test me by thinking of a color and having me guess. Red,\" I said. He recoiled a bit, but I pressed on, \"You're right, colors are too easy. Yes, let's do some number guessing. Nineteen, your daughter's age. Fifty two cards in a deck. Pi? Really, you want to go transcendental?\"\n\n\"Stop! I believe you,\" the doctor said. It was only then that I realized how close to panicking the man was.\n\n\"Sorry Doctor, that was rather rude of me. I don't usually do that sort of thing. At least I'm trying not to,\" I said. He was still nervous so I added, \"I'll stop.\" The doctor appeared somewhat mollified, but his heart was still racing and his mind reeling.\n\n\"So,\" the doctor began. He pursed his lips and his mind churned as he tried to make sense of it all. \"Can you read anyone's mind?\"\n\n\"Yes, even some of those in comas,\" I replied. The doctor took a step back, and I realized my mistake. \"I made an educated guess, Doctor. I thought that was something that might appeal to you.\"\n\n\"It does offer an amazing opportunity,\" the doctor said.\n\n\"Doc, when you're so excited, and agitated, it makes it hard for me not to read your mind,\" I said. I really was having a hard time blocking his thoughts out. It was almost as if some of my control went away with Anna.\n\nI felt the doctor make an effort to settle his mind. He also switched gears, \"So, why do you want to know about Anna's condition?\"\n\nI was a bit blind-sided by the question. The question was inevitable, but I didn't expect to face it so soon. I stared across the room and said, \"When I fell into the coma, I became trapped in a room. Not just any room, it was Anna's room.\" I started to get choked up, and this time it wasn't merely the parched throat.\n\n\"She was there, wasn't she?\" He asked. My eyes swiveled from the blurred painting on the wall, to look the equally blurry doctor in the face. I could only nod in agreement. \"Take your time,\" he said as I struggled to find my voice again.\n\nHe handed me a glass of water and a box of tissues. I needed both, and a few calming breaths before I could continue. \"She's been trapped in there ever since,\" I said struggling for words to describe what happened. I finished lamely, \"Ever since it happened.\"\n\n\"She's tired,\" I said. \"She can't live like that any longer. She asked me—\" My throat closed up and the words wouldn't come out. I turned my head away in shame.\n\n\"It's alright,\" Doctor Conners said. \"I won't make you say it, not yet. I've lost track of the number of times I've seen families struggle with this issue. At least you know what Anna wants. That is more comfort than most people will ever have.\"\n\nI nodded my head, but kept my face turned away. I heard the doctor walking away and said, \"What about your questions?\"\n\n\"I think it's safe to say your cognitive functions are working. That's enough for now,\" he said. He stopped at the door and turned back to ask, \"Would you like a few moments before I let your,\" he paused to consider the appropriate word, finishing, \"family back in?\"\n\nI nodded, and proceeded to blow my nose rather loudly, and try to wipe my face clean.\n\n* * *\n\nIt wasn't until the next day that I could talk to Doctor Conners alone again. I had undergone another battery of tests and visits from a half dozen specialists. The tests and specialists declared me fit for discharge as soon as Doctor Conners signed off.\n\nOnce again he shooed the girls from the room before commencing our interview. \"How are you feeling today?\"\n\n\"I'm ready to get out of bed, that's for sure.\"\n\n\"Well, you've checked out fine, so I'm ready to sign your discharge papers,\" he said. He didn't actually move to sign the pages clipped to his board, however.\n\n\"Before I leave,\" I started. The room only blurred slightly as I continued, \"I need to see to what we talked about.\" I exhaled violently. \"No, I have to see Anna again. I want to be with her when you turn off the machines.\"\n\n\"She's waited this long. You can go home, take a few days and then come back,\" the doctor said. He was offering me a last respite, even though he knew I wouldn't take it.\n\n\"No, Doctor Conners, I can't. She's already waited too long.\"\n\n\"I thought you might say that,\" he said as he walked out the door. He came back a moment later with a wheelchair. \"I'll tell them I want to keep you a couple more days for observation, but I'm afraid until then you'll get around in this.\"\n\n\"I can walk,\" I said, as I swung my legs off the side of the bed. As I stood up, the world started going black, and only the doctor's hands on my arms kept me from falling back on the bed.\n\n\"I'm sure you can,\" he said in a way that almost didn't sound condescending. \"But it is hospital policy.\"\n\nI relented, but only because my legs were so stiff it would have taken an hour to walk to Anna's room. At least, that's what I told myself. In reality, I would have preferred it to take an hour, or a day. I settled into the chair and let the doctor push me to Anna's room. It turned out that it wouldn't have taken me an hour, since she was right next door.\n\nI took a moment to look around the room, noticing how similar it was to mine. I also noticed that not only was her room right next to mine, but there was a door that looked to connect them. I almost asked the doctor why he didn't take me through that way, but as I turned my head I caught a glimpse of Anna lying on the bed.\n\nI had looked at every part of the room except for the bed. It was as if my mind shied away from seeing Anna in her current condition. The doctor left me just inside the room, leaving me alone for a moment to confront my feelings. I slowly rolled the chair towards the bed.\n\nEven after all these years, Anna looked beautiful. Her long blonde hair was neatly brushed over her shoulder. Her faced had thinned over the years, losing the baby fat that had made her seem part cherub. But the lean lines of her face were still beautiful, even angelic, just an angel of a different type.\n\nI grasped her hand and felt how thin it had gotten. I recoiled inwardly as it felt like I was holding the hand of a skeleton. The prominence of her bones was disturbing enough, but I also couldn't feel anything behind the thin flesh. I strained my powers to their limits, but I couldn't feel even a spark within her flesh. I had never been able to feel anything in her, but before I'd always had hope.\n\nThe doctor returned with a lawyer and some paperwork. I don't remember the doctor's explanation, or signing the papers. I don't remember turning off the machines. All I remember was saying \"I'm sorry Anna,\" over and over.\n\n* * *\n\nAt some point, I returned to my room. I must have eaten as well, because when I woke up I had to use the bathroom. I almost called the nurse to help me, since I felt much too stiff to make it on my own, especially since I had to navigate through a room full of women. Somehow they must have talked the doctor into letting them stay with me. I used just a hint of my powers to keep them asleep as I saw to my needs.\n\nI was about to climb back into bed when I noticed the door that lead to Anna's room. I slowly navigated my way towards the door, and through into Anna's room. I dragged one of the chairs to her bedside and sat with her.\n\nAs I sat there, holding her hand, my mind started to clear. I found that I was talking to her as I gently combed her hair with my free hand. \"How long did we have Anna?\" I asked.\n\nI laughed slightly, \"No, not including when you were a passenger in my head.\" I could almost hear her voice talking to me, but unlike before I knew this time it was my imagination. \"I didn't mean for it to happen. I hope you know that.\"\n\nI heard gentle movements coming from the room next door, and my thoughts turned to my girls. \"They are all really wonderful. I wish you could have met them. Although, I suppose if you hadn't gone into a coma, I never would have met any of them.\"\n\n\"You're right. That was the first time I said you fell into a coma instead of saying I put you into it. It wasn't your fault, but I guess I just can't carry the entire burden any longer.\"\n\nAgain, I heard noises from the next room. I sent my thoughts over to the girls, but they were all still asleep. I tasted their dreams and couldn't help but smile. I saw images of baby rooms, and baby toys, and of course babies. My smile started to fade, as I felt the stress this ordeal was putting on the girls. They loved me, and were willing to put my needs before their own.\n\nMy mind suddenly lurched as I came to a realization. They weren't putting my needs before their own; they were putting Anna's needs first. My vision blurred as I really began to understand. All these years, I've been punishing myself for what I did to Anna. In doing so, I had forced the girls to be second to a ghost.\n\n\"How long did we have?\" I asked Anna again. \"Was it really only six months?\"\n\nI stroked her hair again, reluctant to speak aloud what I felt growing inside of me. I took a deep breath, and then another and said, \"I'm sorry Anna. I will always love you, but I can't keep on this way. I've been holding on so long, because I don't deserve happiness after all the things that I've done. But the girls do deserve happiness. They deserve more than I have ever given them. They deserve all of my love, not just the scraps I can tear away from loving you.\"",
        "\"I have to go now, they are waiting for me. They have been waiting much too long. I will always love you, and I swear that I'll teach my children not to make the mistake that I made.\"\n\nI stood up, leaned over Anna and placed a kiss on her forehead. \"Goodbye Anna. I hope you find the peace in the next life that I took from you in this one.\"\n\nWith tears brimming in my eyes, I slowly made my way back to my room, gently closing the door to Anna's room.\n\n* * *\n\nI was staring at the ceiling as the sun rose and filled the room with light. The girls started to stir as the darkness fled. Bambi was the first to wake up enough to check on me. She clasped my hand and stroked my cheek. \"How are you feeling?\" she asked softly.\n\n\"I feel like going home,\" I said, looking deep into her eyes. She didn't need powers to know what I meant. She hugged me tightly and cried with happiness. It didn't take long for the other girls to wake to what was happening.\n\nIt took the hospital staff a bit longer to get my discharge sorted out. But, by the time we had finished a very crowded breakfast in my room, Doctor Conners came by to sign me out. The good doctor and I shared a brief but significant look. There was no way he could understand it all, but he understood enough and he promised to have the hospital call. He didn't say why the hospital would be calling, he didn't need to.\n\nI was soon driving away from the hospital in a caravan of cars. As we drove, my mind kept wandering, unable to concentrate on the conversation buzzing inside the car. But as my eyes wandered, rather than seeking out the clouds outside the window, they settled on the girls.\n\n* * *\n\nDinner that night was a muted affair. Out of respect for Anna, they left the seat next to me empty. It was a touching gesture, but it was also a nagging reminder. The side of me that was normally kept warm by a close pressed body instead felt tingly cold as if I was sitting next to a ghost.\n\nThe girls acted as if I was sitting next to a ghost as well. At first they engaged me in conversation as usual, but as the meal went on, I caught more glances toward the empty seat followed by averted eyes. They were happy that Anna was soon to be out of our lives, but ashamed for feeling that way. They were sorry for me, and for Anna, but they knew it was for the best.\n\nKatia was also missing from dinner. I heard something about a patient who went into labor, but I wondered if she was absent because she didn't know about my powers. Or perhaps it was because she didn't know the true story about Anna. She would have to learn soon enough, but now was perhaps not the best time.\n\nBy the time dessert was served the girls and I had little appetite left. I doubt there was ever so much uneaten dessert as there was that night. The girls started drifting away from the table. They each came to my chair and gave me a kiss on the cheek before departing. Some started to offer words of encouragement, or consolation, but one glance of the empty seat and they scurried off without a word.\n\nBetsy and Gwen were the last to leave. I could sense how much they wanted to leave, to have time for their own thoughts, but they stayed to keep me company. Finally, I told them that I needed time alone with my thoughts as much as they did. They didn't believe me, but eventually they departed, relieved and concerned in equal parts. In my mind's eye, I watched them walk slowly back to the girls' side of the house. They walked with their arms around each other, talking quietly.\n\nI looked at the remains of our dinner and the empty chairs surrounding the table. I then did something I had never done before: I took my dirty plate and glass to the kitchen. After a bit of looking around I found a cart and pushed it back to the table and loaded all of the other dishes onto it. I took my time, allowing my mind to wander as I cleared the table. I seldom, if ever, even wondered who cleared the table after meals. I'd always taken such things for granted. I took a number of things in the house for granted. Perhaps this was the first step in making sure I no longer did.\n\nIt must have taken an hour to clear the table and load the dishwashers. I didn't know what was usually done with the leftovers, and nearly decided to throw them out. But with nearly a dozen pregnant women in the house, I decided it was probably best to leave some pre-cooked food around.\n\nOnce I was done in the kitchen, I went around the house, turning off the lights. This task, at least, I was familiar with. There were many nights when my dark memories stirred too close to the surface to face sleep. Tonight, I knew, was going to be such a night.\n\nAs I shut off the last light downstairs, I found my feet taking me towards the back door rather than the stairs. I soon crossed the terrace, and then the yard. My pace slowed as I entered the woods, as the moon's illumination grew too feeble to travel quickly. But even in the near blackness of the woods, my feet knew the way to my not-so-secret lair.\n\nThe lair, turned clubhouse, was far enough away from the house that my powers couldn't reach from one to the other. Inside I could be isolated from the girls' thoughts, and they could be isolated from mine. I neared the edge of my range and stopped, casting my thoughts back to my girls. My touch must have been clumsy from such a distance, since I could feel many of them focus their attention on me. I told them all goodnight. I must have sent more than just goodnight, since there were no protestations of concern or offers to keep me company.\n\nA few more minutes of walking and I was out of range entirely. I made my way through the hidden door, and the long corridor to my hideout. I crossed immediately to the far doors that lead out onto the balcony cut into the cliff face. I stood there and watched the stars spin slowly across the sky. I let my mind wander and tried to find some sort of peace with the world.\n\n* * *\n\nThe next few days were a blur. It was as if I fell asleep watching the stars and awoke to here Betsy telling me that Doctor Conners was on the phone for me.\n\nI remember how very steady my hand was as I reached for the phone. I put it to my ear and said in a perfectly calm voice, \"Hello Doctor Conners.\"\n\nMy hearing seemed to fade in and out as I listened to Dr. Conners. But while my conscious mind might only have heard, \"...I'm calling regarding Anna...\" my subconscious mind heard the entire conversation.\n\nI heard myself say, in a perfectly calm voice, \"Thank-you for calling Doctor.\" My hand was still steady when I put the phone down on the cradle. As the line clicked shut, the world suddenly began to spin as my legs collapsed, leaving me sitting on the floor. I cradled my head in my hands waiting for the world to stop moving, and grimly holding on to consciousness.\n\nEventually the world stopped spinning, and I became aware of my surroundings. All of my girls were around me, some close enough that they struggled to resist grabbing me in their arms. They sat, knelt and stood around me, waiting for me to say what they all already knew.\n\nI looked up, and in the back of the group, I saw a young blonde head. Of all the faces that were turned towards me, hers was the only one at peace. She touched her slim fingers to her lips and blew me a kiss, before folding her fingers in a small sad wave. The sadness only touched her face for a moment and caused only a single tear to slide down her cheek. The peace settled over her face again. I felt a small portion of that peace settle into my heart. I closed my eyes and took a deep shuddering breath. When I opened my eyes again, she was gone.\n\n\"Goodbye Anna,\" I said.\n\n* * *\n\nI hope you have enjoyed the story as much as I have enjoyed writing it. I'd like to thank everyone who has stuck with the story through the many delays. I'd especially like to thank the people who have taken the time to write me comments on the story and who have voted. It really means a lot to me.\n\nI would also love to hear your reactions/comments now that the story has ended."
    ],
    "authorname": "only_more_so",
    "tags": [
        "surreal",
        "no-sex",
        "coma"
    ],
    "category": "Mind Control",
    "url": "https://www.literotica.com/s/the-reluctant-psychic-ch-18"
}