{
    "title": "NewU Pt. 03",
    "pages": [
        "Author's note: Hey Readers \n\nThis is where the story starts delving into the mid control/sci-fi elements of the narrative, this chapter is mild in terms of erotic scenes but it is where our pre-power hero starts to understand the scope of his ability... the fun stuff starts back up again soon. \n\nHope you enjoy \n\nThe Novalist \n\nThe rest of the day had been fairly uneventful; Becky had gone off shift a few hours after our 'appointment', she had popped in to say goodbye but, other than that, I hadn't really seen her - or any of the other nurses - since our rendezvous had finished. Jimmy had come, as expected, for the afternoon's visiting hours; the conversation had been normal enough, almost exclusively dominated by his growing desire for Philippa. My mind was consumed with the memories of Becky's touch; her hands, her skin, her lips... both sets... her warmth and, most dominantly, her eyes, flashing with primal hunger before I spent myself into her mouth. That serene satisfaction that she had pleased me filling her thoughts, that glow about her that radiated blissful contentment... she was genuinely happy with her decision to follow through with her plan and would have spent the rest of the day with me if her duties had allowed. Unfortunately for both of us, they hadn't. \n\nJimmy had, of course, noticed my distracted involvement in our conversation; he had bought my excuse about being tired and had shrugged the rest off as a hangover from my parents visit. For his part, Jimmy had been elated at Philippa's perceived - albeit vague - interest in him, I was the only one that knew her real desires and her growing attraction to my friend; but he'd had the good sense to swear off other women until he got a concrete answer from the object of his obsession. As far as he was concerned, he had gone 8 weeks without any pussy, another few weeks wouldn't hurt if there was a change of Philippa being his reward, especially if it meant something more long-term than his usual conquests. \n\nDespite me being awful company - and in a true testament to his friendship and character - Jimmy had not cut his visit short and had stayed right up until the end of visiting hours, his happy chattering about Philippa - or occasionally, and briefly, another subject - had gone a long way in distracting me from my own thoughts which were as happy and optimistic as his, and he had known when to stay quiet and leave me to my thoughts when my mind drifted away from the conversation. \n\nBecky wasn't the only subject occupying my mind, although she was by far the most dominant and enjoyable; it was becoming increasingly difficult to drown out the thoughts coming from random people around me. At first - immediately after the accident - I seemed to be only able to hear people that were right next to me, especially if they were concentrating on me, but over the past day or so, that limit had loosened; now I could hear the thoughts of random strangers in the hallway, thoughts that would grow in volume as they approached my door and then die away as they moved further away from me. Although I had never seen it, I knew that the nurses station had to be reasonably close to my door, because a lot of the thoughts I was picking up involved complex and undecipherable medical jargon, thoughts about treatments, medication, therapies and - from the male nurses especially - the relative hotness of guests and colleagues. Apparently, Jimmy was right, Charlotte - who I still hadn't met - was the epitome of feminine beauty, surpassing even Becky and Philippa on the nurse's scale of hotness. \n\nIt had become overwhelmingly exhausting. The promise of this ESP thing was quickly being tempered by the sheer volume of 'noise' it was picking up from useless sources. Sleep seemed to be the only respite and as Jimmy stood up to say his goodbyes, my feelings of guilt for giving him less than my full attention was offset by the prospect of blissful respite from the thoughts of the people around me. My eyes dropped shut almost as soon as the door closed behind him. \n\nI couldn't tell you what time It was; the still curtain-less windows showed nothing but blackness in the night sky but I was pulled from my sleep by a feeling - a presence - that I could only describe as power. \n\nMy eyes took a few moments to adjust to the dimly lit room, but soon a figure could be made out, standing off to my left. It was male, that much was obvious from the sheer size and shape of the intruder but there was more about him that that. \n\nHe smiled as he stepped into the small amount of light from the window. \n\nNow, I have never been homoerotically inclined; I am not homophobic in the slightest, it's just that the relative attractiveness of other men is not a concept that I am familiar with, but this man was an Adonis! His broad shoulders, chiseled jaw, immaculate features and piercing blue eyes could drop panties, harden nipples and moisten labia at 50 paces. There was an air of well-earned superiority about him, like a pro-athlete, multinational business billionaire or Hollywood superstar deeming you worthy of unrequested personal attention... like a demigod stepped down from Olympus just to talk to you; it was awe inspiring. \n\nStrangely, however, I felt no danger or threat from this man whatsoever - counterintuitive when you consider being woken by a shadowy figure in the middle of the night, albeit a perfect specimen of masculinity - in fact, the man gave off an aura of friendship, trustworthiness and safety that I doubt I will ever be able to adequately explain. My mind instinctively reached out to see his thoughts, it wasn't a conscious act, it was something I had been involuntarily doing since the MRI incident but this time, I genuinely wanted to know what was on this stranger's mind, but - for the first time - they seemed cut off from me. \n\n\"So, it is you.\" He smiled warmly. \n\n\"I... err... Who? ...\" \n\n\"I've been looking forward to meeting you.\" He said, his smile never waning for a second. \n\n\"Have you?\" I asked with a cocked eyebrow, I was surprised by his statement, aside from the severity of the car crash and the fact that I survived it, I didn't think there was anything special about me at all, at least nothing that anyone other than I was aware of. \n\n\"I am like you.\" He simply said, his statement was followed by a rush of thoughts, as if the gates baring my gift from his mind was suddenly thrown open and everything behind them came rushing out in one unrelenting torrent. \n\nSuddenly, I was aware of things that I couldn't possibly have known; his name was Marco and he was old, hundreds of years old, more importantly - at least to my addled brain which seemed to jump over that nugget like a rat in the street - he really was like me. I could almost see the activity on his theta wave and although Doc Harris had said that judging the relative power of a person was difficult from just looking at a wave form, I instinctively knew that this man was powerful, how his power compared to mine - it would seem - was still a matter of investigation. What was most important though, was that this man identified as a teacher... maybe an apprentice's master would be a more accurate description, but even that hardly did it justice. \n\nMoreover, we weren't the only ones; dozens, maybe hundreds of faces flashed through my mind... his mind... whatever, each of them possessing the same gift I had miraculously gained, yet I somehow knew that of all of them, I was the only one not gifted with this ability from birth. He was here to initiate me into their little brotherhood and train me in the use of this new gift, but given the source of my power, my 'training' - for lack of a better word - would be unusual for the both of us. \n\nAs quickly as it started, the flow of information stopped. My eyes eventually refocused on the dimly lit room that I had completely forgotten I was in; his smiling face was the first thing that drew my eyes. \"Impressive,\" he nodded, \"not many people can handle that level of exchange on their first attempt.\" \n\n\"Err... thanks.\" \n\nHe huffed a laugh, moving forward and sitting himself down into the chair usually reserved for Jimmy, crossing one leg over the other and straightening his back into what can only be described as a perfect posture. \"I'm guessing you have questions.\" \n\n\"A few.\" \n\nHis smile widened. \"I knew I would like you.\" \n\n\"You did? How?\" \n\n\"As you probably know now,\" he started, \"we can... sense... another person with our gift from great distances, the limit of that distance directly corresponds to the power of our gifts, in our case, the power of mine... and the power of yours.\" \n\n\"Cool, so how far away were you when you sensed mine.\" \n\n\"I was in Rome.\" My eyebrows shot up, he had located me from easily over 1000 miles away, I was suddenly very grateful that he bore me no ill intent, not that I could have done anything to defend myself against this man in my normal condition, let alone my current one. \"I have been reading your memories and your thoughts since I detected you; you haven't had an easy life, Pete, but you have conducted yourself honorably, you deal with your problems and hardships, not with violence or aggression like most, but with humor and integrity. As you already know, I usually only deal with children - the ages at which their gift becomes active varies in age from 9 to about 14, so I have never initiated one so... mature before. Hopefully, that maturity and your character will go some way to offset the... err... novelty of your situation.\" I already had more questions than I could count from that statement alone, but I seemed to know that they would all be answered as his lessons went on. \"I suppose I had better start from the beginning. \n\n\"The Doctor you spoke to was right, at least in part; we are the next step in human evolution, but by the same determination, we are also 'not human' - the only analogy I can give is the evolution from Neanderthal man to Homo-Sapiens: related, but different - with enough numbers and enough time, ours will become the dominant species on the planet. Humans, as we know them now, will simply be bred out of existence.\" \n\n\"I'm not sure they will be happy about that.\" \n\n\"We'll get to that,\" he replied, his words slow and careful, as if each of them was carefully considered before being spoken, \"but safe to say, the homo-sapiens were extremely violent when it came to replace their less evolved cousins, we are committed to not following their example. Anyway... the first of us, at least the first of us that we are aware of was a woman, her name was Maria - our Eve. We don't know exactly when she was born, but her writings tell us that one of her parents and both of her siblings were killed in the Black Death - the plague that swept Europe in the mid-1300s - somewhere around modern-day Munich. She was caught up in - and eventually killed during - the Salem Witch Trials in 1693 meaning that at the time of her death, she was about 350 years old. \n\n\"In that time, she had travelled all over the world, looking for others like her, and she found them... she is the spiritual mother of our species, even though it is unlikely that she truly was the first of our kind. She also spent centuries trying to discover the source of her powers... of our powers. What she first postulated - and we have since confirmed - is that our kind go through some sort of transformation in the womb under some very specific circumstances; in short: the mother needs to contract some sort of illness, the type of illness is unimportant, but it must be one that transfers through the mother to the fetus - the common cold or the flu, or even cancer, for example, don't work. The fetus, in turn, needs to be at a point in its development during which the brain is being formed from a group of cells into a more complex organ... if all this happens at the right time, a new part of the brain develops, bridging the gap between the right and left hemispheres and the various lobes and giving us what we have called 'the gift'. I'm not going to lie, it is an extremely complex process that some of the best minds in the world have spent decades trying to explain, but that is the best theory we have so far... the only other way is for one of us to have a child, passing it down genetically is the most common and easiest way for us to grow our numbers. \n\n\"In your case,\" he went on, \"our best guess is that your mother did contract some kind of illness that transferred to you, enough to partially develop the new lobe, but not enough to activate the gift. Then, when the MRI overloaded, the magnetic waves finished the process and activated your abilities. What we have discovered is that the strength or power of a person's gift is directly proportionate to the severity of the illness they were subjected to; there is little doubt that without the lobe, the waves of that errant MRI would have killed you instantly. Some of our greatest scientific and medical minds are keen to see how much power that translates into, but the working theory is that you may be one of the most powerful of us all, maybe only matched by the great Uri.\" \n\n\"Uri?\" \n\n\"Uri's mother lived in the city of Pripyat\" my look of confusion told him to continue, \"she was only a few miles away when the nuclear reactor at Chernobyl melted down, she was dosed with unimaginable amounts of radiation, most of which was transferred to Uri... his power far exceeds any other known gift by some margin.\" \n\n\"Ah, so why is he so great?\" \n\nMarco laughed again, \"If we were ever to say we had a leader, it would be Uri\" he thought for a second before correcting himself, \"maybe leader is not the right term, guardian maybe... he protects us.\" \n\n\"From what?\" \n\n\"That will come later in your training.\" Marco smiled again. \n\n\"And how long will that take?\" I asked carefully, \"I don't mean to sound rude, but the sooner you can show me how to control these powers, so I'm not bombarded with random peoples' thoughts, the better... It feels like my head is going to explode sometimes.\" \n\nMarco's smile faltered for a second, his brows arching into a concerned frown. \"Really?\" he mused to himself, \"that's interesting... I'll show you everything you need to know, but to answer your question... about an hour.\" \n\n\"An hour?!?\" \n\nMarco's smile resumed its rightful place. \"You'll be amazed what you can achieve with the gift. Before we start, there is something that you need to consider... it will help make the whole process go that much easier; humans are one of only a few species in the natural world who are born lacking an understanding of their own abilities. A baby does not know how to walk, or talk, it cannot feed itself or communicate with its parents; it is totally reliant on adults to keep it safe and alive, there are almost no other examples of this in the natural world. Almost every land going animal is born knowing how to - and being able to - walk, there are a few exceptions, but the overwhelming majority are on their feet within minutes of being born. Most know how to feed without help; they know where the mother's teat is or how to gather food for themselves, fish are born knowing how to swim and how to feed, some species have genetically passed down the instinct to hide in shallow waters to avoid predators and almost all animals can communicate with their peers. Even birds, capable of the most complex physical activity on earth, are born knowing how to fly - even if they are not physically capable for it for a few weeks. \n\n\"The reason why human's cant is simple. The human brain is so advanced that it takes about 2 years to develop to the point that it is capable of something approaching self-sufficiency, but if that were to take place in the womb - as it does almost everywhere else - a human woman would have to give birth to a toddler. A woman's body simply isn't designed to allow a child of that size through the birth canal, neither the mother nor the child would survive that kind of pregnancy. \n\n\"This becomes relevant when you consider the gift; in the same way a horse is born knowing how to walk, we are born with an instinctive knowledge of how to use our gift... most of us don't become consciously aware of our powers until we hit puberty, but when we do, we go through a process known as 'the awakening'... it is our evolution's way of allowing us to comprehend and access our powers. \n\n\"In your case, its slightly different... you didn't have your powers when you went through puberty, and we can't make you go through puberty now, but the theory still stands; your subconscious mind contains the knowledge and ability to control your gift, the fact that you have a lobe - and are still alive and possess the gift - proves it... we just need to initiate your awakening.\" \n\n\"Cool, so how do we do that?\" I asked. There was a small part of me that felt like I should be laughing my ass off at the absurdity of what I was hearing, or at least thoroughly questioning it, but there was something about Marco that made me accept his story without doubt; whether it was part of the gift or a conscious compelling by Marco, I wasn't sure, but nothing that Marco was telling me seemed anything other than the logical explanation of my condition. I wasn't confused or doubtful, I was just grateful and eager to learn. \n\nMarco's warm smile remained in place as he effortless pulled himself from Jimmy's chair and walked up to the side of my bed. \"Take my hand\" he whispered almost reverently. I arced an eyebrow, suddenly worried I wouldn't be able to keep a straight face if this guy started muttering a prayer or a spell, but I did as he asked. \n\nAs soon as our fingers touched, existence fell away. \n\nI found myself standing in a room; it was odd, like an overly dramatic movie set. It was dark, with invisible light sources overhead providing the only illumination yet I could see everything. If I were ever to imagine what the insides of Bond villain's office would look like, this would be it. There was a huge computer against one wall, multiple screens - currently blank - hanging off the wall above the keyboard. Alongside it were huge units of memory banks - the kind you see in server farms or on supercomputers, the kind that hold incalculable amounts of information, I had seen these kinds of things before as part of my studies into computer game development for online games. Along the wall opposite the computer was a large, black, leather, comfortable looking sofa and an equally luxurious looking bed. On the walls behind me, either side of the door I didn't remember entering though, were hanging sets of Plasma screen TVs. In the center of the room, was an illuminated, round white podium, the kind you would see at a tailors... it all looked very impressive but I had no idea what any of it actually did... or where I was... or why I was here. \n\nSuddenly, Marco was standing next to me. \n\n\"Where is this?\" I asked, still looking around the office. \n\n\"That's... hard to explain.\" He answered after some thought. \"this is your subconscious mind's interpretation of your gift. It's a way of explaining it to you in a manner that you can understand.\" \n\n\"Hmmm...\" my subconscious wasn't doing a particularly good job on that front. \"Ok, so... what's that?\" I asked, pointing to the computer, obviously the most important thing in the room. \n\n\"That's where things get complicated,\" Marco answered after another pause, \"You see, what you are seeing is your subconscious mind's interpretation of your gift. Even though you can see me, I cannot see what you are seeing, I am in my own subconscious looking at my gift and you are here with me. In my case, it is a library; rows upon rows of books and information and memories, maps, diagrams, and a desk to study and organize them all... a writing bureau to make my own additions... and - probably like you - a very nice bed. My library is the physical manifestation of how my subconscious perceives the world and my understanding of it. Yours will be very different. ",
        "\"There are, however, the same basic elements in everyone's library - at least that is what I call my own subconscious, you may want to call it something else - the first is the storage, usually that takes up most of the space in the room you are standing in,\" my eyes were instinctively drawn to the memory banks. \"this is where your life's experiences and knowledge are stored, the room itself will grow as needed to allow this storage space to grow, there is no limit to how much knowledge and memories you can hold in this space.\" \n\n\"Cool.\" \n\n\"Now, there should be a way to access them... They are not accessible at the moment, but there should be a way for you to start using them; in my case, there was a rope barrier blocking access to the aisles. Look around your storage space to see what I mean; the answer should be obvious to you.\" \n\nWith a shrug, I walked over to the memory banks and immediately noticed that they weren't switched on, a small power socket at ankle height to the left of the machines seemed to be connected to banks. I flicked the switch and the banks hummed into life. The effect was immediate; in an instant every long forgotten memory, every piece of information, every lesson from school and every detail of every conversation I had ever had appeared in my mind... not an overwhelming resurgence of information, just the knowledge that they were all instantly accessible. With a thought, I could recall my first steps, the perfume that Stacy Granger - my first crush - wore during the summer dance, and the feeling creeping up my spine when, a few years later, her sister gave me my very first blowjob. Every single nugget of information I had ever learnt, including every word I had heard or read about my college degree was at my finger tips and - more than that - organized in a way that made it all make perfect sense. The information I now had would allow me to ace my way through college... college that I may never be able to attend again. That final thought pulled me back from the euphoric realizations that had kept my mind busy for the past few minutes. \n\n\"Wow\" I mumbled with a little less enthusiasm than this ability warranted. \n\n\"Have you accessed it?\" \n\n\"Yeah, it's amazing.\" I put a little more effort into my voice this time, not wanting to sound ungrateful for Marco's help or underwhelmed with an ability that most people would kill for. \n\n\"Don't worry about your injuries,\" Marco said with a smile, somehow - and unsurprisingly - knowing what I was thinking, \"We will get to that in a minute, but rest assured, there are very few things that our gift cannot change.\" Again, my usual skepticism was silenced by the trust I instinctively had in Marco. \n\n\"Ok, next there should be some sort of viewing device, something that you would use to be able to see yourself; Mine is a full-length mirror.\" \n\nMy eyebrows scrunched up, something to view myself in, there is nothing like... my eyes were drawn to the tailors platform in the center of the room; with the new found memories at my fingertips, it was looking a lot more familiar than I had originally noticed, it took only a few seconds for me to realize what I was looking at... It was a character design screen from a computer game. The newfound understanding that the memory banks allowed filled in the blanks for me; Marco was old, I hadn't worked out exactly how old yet, but certainly older than modern computing technology; his way of gaining and storing information was with books, books which - for my generation - had been replaced with computers. He saw himself as a 2-Dimensional reflection in a mirror, my gaming experience had trained me to think of myself as three-dimensional character floating on a screen, a screen which contained a pedestal just like this one. \"I've got it.\" I answered. \n\n\"Ok, same principle, you need to activate it. I had to simply look into mine, you will know what to do with yours.\" He was right, all I needed to do was to walk up to the pedestal and stand on it. The lights underneath came on but, other than that, nothing else happened. \n\n\"Err... ok, I think that's on, now what?\" \n\n\"Now leave it.\" \n\n\"Leave it?\" \n\n\"Yes, walk away from it.\" \n\nI did as I was told and walked back towards the door, resuming my place next to Marco. When I turned back towards the room, I was surprised to see a 3D holographic representation of my body - complete with scars and broken limbs - something my current 'subconscious' body was lacking - slowly rotating a few inches above the pedestal. \"I... erm...\" I had no idea what I was looking at, which felt strange considering my newfound abilities from the memory banks... which in turn felt strange due to the speed with which that ability now seemed natural. Part of me was convinced that I should be freaking the fuck out by now. \n\n\"That,\" Marco said with a smile, \"Is what I call the editing station. With that, you can change anything you wish about your physical body.\" I cocked an eyebrow at him. \"What? Do you think I was born looking like this?\" \n\nI shrugged, everything Marco had told me so far had been true, so I saw little reason to start doubting or questioning him now. \"So, how does it work?\" \n\n\"Basically, and as strange as this may sound, you only need to concentrate on which parts of your body you want to change and how you want to change it, and the editing station will do the rest for you. Be careful though, any drastic changes will be noticed by others which in turn can draw some unwanted attention.\" \n\n\"Can't I just make those changes happen gradually?\" I asked. \"Like, this is what I want to look like, make those changes happen over the next... I don't know... 3 months.\" \n\nMarco's smile widened, \"You're a much faster learner than I had hoped.\" \n\nI walked up to the pedestal. Right, well then... all that broken shit can go! I want to make a full and complete recovery in the next... I don't know... what's a realistic time frame for me to get back on my feet? No fucker will give me a straight answer for that one. Ah fuck it, let's see what this thing can do, let's say 6 weeks. I want to have a better body, and be better looking... nothing stupid, I don't want to be a body builder size, maybe like brad pit in fight club or something, maybe Cuba Gooding Jr in Jerry Maguire. Let's do that over the same time. Hmmm... I paused. Looks would be difficult, people know what I look like and a better body can be explained away with working out, changing my face, not so much... I gave it some more thought... nope, nothing. I'll have to come back to that. Oh... an obvious one, I want a bigger cock, nothing obscene, let's say another few inches... and that shit can happen right the fuck now! Same will illnesses or diseases, I want to be in perfect God Dammed health by the time I leave hospital, whenever the fuck that will be. \n\n\"Ok, I think I'm done.\" \n\n\"You healed yourself didn't you.\" Marco grinned. \n\n\"Err... gradually, yes.\" \n\n\"Doctor Harris was right about another thing. This gift is part of an evolutionary trait, but one of the others that we have is - as she explained - accelerated healing. If you think about the source of our differences to humanity - the illnesses during fetal development - it is essential that we can heal those illnesses very quickly, being born with Typhus - as I would have been - would have killed our race off in our infancy. Your wounds will heal all on their own with no assistance from you in a much faster time that even you would think of, same with illnesses. How long did you say?\" \n\n\"Err... six weeks.\" \n\n\"Ha!\" Marco Laughed, \"Try two\" \n\n\"Cool,\" I muttered, \"Wont that be hard to explain.\" \n\n\"Very, but again, we'll get to that.\" Marco stretched and resumed his smile, \"right, next will be the desk, or at least mine is a desk. It is something you would commonly associate with working, studying, that kind of thing. I would hazard a guess that yours is some sort of computer.\" \n\n\"Yup.\" \n\n\"Alright, you know what to do.\" \n\nSurprisingly, I did. Just like the memory banks, it was simply a case of turning the computer on, no wall sockets this time, but pressing the power button the computer itself. Blue lights illuminated from within the machine, casting a glow over the comfortable looking desk chair I hadn't realized was there until now. A few moments later, the three screens on the wall flickered to life. Streams of information started flowing across them, all of it completely incomprehensible to me. \n\n\"Err...\" \n\n\"Let me guess, you are seeing some writing that you don't understand.\" \n\n\"Lots of it.\" \n\n\"Don't worry about that for now, it is the visualization of neural energy, in short, it's the language of your brain. When you focus on it in context, you will be able to understand it. Now, your desk will be split into three parts...\" I assumed he was talking about the three screens. \"yours might be slightly different but usually, the one in the middle is the internal version of the editing station. My mirror allows me to edit my external features, this part of the desk allows me to edit my internal ones; there are very few limits to what this can achieve, it has already allowed you to read other people's thoughts, that one is almost always active unless you apply filters... mine for example is filtered to only hear thoughts that are relevant to me or that I would find useful.\" \n\n\"That's a big vague, isn't it?\" \n\n\"It doesn't need to be specific, you are giving filters to your own subconscious, you are literally talking to yourself, you know what you mean; you subconscious will always read everyone's thoughts, there is nothing you can do about that, but these filters will stop it from passing them all on to you. In my case, it filters out thoughts that I would consider useless and only pass the important ones on to me... it's my subconscious, so it knows the difference. All you need to do is write something relevant to your situation onto the middle section of the desk, and the desk will do the rest.\" \n\nI sat myself down into the absurdly comfortable chair, took the mouse and moved the cursor to the middle screen, as soon as I clicked, the streams of untranslatable data vanished. \n\nFilter all thoughts so I only hear the ones that are relevant to me or ones that I would find useful or important. I typed, then pressed enter. There was a small ding noise, like the ones that came with the old email programs and the writing disappeared. Quickly replaced with the gibberish data again. \"So, what else can this do?\" I called over my shoulder to Marco. \n\n\"Pretty much anything you want, and being internal, there are less requirements for the changes to be careful... People can't see them but giving yourself the ability to fly would probably be a bad idea.\" \n\n\"I can do that?\" I asked in incredulous surprise. \n\n\"You can do whatever you want.\" He shrugged simply. \n\nHmmm. I squinted at the screens, maybe making myself better looking and thinking of a way to explain it isn't necessary, what if I made myself 'seem' more attractive with this? My fingers started moving on their own. I want to be more attractive to women... I typed, no, that's not enough... the degree by which they are attracted to me is proportional to how attractive I find them, the hotter I think they are, the more attracted they are to me... \n\nCool, what next. \n\nWomen who are very attractive - and therefore very attracted to me - will be much more willing to hit on me or otherwise initiate contact with a view of having sex... basically, they are ridiculously horny, are willing to act on it when they are with me and they become increasingly sexually aggressive the more attractive I find them... Within reason... I added that last bit after images of Becky mauling me in plain view of her colleagues flashed into my mind. As hot and sexy as she was, I didn't want her to lose her job on my account, making her a cock hungry slut with eyes only for me would probably do more harm than good. But this system would need some serious exploring. \n\n\"Ok, I'm done.\" I called to Marco. \n\n\"Excellent, so, the center part of the desk is about editing you, the section on the right is about editing everything else.\" \n\n\"What?\" \n\n\"If you want to suddenly have a million dollars in your bank, you use this... If you want a certain person to fall hopelessly in love with you, you use this... if you want to make the entire world forget that a song existed - as one of our brethren did - and then claim it as your own, you use this... however, this is easily the single most dangerous part of our gift, changing things here is the easiest way to get noticed and get in trouble... and before you ask, yes, you can kill people with it, but unless it is for a very good reason, there will be consequences; we have our own special brand of justice for people who misuse their gift.\" \n\n\"Err...\" \n\n\"You made women want to have sex with you, didn't you?\" Marco smirked. \n\n\"Maybe...\" \n\n\"As I said, eventually, our species will grow to become the dominant race on the planet, so growing our numbers is actually quite important, most of us have some sort of command like that... maybe in the future, when there are enough of us, they may change the law to stop that, but we are thousands of years away from that point. So, have as much fun as you like... no kids though, even we have strong moral objections to pedophilia.\" \n\n\"Right, good to know.\" I filed the question about 'their own brand of justice' away for later, \"So, how would I use it?\" \n\n\"Carefully.\" Marco said, without a hint of humor, \"You need to be very careful about what you write in there and you will almost always have to use a caveat like 'nobody will notice' or 'this will never be traced back to me' or something to protect yourself from the consequences. If you gave yourself a million dollars, for example, the bank, or the IRS, or the Police would start asking questions, if you said that you wanted a million dollars and nobody would notice unless you wanted them too... that would be easier to get away with. The one that most people put in is something on the lines of 'if anyone finds out about my powers, they will be unwilling or unable to let anyone else know, in any way, under any circumstances without my explicit permission.' That tends to cover a lot of the bases for poorly worded commands. \n\nI nodded and typed the command into the right-hand screen as Marco had transcribed it. \n\n\"Ok, the last portion of the desk - the one on the left - is your way of accessing information, a way to instantly learn anything; whatever you ask for gets stored in your memory banks and becomes part of your accessible knowledge. In my case, whatever I want to know forms itself into a book which is then stored in my library, but because it is in my library, I automatically understand and have access to it.\" \n\n\"That could be useful.\" \n\n\"You have no idea.\" Marco grinned. \"How many languages do you speak?\" \n\n\"Err... Just English, learnt a little French and Spanish in school but nothing that I could use.\" \n\n\"One of the most common things that initiates ask for is to be able to understand any human language. Give it a go.\" \n\nI moved the cursor and typed in the appropriate command. Nothing happened. \n\n\"I... err... don't think it's working.\" \n\n\"Are you sure?\" \n\n\"Pretty sure.\" \n\n\"Then how are you understanding and answering me when I am speaking Aramaic? A language that hasn't been heard by human ears in over a millennium.\" \n\nAs soon as I started paying attention to the actual words coming out of his mouth, I knew he was telling the truth. \"Holy Shit! That's incredible!\" I looked back down at the keyboard. I want to have a complete working knowledge of the theory and practice of all computer game development. I typed in and immediately, the knowledge given to me from the memory banks' recollection of my studies was cast in a new light... not only did I understand every word of it, but it all seemed a little... easy, primitive even. \n\nFuck! I am going to have some fun with this! \n\nAlright, I've always wanted to learn a martial art, so let's make myself an expert in all of them... done! Let's also add in a musical instrument or two, let's say guitar and piano, that is something else I've always regretted as a child... done! Should I make myself the next soccer superstar? I begged off that last one, having a shit load of money had always held an appeal for me but fame and celebrity status sounded like my personal version of hell! But either way, this desk thing - all three parts - would need to be explored in minute detail at a later date. \n\n\"That is awesome.\" I muttered as I swung my chair back around to face Marco. \"So, what are they?\" I asked before realizing that not only could he not see what I was pointing at, but what I was pointing at looking completely different for him. \"Err... either side of the door.\" \n\nMarco turned around to look at what I was pointing at, \"Oh, the windows, I almost forgot about them.\" He said with a smile, \"So, the one on the right of the door is basically a view of what your eyes can see, it's a way of still being aware of your surroundings when you are in here. The one on the left is slightly more complicated, that one shows you information. Different people use that one in different ways, some use it as a screen to watch old memories, others use it to watch other people - the ultimate stalking apparatus - others use it to monitor things like the news or the stock market, basically, you can use that for whatever you like. You should already know how to activate them... I had to open my windows.\" \n\nOf course, he was right. I walked over to each screen and switched them on. The one on the right was displaying the view through my own eyes - currently staring at the ceiling of my hospital room, the top half of Marco's face visible on the left-hand side of the screen, mirroring my expression. Without even consciously thinking about it, my sight moved down to see that we were still holding hands. The screen on the left was still blank, I didn't need to ask Marco why, I was starting to get the hang of this now, it was blank because I hadn't given it a task yet. \n\n\"Finally, the last element of your library - and the one you will probably use the most - is the bed, it is also the hardest one to explain.\" he thought for a few seconds before continuing. \"an average human requires between 6 and 10 hours sleep per night, that sleep is used to... 'recharge' their bodies and minds; food gives them energy but sleep is needed to allocate that energy to where it needs to go, obviously it is nowhere near as simple as that, but you get the idea.\" \n\nI didn't. \n\n\"Our species works a little differently; our bodies are much more efficient when it comes to using energy so we usually need less than an hours sleep a day to recharge our bodies, the more healthy we eat, the more efficient that process. Our minds, however, are a completely different story; they are much more advanced than humans and require a massive amount of energy to keep working properly, if we were to use conventional sleep to recharge our minds, we would need to sleep for 30 out of every 48 hours. I'll take a guess that you have been more tired than usual lately.\" \n\n\"You could say that.\" \n\n\"Ok, so here is where is gets complicated. Our minds are able to process information at much faster rate than humans - significantly faster - that means that outside of here...\" he gestured to the room around us \"...our perception is altered by our brains to make time seem like it is passing slowly. Our brains work so quickly that without that altered perception, everything would seem like it was running in slow motion. In this room, however, our minds are free to run at their full capabilities, meaning that both mentally and - more importantly - physically, time is running at a much faster rate in here than it is out there. ",
        "I blinked at him a few times before he continued. \"How long do you think we have been in here?\" \n\n\"I don't know...\" I thought about it for a second, between the wandering around, being introduced to each machine, switching them on, learning how to use them, making some changes and then more conversation, we had to have been in here for quite a while by now. \"45 minutes? Maybe an hour?\" \n\n\"We have been in here for a little over 38 seconds.\" \n\n\"That can't be right!\" \n\n\"look through your window, look for something that would normally be moving.\" \n\nI did as he suggested and walked up to my screen, the view instinctively following where I would normally guide my eyes. I couldn't make out anything in the room that would normally be moving, suddenly I remembered the drip tubes attached to my arm and watched as my sight followed the tubing up to the drip chamber. With a feeling of utter astonishment, I watched a drip leave the pipette and start falling into the chamber, what would normally take less than a second took almost 5 minutes to finish. \"Fuuuuck!\" \n\n\"Impressive, right?\" Marco grinned. \"Now, the bed is literally just for sleeping in, but sleeping at this massively increased rate of time; a solid 12 hours sleep in here equates to about 45 minutes out there allowing us to recharge our minds in a reasonable and practical amount of time.\" \n\n\"Wow!\" it wasn't my most articulate moment, but I was genuinely lost for words. \n\n\"Now, laying in the bed will activate your powers... all the things that you have altered today will be applied and your library will be available to you at any time in the future.\" \n\n\"So, how do I get in here in the future?\" I asked as I walked over to the bed. \"I'm assuming I won't need you every time.\" \n\n\"No, of course not,\" he said, that permanent smile never waning for a second, \"all you need to do is think about the door, you will see it in your mind's eye and walk through it. It will be surprisingly natural after a few attempts.\" \n\n\"Fair enough,\" I nodded as I climbed onto the bed and laid down, waited a few seconds then got back up and walked over to Marco. \n\n\"You're getting the hang of this.\" He said with an impressed tone. \"But activating the bed was the last task to perform in here, we can go back to your hospital room for the rest of it now.\" \n\n\"Cool, but... err... you didn't mention the sofa. What is that for?\" \n\nMarco's smile faltered, his brow furrowing into a look of confusion and curiosity. \"what sofa, there are only four elements to a library. Are you saying you have another?\" \n\n\"Err... unless the big ass, expensive looking sofa doesn't count... yes.\" \n\nHis eyes widened slightly, almost a look of awe. \"There have been rumors about people with more than the four elements, Uri is thought to have five, but he has never confirmed it, at least not to anyone I know. As a rule, each object in here has a function; I only have four and have never met anybody that has five, other than Uri. I'm afraid I can't help you with the sofa, you may have to work out its purpose for yourself.\" \n\nI frowned, leaving this room without all the answers felt... unsettling, although I couldn't tell you why; it was almost like having a limb whose purpose you didn't understand and just hung there, looking awkward until you could figure it out. I would need to spend a lot of time in by new bunker to work all of this out and explore it properly. \n\nHey... I just figured out my name for this place... My Bunker. Sounded just like something a Bond villain would have. I turned away from the Bunker and followed Marco through the door. \n\nWith a sharp inhale, I returned to the hospital room and immediately knew something was different. I felt... Powerful... that there was nothing in all the realms of possibility that were beyond my abilities. Forget the Demigod walking down from Olympus, I was the motherfucking Demigod and I knew it! I looked over to Marco - who had let go of my hand and was looking at me with an expression of wide-eyed wonder. It took less only a few seconds to work out why; Marco's power - we both realized - paled in comparison to my own, I was more powerful than he was by several orders of magnitude and everything about him peeled open like a grape. The impenetrable gates that held back his thoughts when we first met now seemed like nothing more that stacked twigs on a hinge, even his looks - which had been so striking - seemed to crumble under my scrutiny; it was like I could see the decisions and commands that went into every individual change he had made to himself and - moreover - I could see through them to the skinny and sickly teenager he had been when he made them from his home in Northern Italy 127 years earlier. \n\nThe world hummed with an energy that I could not only perceive, but interact with and control; I could sense the people in the hallways, the people on the highway outside the hospital, the people all over the city that surrounded it and the all over the country that surrounded that. I could feel the couple in Paris making love, I could feel the fear of the man being mugged in Barcelona, I could feel the excitement in the child on the eve of her 10<sup>th</sup> birthday from her bedroom on the outskirts of Budapest... and I could sense Becky, her dreams filled with visions of our coupling, her body basking in the warm post-orgasmic afterglow of those memories and the promise of more. I felt like my mind was now a muscle, able to be stretched and honed with practice, not simply an important part of the whole and capable of feats that, only a few minutes ago, would have seemed utterly preposterous. \n\nMarco cleared his throat, composing himself before starting to speak. \"feels good doesn't it?\" His smile returned, but now seemed almost nervous, like a man staring down a tiger. With a single thought I put his mind at ease, I owed a lot to Marco and I still had a lot to learn from him, he had no reason to fear me... my single thought let him know that. His smile returned to its warm and easy state in moments. \"Thank you,\" he sighed in relief, \"I have heard about people as powerful as you, but I have never initiated one, you can never tell how a person will react when they feel that first surge of power. I imagine yours was quite exhilarating.\" \n\n\"You could say that.\" \n\n\"And putting my mind at ease was a nice touch, you seem to have an almost instinctive knowledge of how to use your power, an instinct that most of us take years to develop.\" \n\n\"I didn't want you wigging out on me.\" I smiled easily - perhaps the first time I had managed that since meeting Marco, \"and I get the impression you have much more to teach me.\" \n\n\"Teach you, no.\" he replied, \"as far as your abilities go, you have learned everything I have to teach, \"but tell you, yes. There are many things you need to know...\" \n\nI cut him off with a wave of my hand, someone was coming; before the door had fully opened, I had used my powers on the attractive middle aged nurse to make her ignore - or not even notice - Marco's presence and to think I was asleep. She quietly tip-toed further into the room, took some readings from the machines by my bedside, checked my pain medication and turned to leave. With a single thought, she stopped, turned back into the room and lifted her scrubs to show off her impressive chest... shook her tits a few times... then continued about her duties as of nothing had happened, which as far as she was concerned, nothing had. \n\nMarco watched her go with a smirk. \"Very nice,\" he nodded appreciatively, \"both the use of your powers and her lovely breasts... Anyway, most of the things you need to know will come with time, but there is one subject that needs to be discussed immediately.\" \n\n\"You are talking about the things that Uri has protected you from.\" \n\nMarco nodded. \"As powerful as our gifts may be, there are a small group of people who can detect them... or at least their effects; the vast majority of people will be oblivious to your powers, but there are a small number who are able to notice the changes around them that most people miss, passive abilities - like reading their thoughts - are still invisible to them as well, but direct powers are different. Over the centuries, these people have formed into a group that you have probably already heard of. The call themselves The Inquisitors. \n\n\"For centuries, they have operated through the church, first labeling us as witches or heretics and later moving on to calling us criminals or terrorists, they have orchestrated or directly led massive movements to find and eradicate people of our kind. The Salem Witch Trials that killed Maria, that was them, so were the Spanish Inquisitions and they played a huge part in the Nazi movement and the Holocaust. They are the greatest, and only real threat to our survival, and their sole occupation is to hunt us down and kill us, a task they have become extremely good at. Nowadays, they don't just use the church; they operate in Police forces, newsrooms, government positions, anywhere where they are in a position to detect the effects of our powers. And make no mistake, the operate above the law, there is nobody out there that is in a position to help us.\" \n\n\"What powers do they have?\" \n\n\"They don't have any powers per se, at least not in the same way we do; their powers lie in the ability to notice the changes made by our powers - hence the need to be careful with your commands on the editing stations. Excessive changes, or changes that are too large, draw their attention and once they have their eye on you, it is very difficult to get away from it. They do, however, have a limited... resistance... to our power, attempts at directly controlling them have failed, Uri is the only one who seems powerful enough to have any effect, and their combat skills are at least as powerful as ours. In a one-on-one fight, our kind usually wins because of the advantages our powers give us, they may be able to fight us off in hand-to-hand combat, but dropping a building on their heads is still enough to kill them... the problem is that they rarely - if ever - work alone, there is always a team; none of our kind has ever stood their ground against an Inquisitor team and lived to tell about it, not even Uri... he has been forced to retreat many times when facing a group of them. \n\n\"Their numbers are growing, at least as fast as ours, probably faster... and they kill more and more of us each year. If you ever see one, you need to leave. Stop what you are doing, don't use your powers, stand up and walk away... it's the only way of avoiding them safely.\" \n\n\"So, what... do they wear a uniform or something? How do I know what to look out for?\" \n\n\"They glow.\" He answered, with no hint that he was joking, \"only we can see it, but they will appear to have a... err... an aura around them, like they are standing infront of a bright light. You also need to be careful around priests and other religious figures, they may not be Inquisitors, but you can bet your life that they are reporting to one. I cannot stress this enough but you need to be extremely careful in how you use your powers; if you draw attention to yourself and they work out who - or what - you are... they will come for you and they will kill you.\" \n\nMy feeling of invincible powerfulness had evaporated, replaced with a feeling of suspicion and paranoia. There was no doubt from Marco's thoughts that these Inquisitors were a real threat, and one that scared the shit out of my new friend and mentor. \n\n\"I'll be careful.\" I said after a long pause. \n\nMarco nodded for a few seconds before the smile returned to his face. \"For now, that is all you need to know, there is obviously a lot more you need to learn but I don't want to overwhelm you on your first night. However, this is a threat that you need to be constantly vigilant for; I will be in touch when it is time to continue your training and when it is time for you to meet some of the others...\" \n\n\"The others?\" I asked, my head shooting up. \n\n\"Yes,\" he smiled, \"we are like a family, we look out for each other, help each other where we can, and meet up for the occasional gathering... it's a good excuse for a party.\" He winked. \n\n\"I'm... actually looking forward to that.\" I smiled. \n\n\"Good. Well, in that case, it was a pleasure to meet you Pete. I look forward to seeing you soon and err...\" he looked towards the door, \"good luck with the nurses.\" \n\n\"Thank you, Marco.\" I smiled back as we shook hands, \"I'll see you soon.\" \n\nWith that, he turned and left. It took all of thirty seconds for me to find my way back into my bunker, and less time to curl up on the obscenely comfortable and massive king-sized bed, in a matter of seconds, I was out. Excited visions of what my powers could do filling my dreams and yet a dark foreboding of this new threat - and my limited understanding of them - never far away. \n\nThanks for reading the third chapter of NewU. Part 4 will be up soon. \n\nAs always, comments, suggestions and criticisms are always welcome... as are offers from editors who would be interested in working with me. I have been overwhelmed by the response to the first two chapters and am beyond grateful for the scores and comments left by my readers. You are all awesome. \n\nSee you in part 4"
    ],
    "authorname": "TheNovalist",
    "tags": [
        "mind control"
    ],
    "category": "Mind Control",
    "url": "https://www.literotica.com/s/newu-pt-03"
}