{
    "title": "Gay Anal while My Wife Watches",
    "pages": [
        "My wife and I watch gay porn together. One night while we were a watching a particularly good one she started making comments about it. She asked me if I wanted to do what they were doing on the screen. I told her yes, and I wanted her to be there and watch me be fucked hard like that. One guy had a real nice cock and I told her I wanted to suck his cock before he fucked me. \n\nI asked her if she wanted to see me do something like that for real and she said she definitely would. We started talking about different sexual scenarios. She wanted me to describe in graphic detail what I would do if there was a man in bed with me right then. She asked me if I would kiss him and what else I would do. I said yes, I'd make out with him then have him fuck me in the ass while I was sucking on another guy's cock. She said we would need two guys then. This was getting real and I was getting turned on by the conversation.\n\nI told her when she goes on trips I get on the Internet and search for someone we could do it with. I told her I went as far as contacting a gay erotic masseur on the internet. I said I found a guy in the city we live in and showed her his website. I said I wanted to hire him for an in home massage and have him give me an erotic massage while she watched. She seemed intrigued by it and agreed I could do that if I wanted to. She even suggested that we could do it in late June as our daughter was going away for a couple of days. We talked like this throughout our love making. We kept talking like we were serious about doing it. We both had powerful orgasms she had about five. \n\nDuring the conversation she said one thing that was very intriguing. She mentioned that she would do it if we could find the right person. Someone in good shape, attractive, not a professional escort, but an anonymous safe person. Someone that I could have sex with and no complications. A perfect fantasy person come to life. With the right person I'm sure she would be willing to watch me and him in bed together, maybe she would even join in and make it a threesome. \n\nWhen she was in the heat of the moment she said, quite convincingly, she wanted to watch me do it, but afterward she said she was just play acting and didn't really want to. I said that I didn't want to either. I understood her reaction because I felt the same way. In the heat of the moment, it was exhilarating to talk that way and pretend that it would happen for real. That's what makes the fantasy so exciting pretending like we were actually going to do it. \n\nI think in the height of sexual arousal true erotic desires are revealed. It's like the chemicals in the brain cause normal inhibitions to diminish and one lets atypical feelings out. These expressions might or might not be true feelings. After the excited state wanes these thoughts are deemed too risky to actually follow through with. If the risk could be removed, I think she would watch me with another guy. When her mind was unencumbered, free of guilt and concerns about cultural mores, she expressed these cravings openly. I think there is a part of her that really wants to do something that forbidden. She might let it happen with the right person. Neither one of us had a right person in mind, and our misgivings about the risk outweighed the desire.\n\nDespite these misgiving I started giving it serious consideration. Could we find that right person? Who could it be? A friend would be too complicated, an escort too risky, a professional massage therapist maybe (there is the guy in our city but how do you know for sure he's legitimate). We could search for someone on the internet, from what I've read a male female couple looking for a male is easy to find, but that is also risky. I really couldn't think of anyone that would fit. A discreet friend would be best, but that would make the friendship awkward. Then it came to me why not the only other person, since I've been married, I've had sexual relations with? I had sex with my roommate a long time ago when I was away from home on a summer job. He would be perfect.\n\nI never told my wife about him as were married when I had sex with him. I kept it a secret all this time because I considered it cheating, and even though she has these gay fantasies involving me the real thing might be too much. Me an him had sex throughout the summer. He would be a perfect candidate to fulfill our fantasy.\n\nWe were friends we spent three months together. He would be much older now. He might not be as good looking. Maybe he got fat and bald, but he would fit because I could trust him as we did it quite often that summer. He was discreet none of our co-workers ever suspected what we were doing. Would he still be willing to have sex with me and to complicate it let my wife watch? It probably will never happen, but he would be a good candidate. \n\nLena doesn't know I had sex with him. I lied to her about him. We had sex throughout that summer. All my previous homosexual experiences before him were strictly oral, but with him I went all the way. The second time we did it he fucked me. I never felt such a sexual high. Part of it was the forbidden nature of what we were doing, but the main part was it felt so amazingly good. We got into anal sex and continued doing it throughout that summer. \n\nWe were partners in the field and shared a motel room for three months. I don't know how many times we did it to each other that summer. We both had healthy sexual appetites. It was at least several times a week. We did it a lot but that was a long time ago. He was sexy and discreet, and he lived in California so no complications would arise. I learned a lot from him.\n\nI was thinking about him and had a few vivid memories. The first time he fucked me was the first time I had real anal sex. I distinctly remember strong smell of the baby oil was thick in the air. He used it to lubricate my ass. To this day I can't smell baby oil without thinking of that first time I had a hard a cock buried in my ass. I remember while it was happening being on an extended sexual high. It was so intense feeling his cock ramming in and out of me. I had been fantasizing about that happening to me since I looked at that gay magazine years before.\n\nThat first time was powerful. I remember afterwards staring up at the ceiling. I had just committed the ultimate homosexual act and the guy who fucked me was lying next to me in bed. He had ejaculated his semen deep into my ass. I was coming to the realization of what I just did. I considered myself heterosexual but here I was lying in bed with semen leaking out of my ass. My heterosexual ass had been defiled and I liked it.\n\nI also remember the regrets. I started thinking about my wife and how I just betrayed her. I remember thinking \"what have I done?\" Cheating on her with another woman would have bad, but she would not forgive cheating with another man. I felt terrible and guilty but sexually exhilarated. I loved her, I didn't want to keep any secrets from her, but I could never tell her this! This would have to be a secret I took to the grave. \n\nI recall laying in that bed and my brain was in turmoil but as bad as I felt I wanted to do it again. The sexual excitement outweighed the guilt. I rationalize that because I loved her, and there was no risk of falling in love with him, it wasn't a danger to our relationship. If there is no emotion involvement and no danger of him replacing her in my heart, then was it really cheating? I rationalized that It was no worse than jacking off when she wasn't home. I put things in my ass when I was alone and she didn't know. This really wasn't much different except it was a real cock instead of a fake one. I convinced myself that it would just be for the summer, because after that job I'd never see him or do it again. \n\nI considered it my one opportunity to explore homosexual sex. That summer of gayness allowed me to finally get a sense for what full homosexual sex was about, and helped get it out of my system. It never was emotional for me. It was just sex. The deed was done. I did it. What did it matter if I did it again? \n\nI remember laying there feeling a sublime warmth emanating from my freshly fucked ass. I felt his semen leaking out of me. A warm feeling began to built in my genitals again. My penis started to move and grow. I looked over at him lying on his stomach with his enticing ass sticking up. I couldn't stop myself the yearning pushed all negative thoughts out of my head. I reached for the baby oil. I fucked my first ass that evening. That was just the beginning of three months immersed in gay sex.\n\nHis name was Dario. He was half Greek and half Italian. He was taller than me. He had black hair and blues eyes. He was muscular but slenderer than me. He was a good-looking guy. When we went to the bar or out to eat the woman in the place would take special notice of him. My wife met him at the end of the job as she came to stay with me for the last two weeks. That was twenty years ago.\n\nAbout a week after Lena and I had sex where we talked about the different scenarios of inviting another man to our bed I began thinking more and more about Dario. He seemed like a good candidate and would be perfect for our special fantasy. I decided to look him up. I got on Facebook. I found him pretty quick. He looked the same. He had the same piercing eyes, but his black hair was grey. He still looked good. He was living in California. I put in a friend request. A few hours later I checked my computer, and he accepted the request and he requested I add him to messenger. \n\nI started scanning his Facebook page. He had a lot of photos. He was still in good shape he had a great body. As I was going through his photos, I started to get curious about something. Then I came upon a series of beach pictures. These were recent pictures. It was him and friends of his, all males, in skimpy bathing suits. One picture showed a bunch of guys on a beach. There was a picture of him kissing a guy. He was gay! That explained a lot. He must have been homosexual but didn't want to admit it. Coming out back then was tough to do. I sent him a massage.\n\nHe responded to my message right away. We conversed for several weeks. He told me he was bisexual. He said he came out in the nineties. He told me that when he was in high school, he figured out he was attracted to both sexes. He dated mostly girls but hooked up with guys too. He said by the time we were working together he knew his orientation and what he wanted \n\nWe talked about our time that summer. We hit it off right away. I remember he told me about the tics and suggested we inspect each other after each day in the field. He said by the way I reacted to his touch that I might be susceptible to his advances. He said he was hesitant to try anything at first because I was married, but he was encouraged by my willingness to allow him to touch me in places most guys would have objected to. He said he was going to tell me about his orientation back then but he didnt. He wanted to keep it just sexual. I told him I had my suspicions because he seemed to have more experience than me. I told him that I liked the sex, but I loved my wife. He told me throughout his sex life he had come upon many happily married men that had gay sex but emotionally were mostly heterosexual. \n\nWe filled each other in on what we had been doing the last couple of decades. He wasn't married but had some long-lasting relationships. He wasn't in a relationship at the time but was dating regularly. I told him my history. I was still married to Lena, he met her on our job, and we had one daughter. I told him I was living in Denver. He said that was a coincidence he has been to Denver many times on business and that he had a business trip planned to Denver in June. When he said that I got a semi erection and my genitals felt warm. It turned out he was going to be here the same days my daughter was going to be away. I told him he would have to come for dinner one night. He readily agreed. \n\nI told Lena that I had recently connected with my friend from my summer job. I told her I found him on Facebook. I told her he was going to be here in June and that we should have him for dinner. \n\nShe said, \"Sure that would be nice. He was the one you were roommates with, right?\"\n\nI said, \"Yes we were field partners and shared the motel room for the season.\"\n\n\"I remember him we met when I came to visit you. He was good looking.\"\n\nI said, \"Yes that's the guy.\"\n\nLena responded, \"That's good I'd like to talk to him and hear about your time together. Like what you guys did in your spare time. You guys seemed to be really good friends. I'm surprised you haven't contacted him before this. It has been a long time are you looking forward to seeing him again?\"\n\nThe way she said that it seemed like she was insinuating something. She always had her suspicions about my orientation. She is convinced, and rightfully so, that I have had gay sex that I haven't told her about. \n\nI said, \"Yes it will be good to see him it has been a long time.\" \n\nDuring the intervening weeks Dario and I texted a lot. One-night Lena went to bed early. He called me on FaceTime. This was the first time we talked directly. When I saw him, I was surprised how young he looked. He didn't look that much different. A few wrinkles but time was good to him. He commented on how good I looked too. We eventually started talking about our field work together which led to talk of the sex we had that summer. He told me he looks back quite fondly on that time. I told him that I did too. I said I didn't have any regrets about the sex we had. I told him I did regret lying to my wife. I said I never told her about him. \n\nWe had only been married a few years when I was with Dario. I couldn't tell her at the time because I didn't know how she would react. I told him about Lena's and my fantasies. He asked me if I ever had gay sex again since we did it together. I told him no. He said it must be difficult to have those desires but not be able to act on them. I said that I've been completely satisfied with my sex life. I didn't really have a strong desire to do it. My wife and I played out the fantasy and that's good enough for me. He said ok if you say so. \n\nAt that he put his hand down his pants and started rubbing himself. I watched. He stood up so his crotch was right in front of the camera. He pulled his pants down, he had no underwear on, his hard cock sprang up and took up the whole screen. It was about seven inches long and was sticking straight out of his close cropped black pubic hair. My mind went back to the first time he fucked me with that cock. He sat back down and started playing with himself. \n\nI followed suite and took off my pants and shirt. When I looked back at the screen, he was completely naked. We both started jacking off. He had no chest hair as he must shaved his chest because I remember him having hair before. He was rubbing his chest and pinching his nipples while stroking his cock. I started doing the same. We were talking about what we use to do to each other. Then he said he wished I was there with him and we could relive those nights in the motel. I said I'd like that too.\n\nHe said, \"I want to bend you over and fuck you right there on the computer table.\"\n\nI said, \"When you get here next week, I'd like to make that happen. I want to feel that cock inside of me again.\"\n\nThat was the first time one of us mentioned that we could have sex when he got here. We both came shortly after. We cleaned up.\n\nHe asked, \"You said you couldn't wait to feel my cock inside you again. Did you mean that? Do you really want to do it? What about your wife?\" \n\nI said, \"Yes I really want to do it, but I wouldn't do it unless me and Lena had an agreement. I'll have to talk to her about it before we can do anything. It has been a fantasy of hers to watch me with another guy, but fantasy versus reality is an entirely different thing. If it is going to happen it will be only be with her consent. Would it be ok with you if she watched us?\"\n\nHe said, \"Sure it won't bother me. You are a lucky guy. I'm surprised you can even broach the subject most married guys I know have to be very discreet and sneak behind their wife's back. They could never discuss it with their wives. You'd be surprised how many of them there are out there too. I'll bet I've up hooked up and had sex with at least a half dozen married guys over the years. Most of them have been older like in their forties, fifties and older.\"\n\n\"I'll see how she reacts to the arrangement. It isn't so much the present situation, but what we did in the past. I've been lying to her all these years. I'm going to have to tell her about what we did before we go any further. I'll let you know how it turns out.\"\n\nWe ended the conversation there. He would be in Denver the next week.\n\nI was thinking about how I would approach Lena about confessing to her. I had to come clean about what me and him did that summer. Days went by and it never seemed to be the right time to bring the subject up. How do you tell your wife that you had been lying to her for twenty years? He was going to be here in just one more day. I decided I was going to talk to her about him that night in bed.\n\nWe got in bed. I was shaking with nervous energy. I finally worked up the courage.\n\nI said, \"There's something I want to talk to you about. I have to tell you something that happened a long time ago.\"\n\nShe said, \"OK I'm listening.\"\n\n\"I'm just going to say it right out front. Back when I was on that summer job Dario and I had sex. We had oral sex and anal sex. It wasn't just once or twice it was all summer long. I'm sorry I never told you.This happened when we were married. I'm sorry I did it. I hope this doesn't hurt you too much. You are my only love. It was just sex. Just a way to get off nothing else.\"\n\nAfter a long moment of silence, she said, \"It's about time you told me the truth. I've always suspected it, no I've always known. When I came to stay with you for those two weeks you were different in bed. You started to be more interested in and aggressive with my butt. I remember you giving me a back rub. You moved down to my butt and started spreading my cheeks apart so you could get a good look at how hairy I was down there. Then you put your tongue in my ass and it shocked me. I was wondering where that came from.\" \n\n\"You didn't stop there you moved on top of me and without even asking you put your dick up my ass. While you were pumping my ass you seemed exceptionally excited. You were moaning and groaning more that you ever had. You were thrusting into me wildly and when you came you tensed up and shuttered for almost a minute. I actually liked what you were doing, but I was surprised by your behavior.\"\n\n\"Then I met your roommate. It made sense. I started thinking, \"That guy is really sexy and good looking I'd have sex with him, and Ron has been sleeping in the same room with him. What have they been doing these past three months?\" I knew back then what transpired between you two I just wasn't a 100% sure. That's why over the years I kept asking you. I wanted you to tell me the truth!\"\n\n\"Your intuition was correct. I've wanted to tell you for years, but as time progressed it became too difficult.\"\n\nShe said, \"I know why you're telling me now. You want to fuck him again don't you, and you want me to watch you do it? After we talked about your homosexual fantasies, I had a feeling that you were serious about wanting to do it. I knew you were thinking about doing something. Then out of nowhere you contacted your friend after all these years... I knew right then that you have been lying to me. When you told me you contacted him, that finally convinced me I was right all this time. You had sex with him. I knew that you were trying to find someone to fulfill your desire to do it again and who better than him. I was certain you were working on setting it up with him, then I saw you in the computer room the other night.\"",
        "She continued, \"I heard you go into the computer room and shut the door. I heard you talking on Facetime. I watched you from the steps. I was shocked when you stood up and took off your cloths. I watched as you started jacking off staring at the computer screen. I moved closer and heard you talking to him about what you guys did together. I heard you saying what you wanted to do when he got here.\"\n\n\"I always knew you did it, and after everything we have shared, it wasn't a big surprised to have it verified. I knew you always wanted to do it. I told you that you could.\"\n\n\"I laid in bed thinking about what I just witnessed. The more I thought about it the more turned-on I became. I got my vibrator and masturbated thinking about you guys fucking each other. I was hoping you would walk in on me and we could have had our discussion then. I've known your plan for over a week now. I've been expecting you to ask me.\"\n\nShe hesitated then said, \"I've given it a lot of thought the last few days. I know you want to do it, and I want to watch you do it, but I have concerns that once you do it again you won't want to stop. How do you know you won't want that lifestyle instead of what we have? If I could be assured that nothing between us would change then I could agree.\"\n\n\"I love you and only you. When Dario and I were doing it, I had zero emotional connection to him. I was miserable being away from you. The sex was an outlet. I wanted you to spend the last two weeks with me that's why I asked you to come. The sex with him stopped as soon as you got there my heart and focus were on you. I haven't had gay sex since then and we have been doing pretty good these last two decades.\" \n\n\"I can promise you that this is just a unique opportunity and involves no risk. This is what we have fantasizing about. We have acted this scenario out many times together, and we were both extremely turned-on by it. I think we owe it to ourselves. We should at least try it this one time. We will probably never get an opportunity like this again. I want to do it... do you want to?\" \n\n\"My mind is saying no but this conversation has me so turned on that I'm willing to let you do it. I agree but only if I'm there and can watch. So how do we make this happen?\"\n\n\"The plans are made. We have a willing guy. He told me he wants to have sex when he gets here. I told him I would have to get approval from you, and that it would include you watching us but not taking part it anything. He agreed and had no problem with you watching. We will be home alone on Thursday. I say we have him for dinner that night and see how things develop. Remember you can stop this anytime you want you just say so.\"\n\n\"Ok Thursday night it is. I can't believe we are actually going to do this, but I'm so excited right now I'm trembling inside.\" \n\nThursday evening came. He took a taxi to our house. Lena was preparing the meal. We hadn't said any more about what was to transpire later. We just went about our business as if everything was normal. He got to our house around 6:00. Dinner was at 7:00. I answered the door and we greeted each other warmly. I told him to come in and meet Lena. We walked to the kitchen and I introduced them.\n\nHe said, \"Hello Lena, it's very nice to meet you again after all these years.\"\n\n\"It's nice to meet you too Dario. I've heard a lot about you over the last couple of days.\"\n\nHe said, \"I hope it was all good. We spent a lot of time together that summer.\"\n\n\"From what I've heard Ron enjoyed his time with you. It seemed you guys became close friends. Would you like a glass of wine?\"\n\nHe said, \"Yes I'll have some wine and yes pretty good friends. We made a connection. I guess sharing a motel for three months forces you to get along.\"\n\nI poured a glass of wine for all of us. We all hung out in the kitchen while Lena prepared the meal. He spent most of the time talking to Lena. She asked him a lot of questions about his life. Early on he told her that he was gay. Lena said she knew that as I told her. She asked if he had a partner and did he ever considered getting married. He told her no but came close one time, but it wasn't legal then. She said she was sorry and too bad the law was so slow to recognize everyone's right to happiness. \n\nThey hit it off great and became quite sociable. Lena was very friendly with him and talked about a lot of personal things. He didn't seem to mind as they connected, and they had a very serious conversation about Dario's experiences. I could tell she liked Dario she opened up to him and was completely uninhibited with him. \n\nDinner was ready and we sat down to eat. He loved Lena's spaghetti and raved about her sauce. We all enjoyed the conversation. Lena started to clean up and Dario followed her innto the kitchen to help and continue the conversation. I think he became quite captivated with Lena.\n\nWe took our wine to the living room and sat there talking after dinner. I started getting nervous. Lena appeared relaxed as ever. She was talking and joking and enjoying the time spent with him. I kept wondering how we were going to initiate this. Who was going to be the first to say something? We talked about all kinds of subjects during dinner. Politics, jobs, places we lived but no one brought up what we were all thinking about. It was probably better that way. It gave us a chance to become reacquainted and for Lena to get a feel for what type of person Dario was. They had hit it off nicely. I could tell she like him, and he liked her as well. It was getting late and I was getting nervous. I knew it should probably be me to initiate something, but Lena broke the ice. \n\nLena said, \"I think it's time we change the subject and discuss what's on all our minds. Dario, Ron told me all about what you guys did together in the motel at night. He just told me a few days ago but I suspected something happened back then. That was a long time ago. I didn't like it that he never told me. I understood why he had homosexual desires. His actions, his affinity for anal sex, the stuff he was looking on the internet were all things that convinced me he wanted to and probably had homosexual sex more than what he was telling me. I have always been intrigued by the idea of him having homosexual desires. I have fantasized about it. I think we all have waited long enough for this. I'm ready. I'm sure you guys have been thinking about it. I know Ron has been craving this for a long-time. He doesn't have to wait any longer. I think it's time. Let's move upstairs to the bedroom.\"\n\nWith that said she stood up and walked upstairs. \n\nI said to Dario, \"I think we have just been invited to get started. I have to admit I'm nervous. It's been a long time for me. I'm ready if you are. I hope she doesn't regret this.\"\n\nHe said, \"I think you have a very understanding wife and an incredibly strong relationship. She is a wonderful woman and very sexy too. Do you think she might want to join in? That would be OK with me if she does. You're pretty lucky that she allows you to quench your gay desires and all she requires is to be present while it happens. You have the best of both worlds. As far as it being a long time ago don't worry it's like riding a bike, and if you are anything like you were back in then you will be fine.\"\n\nI said, \"That will be up to her. She has told me that she just wants to watch, but when she gets aroused there's no telling where she might go. Let's just show her what she wants. If she decides to join in, lucky for us, but it will have to be completely up to her. Whatever she decides to do will be OK with me. You don't have to worry about that.\" \n\nWe went upstairs and Lena was sitting on the couch next to the bed. We walked in Dario first then me. The bedding was already pulled down Lena must have done that earlier. I pulled out the lube, rubbers, and Lena's friend (her vibrator) as I figured she would need it eventually. Dario was already taking off his cloths. I took mine off quickly also. We were both standing there naked with full hard-ons. His was about an inch longer than mine and about the same thickness. We approached each other with our penises sticking straight out. We were standing at the end of the bed I had my back to Lena. We took each other in the arms and kissed passionately. We made out for about a minute then he broke off. He got on his knees in front of me, my back was to Lena, he took my hips in his hand and turned so I was sideways to Lena. \n\nHe positioned us so Lena could see what was happening. He moved his mouth to my penis and started licking the head of it. He squeezed my cock so precum leaked out as he licked it up. He proceeded to lick up and down my shaft as he held on to it tight. The whole time he was doing it he was looking at Lena. He was putting on a show for her. He was giving me a seductive blow job. It appeared he wasn't concentrating on me, but it was more likely he was preforming for Lena. I think he was purposely doing this to get a reaction from her. He licked my cock and balls for a long time. I rubbed my hands through his hair. He moved back to the head of my penis then he slowly lowered his mouth down and took my cock in his mouth.\n\nLena was sitting just a few feet away she watched his mouth close over my penis. He sucked it, moved his head back and forth, then would pull off and lick it. After alternating between sucking and licking for several minutes he stopped took my cock out of his mouth and pointed it toward Lena. She shook her head, but she was feeling her breast while watching us. She was getting turned on already. He stood up again and kissed me with his tongue probing inside my mouth. He stepped back looked me up and down then turned toward Lena.\n\nHe walked straight at her to her side of the bed with his 7-inch penis sticking straight out of his closely trimmed black pubic hair. She was staring at him as he moved toward her. He had a very nice body. He was fit and trim with a firm midsection and strong looking chest. He was mostly free of hair but had a trace on his abdomen leading to his closely trimmed pubic hair. I'm sure she was admiring his body as he approached her. I know she was tempted but she stayed on the couch. \n\nHe turned and moved onto the bed. He laid down on it then looked up at me. He spread his legs and laid there waiting for me. I got in bed and climbed on top of him positioning myself between his legs. I held myself up above him with my arms. We positioned our cocks, so they were touching, and we ground our pelvises together. Our cocks were slippery from the precum leaking out of them. It felt great sliding my cock against his slick member. We ground our balls and cocks together for a long while. I couldn't take it any longer and I lowered my body down on top of his and we started making out as we ground our groins together. \n\nI was positioned between his spread legs pumping into his groin while he was thrusting his hips up to meet my cock. He wrapped his legs around me and gyrated his hip against me. Lena watched the two of us in bed grinding into each other while we kissed passionately. We clutched at each other as our mouths and tongues were interacting feverishly. I kissed and bit his neck. He moved his legs off of me. I moved down and shoved my tongue into his nipple. He groaned as I gently nibbled on his nipple. I moved to the other side and sucked and bit that nipple too. I moved down his abdomen kissing and licking his body along the way until I got to his cock. \n\nI took his cock in my hand. I looked over at Lena I had his erect penis in my hand my face hovered over it. I looked her in the eye when I took his penis in my mouth. I enveloped his entire cock with my mouth and was thrilled by the feel of a cock in my mouth again. Lena stared back at me, mouth open, breathing heavily, with a look of desire in her eyes. She slipped her hand down her pants and started to rub herself. \n\nI bobbed my mouth up and down on his cock. I fondled his balls and brushed my finger along his anus he responded immediately. I kept sucking on him and every so often I looked over at Lena. She had the look of wanton lust in her eyes. This pleased me and made what I was doing much more exciting as it was like I was sharing it with her. I sucked him for only a short time. This wasn't what I really wanted to do. I wanted his cock in my ass. I wanted Lena to finally see me have anal sex with a guy. \n\nI moved up and reached for the lube on the dresser. I opened it and squeezed a bunch of lube onto his dick. I looked at the rubbers and decided no I wanted to feel a bare cock in my ass. I didn't bother giving him one. I took my hand and rubbed it along his full length. I covered his whole cock with lube. I took the excess on my hand and rubbed it on my ass. I inserted one then two of my fingers into my ass to loosen myself up for easier penetration. I put the lube down and straddled Dario's legs. I started making out with him again. He reached down grabbed his cock and started rubbing it on my asshole. \n\nI let him rub it back and forth along the crease of my ass. Each time he passed over my anus I pressed down on it and ground my hole on his cock. It felt great and the anticipation was driving me crazy. I sat up. I grabbed his dick, positioned it on my hole and with two fingers pressed the head of it into me. I got the head inside. I let go of his penis and put my hands on his chest. I slowly started to lower down onto his cock. Lena was watching intently. As he started to penetrate me, she leaned over to get a better look. I slowly sat down on his dick and she watched as it slid all the way in. I sat on it until it completely disappeared into my ass. I was sitting on his pelvis and his dick was no longer visible it was fully buried into me. I started to rock back and forth on him. \n\nLena watched intently as his shaft disappeared into then reappeared from my ass again and again. I heard Lena get up and grab her vibrator. I watched as she took her pants and panties off. She was naked from the waist down. This was only the second time she was naked in front of another guy other than me. She sat back down and started using the vibrator on herself. This was so intense I was being anal fucked by a guy while my wife was masturbating watching us. She was totally into the show we were putting on. It felt extremely erotic that I was able to make her fantasy come true. I loved her so much for being as open to new things and loving enough to give me the opportunity to do this in front of her. I didn't want to do this without her it would not have been the same. I felt like I was her personal porno star. \n\nHe moved his legs up by bending at the knees and placing his feet flat on the bed. This allowed him to use his legs to lift his pelvis up toward my ass. I held myself in a stationary position hovering above his half-inserted cock. He started moving his hips and pelvis rapidly pumping his cock back and forth in my ass. He became very animated. He was moving his hips vigorously. He was fucking the hell out of my ass. He could last a long time. It was like he could control his climax and ejaculate whenever he wanted. He kept pumping into me for several minutes. He told me to roll off of him he wanted to try a different position. He looked at Lena naked from the waist down and working the vibrator on her clitoris.\n\nHe asked Lena, \"Is there anything you want to see? Is there anything I can help you with?\"\n\nShe said in a breathless voice, \"I just want to watch you guys. Do what you want.\"\n\nWith that he told me to get on my hands and knees he wanted to fuck me doggy style. I moved to my hands and knees. He slipped up behind and quickly buried his stiff cock in my ass. He grabbed either side of my hips and with his hands holding on tight he used his arms to slam my ass back and forth. He was impaling my ass on his rigid shaft. By the sounds she was making Lena had her first orgasm. He was banging into me so hard my head was jerking back and forth. The force of his hips slamming into me jolted my whole body and my balls were slapping into his. It felt fantastic. \n\nI was on a sexual high. I was on the verge of climaxing, but it wouldn't come. That is what's great about being on the receiving end of anal sex. It has all the intensity of stimulating my cock, but I don't cum and the sexual high last forever. I could go on like that all night but if he touched my dick I would cum. He knew not to touch it until I was ready. I wanted him on top of me, so I told him to stop. \n\nI rolled over and spread my legs wide. He entered me in the missionary position. He laid on top of me and we were feverishly making out while he positioned his cock to penetrate me again. He found my hole and plunged his dick into me. It slipped in easily. Lena was watching intently she was becoming more vocal as she was breathing heavily moaning loudly. She was on the verge of another orgasm.\n\nI said to him, \"I want you to cum inside of me.\" With those words Lena let out a loud moan and started grunting. \n\nShe said, \"Yes come deep in his ass.\" A second later she was gasping and had another orgasm.\n\nI grabbed my knees and pulled them up and I spread my legs wide. He started humping me faster and faster. He buried his head in my neck and was biting and sucking on it. His thrust became more hurried. I wrapped my legs around him and crossed my feet to hold my legs in that position. He started to groan louder and was grunting with each thrust. I had my arms and legs wrapped around him trying with all my strength to pull him in tighter to me. Lena stood up for a better view I could just see her head over his bare shoulder. She had her camera out and was taking pictures. \n\nHe stuffed it in as deep as it would go, all seven inches of it, he made a series of rapid mini thrust while he held it deep inside of me. He pushed himself up with his hands on my shoulders. He arched his back through his head back and let out a tremendous groan. His ass muscles tensed, and he jerked his cock into me about five or six times. He was spurting his cum deep into my ass. \n\nLena was using her vibrator and by the sounds she was making she got her third or fourth orgasm. He collapsed onto me and laid there breathing heavily on top of me his face buried in my neck. Lena had fallen back onto the couch. No one said anything for a long time. He was laying on top of me with his hard cock still slowly pumping inside of me. He finally started to soften and rolled off of me to the side.\n\nI looked at Lena she was leaning back on the couch with her head back and her eyes closed. She was naked from the waist down her vibrator leaning between her legs. She was breathing heavily and had her hand on her breast under her shirt. Dario was breathing next to me in bed. I leaned up and Lena opened her eyes and looked at me. I turned on my side and motioned for her to come and lay next to me. She came over to the bed and cuddled up to me. I kissed her passionately and she responded to my kisses. \n\nShe whispered in my ear, \"That was the hottest thing I've ever seen. My whole body is trembling. It was so intense I feel like my nervous system in electrified. I'm jittery can you feel the tremors inside of me.\"\n\n\"Yes, I can feel it you're shivering. I'll assume you liked it and that this wasn't a mistake. I hope you aren't overloaded and can continue as we aren't done yet I still have to get one.\"\n\nWe laid there holding each other for a long time. I think Dario had nodded out. We were gently kissing, and I was gliding my hand rubbing her body from her shoulder to the wonderful slope of her waist as it curves up to her hips and ass. Finally, after taking in her scent and luxuriating in the feel of her warm sensuous naked body press against mine I said, \"Is there anything you would like to do?\"\n\nShe said, \"Yes there is. I want to take both of you at once. I want you in my vagina and I want Dario in my ass at the same time.\"",
        "With that she climbed on top of me. She positioned my penis to the entrance of her vagina and sat down on it. Her wet vagina enveloped my entire penis. One thing is undeniable, gay sex can't come close to comparing to that fantastic unworldly feeling of her wonderful velvety warm wet vagina enveloping my cock. She is my sexual Wonder Woman no one can compete with her. \n\nShe started moving up and down on my erect penis. Dario was laying on his back watching us, or should I say watching Lena. She reached over grabbed his newly hardening cock and said, \"Time to get it up Dario\", as she handed him the lubricant.\n\nDario said, \"I heard what you want but I'm not hard enough yet. I need some help.\"\n\nShe said, \"I can help with that. Go clean yourself and Ill see what I can do.\"\n\nWith that said he washed up and came back and stood at the side of the bed. He moved forward got on his knees on the bed and maneuvered his half erect cock in front of Lena's face. Still riding me, she reached up and started fondling his balls and cock. She took his cock in her hand and lean over and started licking up and down its length. She would start at his balls and lick the entire length of his cock until she got to the head of it at that point, she would envelop his cock with her mouth and suck the full-length in. \n\nI could see her cheeks moving while his cock was in her mouth. It was still soft, so I think she was playing with it with her tongue. She was swirling his cock around inside her mouth with her tongue. After several swirls she would pull off of his cock while keeping a lot of suction on it. She would pull her head away and stretch his semi erect cock out until it popped out of her mouth with an audible noise. She would go back to licking it again seductively while staring into my eyes. She wasn't humping me anymore my cock was fully inserted into her and it felt terrific being enveloped by such a warm intoxicating place. I just laid there watching my wife suck his dick. It was extremely erotic watching it happen. \n\nHer blow job started to work. Dario's cock was responding to her mouth and started to grow. Lena noticed the effect she had on him and took it all in her mouth. She stopped licking and just concentrated on sucking on it. He was growing inside of her mouth. She was going completely down on him right to the base of his shaft. She was bobbing her head up and down on it moving from the head of his dick right down to the pubic hair. She probably did this a half a dozen times until one time she went down on him she gagged. She did it again and gagged again. She wasn't making it to the base anymore and with each subsequent downward movement she stopped further from the base. After several more bobs she was stopping several inches short. \n\nShe said, \"Your too big to go that far in, but it looks like you are ready I want you in my ass.\"\n\nShe started riding me again. While she was concentrating on me again Dario got behind her. He told her to lay down on top of me. She lowered herself down and we started making out. Dario positioned himself on top of Lena. He lowered down and laid on top of her. I couldn't move with his additional weight on me. He hadn't tried to insert his cock into her ass, yet he just moved his penis up and down her crease. She was moving under him feeling his cock sliding between her ass cheeks. He was kissing her neck and she turned her head and they started making out right next to my face. I saw their tongues interacting. He moved his mouth to the nape of her neck and started biting and sucking on her neck. \n\nShe was reacting to his kisses and became more animated in her movements. She started humping on my cock more forcefully. He pushed himself off of her and was sitting on us straddling both Lena and my legs. She then pushed herself to an upright position so both of them were sitting on my legs. My cock was still inside of Lena and she started grinding her pelvis into my groin. Dario reached around her slipped his hand under her top and grabbed both her breasts with each hand. He was fondling her and pinching her nipples lightly whilst he kissed the nape of her neck. She was tilting her head back and arching her back forcing her chest out to take in his caresses. \n\nHe reached down grabbed her shirt and pulled it over her head. She lifted her arms over her head, and he pulled her top completely off. I was looking up at my wife completely naked straddling my groin with my cock inserted in her vagina while another guy was fondling her naked breasts as he bit and suck on the nape of her neck. \n\nShe had her one arm lifted up over his head as she rubbed her hand through his hair. She was rocking on me and started to get more vigorous. Dario slid his hand from her breast down along her abdomen until he felt her pubic hair. He moved his hand further down where he easily slipped his middle finger between her wet vaginal lips and made contact with her engorged clitoris. He started rubbing her clit as she gyrated on my cock. \n\nShe reacted immediately by throwing her head back against his shoulder and giving a long moan. He continued rubbing it in motion with her movements. He slipped his index and middle finger onto her clitoris and penetrated her by wrapping his fingers over her clit and pushing it into her vagina. \n\nMy dick and two of his fingers were in her She was still moving up and down on my cock and he was moving his fingers in and out of her. When she pulled back and the head of my dick was near her opening, he would shove his fingers in deeper and play with the head of my dick which was still inserted. He would have the base of his fingers on her clitoris and he would squeeze the head of my cock between his fingers while it was in her vagina. Once she lowered down again on my cock, he would pull his finger out and rub her clitoris some more. She had another explosive orgasm and while her vagina was contracting, she gushed her vaginal juice all over my pubic hair. She was soaking wet and my cock was sliding effortlessly in her slippery hole.\n\nShe said, \"I want more I want to cum with two dicks in me. I want to be filled up in both places. Dario get the lube I want you inside of me!\" \n\nShe laid back down on me to expose her ass to him so he could enter her. Dario kneeled above her on the bed. He poured lube on Lena's ass and his cock. He put his finger up Lena's ass. I didn't see him do it but by her reaction I could tell he was reaming her with his fingers. She was moaning and moving her ass in a circular motion with my cock inside of her. He pulled his finger out of her and I saw him take hold of her hips with his hands after he positioned his cock at the opening of her hole. \n\nLena and I were holding still while he was trying to enter her. I was under her watching him moving his hips around behind her. I could feel his weight as he was trying to push is cock head into her. He pushed forward then backed off a little, he pushed forward again, and it seemed by his forward motion that it started to go in her. He backed off again but on the third push forward his cock slid deep into my wife's ass. \n\nI knew it was all the way in because of her reaction, she groaned deeply and started moving her ass again, and I actually felt his penis move into her. I could feel his stiff cock through her vaginal wall. I felt his cock's head move along my entire shaft from the base to the head of it. Both our cocks were deep inside of her side by side with just her relatively thin vaginal wall separating them. \n\nHe stopped there for just a second, but Lena was pumping so aggressively there was no need to let her asshole adjust to his penetration. He immediately started pumping in and out of her ass and I felt his cock massaging mine through Lena's inner wall. Lena let out a loud moan and collapsed further into me. Dario laid on Lena's back but held himself up partially with his arms. I started pumping into her vigorously and Dario was pounding into her too. \n\nWe were both fucking her so forcefully that she was bouncing between us violently. She was moaning and breathing deeply. She was bucking back at our thrust with savage energy. She was going wild lost in the act of being fuck in the ass and pussy at the same time. She had her face buried in my neck. She was biting my neck and sucking on it while she was stifling her screams of erotic pleasure. She was loving every second of having two cocks buried inside of her. \n\nThe two of us fucked Lena for several minutes. We had been going at it for a while. Lena was perspiring trapped between us. Her sweat was dripping down on me. We were all expending a lot of energy. Most times it was either one or the other of us that was energetic. He would be pumping from on top of her while I rode the movement. He would tire then I took over thrusting into her. I would have to use a lot of energy to move a few inches because of both their body weights on me. I could go energetically for only about 30 seconds. I would stop and he would take over while I laid there then when he stopped, I'd start up again. We alternated like this for quite a long time. All this time Lena was moaning and groaning and trying to fuck back at us. \n\nThe warmth of her wonderful wet vagina was too much I was about to ejaculated deep inside of her. She was still humping on me hard as Dario was in her ass. I kept going and Lena kept grinding her pelvis on my pubic bone striving to get another orgasm with my cock inside of her. Dario was pounding into her relentlessly. She started to get very excited and I knew she was close again. I was raging hard and inside of her when I felt it build to the point of no return. I yelled that I was cumming and shot several loads into her. I came so hard that it felt like my balls were being sucked inside out. I nearly lost consciousness. My heart was pounding and I could feel stream after shoot along my shaft. She reacted with more energy and both Dario and I knew she was close too. \n\nI was still hard and knew I had to make her cum. We both gathered more determination and drove for one last effort to push her over the edge. We both started heaving our pelvises into her. We were fucking her almost animal like and she was beginning to lose it. She clenched her legs together squeezing his cock in her ass while rubbing her clitoris on my shaft. She let out a tremendous moan. She came on top of me with Dario still pounding into her ass. She had about a half dozen spasms then unclenched her muscles and laid further into me. \n\nLena and I were done, but Dario wasn't he was still fucking her. She was exhausted and laid on top of me motionless. He kept pounding her. Her body was being jostled on top of me as he continued pumping into her ass for another couple of minutes. I could feel my cum being pushed out of her vagina by his continued penetrations and the cum was leaking onto my balls. Lena and I tried to kiss but she was being jostled too much. Our teeth bumped into each other a couple of times because he was thrusting so hard her head was moving around. \n\nHe was having his way with my wife's ass, and we both were relegated to being observers just waiting for him to finish, he started to pick up the pace. He stiffened up and jammed his cock as deep as he could into her. He groaned loudly and stopped moving his cock but just held it there deep inside of her. He quickly pulled out of her ass grabbed his cock and shot at least five separate streams of cum on my wife's back. He had hold of his cock, but he still jammed his balls forward grinding into her ass as each stream exited his shaft. Her head rocked back and forth on my chest and bumped my chin due to the rhythm his thrust. She closed her eyes and moaned deeply as he spent the last of his ejaculation on her back. \n\nHe exhaled and collapsed onto her. The weight of him and her on top of me made it difficult for me to breath. She suddenly lifted her head and looked me in the eyes as he reinserted his still hard cock back into her. We started making out as he continued to slow fuck her. He was sliding around on her due to all the cum on her back. With each movement a sodden sound emanated from them. His cock softened inside of her. He reached down and pulled it out. \n\nHe finally slid off of her. He laid next to us on the bed. Lena started grinding her pelvis onto my pubic bone and balls. Her pubic hair became saturated with my cum that leaked onto my balls and she was sliding her mound along my entire genital area. \n\nShe started kissing me again and said, \n\n\"This was incredible. I want more. Let's ask Dario to spend the weekend here, Please I want more of this. Tomorrow you can watch him fuck me, unless he can get it up a third time tonight.\""
    ],
    "authorname": "ILikeIt",
    "tags": [
        "anal",
        "cuchold",
        "double penetration",
        "first gay anal",
        "first time",
        "gay",
        "hot wife",
        "mmf",
        "threesome"
    ],
    "category": "Anal",
    "url": "https://www.literotica.com/s/gay-anal-while-my-wife-watches"
}