{
    "title": "Single Again Ch. 07",
    "pages": [
        "I wake with a start and find myself alone in bed. It takes me a moment to clear my head and remember exactly what happened last night. Then I smile as the memories return. But where are the girls? I hear someone talking and realize it is from the bathroom. I see Tina's clothes from last night still in a pile on the floor and guess that they are both together. \n\nI stretch and then climb out of bed. As I walk to the bathroom I realize what I am hearing is not talking but moaning. The girls are enjoying themselves without me. I slowly push the door open and see them in the shower. Tina is sitting on the bench with Judy's head between her legs. Tina is playing with her own tits, her eyes are closed and she is definitely enjoying the attention she is getting. \n\nJudy is squatting between her legs and obviously using her tongue. I also notice one hand is between her legs and she was a couple of fingers buried inside of her. Hopefully that means she is feeling good enough to let me enjoy her. \n\nTina squeals and her eyes open. It takes her a moment but she finally sees me watching and a dirty look appears on her face. She glances down at my hard cock and then at Judy's ass. It's obvious that Judy has no idea I am there. \"Come fuck her,\" Tina mouths silently to me. Tina helps me out by reaching down and rubbing her ass. Judy lifts her ass higher and now I can easily see her fingers buried in her pussy.\n\nI quietly walk behind Judy, spit into my hand and rub it onto my cock to help give me some lubrication. Then I lower myself so that my cock is in position and slowly push past her fingers and into her pussy. She is sopping wet but it still takes a moment to push inside of her. Judy squeals as I pierce her folds and looks over her shoulder. Her eyes are filled with lust.\n\n\"Oh fuck John, push inside of me. Fuck my pussy.\" Tina grabs her head and pulls it back to her pussy.\n\n\"Now fuck her like she needs it,\" Tina tells me. \"Fuck that pussy hard.\"\n\nI do exactly as she says and soon I am pounding her hard. I can hear muffled screams coming from Judy. She has her hands on Tina's thighs to keep from slamming into Tina. Judy's pussy is on fire and she has loosened up quite a bit. She starts to kiss Tina and I notice Tina has her hands on Judy's tits. \n\n\"Oh fuck oh fuck I'm going to cum. I'm going to cum all over your cock. Oh shit,\" she continues to moan. Her back arches and I am able to get just a little deeper. Her pussy grabs me tight and suddenly I'm flooded with her juice. She screams loudly as her orgasm hits her. \n\nI don't stop and continue to plow my cock in and out of her pussy. Another orgasm racks her body and then a third. Finally I feel like I am about to cum. \"I'm going to coat your pussy in cum. I can feel it rising.\"\n\n\"Oh, do it John, cum inside me. I want to feel your hot seed inside of me. Oh fuck,\" she groans as yet one more orgasm hits. I finally feel cum rise from my balls and I happily coat her insides with a huge load. Judy's legs start to shake and after just a couple more thrusts I finally pull out.\n\nJudy falls to her knees and Tina helps her sit on the bench beside her. Judy is looking at me and when she has her strength stands and gives me a long deep kiss. \"That was even better than I'd hoped,\" she says between kisses. I hold her tight as I let the water run over us. After a few minutes I hold my hand out to Tina and the three of us hug. \n\nIt's a few days later and the weather reports are a bit more accurate. On Wednesday we received another six inches of snow, but at least the town was more prepared and the main roads have been cleared. The side roads are another story, but at least people are able to get out now. \n\nAfter that night with Tina we only saw her once more even though she had an open invitation. Judy was feeling much better and I suspected that was the reason for Tina's absence. And Judy made the most of the situation. I woke up early on Tuesday, the day before the next storm was supposed to hit, and took the dogs for a quick walk. When I got back to the house, Judy was in the shower. I decided to join her to warm myself up. \n\nThat was the start of a sex filled day. I don't think I wore more than a robe all day and that was only to let the dogs out. Judy was obviously making up for lost time and I lost track of the number of times we had sex. I think we used just about every piece of furniture in every room downstairs. \n\nBy Saturday, the roads are clear and Judy decides she needs to go home. Reluctantly I say good-bye, but not before one more quickie. The plan is to spend some time apart since we have been so cooped up for the last week. I have to admit it felt good to have the house to myself again. \n\nLater that day I got a call from Heather's friend Becky. \"Hi John, it's Becky. I still owe you a dinner and hope that you are free tonight.\"\n\n\"As a matter of fact I am. What did you have in mind?\"\n\nShe sounds relieved as she says, \"I'm still not able to get around with the snow, but I would love to cook you some dinner.\"\n\n\"That sounds nice. Give me an hour and I'll be there.\"\n\n\"Oh thank you so much. I'll see you in an hour.\"\n\nIt takes me a lot longer to get to Becky's house since a lot of the side roads are still in bad shape. Before I can knock Becky opens the door. She looks stunning. Her hair is pulled back in a pony tail. The sweater she is wearing hugs her tits nicely and the jeans look as if they were painted on her body. She looks a lot better today than the last time I had seen her. \n\n\"Hi, I'm glad you could make it. Is everything still a mess out there?\"\n\n\"It's getting better. So how are things going?\" I ask.\n\n\"Not too bad, but I thought I was going to go stir crazy this past week. I couldn't go anywhere and walking outside would have been suicide. It's a good thing that I had just done my shopping or I would have been in some big trouble.\"\n\n\"Aren't you friends with any of your neighbors?\"\n\n\"No, not really. I haven't been living here very long and my husband isn't very social. I tried to make some friends but it is kind of difficult when everyone else is a couple.\"\n\n\"So where is your husband now?\"\n\n\"I'm not really sure right now. After he packed all of his boxes he pretty much disappeared.\"\n\n\"So he never picked his stuff up?\"\n\n\"Nope. He was supposed to show up the next day and never did. I do know that he is not contesting my divorce request but that is the only thing I've heard from him.\"\n\n\"That's good, so now you can get on with your life.\"\n\n\"Yeah, maybe. I'm just not sure what I'm going to do. The house is mine and it's paid for and the alimony he will have to pay me means that I won't have to work, at least nothing too difficult. I'll probably pick up a part-time job to have something to do.\"\n\n\"That's good. You need to get out of the house and meet some people. It will be good for you.\"\n\n\"You sound like someone with experience.\"\n\n\"My wife and I divorced last year. Well, officially last month, but we split about a year ago. I kind of dropped out of my social circle because I didn't want them to become involved. I felt very alone but things are starting to get better.\"\n\nShe sipped her wine and stared at me for a moment. \"Can I ask another favor?\"\n\n\"Sure,\" I reply.\n\n\"I don't have many friends in town. Actually, just Heather and I sometimes wonder about her. She's nice enough but I always feel like she's friends with me more out of having done business with her than any real fondness. Do you think we could do something together sometime?\"\n\nShe's a beautiful, intelligent woman and she's telling me that she's pretty much alone. While I don't want to get involved with someone going through a divorce, I can't help but feel sorry for her. \"What about your family?\"\n\n\"They live out west for the most part. I have some cousins a few hours away, but I don't really see them much. I should probably tell you a few things about myself that may help you understand me better.\"\n\nMost of her problems seem to stem from her husband. They met in college and she fell for him instantly. He is one of those slick characters that could sell ice to Eskimos, she explains, and he rubs a lot of people the wrong way. She was so in love with him that she didn't see that. Over the years he had alienated just about everyone he came in contact with, including her family. He was always out for the next big deal and didn't care who he hurt. She also found out later on that he had swindled a lot of money from different members of her family. \n\nWith the economy crashing she started to see him for what he really was. But she had nobody to turn to. Her family had abandoned her and her friends had stopped talking to her. \n\n\"It all came to a head last month when I took my wedding ring in for a cleaning. The person at the jewelry store took one look at it and told me he couldn't clean it. When I asked why not he told me that it was fake. I looked at him like he was crazy. I'd been going to that store for years and this was the first time I had ever been told that. I always wore the ring and couldn't figure out what was happening. It took a while but I remembered about a month before that I had taken my ring off so that I could garden. When I went to put it back on I couldn't find it. My husband told me that I'd probably put it down somewhere else and forgotten. About a week later I found it in the bedroom and put it back on. I knew I hadn't left it there, but didn't think anything about it. He must have taken it and had someone replace the stones with fakes.\"\n\n\"Anyway, after I found out it was fake I confronted him. He tried to deny it but eventually told me he needed the money because some deals had gone bad. I always let him take care of our finances so after talking with him I went to our bank and found out we had no money. As it turns out he hadn't completed a deal in almost two years and to make matters worse was stealing from our accounts. That's when things came to a head and he attacked me.\"\n\nI sat and thought about that for a while. \"But how is he going to pay your alimony and stuff?\"\n\n\"It turns out the bastard has his own bank accounts. I'm holding my breath to figure out where that money came from but so far they seem legit. My lawyer says that he has probably been keeping that account to himself this entire time and has been using our shared account to cover everything else. I never paid attention, I just know that bills are paid.\"\n\n\"That's pretty dangerous.\"\n\n\"I know, but I've learned a lot the past month and I have everything under control now. I'm just preparing for some of the unknown stuff. First of which is what happened to him. Nobody has seen him in over a month now, but his lawyer is moving forward with the divorce.\"\n\nThe discussion changes to more personal things. Becky doesn't seem to have much of a life outside of her home. She loves to read and garden, but that is about it. \n\n\"I have a neighbor that I could introduce you to. She's a little older than you but she's single and very nice. I can set something up.\"\n\n\"Thank you. That would be a nice start.\"\n\nShe has made a simple dinner that is quite good and afterwards I explain that I need to leave to take care of my dog. She says she understands but I can tell she is disappointed. When I get home I find a message from Judy and call her back.\n\n\"Hey, how's it feel to be home?\"\n\n\"Actually pretty good. Where were you?\"\n\n\"I had done a favor for someone a while back and she made me dinner to repay me.\"\n\n\"She? Do I know this she?\"\n\n\"No, I don't think so. She's a friend of Heather's and needed some help.\"\n\n\"And she only made you dinner?\"\n\n\"Are you jealous?\"\n\n\"Should I be?\"\n\n\"No, just dinner and nothing else. That's it.\"\n\n\"Ok, I'll take your word for it. What are you doing now?\"\n\n\"Nothing. I will probably watch some tv and head to bed. What about you?\"\n\n\"Same thing. I kind of miss being there though. Maybe I could have waited another day.\"\n\n\"I asked. You said we needed a few nights off.\"\n\n\"Yeah, well I'm admitting that I was wrong. Don't get too excited about that though. I was thinking about coming over, but now I'm comfy and don't feel like getting dressed again.\"\n\n\"I could come over there if you'd like.\"\n\nThere was a short pause. \"No, I think it would be good for us to not see each other for a few days.\" The past week was crazy and I had to agree with her.\n\n\"Well, let's plan on dinner next weekend then.\"\n\n\"Ok, that sounds good. We can make plans as the weekend gets closer. Have a good night.\"\n\n\"You too. Good night Judy.\"\n\nI find nothing on television and decide to go to bed early. I realize it is not even ten o'clock yet, but figure I can get up early tomorrow. Just before I get into bed my phone rings and it turns out to be Mandy.\n\n\"Am I calling too late?\" she asks.\n\n\"No, not really. I was just about to go read in bed. How are you? I haven't heard from you in a while.\"\n\n\"I know. Things have been a little crazy around here and then Levi got sick. Throw in the snow and I've been pretty much stuck at home.\"\n\n\"I'm sorry to hear about Levi. Was it anything serious?\"\n\n\"No, just the flu, but of course when your children get sick, the parents get sick. We're finally over everything though. So, you are going to bed now?\"\n\n\"Well, I am thinking about it. There isn't anything on tv worth watching and I don't seem to have any decent books.\"\n\n\"I thought you were going to read for a bit?\"\n\n\"Yeah, well, it's an old book that I've already read.\"\n\n\"I'm in the same boat. I've read just about everything this past week. Levi is at Anna's house for a sleepover and I thought about a quiet night, but now I'm just bored. I'm hoping you'd like to meet me for a drink.\"\n\n\"That sounds great. What do you have in mind?\"\n\n\"There's a little pub in town. Does that sound good to you?\"\n\n\"Sounds great, give me half an hour.\"\n\n\"I'll see you there.\"\n\nI get dressed and make my way into town. When I get to the pub Mandy is already there and has ordered me a drink. She looks fantastic. Her face seems to have filled out even more and she is looking quite beautiful. She is wearing a loose fitting sweater and tight jeans with high-heeled boots. It's the kind of look that always turns me on. She stands as I approach and gives me a big hug.\n\n\"I'm so glad you came.\"\n\n\"I hope I haven't kept you waiting long.\"\n\n\"No, I only just got here. I ordered you a beer. I hope that is ok.\"\n\n\"That's perfect.\" I take a seat across from her and ask, \"So what have you been up to?\"\n\n\"Nothing exciting. First Levi got sick and then I was sick. And of course we had that freak snow storm. I thought winter was over.\"\n\n\"I think everyone did. Guess we were wrong.\"\n\n\"What about you? I kind of hoped you'd call, but I guess when I didn't return you call you were over me.\"\n\n\"No, nothing like that. I was a bit disappointed that I hadn't heard back from you. But I had a project approved and I've been busy working on that. Then like everyone else I've been locked up for the past week or so.\"\n\nFor the next hour we just catch up on things. I can tell she wants to ask me more or say something but I decide to let her make the move. When she gets up to use the bathroom I admire her ass. It seems a bit fuller but that could be just the jeans she is wearing. When she comes back to the table she starts to say something but backs off and takes a sip of her wine. \n\nIt is getting close to midnight by now and I decide it's time to head home. I pay the tab against her objections and we walk outside. Once outside she turns and kisses me. \"What's it going to take to get an invitation home with you?\"\n\n\"Maybe another kiss or two,\" I say with a smile.\n\nShe does better than that and gives me a long passionate kiss, pulling her body against mine. \"Will that do?\"\n\n\"You bet. Would you like to drive with me or follow?\"\n\n\"I'll follow, just in case I have to leave early tomorrow.\"\n\n\"Ok, just be careful. Most of the roads are pretty good till you get to my street. We'll just go slow once we are there.\"\n\nWe make it back to my house and go inside. Pup is barking by the back door so I let him out and he runs down the stairs. I'm glad to see that he hasn't done anything to the house while I was gone. Mandy stands quietly in the kitchen while we wait for Pup to come back. Obviously she isn't going to make a move so I decide to take control. I walk over to her and pull her to me. The kiss is quite hot and I am glad to see that there seems to be a bit more flesh to her. That might be just the clothes she is wearing but she feels a lot less delicate.\n\nPup scratches at the door so I let him back in and then take Mandy into the bedroom. We embrace again and this time I slide my hand under her sweater. I am surprised to find only skin. She is moaning as we kiss and the longer we go the more frenzied she becomes. I soon have her sweater off and I check her out. She has definitely filled in nicely in the past few weeks and she doesn't seem quite as shy. I smile as I check her out and she seems to relax quite a bit.\n\n\"I've put on almost ten pounds since the last time you saw me.\"\n\n\"You look fantastic.\" Not only do I not see her ribs, but her tits look even more incredible. They seem bigger and also a lot more firm. My compliment seems to make her bolder and she pushes her pants down her legs. She is wearing very tiny underwear and I can see that they are quite wet. \n\n\"Your turn,\" she says as she begins removing my clothes. I only let her get my shirt off before I pick her up and put her onto the bed. Our first time together was kind of strange because she was acting so shy and I was afraid she was too fragile. Tonight is beginning to feel different and I decide to go after her.\n\nShe is lying on her back and I pull her so that her ass is right on the edge. I reach down and pull her panties off exposing her pussy. She is already dripping wet which is also different than last time. I bury my face between her legs and lick her pussy from bottom to top. Even her taste is better, just a bit sweeter. She moans loud as my tongue comes in contact with her clit. I look up her body and she is pinching and twisting her own nipples. \n\n\"Oh fuck John, I've been dreaming about this for weeks. I'm so glad you wanted to see me,\" she pants. I move my tongue all around her clit and it pokes its way from under the hood. With it is exposed I begin to play with it which makes her moan louder. \n\nI wrap my lips around her little nub and pull my head back causing Mandy to jump and groan even louder. By now her juices are funning freely out of her pussy and drenching my chin. I move two fingers to her entrance and push into her, curling my fingers to play with her g-spot. She groans again and I feel her pussy grasp my fingers.\n\n\"That's it, I'm going to cum. Oh fuck I'm going to cum so hard. Oh, oh,oh...\" she squeals her ass rises from the bed. Just before she releases I pull away from her and she screams \"Nooooo. Don't stop now. I'm so close, please don't stop.\" She reaches between her legs but I push her hands away and move my face back. I curl my fingers again and rub her g-spot at the same time as I lick her clit. \n\nMandy explodes the instant my tongue and fingers make contact. Her body convulses several times as her pussy spasms and squirts. She is out of control as a second, more violent orgasm crashes. I continue to suck her clit and she quickly has a third, even more violent orgasm. Each time she squirts more juice. \n\nAs her third orgasm calms she pushes me away with her feet and rolls onto her side. Every so often her body shakes. She has her arms wrapped around her as if she is trying to get control of her body. I watch this sitting on the floor and wait for her to recover. \n\n\"Damn John, that was so much better than using my toys. I've been fantasizing about this and when I hadn't heard from you decided to make the next move. I'm so glad I built up enough courage to do it.\" She finally sits up and reaches for me. \"But now comes the best part. I want to feel that magnificent cock inside of me. And I'm on the pill so fuck me to oblivion. I want to feel you cum inside of me, so don't hold back.\"",
        "I am in bed before my pants hit the floor. Mandy lies back again and pulls me on top of her. I reach between us and line my cock up with her pussy. After just a few strokes I begin my slow descent, but Mandy has other ideas. She reaches around, grabs my ass and pulls me down into her. \"Oh fuck,\" I growl as I feel her hot moist hole accept me.\n\n\"I said fuck me and I mean fuck me. I'm not as delicate as you think and I want you to fuck the shit out of me.\" I don't need to be told twice and quickly pound my hips into hers. She is still tight but quickly loosens up. \"Oh, that's it. Fuck my pussy. Fuck me hard. I want all of you and I want to feel your cum shooting inside of me.\"\n\nI am able to hold out for a while but eventually I feel my balls start to tighten. \"Here it comes. I'm going to give you what you want. I'm going to cum deep inside of you.\" \n\n\"Oh yes, do it.\" She pulls her knees towards her chest and I fuck her even deeper. My balls finally release and I flood her pussy with a large load of hot cum. \"Oh, oh oh,\" she moans. I continue to pound her as I fill her up. I start to slow down after my last shot but she encourages me on. \"Don't stop. I want more. I want to feel you cock in my stomach. Fuck my neglected pussy. Fuck me like I need it.\"\n\nI stay semi hard and keep moving hoping that I'll get hard again. What she says next does the trick.\n\n\"I've been fucking myself with a big dildo every night thinking it was you. I get into bed and watch porn and then fuck myself silly. I get into different positions imagining that it's you pounding into me. My favorite is with you behind me. I have my big red rubber cock and I am on my knees. I imagine you holding my hips while I push my cock into me. I always scream when I cum but I feel so empty without your cum dripping out of my pussy.\"\n\nThat is all it took. I move her into position and she reaches back to guide me into her pussy. It is already leaking from my last load and I slam my hips into hers.\n\n\"That's it. Fuck me hard. Fuck me like I can't by myself. Grab my hips and use me. Then fill me up with more cum.\" I grab her hips and start to plow her pussy. She is sopping wet and I easily pound her. Having just cum though I know it is going to be a long ride. Suddenly her back arches and I feel her pussy clench my cock. Then she screams and cums.\n\n\"Oh, just like that. Give me more. Fuck me harder.\" She is completely out of control now and shouting at me to give her more. I reach forward and grab a handful of hair to pull her. She whimpers but doesn't complain. \n\nI take a moment to look at her body more closely. She definitely has put on weight and it looks fantastic. She no longer looks as bony as she had. I move my other hand up her back and can't feel her ribs or spine like I had just about a month ago. And her energy is much greater than it had been. \n\nI continue to pound my cock into her as I tell her \"You look fantastic, do you know that?\"\n\nShe looks at me over her shoulder. \"That's probably because you have your dick in me,\" she says and laughs. \"Not that I'm complaining.\" \n\nI smile at her and pull out. I can tell she is starting to tire and I want to try a new position. \"You drive for a while.\"\n\n\"I thought you'd never ask.\" We change spots quickly and she mounts me. \"Do you really like the extra weight?\"\n\n\"I told you, you look fantastic. You look healthy and you have a lot more energy than last time.\"\n\nShe leans forward to kiss me. \"Thank you. Not just for saying those things, but for making me feel desired again. I know our first time together you had some qualms because I looked so skeletal. But you made me feel so much better about myself knowing that a man was still interested in me sexually.\"\n\n\"Well, I am definitely interested sexually.\"\n\n\"Good, because I hope that we can get together more than once a month. It seems that my libido has recovered as well. I'm as horny as teenager.\"\n\n\"I couldn't tell.\"\n\nShe bites my lip but laughs. \"You have no idea. It's like a switch was turned on. I've been trying to get enough courage to call you and then that stupid storm hit. I was stuck at home with Levi and had no way to get any release. At least when he's at school I can take care of things. I had to wait till late at night after he was asleep, and even then it was tough. He walked in on me twice while I was taking care of myself.\"\n\nI laughed at the image of her spread eagle with some vibrator while her son walked into her room. The entire time we are talking she is slowly riding me. It is just enough to keep me hard. She finally gets down to business and begins to fuck me faster. I reach behind her and grab her ass.\n\n\"Spank me. I liked it last time.\" I spank her softly and she groans. \"Yeah, that's it, just a little harder this time.\" I spank her harder and she grunts. She also pushes her pussy down and holds it there. \"I love the feel of your cock buried inside of me.\" I spank her again and then grab her cheeks. I spread them apart and run my finger down her crack. When I touch her butt hole she squirms. I am happy to find that it is already wet and I apply a bit of pressure.\n\n\"Oh yeah, put your finger in my ass.\" I feel her force herself to relax and my finger slides in. \"Oh,\" she whimpers.\n\n\"You like me playing with your ass?\"\n\n\"Yes.\"\n\n\"Maybe you'd like me to fuck your ass.\" Mandy whimpers as she feels a second finger push inside of her. \"I bet I can get a third finger inside of you.\" \n\n\"Do it,\" she groans. I move my two fingers around to loosen her before pushing a third finger inside of her. \"Oh yeah, I like that.\" Her body is completely relaxed on top of mine. \n\n\"You want to feel my cock now?\"\n\n\"No, not yet. Maybe another time,\" she pants. \"But I like how your fingers feel.\"\n\nI start to move my hips to encourage her and she responds. \"Oh, I feel so full right now. But it also feels so good. I've never done anal, but I think I might like it.\" She moves her hips faster and I meet her movements by thrusting my hips into her. Soon we are both grunting and moaning. I can feel my fingers through the thin membrane and she can feel it as well. \n\n\"Uh, uh, uh..\" she grunts as her orgasm quickly approaches. \"I'm going to cum. Cum with me.\" She is screaming now so I move my hips faster, hoping to join her. \"Oh fuck me, fill me up with your juice. Flood my pussy,\"\n\n\"Oh fuck, I'm going to cum Mandy. I'm ready. Cum with me.\" My balls tighten and then explode. It's much more powerful than the first. As my first stream hits her inner walls, Mandy explodes as well and we both scream. \n\nAfter a few more thrusts I pull my fingers from her ass and she collapses on my chest. Neither of us can speak or move yet. My softening cock slips out of her and is quickly followed by a huge stream of our combined juices.\n\n\"Wow that was intense,\" I say.\n\n\"You're not kidding. The real thing is so much better than some porn and a vibrator.\" She kisses me and rolls to one side. \"I think we've made quite a mess.\"\n\n\"I think you're right.\"\n\n\"I need to use the bathroom.\" She gets out of bed and I watch her as she walks. She is definitely looking better as I admire her ass. I can see a large gob of cum run down her thigh as she hurries. I get a towel and wipe myself. There is a huge wet stain on the bed now so I quickly change the sheets thinking that the night is over.\n\nMandy comes back out and helps me finish. Sadly I am correct and we climb into bed to snuggle. To be honest though, I probably couldn't get another erection right now with Viagra, so it is probably for the best. I glance at the clock and notice it is after one, but for some reason I can't fall asleep.\n\nI move my hands lightly on Mandy's back and she moves closer. \"That feels nice. Do you really think I look better?\"\n\nI lift my head to look at her. \"You look much better. You are starting to show off your curves more. Your tits are incredible and your ass looks awesome.\"\n\n\"And you not just saying that because I rocked your world?\"\n\n\"If we had met in a bar as strangers I'd have gone right for you.\"\n\n\"And taken me home to ravish?\"\n\n\"Maybe not even home. Maybe I'd just take you into a back room and had my way.\"\n\n\"How kinky? Maybe we can do something like that anyway.\"\n\n\"You are quite the perv.\"\n\n\"I've watched quite a bit of porn the last few months and especially the last week. I've got all kinds of dirty thoughts going through my mind.\" My cock twitches but is definitely out of action for now.\n\n\"I welcome you to show them to me.\"\n\n\"That's a deal.\"\n\nWe kiss before falling asleep in each others arms.\n\nPup wakes me up early the next morning to go out. Mandy is still asleep so I slowly get out of bed to let Pup out. I probably should have put a robe on and the cold air kills the erection that I had. I use the bathroom and brush my teeth before letting Pup back in and climb into bed behind Mandy, trying not to touch her till I warm up again. \n\nI must have dosed off again and find myself spooning behind Mandy. The dream I had was pretty much exactly like this and I have a raging hard-on pressed against her ass. Mandy is still asleep as I adjust myself so that my cock is more comfortably nested against her backside. She is still sticky from last night's activities.\n\nI move my fingers along her side down to her leg and back to her shoulder. When my fingers brush along her breast her nipple hardens. I want to see how far I can get before I wake her so I gently move my fingers across her other breast. After a few moments I start to gently grind my hips against her. I move my hips back so that I can place my cock so that is now beneath her ass rather than between us. I give her ass a squeeze as I slowly rub my cock along her ass and slit. She is already wet and I am soon coated. \n\nMandy whimpers when I feel my cock press against the top of her pussy and I pull back slightly. \"Don't stop,\" she whispers. Her eyes are still closed so I am not sure if she is really awake or not, but I continue to push against her. I cup her ass and spread her cheeks apart to get even tighter against her and she whimpers some more. \n\nI want to play with her ass some more and place my finger along her crack till I find her anal hole. It is already slick from running my cock along it for the last few minutes. Mandy is moaning a little now and pushes her ass against me allowing my finger to slip inside of her. If she wasn't awake, she is now. \n\n\"Oh, and I thought I was just having a really good dream.\" She turns her head to look at me. \"Do you wake all your overnight visitors like this?\"\n\n\"Only the ones with such nice asses.\" I feel her reach between her legs and grab my cock. She adjusts the angle and I press forward, slipping into her steaming snatch. We both groan as I slide deeper inside of her. I have a finger buried in her ass still while I move my hips to thrust my penis into her.\n\n\"Oh, I like this position. You're prick is hitting the perfect spot.\" I can also feel her rubbing her clit. \"Put another finger into me, please.\"\n\n\"Please?\" I chuckle.\n\n\"Would you rather I said fuck me with more fingers you fucking bastard?\"\n\n\"Either way works for me.\"\n\n\"Stop talking and fuck me already.\"\n\nWho am I to argue with her? I slide a second finger into her ass and move my hips faster. Once my fingers are sliding easily I add a third finger. Mandy goes nuts and starts to push her ass against my hand.\n\n\"Oh that feels incredible. I think I'm going to cum. Fuck me. Make me squirt all over you.\" Instead I pull out and readjust so that the head of my dick is against her ass. \"Wait, I've never done this before.\"\n\n\"It's ok, I have. We'll just take it really slow.\"\n\nShe looks back at me and I kiss her as I reach around and rub her clit. Her eyes close slight and I feel her relax enough for me to push my hips forward. After having three fingers inside of her it doesn't take much pressure to get the head of my cock through her anal ring. She grunts as she feels me split her.\n\n\"You control things. Move your hips back slowly and if it starts to hurt stop till it gets comfortable again. The important thing is that you relax.\"\n\nShe is biting her lower lip and I feel her push against me. I am watching her face and see her eyes roll back into her head. Her mouth opens but she doesn't make any sounds. I am still rubbing her pussy and Mandy continues to push back against me. Slowly my cock fills her ass and when I get to about halfway in she suddenly slams her hips back. It actually hurts me a little, but Mandy wails loudly.\n\n\"Oh fuck that hurt. Just lie still for a minute.\"\n\n\"I warned you to go slow.\"\n\n\"I know, but it was feeling so good I kind of lost control.\" I moved my hand from her pussy and took her chin and moved her face so that I could kiss her. It was more than a minute later before she started to relax and move her hips. But it must have been enough for her because she started to moan in pleasure shortly after that. \"It feels like you are in my stomach. It feels so fucking good though.\"\n\nI let her stay in control till she is pushing against me as hard as she can. \"Ok, now fuck my ass.\"\n\n\"Anything you command,\" I say jokingly and start to thrust into her. \n\n\"That's it. Fuck me harder. I fucking love this,\" she pants. \"Oh crap, I can feel every little part of your cock. Oh, oh.\" She is grunting and thrusting back against me. I reach between her legs and lightly touch her clit. \"Oh fuuuuuuck,\" she screams and I feel her entire body tense up and then release. She screams loud and her body starts to thrash. Between the tightness and the movement I can't hold out any longer.\n\n\"I'm going to cum in your ass,\" I say into her ear. \n\n\"Yes, do it.\" She is still not in control and the pressure puts me over the edge. I shoot a huge load into her ass. \"OH, oh,\" she screams. \"Your cum is so hot in my ass. Oh fuck it feels good. Shit, it feels beyond good. I'm going to cum again. Oh crap, oh fuck.\" \n\nI immediately start to deflate as my cock is spent. When I slip out of her ass she rolls over and starts kissing me all over my face. Mandy has a look of total contentment on her face and holds me tight once she has finished kissing me.\n\n\"I know you're not looking for a relationship right now, and truthfully, neither am I, but I would really like to see you again and do a lot more of this.\"\n\nShe is almost giddy. \"I'd like that too. Maybe when Levi is in school you can come over. I'm usually working from home so just give me a call.\"\n\nShe smiles and kisses me again. \"I definitely want to do anal again. That was amazing. I was so afraid it would hurt.\"\n\n\"I think I've created a monster.\"\n\n\"Maybe you have. For some reason I feel so alive right now. But I can't stay too much longer since I have to pick Levi up. Hopefully we can get together for lunch during the week.\"\n\nI kiss her deeply. Once we both recover we shower together and I make her some coffee to take with her. \"Thank you for a wonderful night. I'll call you later this week. Maybe if it warms up enough the kids can go back to school and I'll have time to see you again.\" We kiss and I watch her walk to her car.\n\nNo sooner do I have the door shut then the phone rings. \"Hey stud, so who'd you fuck last night?\" Judy asks.\n\n\"How do you know I fucked anyone?\"\n\n\"I don't. I tried to call around eleven and you didn't answer. I couldn't get to sleep last night till late.\"\n\nOur deal is that I tell her everything. \"A friend of mine called and I had drinks with her. Then we came back here.\"\n\n\"I knew it,\" she says. \"Was it good?\"\n\n\"It was pretty good.\"\n\n\"Is she pretty?\"\n\n\"She is very pretty, but nowhere near as sexy as you,\" I say.\n\n\"Bullshit, but I'll accept that. Does she have big tits?\"\n\n\"They are very big. You want the details?\"\n\n\"I was thinking about coming over, but I guess you may be a bit worn out.\"\n\n\"At least for now I am. But I'd still like to see you.\"\n\n\"You didn't get enough last night?\"\n\n\"Maybe I just want to see you.\" And I am telling the truth. How could I not like this girl? Barely even getting disturbed I had fucked another girl.\n\n\"I'd like to see you too. Can we meet for lunch?\"\n\n\"Of course. Name the place.\"\n\nWe decide to meet at the diner just outside of town. I am thrilled that the weather seems to be warming. By the time I am on the road, it feels like spring, even if the large piles of snow say differently. When I get to the diner, Judy is already there. She is dressed in a sweatshirt and jeans and has her hair pulled back in a pony tail. She stands up when she sees me and gives me a huge hug and kiss.\n\n\"What was that for?\" I ask as we sit down. She has chosen a booth and sits next to me rather than across from me.\n\n\"When I saw you I just wanted to do that.\"\n\nShe is also holding my hand under the table and seems to be very excited. \"Are you ok?\"\n\n\"Better than ok.\"\n\n\"I'm sure you'll explain at some point.\"\n\n\"It's not very difficult to understand. I saw you out last night with that girl. I almost came over to you but I was afraid you'd think I was spying so I just left and went somewhere else.\"\n\n\"So you were testing me this morning?\" I am a little pissed about that.\n\nShe gets concerned but doesn't deny it. \"You have to realize that I am still a little nervous about all of this. I know deep down that I can trust you. I don't know why but I do. But I still have all that history to erase and it is going to be tough.\" \n\n\"Ok, but I just want to be fair here. I don't like being tested. What you see is what you get with me.\"\n\n\"I know, that's why I am so happy right now. You were completely truthful with me and didn't even try to sugarcoat anything. Well, except for the sexy part. She's way sexier than me and her tits are massive. Think she'd be up for a threesome?\"\n\nI blink and then kiss her. \"I can always ask.\" The rest of lunch goes by talking about a lot of stuff, but eventually Judy comes back to sex. \n\nShe has moved her hand to my crotch and is lightly rubbing me. I quietly give her the details of last night and by the end she is squirming. \"So you really did her up the ass?\" I glance around but don't notice anyone looking at us.\n\n\"Yes. It was kind of a spur of the moment type of thing.\"\n\n\"Wow, and she liked it?\" I notice her cheeks are a bit flush and she has a fevered glaze in her eyes.\n\n\"She loved it. I think she came twice.\"\n\nJudy licks her lips and leans against me as we wait for change. I walk her to her car and she is all over me. \"I want to try that too. Not right now, but soon. I know it feels good with just your finger.\"\n\n\"Just let me know.\" \n\n\"No, I want it to be like you were with Mandy. I don't want think about it, I just want it to happen.\"\n\nWe kiss some more and I invite her back to my place. \"No, not today. I have to get some more stuff done before I start back to work tomorrow.\" She presses against me for some more kissing. \"Ok, I really need to go,\" she says reluctantly. She gets into her car before I can grab her again and rolls down the window. \"I'll call you later.\"\n\n\"Ok, bye.\"\n\nI watch Judy drive away and shake my head. Now I'm horny again. I drive home and am greeted at the door by Pup and decide to take him for a walk. As we walk past Tina's house I hear \"Hey neighbor.\" I look up and see her leaning over the railing of her deck.\n\n\"Hey, how's it going?\"\n\n\"Good, care for some company?\"\n\n\"Of course.\"\n\n\"I'll be right down.\" I play with Pup till Tina comes out a few minutes later. \"So, who was the girl last night?\" \n\nDamn, is everyone watching me? \"A friend of mine. Her name's Mandy.\"\n\n\"Did you have fun with her last night?\"\n\n\"I did. Are you pissed?\"\n\n\"No, not really. But you could have called me.\"\n\n\"She actually called me.\"\n\n\"Well, that's ok. I know you're not going to settle down. But does Judy know?\"\n\n\"She does. I told her I'd be honest about that type of thing.\"\n",
        "\"Interesting.\" We walk quietly for a bit before she says, \"I'm glad you were honest with me about it too.\" I look at her and she is smiling. The snow is still very deep and we start to tire quickly so the walk isn't very long. \n\nWe walk back to the house and as we pass Tina's we hear, \"Oh there you are. Is that our neighbor?\" I look up and am stunned. It must be Tina's daughter and she's every bit as gorgeous as her mom. She has the same color hair and eyes as Tina and the same amazing body. She is wearing a t-shirt and shorts and looks like a swimsuit model.\n\n\"Hey Brandy. You were on the phone when I left. And yes, this is John. He lives next door.\"\n\n\"Now I know why you didn't come home that night.\" She smiles brightly at me. \n\n\"Mind your own business.\" Tina introduces me to her daughter before heading back to her house. I tell them good-bye and walk back to my place. \n\nI clean some stuff around the house, make myself a drink and grab the computer before settling down on my deck. I'm not really paying much attention to anything when I hear the latch on my gate open. \"I hope you don't mind, but I was lonely.\" Tina steps through the gate.\n\n\"Not at all. Have a seat.\"\n\n\"Thanks.\" She has a glass of wine in her hand. \"I can't believe how warm it is now? It's just weird with all this snow.\"\n\n\"I know, I was thinking about that earlier. It feels like spring with a foot of snow on the ground.\"\n\n\"Are you working or playing?\"\n\n\"Just going through some emails before work tomorrow.\"\n\n\"Should I leave you?\"\n\n\"No, I'm glad you came over. Maybe we can actually have a conversation.\" She smiles at me but doesn't say anything about it. She is staring at the lake and I take a moment to check her out. She's not wearing her coat now and I see that she is wearing a tight fitting t-shirt that really shows off her tits. She is a gorgeous woman and I can't imagine the fool that let her go.\n\n\"I love it out here,\" she says. \"It's so peaceful and relaxing.\"\n\n\"Yeah, it is really nice. That's what sold me on the house to begin with.\"\n\n\"I've seen you out here. When you first moved in you were doing some work without a shirt. I was in my bedroom and eventually reached my hand into my pants to give myself some release. I've had quite a few fantasies about you.\"\n\n\"Why did you never come over?\"\n\n\"Too afraid I guess. I always hoped you'd come to say hi to me.\"\n\n\"I'm sorry. I kind of hid myself away while I was going through my divorce and then when it was over had just settled into a routine.\"\n\n\"I'm glad we finally met.\"\n\n\"Me to,\" I respond. We talk about other stuff as we try to get to know one another. It seems we come from different worlds. Her parents are very wealthy and she is used to the better things in life while I came from more of a middle class background. I always had what I needed and learned that hard work has its rewards. \n\nAs we get to know each other, I find myself drawn more towards her. Eventually the sun starts to get low and a chill creeps back into the air. I notice Tina shivering and that her nipples have started to jut out. \n\n\"Would you like to stay for dinner?\"\n\n\"Yes, thank you. I can cook if you'd like.\"\n\n\"No, it's probably a bit late for anything big, so how about something simple?\"\n\n\"What do you have in mind?\"\n\n\"How about ordering a pizza?\"\n\n\"Sounds good to me.\"\n\nWe go inside and I place the order for a large pie. A few minutes later Tina's phone rings. \"Hey Brandy.\" There's a slight pause before she continues, \"No, I'm going to have pizza with John. You're on your own tonight.\" I can hear her through the phone but not enough to know what she is saying. \"Hold on, let me ask.\" She pulls the phone down and asks me \"Would you mind if Brandy joins us? Apparently she has forgotten how to cook.\"\n\nI hesitate since I am hoping that Tina will stay a while. \"Sure, if it's ok with you.\" Tina smiles at me and puts the phone back to her ear.\n\n\"Sorry babe, but we've already ordered and it probably won't be enough. Why don't you just order your own or make yourself a salad?\" I hear Brandy say something before Tina tells her good-bye.\n\n\"She's not really happy with me right now,\" Tina says but is smiling about it. \"She'll have to get over it.\" Tina puts the phone on the counter and grabs me for a kiss. In next to no time I have Tina on the counter, her shirt and bra are on the floor and we our tongues are dancing together. \"Oh yeah, this is much better than dinner with Brandy.\" \n\nTina pulls my shirt off and starts to unbuckle my pants but the doorbell interrupts us. \"Damn, bad timing.\"\n\n\"It's probably good timing. I'd hate to answer the door in just my underwear.\" I grab my shirt and wallet and answer the door. It is the delivery guy, but standing just behind him is Brandy with a large bowl of salad. The guy is gawking at Brandy who is wearing a cut off t-shirt that exposes her flat stomach and has a deep V cut into it, showing quite a bit of cleavage. \n\n\"Hey Brandy, come on in,\" I say loud enough, hoping that Tina hears me. \"Let me take that from you dude.\" Brandy squeezes past and the guy doesn't move. \"Hey, eyes up here,\" and I snap my fingers. I have to admit, Brandy has quite an ass. I finally get his attention and pay the bill, leaving a nice tip. He still hasn't moved so I just shut the door gently in his face. What a weiner.\n\nI walk into the kitchen and Tina and Brandy are standing face to face. Tina is furious, but Brandy has an amused look on her face. They both turn to me as I step into the kitchen and then separate. It is very awkward now so I step to the cabinet and grab some plates. Tina grabs Brandy's hand and takes her outside while I set the table.\n\n\"Well why should you have all the fun?\"\n\n\"Because you have plenty of guys your own age.\"\n\n\"And I bet none of them are half of what he is. I can tell, otherwise you wouldn't be here right now, mom. Besides, where's your bra? You were wearing one earlier.\"\n\n\"None of your business,\" I hear Tina say, but she looks horrified. \"Please go home,\" she begs Brandy.\n\nBrandy is about to say something then stops. There is something about her posture that changes and she just comes back into the house and steps up to me. \"I'm really sorry for barging in like that.\" She looks over her shoulder at her mom who has just come back inside. \"Treat her nice. She deserves it.\" \n\nTina actually has tears in her eyes and Brandy gives her a hug. \"Thanks,\" is all Tina can say. Brandy whispers something to her that I can't hear before she leaves.\n\nTina and I are both silent after the whirlwind that just occurred. I open the box and put a slice of pizza on each of our plates, but Tina ignores the food and kisses me passionately. In no time at all we are stripped and Tina is bent over the counter as I tongue her damp pussy. She is so turned on that she has a small orgasm before I really get started. I continue to lick and suck her till she has a more intense second one before she turns around and drops to her knees.\n\nI am so hard already that she has trouble getting me into her mouth so she gives up and turns around. \"Fuck me John. Fuck me hard.\" I stand up and shove my cock into her. Tina squeals as I split her lips and sheath myself all the way inside of her. Without giving her a chance to get comfortable I pull out and slam home again and again. \n\n\"Oh that's it. Give it to me. Fuck my pussy and make me cum.\" She is a lot more vocal than when Judy was with us. I have my hands on her hips and I am pulling her into me as I thrust forward. I feel Tina's hand rubbing her clit and she is looking back over her shoulder. I can feel my balls start to tighten at the same time Tina tells me she's ready to explode. I grip her hips tighter and thrust into her as she explodes. The sudden tightening of her pussy sends me over the edge and I blast a load deep inside her womb. \n\nTina screams as her orgasm tears through her and we both start slamming into each other. The intensity of the orgasm makes me see spots and I am afraid I am going to fall over, but I manage to continue standing. Tina on the other hand is grabbing the counter and the only thing holding her up is my hands on her hips. I help her stand up and pull to me.\n\nHer head is on my chest as I hold her and caress her long hair. It's several minutes later before she can speak. \"That was incredible. I can't believe how intense that was. Was it good for you too?\"\n\n\"I think I started to black out. What made you so crazy?\"\n\n\"My daughter told me to give you my all, so I did.\" \n\n\"How about we eat before the pizza gets cold?\"\n\nWe put our pants and shirts on while we eat. I am suddenly ravenous and eat about five slices and some salad. Tina seems to be quite hungry as well but she eats more salad than pizza. \n\n\"I should warn you, I'm pretty sure Brandy is going to go after you. It only makes sense since you are closer in age to her anyway.\"\n\n\"I'll keep my distance.\" Tina stops to stare for a moment.\n\n\"Don't stop on my account. From what I understand she is quite good in the sack. And I trust you not to hurt her.\"\n\nI stop in mid bite as I hear what she is saying. \"Tina, that's crazy. I don't want to mess things up with you.\"\n\n\"Don't be silly. I'm not going to marry you. I like you a lot and hope that we can continue this for a while, but if you want my daughter, I know she wants you. Just be good to her.\" I don't know what to say anymore and continue to stare at Tina. \"Look, for the rest of tonight, you're mine. But I know my daughter. Once she has her sights set on something she always gets it. She's a great kid and I love her deeply.\"\n\nWe continue to eat quietly as I think about what Tina has just said. I will talk to Judy about it before I let anything happen but I feel certain that Judy won't mind. She may even want to join us. That thought made my cock start to come back to life. \n\n\"What are you thinking?\" Tina asks.\n\n\"I'm going to have to talk to Judy about this.\"\n\n\"You are probably right. Can I make an observation about Judy?\"\n\n\"Am I going to like it?\"\n\n\"I'll let you decide. I like Judy. She is a really great girl, but her past is a mess. You're good for her though and I think she knows it which is why she is letting you do some of the things you get to do. But it probably won't last forever. At some point she is going to want a commitment from you. Are you willing to do that? It may not be tomorrow, or next month or even next year, but eventually she will want that.\"\n\n\"I've already thought about that. Getting snowed in together gave me a lot of time to get to know her. I know you're right, but I also think she likes having another woman around. She spent the last several years with a woman. It's part of who she is.\"\n\n\"Maybe you're right. And you get to continue to play around,\" Tina says with a smile.\n\n\"Well, I don't always think it will be like this. At some point she is going to limit my activities.\"\n\nWe are both quiet for a bit as we clear the table. Once everything is clean Tina aggressively attacks me again. She wraps her arms around my neck and pulls me tight so I lift her legs and walk into the bedroom. I drop her onto the bed and quickly pull her pants off. I notice a big wet stain in the crotch but don't say anything about it.\n\nAs I pull my clothes off, Tina removes her shirt. My cock is already hard and without ceremony I pull her to the edge of the mattress and slide in. She is soaked and very hot and I am able to slide easily into her. After our earlier fuck, we take this one much slower. I alternate playing with her tits and rubbing her clit and soon have her moaning and thrashing about. She has a small orgasm before we change positions. \n\nTina is on top and riding me slowly again. She leans forward to kiss me and I take the opportunity to grab her ass. \"You like my ass?\" she asks.\n\n\"I do, it's nice and firm and feels good in my hands.\" I slide my finger along the crack and make contact with her ass. It's already wet so apply pressure and my finger slides into her. \n\n\"I like that,\" she purrs so I move my finger quicker till she is nice a loose. I push a second finger into her and she moans. \"I haven't had anyone play with my ass in years before you the other day.\" Her encouraging moans of pleasure give me the confidence that a third finger would make it even better. As my third finger presses in she squeals and her pussy spasm as she cums. I start to move my hand faster in and out of her ass and she moans in greater pleasure. \n\n\"Would you like my dick in your ass?\"\n\n\"I thought you'd never ask.\" She rolls off of me and onto her back. Tina pulls her knees to her chest to expose her slight gaping ass hole to me. \"Go slow, it's been a long time.\"\n\nI kneel between her legs and line the head of my cock up with her ass. I watch with interest as her ass widens around my cock, but she is extremely tight and I have to take my time. \"Push harder, but not too much.\" I push and I finally get through the tight ring. Tina moans and pushes on my hips to keep me from moving any further. She finally releases me and I start to slowly push deeper. Now that I am through the ring my descent seems to be much easier and Tina's moans are pure pleasure. My hips finally bump against her ass and she asks me to hold still. \"Just give me a moment to get used to you. You're bigger than any of the others.\" Her eyes are closed so I look at her while I wait for the ok. Her nipples are huge and the areola is a deep red. Her pussy is gaping and juice is running out of her like a faucet. The lips are extremely swollen and I see her clit poking from under its hood.\n\nAfter what seems an eternity she finally tells me to go ahead, but slowly at first. I pull out and watch my cock slowly slide out. Tina starts to rub her pussy with one hand and her nipples with the other. Her eyes are closed and her mouth is slightly open. She is smiling by the time just the tip of my dick is remaining inside of her. I reverse direction and plunge back into her. With each stroke it gets easier to move and soon I am pounding into her ass. \n\n\"Oh fuck, I've forgotten how good this feels.\" It doesn't take long before I feel a familiar tingle and I am glad to see that Tina is quickly getting close to her release. Her moans have turned into screams and she has three fingers buried in her pussy. \"That's it, fuck my ass. I'm going to cum. Oh baby, that's it, I'm cumming\" and her body lurches. The sudden tightness does its thing and I explode in her ass. Tina squeals as she feels my hot juices flood her bowels and her pussy gushes. My hips pound into her several more times before she pushes me away and rolls onto her side. \n\nHer body shivers every once in a while as her orgasm continues. I'm exhausted and curl up behind her, holding Tina's body against mine. She finally regains her composure and turns around to face me. \n\n\"That was wonderful, thank you.\" We kiss before I answer.\n\n\"You are very welcome. It was just as awesome for me.\"\n\nWe hold each other for a while before Tina decides to head home. I walk her back to her house and Brandy opens the door. She takes one look at her mom and smiles. I tell them good night before heading home.\n\nI clean myself up and then call Judy. I tell her all about how Tina came over and the incredible fuck in the kitchen. By the time I tell her about the orgasm we both had I can hear her moaning and her voice has gotten much huskier. I also tell her about what Tina told me about Brandy and Judy told me to go for it, but to keep in mind that she'd want a turn with her too. Then I tell her about the anal sex and I hear her moan as I tell her about cumming in Tina's ass. \n\n\"Damn John, now I'm even hornier than I was before. I did have a nice little orgasm, but I need more.\" \n\n\"Do you want me to come over and help you out?\"\n\n\"No, I'm already in bed and will probably be asleep by the time you get here. But I don't think I will be able to wait till next weekend to see you. Are you free tomorrow night?\"\n\nI smiled to myself. \"I can be.\"\n\n\"I'll be over right after work then. I have to stop by and take care of Maggie first but will be over right after that.\"\n\n\"Why don't you bring her?\"\n\n\"Because I can't stay overnight.\"\n\n\"I'll see you tomorrow night then. Sweet dreams.\"\n\n\"Sweet dreams John. I'll see you tomorrow.\"\n\nI decided to go to bed because I knew I'd need a lot of energy tomorrow."
    ],
    "authorname": "WhatIKnow",
    "tags": [
        "group"
    ],
    "category": "Anal",
    "url": "https://www.literotica.com/s/single-again-ch-07"
}