{
    "title": "The Test Ch. 03",
    "pages": [
        "If you haven't read the first two chapters, please do so now. You need to know what \"The Test\" is all about. \n\nI again would like to thank 'Gypsies' for editing this story and making it more enjoyable for all of us to read. Thank you, for all the comment. I really enjoy reading them.\n\nDG Hear. . . . . and now the conclusion of 'The Test'.\n\n*\n\nI'm Mark and going to get married to the love of my life Karen. As you know we promised to abstain from sex till our wedding night. I've had a lot of temptations but have been able to 'Just Say No', it hasn't been easy but I want to prove to Karen that I can do it. I'm also quite paranoid that someone is out to get me sexually, and stop Karen from marrying me. I'm just hoping it's not Karen, she's just not that type of person, I hope.\n\nI ran into Connie at the court house, I was there to testify at a trail. Thank God it wasn't a case that Connie was on. She is a terror in the courtroom, but a bigger terror in the bedroom. I've had some great sex with her in the last seven years. As I said earlier she would do it all. \n\nShe invited me to lunch. How could I say no to a former sexual partner and future sister-in-law?\n\nWe ate at a cozy upscale restaurant. She asked for a booth that was out of the heavy traffic area. She said she always gets what she wants. Well almost always, she wanted me again, just one last time. \n\nI asked her about Karen, would she fuck her sister's boyfriend and future husband?\n\nShe looked at me and said, \"Yes, I would. You were my boyfriend first and until you're married you are still fair game.\" I love my sister, but at the same time she has something I want, \"You.\" I like many others girls fell in love with you. We all knew it was just sex for you. For us it was a combination of sexual fantasy and love.\n\nI also feel scared for Karen. You say you love her and want to be only with her. That's not your style Mark. I don't think you will be faithful to Karen. You two will have an argument and you'll go out and fuck the first skirt you see. That will break my sister's heart. I would rather you just leave her now. It will hurt but she will mend. If you cheat on her after marriage she will never love again. She's not like me, a realist; I just take life for what it is. Karen is a romantic, she wants love, children, she wants family, the little cottage, and the faithful husband. She deserves that kind of man, I just don't believe it's you Mark. She believes most people are inherently good. We know better Mark. We see the scum everyday.\n\nI looked at Connie saying what was in my heart. I love Karen; I want the same things that you mentioned that she wants, loving wife, kids, close family, and even that little cottage. I want to do my best to give that to her. Connie, the sex with you was the best, but there was always something missing even as wonderful as it was. You felt it; it's called 'love.' Karen is the only person I've ever felt both sexual excitement and love. I just have to hope that my love for Karen stays. I am going to do by best to love, and honor her.\n\nWith that said I stood up and left Connie sitting there as I left the restaurant. I don't like being away from Karen; the temptation is just too great. When I'm with Karen, it's only her that I want.\n\nAfter talking to Connie I wanted to, no, make that needed to see Karen. I just stopped by her boutique, walked in went up to the counter and in front of her customer I took her in my arms and kissed her. Then looked at her smiling face and said, \"I love you Karen. I just needed to tell you.\"\n\n\"With tears in her eyes she said, \"I love you to Mark and I needed to hear it.\"\n\nHer customer, an older lady probably in her fifties looked at us and said, \"So you're Mark.\" This woman, who I didn't even know, told me, \"No more playing around with other women. You have the best and nicest woman on the planet in your arms. Love her, savor her, and treat her like a goddess because she is one.\"\n\nI looked at this woman who really seemed refined and said, \"Yes, Madame.\" \n\nKaren, looked at me and kissed me lightly again and said, \"Mark, meet my mother, as you know mom, this is Mark.\" \n\nI said how it was so nice to meet her and that I looked forward to dancing with her at the wedding.\n\nShe looked at me and said, \"Well I can see why my daughters and their friends have always talked about you. You are a 'Don Juan,' a 'Casanova' and not to hard on the eyes either. All I sincerely ask of you Mark is after you marry my daughter, be honest and faithful to her, and never go to bed angry at each other.\"\n\nI'll do my best Mrs. . . . I don't even know your name.\n\nEvelyn Cousin is my name; just call me Eve, in less then two weeks you can call me 'Mom.'\n\nWell nice to meet you Eve, or hopefully mom.\n\nShe said her goodbyes and left the store. I looked at Karen and said, \"I just had to see you, I'm sorry for bursting in like that.\"\n\nMark, you can stop in and see me any time. While you're here I have something to tell you. I have to go to a buyer's convention for a few days. I'll be back before the wedding. Then I'm taking a week off after the wedding. I hope I need it to recover, and then she smiled.\n\nSomething is bothering me a little. Your mom's last name is Cousin? Is she related to the State Senator, George Cousin?\n\nI told you I would never lie to you, yes Mark, she is related to my father, she married him, as she grinned.\n\nHoly Shit, my future father-in-law is the State Senator. That kind of makes him my boss. No wonder you could find out everything. I then kissed her and said I would see her when she returned from her convention. \n\nI went out with my friends since Karen would be away for a few days. None of us drove; we used a taxi because we expected to get plastered. We went from nightclub to nightclub, looking at a lot of tits and ass. The guys were trying to buy me a lap dance but I kept saying no. \n\nOne girl who was almost nude, all she had on was a pair or transparent panties came over and just sat on my lap. I just held her there. I could feel my hard-on pressing through my pants and against her pussy. If I would have taken my dick out, I would have been fucking her. I had to stop her before I came in my pants. How would I explain the wet spot to the guys? I did reach between her legs and felt two fingers slid into her pussy. I had to pull them out fast before I went any further.\n\nI got up, excused myself and went to the restroom. I washed my face to cool down then returned to the lounge. I was feeling intoxicated, different gals came up to me and gave me hugs, I did play some grab ass, after all I am only human. I had offers for sex from six different women that evening. Believe me, it's was a lot harder to turn down then you can imagine. \n\nThe one girl who was almost naked did come back and sat on my lap again. With her pussy pushing down onto my cock that was confined in my Dockers, I did have an orgasm. God it felt good to release a load. I didn't consider this cheating. My dick never came out to play. By the way, 'No cum mess,' I put on a condom when I was in the restroom earlier. Not to fuck anyone but to catch an ejaculation if I should have one. My friends never saw a mess on the front of my pants, but I know the dancer felt it. When your cock goes from hard to soft, they know something happened.\n\nWe left the lounge and I was pretty much plastered. My buddies dropped me off at my house and I headed for bed 'Alone.'\n\nThe next couple of days went by without too many problems. I was just waiting for Karen to get back. I missed her, even if it was only for a few days. \n\nBoy, sometimes love sucks. Before when I wasn't in love and wanted a piece of ass, I went out and got one, sometimes two. Now when I'm hot and horny I have to find Karen, and when she isn't there, I have to depend on 'mother thumb and her four daughters'. For the last month I about wore out my hand.\n\nI was out in the cruiser patrolling the street when I saw a car go by. I could have sworn the woman in the passenger seat was Karen. I didn't even know she was back yet. Who was the guy she was with? I had to find out, so I turned the cruiser around and followed at a safe distance.\n\nThey pulled into a valet parking lot, got out and went into an upscale restaurant. I wasn't sure what to do. It would look like I didn't trust her if I went in. Maybe there isn't anything going on, but three days before our wedding and here I'm a nervous wreck. Right now I'm not sure of anything. I checked the car plates and found that it's just a rental.\n\nI wasn't sure what to do so; I drove around and waited for them to come out of the restaurant. They came out smiling and were holding hands, not a good sign for me. Then I decided to follow them to see where they ended up. They were headed towards Karen's apartment, Lord tell me I dreaming, this can't be happening. Karen just isn't like that, no it must be something else. My mind was swimming. I watched them enter the apartment.\n\nI waited about five minutes, I couldn't wait any longer, my future and my life were at stake. Because of my love for this woman, I've been totally faithful. I had to know, I had to know now. I pulled up to the apartment and went to the door. I had my uniform on so I had to be careful how I acted. I knocked on the door. \n\nA few seconds later Karen opened the door and for a brief second looked at me. Then with a big smile on her face, she said, \"Mark, you're here! Oh my how I missed you.\" Then she gave me a long passionate kiss. I called your house, I knew you would be working but left a message on your answering machine. I'm glad you got it. Come on in, there's someone I'd like you to meet.\n\n\"Mark meet my big brother Dave. Dave, meet the only man I love, outside of family of course\" as she laughed. Then she mentioned that Dave came up from Tennessee for the wedding.\n\nDave and I said our hellos and chit chatted for a few minutes. I then reminded Karen that I was on duty and had to leave. I shook David's hand and told him I would see him at the wedding. I then put my arms around a smiling Karen and kissed her saying I would talk to her later.\n\nI didn't get a chance to see her on Thursday, but did talk to her on the phone. I mentioned that my buddies were going to take me out for kind of a bachelor party on Friday. And we would probably be doing some bar hopping. \n\nShe said she had a million things to do before the wedding and for me to have a good time with my friends. She had some things to talk over with her sister and bridesmaids. She would probably stop by Beth's on Friday anyway. Then she told me we only had two more days to wait. \n\nMy buddies and I went bar hopping. They told me this was my last chance for some strange and I should take it. We were all having a good time, telling jokes, telling stories about our sexual encounters. Even felt up a couple bar broads, but all in fun.\n\nOne of my buddies paid a girl to sit on my lap nude. Just for a joke, I didn't know he did it. Then all of a sudden this girl just jumps on my lap, puts her arms around me and kissed me. I started laughing and told the gal thank you, that was nice but I was getting married tomorrow. The girl smiled at me, said congratulations, gave me a light kiss and got off my lap. That was it, we all laughed but when I looked up I saw Karen with tears in her eyes walking away. I got up and tried to stop her but she was gone, I couldn't find her.\n\nI started driving all over looking for her. I had to tell her the truth, I loved her, and I was faithful to her no matter how it looked. I decided to drive over to Beth's house. I remember Karen said something about going there on Friday. It was about nine o'clock at night when I arrived at the Cousin residence. I went up to the house and knocked on the door. After about a minute or two the door opened and Beth appeared. She was dressed in a near transparent negligee, with small panties to match. Her body looked beautiful. She asked me in and said, \"What's wrong Mark?\"\n\nI told her I have been looking everywhere for Karen and can't find her. I thought she might be here. She told me she was going to stop by and see you tonight.\n\nWell, Mark she was here earlier but said she had something important to do and left a little while ago. I have no idea where she went.\n\nWhat did the two of you talk about Beth?\n\n\"You Mark, she always talks about you.\" Beth replied. \"You fucked up didn't you Mark\"\n\n\"You couldn't hold out one more day and made it with another woman.\"\n\nNo, I didn't, I was out with my friends. One of my buddies paid a girl to sit on my lap nude. Just for a joke, I didn't know it. The girl just sat on my lap, put her arms around me and kissed me. I told the gal thank you, but no thank you, I'm getting married tomorrow. The girl said congratulations, gave me a light kiss and got off my lap. That was it, when I looked up I saw Karen with tears in her eyes walking away. I got up and tried to stop her but she was gone. \n\nI've been looking everywhere for her, I need to tell her the truth, that I have been faithful and love her. Shit, maybe everyone is right and I'm not the marrying kind. The last thing I want to do is make Karen unhappy.\n\nWell Mark, if I know Karen, you won't get a chance to explain. You might as well come upstairs with me, and I'll help you drown your sorrows. I know you've wanted me, as much as I want you. I don't love you Mark, it's just that I've heard so much about your escapades that I feel left out. I want to feel it for myself. At best you will have that one last fling, if Karen does take you back. If she believes you've cheated on her, it's all over. Either way you get to fuck me.\n\nBeth seemed to be making sense in my inebriated state. If I have lost Karen, I might as well get a sympathy fuck from a woman that looks as good as Beth. If Karen and I do get married then I'll never have another chance at Beth. Damn, I wish I had a clear head. . . Then I looked at Beth taking off the top of the negligee. Only the near transparent panties remained. Beth started up the stairs and said, \"Come on Mark, we both need it.\" As she disappear from site. \n\nI took two steps up the stairway and stopped dead in my tracks. What am I doing? I thought. This is exactly the way 'The Test' went. I turned around and ran out to my car. I didn't open the glove compartment because I didn't have condoms in there. I sat in the car waiting for everyone to come out to the porch. I waited fifteen minutes and no one showed.\n\nI just started the car and headed for home. I had no idea what was going to happen tomorrow. I might have lost the only woman I have ever loved, all over a mistake. I hurt inside, I really hurt.\n\nWhen I got home there was Karen sitting on my front porch waiting for me. I got out of the car and started crying. I was a big city cop with tears running down his face. I ran up to her as she ran toward me, just like in the movies. I grabbed her and said, \"Honey, I didn't cheat, I didn't cheat on you, honest.\"\n\nShe put her finger up to my mouth to hush me and said, \"I know, I walked out to quickly on you, so after a few minutes I went back in to talk to you and you were gone.\" You're friends told me about the joke they played on you and the dancer came over and congratulated me on such a wonderful man. She said any other man would have fucked her right there on the spot.\n\nI didn't know where you would go but figured you would end up here. So I came straight here and decided to wait for you, no mater how long it took.\n\nKaren, I know we promised to abstain till our wedding day which is tomorrow. But I need to make love to you. Please stay here tonight and make love to me.\n\nMy God Mark, I want you so much too, but we have to go one more day. We have to prove we can do what we say. Would it be alright if I stayed here tonight and we could cuddle and kiss and hugg, and then fall to sleep in each other arms? Would that help?\n\nKaren, I just want you near me, just to hold you tonight and lie beside you would be great no more tests. \n\nWhat tests Mark? What kind of test? I haven't put you through any sort of test, what has been happening and why didn't you tell me?\n\nEver since we decided to abstain, I had a number of women flirting with me. Some came straight out and asked me for a goodbye fuck, some just wanted something to remember me by. I was becoming paranoid about that stupid joke, 'The Test.' I wish I would have never read it now.\n\nMark, I should tell you one thing I overheard. My sisters vowed to each other that you better truly love me or they would make sure we didn't marry. They might have run a test of their own. I'm sorry, I would have stopped it if I had known what they had planned. We'll talk to them tomorrow and find out the facts.\n\nKaren and I then went into the house, stripped naked, got in bed and cuddled. I did get a hard-on but she wouldn't let me use it. She just said, \"Tomorrow lover.\" and we went to sleep.\n\nThe wedding:\n\nWe got up first thing, kissed and hugged and got dressed. Karen said she had to leave to get things ready for the wedding. I had my stuff to get ready also.\n\nIt was three o'clock in the afternoon, time for the wedding to start. I looked out at a church filled to capacity. My best man and I were standing at the front of the church, the music started and the bridesmaids and ushers were coming in. First in was Beth her maid of honor, smiling brightly, followed by Connie who was smiling but was kind of crying at the same time. Then in sequence were five of my past lovers. I acted surprised when seeing each one come in, no one knew about my tape. So I wasn't supposed to know these girls were in the wedding party.\n\nThen she appeared in the doorway. The most beautiful women I have ever seen. She was dressed in a light blue wedding dress. Low cut to show her breasts. The length was right around her knees so you could see her beautiful calves. She looked gorgeous, like an angel dressed in blue. She was escorted by the State Senator, her father, who couldn't be more proud.\n\nWe said our vows, I said, \"I do.\" She said, \"I do.\" \n\nThen the preacher asked the question, \"Does anyone believe this couple should not wed, if so speak now or forever hold your peace.\"\n\nKaren and I were holding hands as we glanced at each of my old playmates, then at Beth, then at Connie. \"No one spoke.\"\n\nIt was so quiet you could hear a pin drop. It seemed like ten minutes but was only a few seconds before the preacher said, \"Now, I pronounce you, 'Husband and Wife' you may kiss the bride.\"\n\nWe turned to each other and gave the gentlest of kisses but held on for a good fifteen seconds while we heard the whole church break out in cheers.\n\nAt the reception we had a great time, I danced and kissed all my old girlfriends, I danced with Beth and she smiled and said, \"I'm glad you passed the test, for Karen's sake, but if you would have come upstairs I would have never told.\"\n\nWhen I danced with Connie, she said everything she had done she did to protect Karen. She would have liked to have that last lay, as she smiled.\n\nI dance with my new mother-in-law, a no nonsense but sweet lady.\n\nAs Karen and I were leaving the party we stopped and said good bye to her mother and father.\n\nHer mother looked at me and said, \"Remember what I told you in the store that day and never forget it.\"\n\nI looked at her and said, \"I'll remember, MOM.\"\n\nThen the Senator, Karen's father looked at me and said, \"Congratulation son, you passed 'The Test', welcome to the family.\"\n\nI'll never know if he was behind all this to protect his daughter or was it a coincidence, maybe? \n\nKaren and I left for our honeymoon. We were staying at a hotel for the night and had places to go starting tomorrow.\n\nAs soon as we got to our room I asked Karen if I could take off her clothes, which I did very slowly. Then she helped me with mine. She disappeared for a few minutes to go into the bathroom. When she came out she had on that little pair of red baby doll pajamas I remembered on the tape. But close up it was near transparent and very sexy. She wouldn't have them on for long. She then took out one of the lotions and started rubbing it on me, man it felt great. When she got down to my cock she inserted the head gently into her mouth. Damn that felt good.",
        "After taking my cock out of her mouth, I stood up and removed her pj's. I got between her legs and started eating her pussy. I don't know what she had done but it tasted great. I could hardly get enough.\n\nMy cock was rock hard and she asked me to lie on my back, for her first orgasm she wanted to ride me. As I lay there she climbed on and slowly inserted my cock into her pussy. As we both got close to coming, she pulled out the little silver vibrator and reached back and pushed it against my balls. The feeling was wild and I shot a load that probably filled her to capacity, as she let out a scream of pleasure.\n\nWell, that was how our marriage began. Did it last you ask? We have now been married thirty years and couldn't be happier.\n\nI always remember what her mom said, \"Treat her as a Goddess because she is one and never go to bed angry at each other.\" I live by these two rules and life couldn't be better.\n\nPS. I have never told anyone about the tape, but I still have it.\n\n*\n\nThank you for reading the conclusion of 'The Test'. Hope you enjoyed it. All comments are welcome.\n\nDG Hear"
    ],
    "authorname": "DG Hear",
    "tags": [
        "cheating",
        "humor",
        "romance",
        "love"
    ],
    "category": "Humor & Satire",
    "url": "https://www.literotica.com/s/the-test-ch-03"
}