{
    "title": "What I Learned at Literotica",
    "pages": [
        "I've been reading at this site for a while now, and I can't think of a better place to learn some of life's most important lessons. I consider this a self-help site.\n\nI've learned so much I feel honor-bound to repay the good deeds and share some of the most important lessons for those readers and writers who have had difficulty deciphering the subtle nuances of this adult education. That's just the kind of guy and girl I am (see item 20 below).\n\n1. Never, ever, change plans to go to a party with your wife.\n\nThis always irrevocably leads her to commit adultery. It's only fair. You made her angry by the stunningly selfish and petty act of refusing to lose your job over the once-in-a-lifetime opportunity to go to a party.\n\nAll the single men there, and many of the married ones, will recognize the inevitability that your wife will cheat and they will compete to be the one, or one of the ones, upon whom she must bestow her charms.\n\nFortunately, you can avoid going to work to bring up the server that is costing your company millions each hour you delay. Just tell your boss you promised your wife you would go to a party.\n\nHe will intuitively understand that, since he isn't invited to the party and has no chance at your wife, he must allow you to go there to save your marriage.\n\n 2. If you are having trouble developing or maintaining an erection, you don't need Viagra. \n\nIndeed, Viagra is a poor substitute. Here is what you have to do. Whatever it takes, convince your wife that you are going on a trip and then come home early.\n\nOften you need do nothing else, but sometimes you will have to make some effort to be sure that she cheats on you while you are away.\n\nWhen you return early and catch her with her lover you will be angry. You will be hurt. You will lose all your trust in her.\n\nYou will be humiliated and have the biggest and most persistent erection of your life.\n\nOf course, there are ways to enhance the experience further, as I will mention below. But, in general, there is nothing like finding out that the woman you trust to raise your children, the woman you trust with all your heart, the woman you trust with the responsibility of sharing all your feelings, the woman before whom you can be completely vulnerable, is cheating on you with no more thought to the consequences than she would have tossing a used tissue in the waste basket, to give you the best erection of your life.\n\nIn return, it is your responsibility to cash in on this opportunity by having the best sex of your life. With your own hand. Preferably against the wall or on your carpet.\n\n 3. If you have any influence whatsoever in your wife's choice of a man to cuckold you, get her to pick a black man. \n\nOf course we always knew they were bigger. But that's not why women go crazy over them. We have been taken in by the myths that abound in the popular culture.\n\nThe media report that black men have a higher incidence of participation in drug dealing. It's not true.\n\nThey report that black youth spend much of their time in gangs dealing drugs and fighting with each other. It's a myth.\n\nThey report that, even in prison, black men continue this behavior of participating in gangs and dealing drugs. All lies.\n\nThey are actually involved in top-secret education classes after school, not involved in gang activity.\n\nThey learn, in detail, the anatomy, physiology and psychology of females. They learn how to instantly find the G-spot. They learn every possible erogenous zone and the best order in which to try them. They learn all the latest techniques for delaying their own orgasms in order to best please women.\n\nThey take courses in nutrition that allow them to discharge a pint instead of a teaspoon or two when they ejaculate. Why do you think they are all well over six feet tall and have muscles that white men can only achieve with steroids? It's the nutrition.\n\nAnd they train endlessly to be able to cum six or seven times a night. You have to admire that kind of dedication.\n\nAnd the biggest hoax of all is that size matters. They foster that myth to make white men feel inferior so we will never suspect their secret with women -- education.\n\nThat is why white women won't go back. What woman could give up a man with a graduate education in pleasing her?\n\nOf course, your wife will become more devoted to him than you. She will do anything for him. She will gang bang his friends, be available for his women and, generally do anything he demands of her. She'll even do his dishes.\n\nI know you may be feeling some concern about this reality. You need not.\n\nWhatever she does for him and with him, no matter how many days or weeks she stays away without telling you where she is, there is one thing of which you can be absolutely certain: she loves only you. You are the only love of her life. She just needs his cock so desperately she will do anything to get it and keep it.\n\nBut rest assured, she loves you.\n\nShe loves you enough to inherit from you and not from him.\n\nShe loves you enough to let you provide her support, not him.\n\nShe loves you enough to have your children. Well, they may be your children.\n\nShe loves you enough that ... \"Sorry honey, my master requires my services. I don't know when I'll be back. Don't forget to get the kids to school in the morning.\"\n\nFinally, you don't think black men really talk like that do you?\n\nThey have to be trained.\n\nThey grow up learning, \"I'd love it if you would pleasure me orally.\" But the training manual is very specific. The translation that women most respond to is, \"Suck my big, black cock you stupid bitch.\"\n\nActually the manual says it is proper to substitute \"ho\" for \"bitch.\" You think I'm kidding? Just read the interracial stories. They leave no room for doubt.\n\n 4. Cheating provides immunity from sexually transmitted diseases.\n\nYour wife may be in some danger if she limits herself. But if she is willing to fuck dozens of men unprotected, who fuck dozens of women who fuck dozens of men, complete immunity is conferred. If only we could find some equivalent of cheating in other areas of our lives we could conquer heart disease and cancer.\n\n 5.Dancing causes hard-ons.\n\nIf I had a nickel for every time I had a hard on while dancing, I'd be completely broke. I just haven't figured out the secret, I guess.\n\nMaybe I need to take some of those education courses.\n\nBut your wife will rub herself against the erection of every man she dances with. It's a law of nature.\n\n 6.Guys who write stories can't dance.\n\nThat's why their wives have to rub up against somebody else's erection when they are dancing.\n\nIf you are concerned about her doing that, don't write stories!\n\nIf you refrain from writing long enough, you will become one of those really good dancers who rub their erections against somebody else's wife.\n\n 7.Extramarital sex makes married women stupid.\n\nThey may remain clever, but it renders them stupid.\n\nWhatever reason she married you for is quickly forgotten when she gives you the blessing of cheating on you.\n\nI don't know who it was that said, \"Man does not live by bread, I mean sex, alone,\" but clearly he was a fool.\n\nFood, clothing, love, respect, family, hobbies, intellectual pursuits all are meaningless compared to being fucked constantly.\n\nI guess it's what makes men genetically superior.\n\nGetting some strange lowers a woman's IQ several standard deviations while the effect on men lasts only until the erection fades.\n\nIf a man remains stupid for more than four hours he should call his doctor.\n\n 8.Most men who encourage their wives to fuck around have the same penis volume as the men their wives tryst with.\n\nSome higher mathematical skills may be required to understand the truth of this axiom.\n\nIf the husband's is long, the other guy is thicker. If hubby is thicker, the other guy is longer. It's Newton's Third Law of Conservation of Volume.\n\n 9.The other man almost always has more stamina.\n\nEven if he is somebody else's husband, he lasts longer with your wife.\n\nOf course, if his wife is screwing around, it is only with men who last longer than he does.\n\n 10. The average penis length of men who want their wives to screw around is 4\" \n\nAs Yogi says, \"You could look it up.\" But you better look on Literotica.\n\nExcept for the rare outlier, they top out at 5\". The men the wives hook up with are never less than 6\" and, if they are that \"small\", they are at least as thick as the barrel of a baseball bat (2 ¾ inches diameter).\n\nIs that why they call it wood?\n\nThe head of the other guy's penis is generally large, usually at least the size of a softball.\n\n 11. Straying wives are physically endowed by their creator with unhinging jaws, like sharks, and, in general, their orifices can accommodate any size penis, dildo, hand, arm or small-sized sedan.\n\nIt is always difficult at first, especially orally. She cannot fit even the head in her mouth at the beginning. But if she can just recognize these special adaptations, it won't be long before the head is being scorched by her stomach acid.\n\n 12. Size matters, but not the way you think. The woman's size matters.\n\nIf she is not to be caught by her husband, even if you drive a VW Beetle into her, she will be tight by the time her husband explores.\n\nIf she is meant to be caught, even an extra millimeter of girth will render her so loose that she will be unable to maintain a firm grip on a volleyball.\n\n 13. Sex is the only thing that matters in a marriage to a woman.\n\nDon't be stupid and work long hours to support her. She won't appreciate it.\n\nDon't buy her a nice car. It's irrelevant.\n\nHot clothing? Completely unnecessary except to show her off to the other guys you want to screw her. She doesn't need clothing. She would prefer to stay home naked and in bed with you, or preferably others, spending all her waking hours having sex.\n\nShe doesn't need to eat. Don't be stupid, eating doesn't give her orgasms.\n\nShe doesn't need to drink. She will get all the fluids she needs from your or somebody else's penis.\n\nShe doesn't want friends. She doesn't need friends except as the possible source of introducing her to new men who can help keep her from frittering away her life. In other words, doing anything that is not sex.\n\nIf you want your wife to respect you, don't work. Don't pay the bills. Don't have friends. Don't have interests. Don't do anything except fuck her constantly. Well, I exaggerate. She's okay with you eating her, fingering her and fisting her if, unlike her lovers, you can't keep it up 24 hours a day, day after day.\n\n14. A wife whose husband wants her to have sex with another man undergoes a growth spurt in which the resulting cup dimension is never less than DD.\n\nWhere men may try to increase muscle size by using human growth hormone (HGH), these wives undergo spontaneous growth as a result of husband growth hormone (HGH).\n\nWhile DD is the minimum dimension, HGH is so powerful that EE, XX and even larger letters that don't really exist are best used to describe their size.\n\nFortunately for these women, while HGH greatly increases breast size, they never suffer back problems and it doesn't cause them to tilt forward regardless of how big they become.\n\nFollowing the conventional wisdom on this point, the larger the breasts, the more attractive the woman. QED.\n\n15.Wives are usually not satisfied by their husbands, except in retrospect.\n\nIt is not just duration, as mentioned above, but there are a variety of acts which do not satisfy them when performed with the husband.\n\nAll hope is not lost, however. A hormone released by curiosity about other men (C.U.M.) makes all these acts extremely pleasurable when performed with someone to whom they are not married.\n\nIn particular, the C.U.M. hormone produces an extreme affinity for anal and oral sex with other men. And the effect is intensified in the case of oral when the wife swallows, which she never does for her husband.\n\nA final effect of C.U.M. is that the orgasms with other men are the best she has ever had -- they far surpass any she has ever had with her husband (it's the law in 49 states).\n\n 16. The Deity has undergone a name change, presumably to make him more hip for today's youth.\n\nHenceforth, He will be known as Gawd!\n\nI've never personally heard it pronounced that way but my reading tells me that hardly anyone uses the old name anymore.\n\nThat spelling is not mandatory. It is perfectly acceptable to use multiple \"a\"s and \"w\"s as in Gaaaaaawwwd where each additional letter represents a statistical measure of the level of enjoyment.\n\nThe use of the new appellation is required in sex acts involving infidelity since they are the most pleasurable and the most frequent.\n\n17. Another name change has taken place which I apparently missed completely.\n\nSemen, spunk, jizz, cum, splooge and many other words have become obsolete when used in connection with any man the wife enjoys.\n\nThe new, mandatory word is seed.\n\nDespite the fact that I have never heard the word used out loud in any situation, it is apparently de rigueur. I suppose it might be a biblical reference given the well-known, high percentage of deeply religious readers of erotica.\n\nHenceforth, the proper choice for style is, \"I'm gonna shoot my seed all over your face, bitch.\"\n\nIf you don't believe me you can look it up in Spunk and White, The Elements of Style.\n\n18. Any name used by a commenter other than Anonymous is the commenter's legal name and can be used to identify him as accurately as fingerprints.\n\nThis includes names such as A. Nonymouse. On the surface, that might seem contrived. Careful analysis will show it so specifically identifies the commenter that his comments are rendered more valid if you agree with them.\n\nThe corollary is that anonymous comments are absurd if you don't agree with them.\n\n19. Most comments have nothing to do with the story.\n\nThey provide a secret code which details the commenter's beliefs, behavior and life history as accurately as DNA describes his physical and chemical characteristics. The interpretation is customarily provided by someone who disagrees violently with the opinion expressed.\n\nIf the commenter thinks the character is a wimp, and castigates the story, the writer and disparages his lineage, a reader who enjoyed the story will use his sleuthing skills to describe the disgusted commenter in detail.\n\nThe offended reader will be able to discern the size of the commenter's genitalia, his lack of success with women, his inability to date, his secret desires, his job status, income and social security number.\n\n20. All stories are autobiographical.\n\nThe author may be a woman in one story and a man in another. They are both true.\n\nI don't really understand how this works, but there are invariably commenters who believe both are true stories.\n\nThe author may lose a leg in one story and have it back in a later one. Both stories are true.\n\nAuthors are a hardy and remarkable lot. For most people, regrowing limbs would be a nigh-impossible task. Authors are made of sterner stuff.\n\nDISCLAIMER: All opinions are those of the author or somebody else. This serious disquisition is intended to be read solemn-faced and without mirth.\n\nDISCLAIMER of DISCLAIMER: You are the reader. You would be entirely within your rights to chuckle now and again if that is your wont."
    ],
    "authorname": "rpsuch",
    "tags": [],
    "category": "Humor & Satire",
    "url": "https://www.literotica.com/s/what-i-learned-at-literotica"
}