{
    "title": "14 Hours Pt. 03",
    "pages": [
        "Bars are more active at night, so that's when I decide to go. I can hear the music from the 'Sink' before I even arrive. It's a standalone building across the street from a gas station. I ride my bike over, parking it away. Removes the suspense of disbelief if I ride up on a bike to a bar with a fake ID.\n\nThe bouncer recognized me and let me in without carding, stamping my hand as I enter. There are two bars, one in the back and to the right. In the center are standing tables, toward the front is a cleared floor in front of a stage. Currently a local band is performing, and they're bad. I've heard worse but I'm not sober enough to like this. \n\nNow I have to blend in, I go to the bar and get a beer, the bartender eyeing me as she takes my money. She's a tall redhead. Not my redhead though.\n\n\"What?\" I asked, her eyes asking questions her mouth can't form quite yet.\n\n\"Nothing, just nice to see you again,\" She says with a grin. \n\n\"This might sound weird, but do you know me?\" I ask, and she laughs.\n\n\"I had a feeling you were fucked up that night. Lexi,\" She says, offering a handshake. I shake. \"You left here with my sister a few weeks ago.\"\n\n\"Do you happen to remember where we went?\" I asked.\n\n\"Probably our parents house, she visits every weekend to go to this lame poetry read in town,\" Lexi says, leaning against the bar to look at me while filling a cup with water. \"I heard you were quite the poet yourself. Like a real hipster douchebag, you do it just to get pussy, leaving my sister alone when you meet a cute blonde.\" \n\n\"What?\" And I get a cup of water splashed in my face.\n\n\"Get the fuck out of here, and stay the fuck away from Lili.\"\n\nI wipe the water off my face, chug my beer, give her a fake polite smile before stepping away from the bar. As I exit the door I bump into a girl and apologize as I keep walking. A moment later that same girl grabs my shoulder just outside of the door.\n\n\"You going to explain yourself?\" She asks, I turn, and it's Lili. The image of her licking cum off her face instantly flashes across my mind. \n\n\"Lili?\" I ask just before I'm slapped across the face.\n\n\"You just up and leave me for that highschool bitch!\" Lili shouts and tries to slap me again but I catch her hand. \"Let me go!\"\n\n\"Stop hitting me.\" Lili tugs her arm away and glares at me, but doesn't swing again. Yet at least.\n\nThe difference between a picture, and in person, is a notable one. Plus seeing her in clothes is novel to me. Lili is almost exactly my height, long and deep red hair that cascades down her lower shoulder blades. She didn't have freckles, so she's not a full ginger, just pale shiny skin. She has a tight pair of capri pants, with a low cut shirt, her bra straps visible, but I wonder why she has a bra, her tits are tiny. The image of her spread out nude flashes.\n\n\"You're the worst kind of guy, you know that. You fuck a girl, then ten minutes later leave her for a younger bitch. Aren't you a little young to have a midlife crisis?\" Lili asks, her glare intensifies, and I hold back a laugh. She's trying to be threatening, but all I see is a pouty face. \n\n\"Did I really appear to be in my best mind that night?\" I asked, and she legitimately didn't know the answer. \"I was on adderall that messed me up. The alcohol didn't help.\"\n\n\"That's not an excuse, and you didn't even drink. You told me you went to the bar to research the Great Gatsby. You needed to see flappers, and bootleggers to really get into the mindset. When no flappers were present, you did the flapping.\"\n\n\"I don't remember doing that, but at this point I kind of have to believe everything I hear about myself,\" I say, she tries her hardest to not giggle, but one slips through her pout. \n\n\"It caught my attention,\" Lili says, her face relaxing. She seems calm now.\n\n\"I remember almost nothing from that night, and I'm truly sorry for anything I did.\" \n\n\"Including leaving me to go fuck a high schooler. Aren't you a little old to be fucking high schoolers?\" Lili asks, and I laugh. \"You think that's funny?\"\n\nI pull out my school ID and show her it. Her eyes fix to the number and dates and I see everything in her mind connect the dots. \n\n\"I'm eighteen,\" I say to her, and she takes the ID from my hand. \"You're the one fucking high schoolers.\"\n\n\"I fucked a toddler,\" Lili says and starts walking away, dropping my ID on the ground. I pick it up and walk after her, as she's getting her keys from her pocket to enter her car. \n\n\"Toddler, really? You act like I'm not an adult.\"\n\n\"Barely.\"\n\n\"You're just pissed that someone got under your skin, now you're double pissed it was an eighteen year old.\"\n\n\"I don't really know how I feel about this?\" \n\n\"How many guys walk away from you?\" I asked, Lili stopping at her car, fingers curled on the handle. \"Not many I take it. You've never just been casually tossed aside.\"\n\n\"She's not even that cute,\" Lili said, leaning against her door and looking at me.\n\n\"You know that isn't true,\" I say, her pursing her lips.\n\n\"She's a little cute,\" Lili relents.\n\n\"Do you know anything else I did that night?\" I ask, her debating before shrugging.\n\n\"You left some stuff at my house, want to pick it up?\" \n\n--\n\nLili gives me a ride to her house, promising to drop me back off to get my bike. The bike made her feel worse. I enter her parents house and then her room, which had much more personality than Kori's. She has band posters and stuffed animals, colorful drawings and bedsheets, and a disorganized desk with her computer covered in sticky notes to remind her of things. Her dresser had three drawers filled with poorly folded clothes that were blocking it from being completely sealed. \n\nLili reached onto the top of it, handing me a copy of the Great Gatsby. My copy. \"I let you take mine from school, had all of my notes in it.\" Adderall me is officially a complete shithead. I banged her, left her to bang another chick, then used her book to bang a third one. All of whom I assumed I lost my virginity to. \n\n\"Thanks,\" I say as she closes her door. Okay, I'm stupid for thinking this is what she said it was. You have a girlfriend, you have a girlfriend...and her shirt hits the floor. \"I have a girlfriend, stop.\" I try to step around her, but she blocks me. \n\n\"No one walks away from me. I get what I want, whenever I want it,\" Lili says and places her hand on my chest and pushes. I step back until I land in her computer chair.\n\n\"I'm a toddler, remember?\"\n\n\"You're a full grown man, I can stop being picky with age,\" Lili says and unzips her pants and starts to shimmy out of them. \n\n\"I'm not doing this,\" I say and try to stand but she pushes me back down.\n\n\"You don't have to do anything,\" she says, kicking her pants across the room. \"I'll do it all.\"\n\nLili reaches for my pants and starts to undo them before I grab her hands and stand up. She struggles a little, but I push and her back hits the wall, me pinning her arms against above her head. This is not helping. \n\n\"Stop,\" I say again, her only smiling and kissing me.\n\n\"Make me.\" I pull away and toss her to ther bed, before I quickly exit her room and her house. When I step out her front door I see her at her window, leaning out bare chested, her tits, or lack thereof, out in full display. \n\n\"I won't tell her if that's what you're worried about,\" Lili said from her window.\n\n\"I'm not that guy.\"\n\n\"So says the guy who nailed another girl a half hour after he wiped his dick off on my tits. You are that guy. Every guy is that guy,\" Lili says as she rubs her breasts. \"So come back up.\"\n\nI don't even acknowledge her, though I do enjoy her show before I turn around and walk away."
    ],
    "authorname": "CaffeineFetish",
    "tags": [
        "humor",
        "satire",
        "redhead",
        "seduction",
        "teen"
    ],
    "category": "Humor & Satire",
    "url": "https://www.literotica.com/s/14-hours-pt-03"
}