{
    "title": "There and Back Again Ch. 011",
    "pages": [
        "Chapter Eleven: Separate Ways \n\nI took a long, tepid drink from a water skin, mouth puckering from the slightly unpleasant iodine aftertaste, and then watched them all try to talk all at once. It would have been comical if it wasn't so serious. Leliana, Sten, and Morrigan wandered off, probably to let the others decide, since none of them had a vested interest in the order of stops. \n\nFinally the discussion settled into a normal back and forth between Aedan, Alistair, Theron, and Tomas. Alistair, unsurprisingly, wanted to go to Redcliffe first to rescue the town. Theron wanted to march on Denerim, to take Loghain head-on. Tomas wanted us to find somewhere safe for Theron to hide prior to any other consideration, which Theron strenuously objected to. Aedan tried to listen to each, and finally cleared his throat. To my continued surprise, everyone stopped and listened, including both Tomas and Theron. \n\n\"So. Let's assume that Loghain learns that Theron didn't die at Ostagar. Do we feel convinced that we can deal with whatever he throws at us to keep the rest of Ferelden from finding out?\" He looked around at the group, and not even Theron was able to nod. \"Alright. Given that, and that we can't risk Theron dying anonymously in the Deep Roads or the Brecilian Forest, we need to find him somewhere to hide. I know hiding feels cowardly, but you have to admit that the rest of us cannot do what needs to be done if we are more worried about you than about doing our jobs. Agreed?\" Theron's face coloured, and it was obvious he was remembering my heated words from the night before. Finally he nodded. \n\n\"I think Redcliffe is possibly the best place to hide him. He can blend in as a Knight, and stay out of sight in the Castle. I think we can all agree that Eamon would protect him with his last breath. It won't be easy, but even if Eamon is still ill, he can stay there under Teagan's protection. I think the best thing for us to do is get Redcliffe safely. Can anyone come up with anything better?\" \n\nTomas spoke up. \"I only have one thing to add to that. There are very few events that Sierra has related to us that we can hope to prevent. One of those is the capture of Riordan. The other is the slavery of elves in the Alienage. In addition to which, we require some information from Denerim in order to save Eamon. I believe that I am actually a liability to you, given how well-known I am around Ferelden. You have a much better chance of successfully hiding Theron if I am not with you. And I have enough stealth to sneak my way into Denerim, intercept Riordan, do whatever I can to safeguard the elves, and get the information you need to find Haven without being seen. I will send it to Redcliffe, and then perhaps try to rescue those I can from Howe's dungeons. If I am caught, you are still capable of safeguarding Theron and combating the Blight. Otherwise, I will return to you once I am done.\" \n\nAlistair looked upset at the prospect of losing his mentor and father-figure again, but no one could come up with a reasonable argument against his proposal. \n\n\"Then I leave for Denerim at daybreak.\" \n\nI spoke up. \"Then I will tell you what you will need to know in Denerim. On three conditions.\" Everyone stopped and stared at me. Shocked that I don't go along with Duncan about everything, no matter what? \n\n\"Name them, my lady.\" His resigned look said he knew what I would ask. I steeled myself against the guilt I knew I would feel later and pushed on. \n\n\"First is that you try to find a way to send word to the Grey Wardens in Orlais. Tell them to come. Sneak across the border in ones and twos, because Loghain will have closed the border. Tell them to send as many non-Orlesians - or at least, ones who can hide their accents - as they can find, and not to send any other reinforcements. If Loghain hears of Chevaliers or other soldiers trying to cross, his paranoia will ramp up even more than it already is. We both know why we need as many Grey Wardens as possible.\" \n\n\"Agreed.\" \n\n\"The second is that you spend tonight telling Alistair and Aedan both all that they need to know in order to combat the Blight. They are not prepared as they should be, and I refuse to be the one to tell them.\" \n\nTomas nodded, anguish clear on his face for a split second before his mask fell into place. Aedan and Alistair were too busy looking at each other in surprise to notice. \n\n\"And third, you also spend a bit of time tonight alone with Alistair. You know why.\" \n\nThis time Alistair aimed his surprised look at me. I refused to look away from Tomas until he slowly, reluctantly nodded. It's about time someone who knew her tells him about his mother. \"You have my word.\" \n\nI stood and stepped away from the fire. \"Then I am going to our tent. If I am asleep, please wake me when you are done with the boys.\" Aedan and Alistair both shot me a dirty look for calling them boys. I grinned apologetically at Alistair, ruffled Aedan's hair in passing, and crawled into the tent Tomas had agreed to share with me. I noticed speculative glances from Theron and Leliana as I headed into the tent. I ignored them. \n\nInside the tent I pulled out the scissors and razor I had brought with me specifically for Tomas' benefit. I had no idea what to do with myself after that, and I was cold again. I wrapped myself in the blankets from my bedroll, sitting upright, thoughts buzzing through my head on what all we were going to have to face over the next several months. Assuming that I stayed in Ferelden, that was. I felt completely overwhelmed at the odds we faced. Even though it had proved possible in the game, and apparently my being present had improved those odds by adding in some foreknowledge and keeping one extra Grey Warden alive, I knew now that the game ending wasn't set in stone. If I could somehow save some, I could also lose some. There were no guarantees that the story would have even a vaguely happy ending. \n\nI didn't think I'd be able to rest, between worry about the future of Ferelden and worry about disappearing in the night, but the exhaustion won out. I nodded off, sitting upright, chin on my chest. I woke some indeterminate time later when Tomas slipped into the tent. His mask was firmly in place, expression revealing nothing, until he closed the flaps of the tent. When he turned back, I could see despair, anguish, and raw fear on his face. I was a little bit awestruck that he allowed me to see his emotions when he kept such a brutally calm exterior for everyone else, but I was also glad that he did. Everyone needs someone to talk to, to trust. \n\nI crawled out of my pile of blankets, over to him, unsure quite what to do but wanting to offer some comfort. I put my hand on his shoulder, and he curled into it unexpectedly. I grabbed him with the other arm to try to keep my balance, and we ended up with his face buried in my chest, my arms around his neck, and he caught me as I started to topple over. I found myself sitting in his lap. I might have giggled if I couldn't feel him almost trembling in my arms. \n\nI held him, not saying anything, just stroking his hair and rubbing his shoulders where I could reach them. After several minutes, he pulled away and I tumbled awkwardly out of his lap. \n\n\"He's angry.\" I knew without asking that he meant Alistair. He was whispering, and I answered in kind. \n\n\"He will get over it.\" \n\n\"How can you be so sure?\" \n\n\"I know him. He forgave Arl Eamon after treating him like a saddle sore all his childhood, unwanted but unavoidable, then after all that, sending him to the Chantry. He is hurt, but he will understand. You're his family now. You and Aedan, you're all he has. Just come back, and all will be well. I'm certain of it.\" \n\n\"He will need you. Will you take care of him? I know you wish to avoid...entanglements, but he needs someone to look after him.\" \n\n\"Of course. Can you imagine I would do otherwise?\" A small smile quirked the corners of his lips, and he shook his head. \n\n\"Hey, I need to ask you something. An opinion. In case, God forbid, you don't make it back.\" He nodded. \"There is an...alternative. To a Grey Warden dying in order to kill the Archdemon.\" His eyes narrowed, and I couldn't decide if it was disbelief or anger that I'd not told him before. \"Not my secret to tell, okay? But listen. There's a price. The price is a child, conceived on the eve before the battle, whose father is a Grey Warden. That child will be born with the untainted soul of the Old God. I have no idea what will happen to that child, or how it could impact the future. I can't guarantee the darkspawn won't find it and corrupt it, somehow start another Blight. I can't guarantee that whatever that child is won't be worse than the Blight. Or, it might just be a human being. \n\n\"If the option is for either Aedan or Alistair to perform the ritual, or to let one of them die, what would you want me to recommend?\" \n\nTomas' shrewd eyes examined my face. \"This is why you saved me. At Ostagar. So I could be the one to kill the Archdemon, not Aedan or Alistair.\" \n\n\"I didn't save you. Even if I did, it would not be the only reason, by far. But one of them, yes.\" \n\n\"Well...\" He looked thoughtful, though still irritated. \"I suppose that if there are no other Grey Wardens when that day arrives, then...I would want Aedan and Alistair to survive. And hopefully together they could deal with the consequences, should there be any.\" He looked somewhat ashamed, but I just drew a sigh of relief. \n\n\"Now. Tell me about Denerim.\" \n\nI told him about Brother Genitivi, and the imposter Weylon. I told him what I could remember about Riordan's story - Howe offering him a place to stay, Riordan not realising his cover had been blown. About the supposed plague in the Alienage, right after the district was closed for a prolonged period due to the attack on the old Arl's son, and the Tevinters who were offering a supposed cure. About the nobles being tortured, and the templar in Lyrium withdrawal, and the elf who tried to defend his bride from the Arl's son, who was also in the dungeon. About the fake support meetings, the Crows who might stop trying to kill the Wardens if they completed some contracts for him. \n\nWhen I was done, I presented him with the scissors and disposable razor. He was not thrilled to lose his distinctive beard after already losing his long hair, but he allowed me to drag him outside where I trimmed the bristly hair, and he lathered as best he could with cold water and my bar of soap and then shaved the rest. He was amazed by the little razor and I sent it with him to keep him clean shaven at least for a while. Leliana heard us moving about, and spying my scissors, proceeded to cut his hair to give it a lot more style then the poor hack job I'd done with my dagger. He looked like an entirely different person and I was happy that no one would easily recognise him. \n\nSatisfied, we crawled into the tent. Tomas repacked for added stealth, refusing a tent, taking only a small amount of our combined coin, leaving the rest split between Aedan, Alistair, and my pack. We finally fell onto our bedrolls and I was asleep in seconds. \n\n******** \n\nI woke at home, on my bed, still dry and unsoiled. I cursed as my eyes opened and I realised where I was. Everyone would wake in the morning to find an empty tent, as Duncan planned to leave so early. Someone would end up carrying all of my stuff, including our tents. And what if they didn't find Bodahn and Sandal on the road? I groaned, knowing I was completely incapable of doing anything about it. I was still wearing what I had been when I left, despite having changed into commoner clothing in Ferelden. I gave myself a headache trying to wrap my mind around how that would work when I went back. \n\nI repeated my ablutions from the previous visit home, including shower. Despite being away for three days I didn't feel overly hungry, again. Once cleaned up and redressed, including an extra t-shirt, I forced myself to eat, made a list, called a cab, and headed to the nearest supermarket. I bought a package of dark brown hair dye, thinking critically of Cailan's noticeable blond head, some small bottles of shampoo and a detangling spray meant for kids. I also bought a few packets of spices that I knew how to use. Knowing we'd be down to eating nothing but meat either dried or fresh caught, I bought vitamin C tabs. I refuse to get scurvy along with everything else! \n\nI also bought several small empty notebooks and a package of small pens. I planned to write down as many details about the various locations as I could, so that I could leave them with Aedan in case I disappeared at an inconvenient time. Or in case at some point I got pulled home and couldn't return. I realised, for the first time, that I didn't want to come home. I'd rather be in Thedas. I'm going to need to have a t-shirt made for my new motto. \n\nAt home I realised that the Swiss army knives I had ordered had arrived, and I tucked them into my pockets. I put the spices and hygiene products in Ziploc bags, added soap and more coin to my pockets, folded in a spare bra, and I was ready except for my notebooks. I kept them near me, and spent the next two days poring through the wiki, writing as fast as I could. I outlined the quests needed to accomplish our goals as well as those that were lucrative. I put in as many details as I could about the enemies they would face and the strategies that seemed to work for different situations. But the first several pages were an overall summary of the difficulties each area was having and the options they would have for resolving them. \n\nI had just finished Redcliffe and the Circle Tower when the dizziness hit me. I stuffed my pens and notebooks in my pockets and raced toward my room. I didn't make it. As I closed my eyes, lying on my living room floor, all I could think of was how stiff I was going to be when I woke up."
    ],
    "authorname": "ElyssaCousland",
    "tags": [
        "fantasy",
        "fanfiction",
        "dragon age",
        "modern girl in thedas",
        "romance"
    ],
    "category": "Celebrities & Fan Fiction",
    "url": "https://www.literotica.com/s/there-and-back-again-ch-11"
}