{
    "title": "Sholan Alliance - AU Bk. 03 Ch. 02",
    "pages": [
        "The following morning Amanda and Ike walked to the Barque and were admitted. This was the first time Amanda had been on it and was fascinated by it as well as all the Sholan's. They really intrigued her because of the varied fur coloring. Also as much as she hated to admit it she loved cats and they had several. It was all she could do not to hunt one down just to pet and see if they reacted like a cat to the petting. \n\nIke glanced down at his wife and couldn't help but grin at her. He knew that look and knew she was working hard to keep from doing anything silly. \"Maybe later you can pet one of them.\" He whispered that in her ear only to get an elbow in the ribs. He laughed quietly at her as he showed her to Ceolura's offices. \n\nWhen they walked in her assistant looked up and smiled. When he noticed Amanda he stood and came around the desk and gave her a light hug. \"I am so pleased to finally get to meet you Lady Amanda. The Ambassador has said some very nice things about you and welcome aboard. If your life mate is going to be in meetings all day I would be more than happy to give you a good tour.\" \n\nShe was slightly startled with the hug but went with it and had to smile. \"I am definitely getting used to the hugs. Your fur is so soft and nice. When Ceolura comes over she and Ike tend to sit on either side of me and it feels so nice.\" She looked up at Ike and leaned against him. \n\nHe grinned at her. \"I can tell that and I am glad that you like Ceolura. She is a great person and it has been my pleasure working with her. Now she did mention a meeting she wanted you to go to with the other females. I am going to leave you here and when done they will contact me.\" He gave her a kiss before leaving her there. \n\nRight after he left Ceolura came out and smiled at her. \"Good morning Amanda and you look very nice and that is a wonderful dress. The meeting is going to be in one of the conference rooms so if you come with me I will take you there.\" She looked at her assistant. \"Please ensure the drinks and snacks are there and have the ladies escorted over in five minutes.\" Once he nodded she offered Amanda her arm and headed towards the room they were going to be using. \n\nAmanda was looking around and was quietly asking questions about the ship. It was obvious she was quite interested in the ship and everything aboard it. \"I would love to go and see the mother ship one of these days. I have seen it on the news and some of the footage Ike has shown me but I still have problems believing it is that large.\" When they walked into the room she carefully settled down in one of the chairs and had to rub her hip. \n\nCeolura gave her a concerned look. \"If your hip was bothering you I could have rescheduled or sent a vehicle for you. Is there anything I can do for you?\" She looked and sounded concerned when she came over and settled down next to her on the couch. \"Our doctor is going to be coming in with the ladies and if there is anything she can do for you ask.\" \n\nAmanda narrowed her eyes slightly when she mentioned the doctor. \"I will be fine and if needed I have some pain medications I can take.\" She really didn't want a fuss made over her. \n\nCeolura shook her head. \"I did not invite you over here just to trick you into seeing the doctor. She is here to give a medical opinion on the ladies request. I invited you over to get your opinion and nothing else. I told you that it is your choice if you want our doctor to look at you and I meant that.\" She turned as her assistant came in and showed one of the crew where to put the drinks and snacks. \"Can I get you something to drink?\" \n\nAmanda sighed. \"Sorry but I am just so tired of everyone other than Ike trying to get me to see this doctor or that one. As I said last night as far as earth goes there isn't anything they can do for me. I am considering your offer but I need to think about it.\" When the two Sholan's came in she quit talking about it and then nodded. \"Ike finds the cshar bland but I find it easy on my stomach so a cup of that would be appreciated.\" \n\nShortly both had something to drink and a few moments later the four remaining ladies came in. Ceolura had moved over to the table and was sitting there waiting. \"Good morning ladies and you have all met Amanda. She is here at my request for opinions on what you are requesting. Amanda this is Dr. Desjean who has been taking care of the ladies. Please get something to eat and drink if you want and then we will get started. \n\nOnce everyone had what they wanted Ceolura pulled out some documents. \"I have the request you sent to me and I have reviewed it. My question for the four of you is why are you requesting to move to Shola?\" \n\nBitty straightened slightly. \"The others have asked for me to speak for them. One reason is human males scare the crap out of us. We all know that is simply a reaction to what happened to us but it isn't something we can get over in a day. We have been keeping in contact with Crystal and she has had very good things to say about her treatment. Just reading her letters and seeing her video's we can see that she is doing better than we are. Also we know that Billy will keep an eye on us and take care of us. Speaking for both myself and the others we want to go to Shola at least for the treatment that Crystal has talked about.\" \n\nShe looked down at her hands which were clenched together on the top of the table. \"Speaking for myself I am tired of being scared all the time when human males are nearby. I want to be able to get back to my life. Dr. Desjean has been a great doctor but she has told us that she can only give us some basic therapy for our issues. It isn't her field of specialty and in her medical opinion our best bet is to go to Shola.\" \n\nAmanda sat there and listened to what they were saying and found it hard to blame them for their fears. Heaven knew she had enough of her own thanks to that accident and that was years ago. Was that why Ceolura had asked her to come with? To listen to the women and give her opinion on what should be done for and with them? For now she was simply going to listen to what was being said. \n\nCeolura nodded at the important points that Bitty was making. \"Thank you for that brief overview of why you want to go to Shola. Now Dr. Desjean what is your opinion?\" She turned her attention to the doctor and waited. \n\n~~~ \n\nThe battle fleet all appeared at the designated rendezvous point and immediately went into stealth mode. Several of the scout ships were sent in-system to verify any and all changes to the system status. That took somewhat over a day for them to go in and get back out. When they returned to the command ship all reported what they had found. \n\nAs of now there had been a few changes of ships but the combatants were still the same, or in the same class. From what they had picked up there weren't more than ten or twelve combatants and two fighter carriers. The rest of the ships all seemed to be transports and support ships. As far as the base it appeared to be in the asteroid field and not planet based. That could be both good and bad. \n\nThe General finally issued orders after discussing the status of the system. The two carriers he had were going to be coming in-system from both above and below the ecliptic with several escort craft for protection. All the fighter craft were to be launched including what was on the command ship and focused on any ships trying to escape. The main force was going to be heading straight for the base. Since there wasn't anything large enough to do major damage to any of his capitol ships he was settling for a killing blow. \n\nHe stood up. \"Everyone to battle stations and prepare to launch on my mark.\" He strolled out of the conference room and to the bridge. Once he had taken his chair he glanced at the chronometer. \"Send my mark in five minutes.\" \n\n~~~ \n\nThe station commander damn near shit a brick when the alert went up. As he rolled out of bed he kicked the slave out as well and told her to get to the slave section. If she didn't her collar would alert and she would be nailed with a tazer quality charge and it would keep getting worse. She didn't even hesitate other than to grab what was loosely called clothing before hurrying out. \n\nHe was jerking on his ship suit while he was checking the repeaters in his room. When he did that he paled since it looked like they had been discovered and the ships coming in-system were heavy combatants. As he was finishing the connections for the suit he had to frown since none of the ships had been classified by type. They were symbols next to the ship symbols that indicated they didn't match anything in the database. \"What the fuck and how could they have gotten new classes of ships built without us being informed.\" \n\nThe system commander didn't know where the information came from but any time there were changes to the fleet they were informed. The information had to be from high up since it was rarely wrong. That wasn't even mentioning it covered the three major polities as well. This was not good and once all the connections had been made he grabbed his helmet and ran to the bridge. \n\nAs he entered he called out. \"What are we looking at and what is the status of evacuation?\" Their orders were first and foremost to destroy any data and to run depending on the size of the attacking force. While he was waiting for the status update he settled into his chair and secured the helmet. \n\n\"Sir we are only about twenty percent done. The combatants just came in-system a short time ago and we just now were able to get decent reads on them. The ships are not in any of our databases. In addition their power ratings do not match anything, civilian or military, on record. They are showing higher overall power settings than on record and their mass is larger as well. As far as we can tell these appear to be alien vessels based on all the data processed.\" He was sweating bullets as he was trying to refine the data with his outdated sensors. \n\nThe commander froze and stared at him. \"Excuse me? Aliens? Are you talking as in the Sholan's? We have been given what date we have on their ships we, human's, have encountered. Same goes for that human ship with strange readings.\" If the idiot tried to tell him that they weren't Sholan's he was going to consider shooting him. \n\n\"No sir, none of the readings I have acquired so far match any readings at all. The ship configurations are not matching up with anything. It is possible it might be Sholan's helping the authorities but I don't have any way of telling.\" He knew that if the commander got pissed off he tended to shoot first and ask later and he really didn't have the urge to get shot. \"As far as I can tell these ships do not belong to human's or Sholan's.\" \n\nThe commander frowned as he moved down to the large display and checked the details. This was significantly larger than the one he had in his room so there was far more detail. As he was looking at the repeater he had to agree that the information displayed definitely wasn't anything he had seen before. \"Expedite the evacuation of the critical staff. Send two of the Light Cruisers forward to get a more detailed scan and have the data constantly updated on the evac ship.\" \n\nAs he was talking there was a strobe around one of the symbols for one of his ships indicating it was being attacked. \"What the fuck is that? How are they being attacked?\" There hadn't been anything showing on the boards before the attack though now there were some ghost signals that came and went. \n\n~~~ \n\nThe captain aboard the Light Cruiser that was being attacked had been a fleet officer till courts martialed. He had been charged and convicted of abusing his rank by encouraging junior females to service him. Once he had been drummed out the Organization had picked him up and given him pretty much all the tail he could want. \n\nWhen the attack started they had just finished buttoning up the ship and the crew was in their assigned stations. The first hit had definitely let them know someone was out there. It didn't penetrate the shields but it was a reasonably powerful strike. \"Captain that appeared to be a L3 ion beam or the equivalent. The ship it came from appears to be in some sort of stealth mode. Orders sir?\" \n\n\"Fire a nuke missle back along the beam path. See if we can paint the ship with radiation. It might help us track it.\" As he was talking several more beams hit the shields and they took it but the damage was starting to mount up. \n\n\"Firing solution generated and firing.\" The ship bucked as the missile flashed out. When it reached the predetermined location it ignited and came to life in a flare of radiation. For a brief moment the ship was detected and a follow up strike launched. \"Sir that partially worked but they are only absorbing a fraction of the radiation. I sent a follow up strike which appeared to do some damage but the ship is still moving.\" \n\n\"Crap!!\" This time when the beam hit the shield it impacted buckled and the beam penetrated. The ship bucked as armored plating shattered under the force. \"Sir, that took out one of the forward sensors. Down twenty percent on scanning ability.\" \n\nAt this point he didn't have much expectation of surviving the fight so he might as well go out kicking and screaming. \"Weapons free on any target identified. Set course Delta 3 to cover damaged shields. Contact Damage control and see what the status of the breach and...\" That was the last thing he said as several capitol class missiles impacted. The bomb pumped x-ray lasers cut through the armor plating as if it didn't exist. \n\n~~~ \n\nWhen the strobing stopped and the icon for the ship vanished he knew that ship was done for. \"Status of incoming forces.\" He bellowed as he went back to his chair. Once seated he started calling up commands and subroutines on his console. Since he was the only one with the authority to set the timer for the demolition bomb he entered his code and set it for thirty minutes on a silent countdown. It was enough time for him to get aboard his ship and get far enough away not to be damaged by the blast. \n\n\"Moving command to secondary conn. I will establish communications upon arrival. In thirty minutes head towards your assigned evacuation pods.\" He couldn't have them freaking out by telling them they had no escape possible. It was better to give them hope so they would keep doing their jobs. After grabbing his helmet he calmly left the bridge and hurried to his ship. \n\nThe staff on the bridge looked at each other and then the repeater. \"Give him five minutes and then we will leave. If he senses that we might jump ship that just means he will blow the station sooner.\" They all traded looks again and started setting all the controls on automatic. Everyone knew that there wasn't going to be any loyalty except amongst the individual ships crews. In their case the XO they trusted to an extent so they would follow him till he betrayed them. \n\n~~~ \n\nThe enemy had been heading in-system for the last half hour and the various combatants were encircling the ships they had detected. The fighter craft were heading in-system in their formations. As of now three of the foreign combatants had been destroyed in trade for a handful of fighters. So far the combat was going as smoothly as he had expected. \n\nThe General was still calling out orders as needed to 'ensure' the battle went as he wanted. When the logs made it back to the Emperor he would see the General had been in charge the entire time. That would look good for him and bad for others. When he came back covered in glory there were several senior officers he was going to have removed. \n\n\"Status update General, the enemy is starting to fall back towards the asteroid belt. They appear to be forming up on one of the asteroids that has a high energy signature.\" The male was not going to speculate on what they were doing or why. That was a damn good way to get handed to the priests and once was more than enough for him. \n\nThe General looked at the massive repeater and typed in some commands. An estimate of arrival time was shown. The ships were slower than any of his but not by that much. If they really ran for it they might be able to out run his fighters. \"Tell all ships to increase speed by .002 light and to tighten up on the light combatants. Send the fighters after the support ships and troop ships. Tell them to save some of the ships and the aliens. We need to find out if these are the enemy or someone new to conquer.\" \n\nThe comm. officer punched the orders in and sent them along with a follow up verbal set of orders. It would take some time to reach the other ships but not nearly as much time as the enemy needed. \"Orders sent General, awaiting receipt confirmation.\" \n\n~~~ \n\nThe commander had made it to his ship and slowly moved away from the base. He ensured the ship was not heading in any direction that contained any of the base components. Once the ship was away he had them power down to the minimum power possible to reduce his signature. The asteroid he was aiming for was heavy with radioisotopes and should hide his ships signature without problem. \n\nOnce they were away from the base he adjusted the destruction orders. If any of the heavy combatants came within range of the base the bomb would detonate. He rather hoped they would be close enough since it was a new type of bomb and the implosion should do extensive damage. It would also take out the computer core as well as the entire base and slave cages. He had to admit he was going to miss that sweet little squeeze he had in his bed earlier but there were always more. \n\nShips were starting to shoot out in all directions from the base. Most of them were smaller vessels that were used for transporting cargo and small loads of slaves to other locations. As of now he was pretty sure that most of them were packed to the gills with the pirates. For half a moment he contemplated activating the bombs implanted in the ships but the information they had needed to get out. The best way to ensure that was to allow as many ships as possible to escape. \n\n~~~ \n\nOn the edge of the system an expected transport had arrived and the moment the battle was picked up the captain ordered the ship to get out system. Since at the moment he didn't have anything illegal onboard he decided to head straight to earth. He should be able to come in as a tramp freighter inbound to pick up a load. While there he would send a message that the base was no more. \n\nAs they were turning the ship in a direction they could use to escape the system his comm. was picking up the omnidirectional broadcast. It was the ongoing data from the system scanners and he was receiving every bit of it he could. As they were heading back towards the jump point selected his sensors picked up several ships headed in his direction. \"Get us the fuck out of here. All power to the drives and if needed take the safeties off.\" \n\nThe ship surged forward and the moment the hyper drives were ready they jumped. \n\n~~~ \n\nThe message about the ship that had come in-system and then jumped reached the command ship to late to do anything about it. \"General we have received a report from one of our light combatants that a ship dropped out of hyper and jumped again. Several fighters tried to intercept but weren't close enough.\" \n\nThe General snarled. \"Tell the egg licking captain he had better catch that ship or he is going to be given to the priests for the rest of his life.\" If that ship escaped it could cause all kinds of problems. It would let the enemy know that they were out there. If that happened the Emperor wouldn't be happy and the General might get handed over to the priests. If that happened all of his plans went out the window. \n\n\"Orders are on their way General. It appears the ship is already heading to the jump point the enemy ship used.\" If they jumped from anywhere else it would be much harder to chase and intercept the enemy ship. ",
        "\"We are approaching the enemy base and have destroyed seven of the combatants. Orders General?\" \n\n\"Order the troop transport to launch the landing craft, detail two claws of fighters to provide cover and slow us down. I want us at least one thousand kunlong away from the base.\" He didn't care about the troops since they were expendable. If any of the major ships were destroyed without a very good reason it would screw his plans up as well. \"Make sure a complete log of the battle, information on the enemy, and communications is sent to the courier. Once they receive it they are to leave system and report to the HQ.\" \n\nThe comm. officer took care of getting the data package ready and sent it on its way. \"Data sent via hyper drone General. Upon receipt of the drone the courier will send the drone back.\" \n\n~~~ \n\nWhen the troop ships landed and the troops started entering the base the bomb detonation was set off. The base, nearby ships, and the transport vanished in a boiling fury of blackness. For a very brief moment a micro black hole appeared before it collapsed. For the microsecond it existed it sucked in everything nearby including the enemy ships as well as friendly ships. \n\n\"By the first Egg what the hell was that?\" The sensor officer swore as a circular gap appeared in the asteroid belt where the base had been. \"General a weapon went off that doesn't match anything we have seen or used before. I can't tell you what it was other than it seems to have swallowed up the base and everything nearby.\" Fear scent could be smelled pouring from the males body. \n\nThe General looked at the display and ordered a replay and swore himself. \"With draw all ships near the asteroid belt. As they retreat have them do as much damage as possible but do not take chances. Keep all possible sensors scanning where the base was and send out another drone with all the data possible. Encrypt it for the Emperor's eyes only.\" \n\n~~~ \n\nThe pirate smirked when the station and transport were wiped out. That seemed to give pause to the enemy since they appeared to be pulling back a fair amount. \"Take us out of orbit and keep it slow. Follow the belt till we are well away and then make a run out of the system.\" \n\nBy now his forces had been decimated though they had done a fair amount of damage to whoever had attacked him. He most definitely wasn't pleased since it was very possible his life would be terminated at any point. Chances were very good some of the Organizations special operatives were on board and would kill him for his failure. \"I am going to my cabin and don't disturb me unless it is critical.\" \n\n~~~ \n\nBilly had called Vangie into his office at the consulate and waved him to a chair. \"I have an idea that you might just like.\" He still had that evil look on his face from earlier. \n\nVangie cocked his head and raised an eyebrow. \"I recognize that look and it seems to indicate pain and suffering for some poor bastard. I have a feeling it deals with Signey and the subject of her interested. Do tell what evil thoughts are traveling through your mind.\" \n\nBilly snickered at him. \"Well I was thinking that I need to go through and clean my weapons. I know you have indicated interest in the workings of my antiques. I was rather thinking that you could invite me over to your house so I can show you how to clean them. If said boy showed up at the same time...\" His smile widened as he was speaking and the deviltry was dancing in his eyes. \n\nVangie's muzzle wrinkled in amusement. \"Even better we can have Kingie come over as well and you can show both of us how to clean and maintain your weapons.\" He scratched an ear for a moment. \"Why don't we have Kingie invite Crystal over as well and have a family evening of it?\" \n\nBoth of them traded evil smirks and fist bumped. It was something Billy had recently taught both Kingie and Vangie just to annoy his girls. \"That sounds like a deal and how about Friday? That will give me time to take care of a few things like a trip to my ship and have a meal catered.\" \n\nVangie had to shake his head. \"Yilly I am glad I am on your good side. When that evil streak of yours breaks loose you can be a total bastard. Those three are still being snubbed and especially by the females. The last time the leader of the three made a pass at a female he got clawed and told to go rot.\" \n\nBilly snorted. \"I didn't even have to work hard on that punishment. If I had been less pissed off it would have been worse.\" He had to grumble. \"Tasha kept nixing my really good ideas so that was what I had to settle for.\" \n\nVangie stood. \"Well I need to go and let Holla know as well as Sally. I will let Holla suggest to Signey that she invite the boy over for a formal meeting. I want to make sure and introduce him to all my family and friends.\" As he left the office his tail and ears were showing serious amusement at Billy's suggestion. \n\nBilly smiled and then contacted Tasha. *Hey love, we are going to be going to Vangie's on Friday. It is going to be a family dinner since pretty much everyone is invited. Us, Dani and Z'Marl, Crystal and Kingie, Sandi and Jenna and I am looking forward to it. Would you mind setting up a caterer for it?* \n\nHe could sense Satasha contemplating his request. *I am not going to ask what you are up to you evil man. I know that it is safer that I don't ask since I have a feeling this is related to the other morning.* She was definitely getting to know how his mind worked. \n\nBilly tried the innocent act just because. *I just want to have a quiet evening with everyone. I don't know why you are suspecting me of an ulterior motive. I feel hurt by your insinuation.* \n\nSatasha mentally growled at him. *Quiet my ass and have you decided where you are going to bury the body?* Just for good measure she mentally snorted as well. *I have things to do and will see you this evening.* \n\nBilly snickered at her reaction before going back to work. There wasn't actually a great deal of work for him yet so he normally was able to get the Ambassadorial work done first thing. Then he dealt with any paperwork from Sue Anne and the company she was managing on Earth. Once that was done he would retire to his design room and keep working on the upgrades he had been. \n\nNow that he had several different jobs as well as access to some of the Sholan computers he was starting over. The basic design was solid but he was going to take his time and do his best to work out the entire engine design before he did anything. Before with the urgency he was doing bit work on it. Now he could start from the beginning and incorporate the changes he had come up with. \n\nZ'Marl was in the room already and she was working on updating the notations for the drive so the Sholan computers could process them. Billy was getting better with the math notations they used but he wanted to make sure that it was correct when input. \"Hey hun, how are you doing?\" He leaned over and nuzzled her ear for a moment before drawing her into a kiss. \n\nJust to tease him she grumbled at him. \"I know why you wanted me as your companion... It is so you give me the headaches and avoid giving them to anyone else.\" When he kissed her she licked his nose before nipping it lightly. \"That is for being a meanie.\" \n\nBilly twitched back and frowned at her. \"I know better than that.\" He wrapped his arms around her shoulders. \"You have been happier in the last couple of weeks now that you are both working and using your brain. Your smile has been less forced and you aren't trying to hide just how intelligent you are. I love the change I am seeing.\" He was stroking her ears as he was talking to her. \n\nZ'Marl leaned against him and rubbed her head against his abdomen. \"Thank you Yilly and I am happier. I was happy before but now I am even happier. What you are doing with the n-space drives as well as the h-drives is simply fascinating and forcing me to stretch my mind. After watching you and your girls not only admitting to being frigging brilliant but reveling in it has encouraged me.\" She had to snicker. \"I think half the boys and some of the girls in the classes Dani is taking are scared of her. Well intellectually that is, I know of several boys who are rather interested in her but are scared to admit it. I think one said something about not wanting to annoy her father for some reason.\" \n\nBilly kept stroking her ears and hair as she was talking. \"I have to admit myself that I am greatly enjoying getting back into designing things. Working with you is very enjoyable as well. I was wondering if you had any plans this evening? I would like to take you to dinner and then spend the night with you.\" At the mention of the boys he did snicker. \"Good, if they are smart they will actually talk to her and get to know her. If they are simply looking for a night with a human female then...\" He growled slightly. \n\nShe leaned into him a bit more. \"That would be very enjoyable and thank you. Now I need to get back to work you silly man.\" She moved away from his hug and started working on the data again. \n\nBilly had to smile to himself. He had major plans this evening and he hoped she would approve. \"I have some things to do as well. I am taking this afternoon off and letting my brain toss around a few ideas that I am considering. If you have any questions I am going to be in our quarters.\" He left the room and headed for their quarters. \n\nWhen he walked in he found Satasha there as he had expected and walked over and gave her a hug. \"I am inviting both you and Z'Marl out to dinner this evening. There are a few things we need to talk about and especially our relationship. I am going to take a nap and then get ready to go out this evening.\" \n\nShe had to smile since she had a fairly good idea of what he was thinking about. \"Go and relax and I will make the reservations.\" After a good kiss she watched him head towards the bedroom. \n\n~~~ \n\nBilly had reviewed the data on the Triads and had come to the conclusion much of it was true. He did have the bond with Satasha and could feel a bond with Z'Marl as well. He wasn't sure if she was feeling it yet but it was drawing them closer together and sooner than later they would pair. It would be similar to when he had paired with Satasha with their memories merging. It wouldn't have the drive to pair every five days though. Periodically they would be drawn together but not on a scheduled basis. \n\nAt first the idea sounded odd much in the way it had been odd when he had first had sex with her. It wasn't the way he had been raised and he had never been in a relationship with more than one woman at a time. It might be normal for Sholan's but not for him. He had been forced to do a great deal of thinking since he had met Satasha. Probably the hardest part he had to come to terms with was Satasha potentially meeting someone she wished to spend time with. That had actually happened and he had to really struggle to deal with his reactions. The Sholan half of him was pleased that someone had found her attractive. The human half had been rather appalled and shocked though he had no room to complain. \n\nHe hadn't spoken to Satasha about it since it was well within her rights though he knew that the link day following her encounter had been a bit stressed. She had given him room to contemplate and come to terms with it. She had also been upfront about it yet not tried to toss it in his face so to speak. It had made him somewhat grumpy as he was dealing with his feelings but once he had come to terms with it he hadn't had a problem. \n\nBilly pulled his attention back to what he had been contemplating and it did feel right. Tonight he was going to ask Satasha to be his lifemate and also ask Z'Marl to be the second mate in the Triad. He had talked to both Dani and Sally about it and both were pleased. Dani was still working on the cultural differences not to mention her encounter with Z'Marl. As he was thinking he eventually fell asleep. \n\nSatasha came into the room and smiled at Billy as he lay there sleeping. Most of the dressings were off though his arm was still strapped to his chest most of the time. The surgeon was planning on one more operation for a final fix. That was going to be a minor surgery and after that the physical therapy would start. He was going to have scars for the rest of his life but he would be pretty close to a hundred percent when done. \n\nShe walked over and settled down beside him and gently stroked his face. \"How can such a stinker look so innocent while sleeping?\" Satasha murmured. \n\nZ'Marl had just come in and heard her and had to grin. \"Probably because he has no guilt issues when he deals out his evilness.\" She settled down as well and stroked his hair. \"We are going to dinner tonight if he didn't mention it. He also wanted to spend the night with me as well. I have to admit I am looking forward to it.\" \n\nSatasha looked up and smiled at her. \"Yilly did mention both dinner and spending the night. He invited me to the dinner but for some reason not for the night.\" She winked at Z'Marl when she said that and ducked when she batted at her. \n\nBilly had awoken and started snickering. \"That is because I didn't think either of you would go for it. Now if you are interested...\" He sat up as he was talking and snickered at the frowns from the two. \"I guess not, oh well such is life.\" \n\n\"Daddy stop teasing your mate and companion.\" Dani called from the living area. \"That is just mean of you and I will do something like dye your hair green or some other horrible color. I do hope the three of you have a nice dinner out.\" She was going out with several Sholan's from the classes she was taking. As of now she had washed her hands of her former boyfriend. He had sent a letter encouraging her to come back to earth and college to be with him. \n\nHe simply snickered before getting up and pulling out a good robe and some of his accoutrements for it. Billy felt silly wearing the Ambassadorial seal but for tonight he was going with it. Both bracelets were on and he had even buffed them so they had a nice shine. \"I am going to grab a quick shower and then get dressed.\" Before he moved he gave both women a good kiss. \n\n~~~ \n\nOnce Dr. Desjean had finished giving the medical report on the ladies and the recommended treatment plan she sat back down. She was needed till Ceolura told her she could leave. Chances were good that this would take till lunch. It wasn't a problem since she now had a second doctor aboard the Barque. \n\nThe Ambassador reviewed the information and after asking a handful more questions she dismissed the ladies. \"I am going to take into consideration all the points made, both by you as well as the Doctor. Once I have composed my findings I will forward them to Alrel for review. I should have an answer for you in about a week. I am going to recommend that this be approved for the length of the treatment first and further review after that. I am also going to forward this to the human Ambassador for review as well.\" \n\nBitty snickered slightly. \"I am pretty sure I know what Billy will have to say about it. He will probably grump about having a bunch of women dumped on him even as he finds a safe place for us.\" The four of them stood and walked out of the room. \n\nCeolura glanced over at Amanda. \"Would you care to stay for lunch? Ike normally comes by for lunch to touch base with me and discuss any issues off the books.\" As she was talking she stood and stretched. \"I hate sitting in one spot for any length of time. For some reason it always makes my tail stiff.\" \n\nAmanda knew it was going to hurt getting up. She had been sitting to long but hadn't wanted to disturb the conversation. With a sigh she carefully slid forward and using her cane finally was able to stand. It did hurt and would hurt for a while since she couldn't take her pain meds on an empty stomach. \"I think I would prefer to lay down for a while. I need to eat something and then take my meds.\" \n\nDr. Desjean didn't know Amanda had any problems since Ceolura had specifically not told her. \"Lady Amanda if you wouldn't mind coming to medical I might have something for the pain. Something you don't need to have to eat before taking.\" Her ears were forward as she talked to the woman. \n\nAmanda started to frown at Ceolura since she felt like she was being setup. Ceolura shook her head. \"I haven't said anything to her about your medical problems. She was here simply to give her opinion on the ladies.\" \n\nDr. Desjean looked between the two of them and had to wonder what was going on. \"If needed I can step out or just go to medical. If you want to come past please do but that is your choice.\" She stood up and shook out her tabard and doctors jacket while waiting for a reply. \n\nAmanda contemplated Ceolura and everything she could read in her posture and expression indicated the truth. She hadn't done this to set her up or to get her to medical. She had wanted her there to listen to the females and the doctors opinion. \"Fine, I will go to your medical and get examined. I do not want to hear another word about this at all.\" \n\nCeolura nodded. \"It is your call Amanda and nothing will be said. If you wish to go then go but please don't do it for any other reason than your wanting to go. I would never put pressure on anyone to do something they didn't want to do. It goes against my training and beliefs.\" She looked at the doctor. \"Only do what she allows and no pressure for anything else. I will let Ike know that you will be here for lunch.\" \n\nOnce Ceolura had left the room Dr. Desjean gave Amanda a questioning look. \"I was not informed of any medical issue you might have. I can tell simply by observation that something is wrong with your hip and you are in pain. If all you want is something for the pain then so be it. I would appreciate a chance to examine what is wrong but as the Ambassador said that is your decision. Will you please allow me to just do a regular scan?\" \n\nAmanda sighed. \"Fine, one scan and what does that consist of?\" When the doctor offered her an arm to hold onto she took it since she was going to need the help. \n\n\"It is simple, painless, and only takes about fifteen minutes. I have you lay down on a table, have the scanner hood come over you and then scan. It will produce a 3D image of what is being scanned. In this case I am assuming it is something either bone or nerve related so would scan for both of those. The scans can be adjusted for specifics such as cancer, disease, telepathic issues, and more.\" She was making sure that her pace was matching Amanda's. \"This is pretty much what we had to do for Yilly both when he was ill and when he was shot.\" \n\nAmanda listened carefully and had to admit the procedure didn't sound to bad and once done she would be done with the nagging. Ike had been suggesting it as well though he was very subtle about it. \"Fine, do the scan and let's get this overwith. I am sorry I am being so grumpy but I have been dealing with this for a number of years and am sick and tired of people wanting to poke and prod me.\" \n\nDr. Desjean couldn't help but twitch her ears in amusement. \"I can understand that and believe me the ladies have said much the same. In this case once we have the basic scan I should be able to quickly tell if we can be of help to you or not. If so then where we go with it will be up to you.\" She showed her into medical and the scan room. \"Let me lower the table so you can get on it easier. The bed is self molding so you should be comfortable while the scan is happening.\" \n\nAmanda settled down on the bed and had to wiggle a bit. \"Oh my, I might have Ike see what we need to do to get one of these.\" As it warmed up she relaxed even more and settled for watching the cover come down over the bed. \n\nIt wasn't much later when the doctor came back over. \"All done and I will review this today and send you the results tomorrow. After that if you wish to discuss my findings just contact me aboard ship.\" She showed her out of medical and to the Ambassador's suite. ",
        "~~~ \n\nOnce they were dressed and ready to go he gave Dani a good hug. \"I hope you have a good time this evening. I would say don't do anything I wouldn't but... If you come home with a Leska the Sholan's might be even more annoyed with me than they are now.\" He grinned at her when he said that. \n\nDani snickered at him. \"Well if I do I get to blame it on you for dragging me out here.\" She returned the hug. \"In all seriousness I might not be home tonight. There is a nice male from class who is working up the nerve to invite me to his room.\"  \n\nBilly smiled at her and lightly bopped her on the shoulder. \"I am pleased that you are getting out and make sure he buy's you a good meal beforehand. Do me a favor and if you do go home with him call and leave a message so I know where you are.\" He gave her one more hug before leaving the suite with his ladies. \n\nOnce they were outside he took a deep breath. \"Damn that was hard. I had to struggle not to demand the name of the male so I could go and let him know if he hurt her he would regret it.\" After a good shake he kept walking. \"I was thinking of the Green Goddess to eat at. I know I have enjoyed the food there and so have the two of you. Is that were you made the reservations Tasha?\" \n\nZ'Marl gave him a hug. \"I can imagine how hard that was since I remember my father feeling much the same way. I think all fathers and older brothers tend to feel that way. Dad told me it made him feel old when I hunted down my first male.\" She had to smile at the memory since it had been an enjoyable time for her. \n\nSatasha couldn't help but smile as well. \"It is the Green Goddess we are eating at. I could sense that in your mind when I mentioned making a reservation.\" She looked around at the people and shops on the street. \"It feels good to get out and just walk around without a bunch of hanger-on's. I remember the quiet evenings walking around as well once the crowds had mostly gone home.\" \n\nThe three of them took their time getting to the resteraunt since they knew that the moment Billy was spotted they would be seated. All three disliked the 'preferred' service they tended to get around him since he was the Ambassador from Earth. The aspect of him being a Leska had been downplayed though that wasn't going to last much longer. It had been a month and a half or so since Satasha had gotten pregnant and she would start showing in the next couple of weeks at most. Once that happened questions would be asked and they would have to be answered. \n\nWhen they finally did arrive Billy had to smile. \"I keep forgetting how lovely it is outside with the plants and little glow lights they have. This is perfect for this evening.\" Shortly after checking in at the desk they were shown out to one of the outdoor tables and handed actual menu's as they settled into the chairs. \"I must be getting used to your chairs. I don't quite feel like a child anymore. It might be the fact I am going to be a daddy again.\" \n\nSatasha snickered at him for that and shook her head. \"If your head gets any bigger because of that you are going to have trouble getting through the doors.\" She looked at the menu and mentioned her choices for food. By the time the waitress came back all three were ready to order. \n\n\"I love the way your meals are communal as well. Several large trays to be shared with everyone at the table.\" He took a sip of his wine and lifted it to check the color. \"Excellent vintage, I will have to order some for the consulate for the next party. Then again I might just have this place cater it and save me the hassle.\" There was a major reception coming up shortly to introduce the humans to the other races in the Sholan Alliance. \n\nZ'Marl had to appreciate the wine as well. \"So Yilly why did you bring us out here or are you going to broach the subject after the meal?\" She was really curious as to why and that made her a bit nervous. \n\nBilly reached over and grasped her hand. \"Now is as good a time as ever and I have a question for both of you.\" He turned to Satasha. \"Would you please accept me as your life mate? Since we can have children there isn't anything stopping us and I don't want to live without you in my life.\" \n\nSatasha had known something was up but this wasn't what she was expecting and her eyes widened and her ears lowered. A slight sheen could be seen in her eyes as she tried not to cry. \"Oh yes Yilly I would love to become your life mate. I have dreamed of this since we became Leska's.\" *Now ask Z'Marl since I can feel that in your mind.* \n\nBilly lifted her hand and pressed a kiss on the back of it before turning to Z'Marl. \"Satasha and I want to know if you would be willing to be our third in the Triad. We both care for you a great deal and I know that my girls care for you as well. Will you please accept us as your life mate as well?\" \n\nZ'Marl was honestly more shocked than Satasha had been and she couldn't keep her tears of happiness contained. \"Oh yes Yilly, I do accept and thank you so much. This means more to me than I can even begin to explain.\" She gave his hand a good squeeze as he kissed the back of it as well. \"I love both of you. When do you want to life bond and do you want a full temple wedding?\" \n\nSatasha snorted at her. \"Why do I have the feeling if he pulled a Priest out of his pocket you would be ready? Silly girl of course it has to be a temple wedding. He is the Ambassador you know and can't do things halfway now can he?\" \n\nZ'Marl gave her a watery laugh. \"True and true, I would love to have a temple wedding. We can talk about that tomorrow. Tonight I simply want to be with the ones I have come to love.\" \n\nWhen the waitress came back Billy had a slight gleam in his eyes. It had been requested that he keep the information about his being a Leska quiet but he was still pissed. \"I would like to order a round of drinks for the house to celebrate my Leska accepting my request to become her life mate and also Z'Marl for becoming our Triad partner.\" \n\nThe waitress looked both pleased and very startled. \"I will let the manager know about the round in celebration. Congratulations on the acceptance of your request Ambassador Madlax.\" She turned and hurried away to talk to an older Sholan male. \n\nSatasha glowered at him for a moment. \"You do know that bit of information is going to be hitting the newsnets in about ten seconds right?\" She knew exactly what he was doing and though she didn't blame him wished he had done it somewhat differently, say from the safety of their suite. \n\nZ'Marl's ears were straight up in shock at what he had done. \"Yilly you are horrible. You know this is going to be reported on and everyone is going to know about it. The leaders of Shola are going to flip when they see this.\" She nibbled on a knuckle for a moment before she spoke again. \"I suppose that is one way to let my parents know without actually telling them.\" She started snickering. \"I almost wish I was a fly on the wall when this bit of news hits them.\" \n\nAbout then the manager came over and bowed politely at Billy and then the women. \"I wished to extend my congratulations as well. I would also like to thank you for choosing the Green Goddess to propose to these lovely ladies. The waitress indicated that you were enjoying the wine so I am going to have a bottle brought out for you.\" \n\nBilly managed to keep his sense of evilness under control. \"Thank you but for various reasons we are only having one glass each tonight. However if you can provide me with some contact information the Embassy is going to be hosting a party in the next few weeks. We were strongly considering seeing if you catered since we greatly enjoy the food here.\" \n\nThe manager was obviously a professional and he gave them a charming smile. \"I would be more than pleased to do that and I will also contact the owners and let them know.\" He pulled his comm. up and sent the information to Billy's comm. \"I will take my leave so the three of you can celebrate and please take what time you want.\" Another bow and he was gone. \n\nThe food was delivered quickly and the three of them spent a very enjoyable time talking and trading bites of food. Billy was greatly enjoying the meal. Even when he was informed that several news crews would like to speak to him didn't ruin his mood. He simply asked to have the new services to contact the consulate and he would have a statement for them in the next day or two. \n\nEventually they were done eating and they strolled out of the resteraunt and as expected several of the news crews were still there. Billy turned to address them. \"I appreciate your interest in myself and my Leska but this evening was for a quiet meal so I could propose to her and Z'Marl as our Triad partner. Please allow us the privacy to enjoy this special evening. As I mentioned I will have a statement in the next day or two. If any of you want a personal interview contact my chief of staff to have that arranged. Now if you will excuse us?\" He turned and walked away. \n\nSatasha wanted to growl at him since she knew that had been a complete setup and the news crews had taken the bait. Not just the bait but the hook, line, and sinker without even blinking. *Yilly you are a wretched man playing them that way. God my father is likely to stroke out when he sees the news. Mind you I am still irritated with him but he is my father.* \n\nZ'Marl could tell that Satasha was mentally grumbling at Billy and barely managed not to snicker at her. \"Yilly you are a devious evil excuse for a man and did I love that. You might not make it out of bed in the morning.\" \n\nBilly sighed and tried to look put upon and failed miserably. \"One thing I do want to mention to you Z'Marl is it is very possible that you will be drawn into our link, or the edges of it if the crystal data is correct. I know we have all read the information but I just wanted to remind you.\" \n\nShe smiled at him and shrugged. \"I don't mind at all Yilly. I accepted that fact then and I accept it now. If I hadn't I wouldn't have accepted the proposal tonight. I love you and Tasha and don't want to be without you.\" \n\nBilly lowered his head as he blushed. He really didn't know what she saw in him other than his mind. She was young, at the beginning of her life and had so much to see and do. He wasn't old by any means but he had been there and done that and almost felt bad about some of the memories she was going to see. \"That means a great deal to me. Thank you for accepting us into your life.\" \n\nThe rest of the walk back was fairly quiet as they all contemplated the changes this was going to bring to their life. All of them wanted it but it was a huge step for all of them and more so for Z'Marl. Eventually she would want a child but how would she handle having a hybrid child? The tests showed that she was genetically compatible with him now as well. \n\nWhen they reached the room the message light was blinking and when he reviewed the messages he snickered. \"Well Dani isn't going to be home, the head priest of Vartra wishes to talk to me, Vangie and Kingie sent their congrats, and there are about two dozen other messages.\" He shut the system down and pulled Z'Marl into his arms. \"I think I am ready to head towards bed and have more than a bit of fun with you my lovely lady.\" \n\n~~~ \n\nThe tramp freighter had been running at top speed for Earth. The combatant that had been following them had been closing the gap slowly over the last week. As far as the captain could tell they were still too far behind to open fire on them. They had tried several times but after the last attempt they settled for trying to catch them. If earth had been any further away they would have caught them. \n\n\"Captain we have reached the Oort boundry for earth. Orders sir?\" She was one of the few females who had voluntarily joined the pirates but she fit in quite well. \n\nHe had long since decided to keep heading in-system far enough that there would hopefully be some sort of protection. \"Take us in as far as possible before we have to drop out of hyper. The second we drop out send out a distress signal that we believe we are being chased by pirates.\" That would get everyone going due to the ongoing issues with piracy over the last fifteen or so years. \n\n\"Yes sir and I am projecting an estimated time to exit hyper at thirty minutes from now. If my calculations are correct we will drop out near the neutral zone. The swiss are pretty serious about keeping it safe so there should be something nearby.\" \n\nHe nodded and settled back in the seat of his chair a bit deeper. This was going to be interesting though not necessarily in a good way since there were going to be questions. He had a reasonable cover story about being jumped mid-flight which should hold long enough to get out-system. Time would tell. \n\n\"Coming up on translation to n-space sir, in three, two, translate.\" The ship shuttered from the crash translation but they needed something dramatic. As soon as they came into n-space the indicator on the comm. showed the message was going out on all emergency and distress channels. \n\n~~~ \n\nOn the enemy's ship they dropped out of hyper as well only to realize they were in a highly populated solar system. The indicators of hyper drives and n-drives were all over the place and till they started resolving they had no idea which ships might be combatants. \"By the shards of the first shell get us the hell out of here. I don't care what you do but get us back into h-space and run like hell.\" As he was screaming that one indicator came up that they knew. It was one of the enemy ships and it was massive based on the power readings. \"Oh shit we are dead.\" He whispered. \n\n~~~ \n\nCrystal had talked to Kingie's parents about what she and Kingie had discussed. \"I would like to do something nice for him but I am not sure what. I was thinking of a home cooked meal but I know there are expectations connected with that.\" She was sitting in his mothers sitting room as she talked to his parents. \"I know I am not ready for that but I want to make my feelings clear. I do care for him and I want a relationship with him.\" \n\nWhen she stopped talking his mother came over and settled down next to her and wrapped her arm around Crystals shoulders. \"Tell him exactly that Crystal. Tell him you want to cook a meal for him and spend time with him. Tell him you want to show him what he means but you don't know how far you can go right now. He will understand Crystal and you know that. Ask him tonight when he gets home and let us know the date and the rest of us will go out for dinner and give you two some privacy to talk and relax.\" \n\nCrystal leaned into the hug and gave her a small smile. \"Thanks mom. That really helps.\" It was one of the first times she had been brave enough to admit that she thought of them as her new parents. \n\nShe laughed. \"I rather like that bit. 'Mom' sounds good to hear from you. Now why don't you go and wait for Kingie to come home. I will distract the other two so you have a chance to talk to him.\" \n\nCrystal gave her a good hug before leaving the room. She decided to wait outside since the weather was nice and she liked the small garden setting. Crystal was looking up at the stars that were just beginning to show when Kingie walked in. \n\nHe came over and settled down next to her and nuzzled her cheek as he wrapped his arm around her. Since the talk several weeks ago he had been more physically demonstrative. Before he had started he had talked to Crystal about it and they had come up with a tentative list. It was based on her reactions to the little intimacies such as kissing, nuzzling, and touching. \"You smell content Crystal. I rather like that scent on you.\" \n\nShe smiled at him when he nuzzled her cheek and returned the gesture. \"I am surprised that I smell content. I would think I would be smelling nervous since I wanted to offer you a home cooked meal in the near future.\" \n\nKingie let a slow smile cross his face when she said that. \"That sounds lovely and thank you. We can relax and get in some cuddling while we talk about whatever.\" He lightly licked behind one of her ears. \"I will not expect anything more than that. Give me what you can and I will be content.\" \n\n\"Thank you Kingie and we will see. I am getting more comfortable with the intimacy and I would be lying if I said I wasn't interested in something more. I just want to make sure that when it happens it is right for both of us.\" She turned in his arms and drew him down into a good kiss."
    ],
    "authorname": "maxd01",
    "tags": [
        "alien felines",
        "pregnancy",
        "mental link",
        "space travel",
        "space battles"
    ],
    "category": "Celebrities & Fan Fiction",
    "url": "https://www.literotica.com/s/sholan-alliance-au-bk-03-ch-02"
}