{
    "title": "In Dreams",
    "pages": [
        "Hannah Bell entered the house in the woods as she normally did except that she tried to make less noise than she might otherwise create. Her boss, Jefferson McDaniel, got home late but she didn't know how late. Even though he was one of the most mild-mannered people she had ever met, the mere concept of disturbing a genius when he needed his rest was beyond her comprehension. That was the way she had been brought up.\n\nGenius; that was the only word she knew how to describe her boss. She had never met anyone like him and yet she knew so little about him. He could easily be described as four or five different and recognizable people; yet these images bore little similarity to the almost shy and reclusive man she worked for. Perhaps her biggest surprise was that she worked for him at all.\n\nShe had worked her way through college and then through law school. During her last year, she began a frustrating search for a job in a law firm. Jobs were scarce for young people who hadn't passed the bar exams or hadn't made a name for themselves in law school. Her need to work had kept her from the recognition earned by participating in many highly visible activities. With only her credential being her degree and a couple of recommendations from her professors, she found the world offered few places for her to shine.\n\nShe remembered the day her advisor at law school, Professor Miller, had asked her to meet him and a friend for lunch. Uncertain what the reason was, she agreed although it would have to be a short lunch since she had to go to her job by three. When asked the reason for the lunch, her mentor had simply said, \"If the connection is right, this might be your future.\"\n\n\"A job! Is it with a law firm?\"\n\n\"Yes and no. He is rather unique as you will find out. He needs a lot of legal work and advice but mostly he needs a mother hen. He lives a complex life with lots of details which more often than not, he ignores. He needs someone like you who can do the legal stuff but then keep the rest of the details in order.\"\n\n\"So, this is an administrative assistant thing.\" She couldn't keep the disappointment out of her voice.\n\nHer mentor stopped and took her arm for a moment. \"Hannah, you don't really understand yourself or the life you have chosen to pursue. You are one of the hardest working students I have ever had. You don't give up and you take care of the details that most students ignore. If you get into a high-profile law firm, you will have to become a smiling face that attracts new clients and pay just enough attention to details to insure a continuous flow of billable hours. Frankly, I think that you would burn out in that world. There is a whole other world out there for really good legal minds that never involves court houses and clients, many of which you would find to be repulsive. Law school has taught you how to resolve issues and recognize important details. That is what you do best. An opportunity like this won't come along very often but it is the world you are best suited for. For now, at least consider what Jeff has to offer. You might be surprised.\"\n\nHis words stung her deeply. Inside she knew that he was right but the image of big paychecks and recognition had become deeply ingrained. Both of those qualities seemed to be the ultimate reward for her sacrifices and working hard. It took a moment before she said, \"You have always treated me well and I respect your judgement. I will listen and consider whatever is available.\"\n\nHe simply smiled and replied, \"That was the right answer. I am going to introduce you to Jeff but then leave. Don't be surprised at how much he knows about you already.\"\n\n\"What should I know about him?\"\n\n\"I could tell you a lot but you probably wouldn't believe me. Go in cold and figure out for yourself what you need to know.\" Without adding anything else, he led her inside an exclusive restaurant that she had only heard of but could never afford to try.\n\nTo say that her first sight of Jeff McDaniel was a surprise would be an understatement. As they approached a table it the back, a tall man broke into a shy smile and stood up to greet them. At 6'4\", he was a tall and handsome man who reminded her of the one guy she had a crush on in high school but who had totally ignored her. The fact that he wore worn jeans and a plaid shirt added to that memory.\n\n\"Hannah Bell, this is Jefferson McDaniel. Jeff, this is Hannah. I am going to run now. Enjoy your lunch and talk.\"\n\nJeff reached out his hand and held her eyes with his to greet her with a warmth that belied the shyness showing on his face. \"Hi, Hannah. I have been looking forward to meeting you. Please have a seat.\"\n\n\"Um...Thank you.\" He pulled out a chair for her and helped her settle comfortably in her seat.\n\n\"If you haven't eaten here before, I recommend either the salmon or the Steak Diane. I am kind of addicted to Steak Diane, so that is my go-to meal when I am here.\"\n\n\"Thanks for the recommendation. I haven't been here before but salmon is my favorite seafood.\"\n\n\"Mine too; except here.\" His smile had warmed as did her heart. Their order was taken and Hannah began to relax in the presence of this man.\n\nAs they waited, Jeff simply asked, \"Tell me about yourself.\" It wasn't a demand or an order; it was a simple request.\n\n\"I am twenty-five and just finishing my law degree...\"\n\n\"Not what your resume can tell me; I already read that. Tell me about you and your dreams and aspirations.\"\n\nThat set her back because no one had ever just jumped right into her being like that before. \"Well...\" She took a deep breath and began slowly. \"I grew up in a small town about 150 miles south of here. All my life, my parents told me that getting a good education was the key to my future. They set up a college fund for me. They both worked at a factory near my home. In my junior year in high school, the plant closed and they were out of work. That meant that my college fund went to pay bills and such. That was when I realized that I was either going to be just another small-town girl with unfulfilled dreams or work my as...butt off and get a degree. So, I worked my way through a small college near there while living at home. I got my degree in Business with a major in Accounting. When I finished, one of my advisors suggested that I might like going to law school since I liked to work with details. I took the exam and was accepted here. To support myself, I have been working in the back office of a bank. Now that I am finishing my degree, I...I just assumed that I would get a job with a law firm as an intern or something until I passed the bar. Then...I would be a lawyer.\"\n\n\"That doesn't sound like a personal dream as much as a self-fulfilling prophecy. You neglected a couple of dozen details like your social life, what you really enjoy doing, you know, the things that make you real and alive.\"\n\nHannah turned bright red and stuttered, \"I...I...\"\n\n\"If you start with 'I'm sorry,' I will make you pay for lunch.\" He grinned. \"I am not trying to put you on the spot; I just want to know the person behind the credentials. Take a deep breath and just talk to me about you.\"\n\nHer eyes flared and he could see that he had stepped squarely on a very sore spot. Then she just blurted out without thinking, \"I haven't had a life! Every time I began to have a dream, I put it away. It has taken every ounce of energy I have to survive and get to this point. I don't even know if I will like being a lawyer. I haven't had a date since high school. I have three good girl friends who are also in school. When we get together, all we do is drink wine, bitch about things at school, and wonder if the life we thought was out there really exists.\" She paused as she realized what she had just said. \"Oh, crap! Maybe I better go; I am sure that I have convinced you that you need someone else.\" She started to get up.\n\n\"Actually, you just convinced me that you are exactly what I need. You are hired. Now sit down, drink your wine and relax. Lunch will be here in a moment.\"\n\nShe stared at him, trying to see if he had any malice in his eyes or demeanor. All she saw was a kind and patient face looking at her with curiosity but also the look of a man whose mind was busy in faraway places. That lasted for only a few moments and then he was back. \"Yes; you are exactly what I need. Let's get the details out of the way before we eat. How much will it take to hire you?\"\n\n\"I don't even know what you want me to do! How can I answer that?\"\n\n\"Ok, how much are you worth?\"\n\nHer dander was up again and she shot back, \"A hundred grand a year plus benefits!\"\n\n\"No, no, no. One fifty plus benefits and a bonus. Take it or leave it.\" She just stared at him in shock. \"Come on; the waitress just left the kitchen with our lunch. Say yes or no, so we can eat in peace.\"\n\nWith the waitress standing next to her with her plate in hand, she blurted out, \"Yes.\"\n\n\"Excellent. Now, enjoy lunch and collect your thoughts again. We will talk about more of the details when we finish.\" He then cut into his steak and took his first bite. \"Damn, I love their Steak Diane.\" She could not think of anything to say and therefore, brought the first forkful of salmon to her mouth and discovered that all of the previous salmon she had eaten might as well have been fried catfish.\n\nNeither of them ate quickly nor said anything as they devoured their meal but her mind was going at fifty miles per hour in a dozen different directions. By the time, she finished, some semblance of calm had returned to her. Jefferson's demeanor had not changed but he was once again wandering through another dimension. She idly wondered where this place was. It would take her almost three years to find out and when she did, both of their lives would be changed forever.\n\nWith lunch over, he ordered coffee for two. Then he sat back and started. \"Do you prefer a desktop or a laptop to work with?\"\n\nThat was another jolt; she was expecting a discussion on the requirements for the job but he was addressing specific details. \"Uh...before we talk about that, perhaps you should tell me what you do and what you need done. I would kind of like to know what you expect of me.\"\n\nHe nodded. \"That's a reasonable question. I will tell you in broad terms right now. The specifics get complicated and we would be better off looking at them directly. First, I am independent, it is just me. I am involved in a variety of things but they all involve contracts, schedules, and terms and conditions along with all of the accounting stuff that goes along with them. I have gotten to the point where I can spend all of my time taking care of these things or doing the work that I do best. Doc Miller said that you are the best contracts and detail person he has ever taught. What I need is someone to keep track of all of this stuff so I can do what I do. When you get comfortable with this stuff, I will probably want you to negotiate some of the contracts and see that the details are followed through.\"\n\n\"Seriously?\"\n\n\"Yes; but as I said all that, it sounds like I am just dumping a bunch of garbage on you. Maybe we ought to bump this up to 200 grand.\"\n\n\"Let's leave it where it is. You have blown me away so far; I don't want to rattle things yet. Is there any travel? If so, a laptop would be good. If not, I am comfortable with a desktop.\"\n\n\"Ok. Then we will get both. I will let you choose the software that you prefer. Now about an office...I assume that you are free to travel some, if needed?\"\n\n\"Yes, of course. I haven't been many places before but I would love to travel some.\"\n\n\"Good. We will need to get you a passport. Now...\"\n\n\"A passport! Like to travel to Mexico and places?\"\n\n\"More like Europe. There may be a couple of things developing there but they are still preliminary. Now about your office.\"\n\n\"I will work where you tell me to work. Where is that?\"\n\n\"It isn't quite that simple. You see I work out of my house and it is sort of out in the country about 60 miles from here. You might not feel comfortable working where I live since I live alone. There is a small town about fifteen miles from my house. We can set up an office for you there if you want to relocate or we can set you up here in the city if you prefer to stay here.\"\n\n\"At one time, I thought that the city was the place to be but I have lost that desire since I have lived here. A small town feels much more like home to me now. But I am more concerned about working in your living space. I could get a place in the town and work out of there. How does that sound?\"\n\n\"We can do that except that I would prefer that you have a somewhat formal office somewhere. There will be people coming to see you. Lawyers and folks like that.\"\n\n\"I see. But that would be the same for your house too, wouldn't it?\"\n\n\"Yes and no. It would except that I have a separate building that I intended to be my office but I never moved my stuff there. It just sits empty with some junk stored in there now. The other thing is that I travel a lot; probably about two thirds of the time. So, I will not be under foot very often.\"\n\n\"I guess that perhaps I ought to take a look at the town and what is available and also at the office you have before we decide. How is that?\"\n\n\"That would be fine with me.\" He frowned for the first time. \"There is one more thing that we haven't talked about but it is very important to me.\" He was obviously struggling with himself as she wondered what might come next. \n\nHe looked into her eyes, which immediately told her that he was about to tell her something very important. \"The thing is... the thing is that I am a very private person. What I do and all of the stuff you will find out about, I prefer that it not be shared or discussed with anyone else. I am a private person; my neighbors and most of the people I come in contact locally just know me as Jeff, a local guy who travels a lot. They don't know what I do and I want to keep it that way. Is that a problem?\"\n\n\"I don't know why it should be. I am kind of private myself and we took a whole semester discussing lawyer/client confidentiality. I guess since I don't know what you do, it is hard to say much else.\"\n\n\"Thank you. To reassure you; there is nothing illegal or dishonest or anything like that. There are a few exceptions but basically, I seldom work around here. I do most of my work elsewhere. When I am home, I want to be home; if that makes sense.\"\n\n\"It does. Now I guess we should discuss when you want me to start.\"\n\n\"As far as I am concerned, you started when you walked in the door with Doc Miller.\"\n\n\"But I feel like I need to give the bank two weeks' notice. In fact, I need to leave or I will be late for work.\"\n\nHe handed her a cell phone. \"Call your boss. That has been taken care of.\"\n\nShe took the phone while staring at him. \"Hello, Mr. Williams. This is Hannah...Yes. Yes. Are you sure? I don't want to leave you short-handed. Yes, sir. Yes sir. Thank you, sir.\" She hung up with her jaw still hanging open. \"What just happened. I mean, what did you do?\"\n\n\"I didn't do anything. Doc and I have been talking about you for some time. Last week, something came up and I decided for sure that I needed you and told Doc to set up this lunch for today. He did and called the president of the bank and told him that I was going to hire you away from him. He started to balk until Doc told him who I was. I am a customer of the bank and they don't want to piss me off. So, you started when you agreed to meet me and walked through the door. So far, I am not disappointed at all.\"\n\nShe was still staring at him and unsure of what to ask. \"Ok; what's next?\"\n\n\"Next is that you have your last classes tomorrow to finish up your degree. I hate to ask this but I need to leave again on Monday; can you come to my place on Saturday and let me show you what is in front of you?\"\n\n\"I can come tomorrow, if you want?\"\n\n\"Actually, I am staying here in town tonight and won't be there until late tomorrow night. Saturday morning would be better. Here is a map and directions to my house. If you can, come around ten and we will have breakfast before I unload on you.\"\n\n\"That would be fine.\" Hannah still wasn't sure exactly what had just happened but she was beginning to eagerly look forward to Saturday.\n\n\"Do you like music and concerts?\"\n\n\"Yes, very much. I haven't been able to go to many concerts but yes.\"\n\n\"There is a concert tomorrow night at the performance hall, here are four tickets. Take your girlfriends and have a good time.\"\n\nShe looked at the tickets and almost fainted. \"These are for the Miles of Music concert. It has been sold out for months. I hear that they put on a fantastic show.\"\n\n\"Then enjoy yourselves. Now, I have to get going. Work never stops for the weary.\" He smiled his warm smile. \"I look forward to seeing you Saturday morning. And thank you for being you. I can usually work with almost anyone but I was hoping that you were someone that I could also feel comfortable with. You make me feel very comfortable.\"\n\nWith that compliment ringing in her ears, Hannah walked back to her car to drive to her apartment. Before she left the parking garage, she had to stop and scream. All of her hard work had paid off in a job, a seemingly wonderful boss, and now a chance to see a great concert with her girlfriends to celebrate. \n\nShe left early Saturday morning with the sounds of the concert still ringing in her ears. Not only was the music wonderful, the seats were in the center of the fifth row with a perfect view of the various antics of the musicians. She and her friends had a great time and had each bought several of their cds when they left. The glow was still with her but she tried to stay focused on her driving and what was about to unfold for her. The more she thought about Jefferson McDaniel, the more excited she became. He was tall, handsome, and obviously successful. And she was going to become part of whatever he was involved with. She had wanted to blurt out about her meeting to her friends but restrained herself because of his serious desire to remain private. She simply told them that he was a successful businessman who needed a lot of legal help. She felt comfortable leaving it at that although they had warned her about lecherous rich guys and horror stories about young women being taken advantage of.\n\nShe had carefully reviewed everything that had happened and had been said but could find no hint of malice in him at all. In fact, she almost wished that he had shown more interest in her personally but then she just set that aside as being fanciful thinking.\n\nThe drive was pleasant and she looked around the small town with interest as she drove through it. It reminded her of a more prosperous version of her own hometown. That made her feel very comfortable. The drive to his house was on a typical two-lane, tarmac road that she was familiar with from her home. What wasn't familiar to her was the entrance to Jeff's property. It was a simple but elegant entrance with a cast iron gate. The drive was lined with crepe myrtles in bloom with each one surrounded by a well-maintained garden of red and gold flowers. The house wasn't visible from the road however, so she still didn't know what to expect as she pulled up to the call box in front of the entrance.\n\nShe pushed the button and immediately she heard, \"You are early but come on through. The door is open; come in. I need to finish dressing.\" Then the gate swung open and she drove through.\n\nThe driveway went several hundred yards into a line of trees and then turned left another hundred yards along. When she made the turn, her heart almost stopped. It wasn't that the house was big although it was big enough. It was a classic log cabin with an A-frame front and large windows. Each side had a wing with a number of windows looking out over more well-tended gardens. The circular drive led to the front entrance which was reached with several steps up to a covered porch. She had seen many log cabins in her life but none seemed to fit the property and the environment as well as this one did. ",
        "She parked in front and then noticed sitting off to the side another log house that was at least two or three times larger than her two-bedroom apartment. She wondered if this was the office he had talked about. If it was, she already knew that it would be where she would be working and couldn't be more pleased.\n\nShe entered the front door to find herself in a great room that ran almost 50 feet to the back windows while looked out over a patio, pool, and more gardens. Not knowing where to go, she simply stood inside the door and looked around the room. It was obviously a man's room but not overly masculine. The prints on the wall were a mix of classical ones as well as modern pieces. The furniture was comfortable and on the casual side. On one wall, there was an entertainment center along with a first-class sound system. A large dining table that would easily seat twelve people was placed looking out the back windows. She idly wondered if this private person had ever had twelve people for dinner. In spite of his statement of privacy, she felt that he had hosted meals there more than once.\n\nHis voice distracted her as he entered from the wing on the right. Again, he was in jeans and a knit pull-over work shirt. \"Come on in the kitchen while I do breakfast. We can eat in there. Any problem finding the place?\"\n\n\"No, none. I love the town and this place is just beautiful. Did you build it?\"\n\n\"Sort of. The structure of the house was already built but not finished. The builder went broke before he could finish it. I bought it and had the finish done myself. Is there anything that you don't like for breakfast? I like my eggs scrambled; is that all right with you?\"\n\n\"I like mine scrambled too and anything else is fine with me. You seem tired. Did you get in late?\"\n\n\"Yeah, I did. I expected to be home by one but it was two thirty before we got everything loaded. I didn't get here until after three.\"\n\n\"Oh; you were working last night? You didn't say.\"\n\n\"Yes, I was working. I am training a couple of new guys and it takes time for them to figure out the most efficient way to do things.\" He paused for a moment. \"How did you like the concert?\"\n\n\"I loved it and it was so much fun to share it with my friends. They aren't that much into the more classical music but they really got into it. It was great fun.\"\n\n\"Good. I'm glad you liked it. It will make some things easier for you.\"\n\n\"Really? What do you mean?\"\n\n\"The work I was doing last night was back stage. I saw you and it looked like you were enjoying yourselves.\"\n\n\"You were working back stage? Is that one of the things you are involved in?\"\n\nHe wiggled nervously before he said, \"You can say that. I sort of created it and act as the producer. The new interns will soon take over part of the on-the-road shows but until they are ready, I do it.\"\n\nHannah went totally silent. He finally looked towards her to see her reaction. When he realized that she was simply stunned, he turned back to the stove to turn the sausage and start the gravy.\n\n\"You created it and produce it! Holy shit! Oh; excuse me.\"\n\n\"I know and use the words too. Don't worry about it. And yes, that is part of what I do.\"\n\n\"Only part of it! What else do you do?\"\n\n\"After breakfast, Hannah. We eat first and then we talk. Do you want to come over and fix your plate the way you want it?\"\n\n\"You expect me to eat when I just found out that my new boss is deeply involved in something as wonderful as Miles of Music?\"\n\n\"As a matter of fact, yes. Get over here and eat. Trust me; the glamor will get old very quickly; it is a lot of work.\"\n\nHannah rose and went to get her plate. Then she turned to him and said, \"You are probably right but right now, at this minute, I am in awe. Let me have that for a few minutes. Please?\"\n\n\"Ok, but after breakfast, you become part of the team that makes it happen. Got it?\" His words hit her almost as hard as his previous announcement.\n\nThey ate quietly as they each concentrated on their own thoughts. Surprisingly, Hannah realized that the breakfast Jeff had prepared was excellent. It struck her that he couldn't possibly be this perfect. It now became her mission to find out everything she could about this man who preferred to be anonymous to the world. With that in mind, her mind calmed down and she began to focus on where to start.\n\nWhen they had finished, he poured them each another cup of coffee and sat back down. \"Ok, where do you want to begin?\"\n\n\"Let's start with Miles of Magic. How did you get involved with that?\"\n\nJeff smiled and replied, \"I guess that is the best place to start since it is the most complex thing I do.\" He paused for a moment and sat back, allowing his memories to come to the forefront of his mind. \"I was traveling a fair amount about fifteen years ago. With little to do in strange places, I would find bands that played in hotel lounges and local bars. Most of them were rock, folk, or country bands. Sometimes I was the only person in the room listening to them. They would talk to me directly and I would talk back. Sometimes I would suggest a song and they would try it out. Since I would stay in an area for a couple of weeks, they would invite me to clubs where they were playing or parties with other musicians. It was fun.\" He paused.\n\n\"Are you a singer or a musician then?\"\n\nHe snickered, \"Not hardly. I sang in choir in high school but I doubt that anyone would go out of their way to hear me sing and I can't play an instrument at all. I just have an appreciation for good music at all times. Understand that there are a lot of good quality musicians and singers out there. Some are better than others but most just lack something, some quality that sets them apart. Some don't have the motivation or patience to breakout; others just don't find their niche. Anyway, a couple of the bands asked if I knew places in other areas that they could play. So, I started asking at different clubs and lounges and got a few gigs for some of the groups. One day a lounge manager at a hotel asked if I could get a group to play for a special festival that was coming up. He wanted a mix of different kinds of music, some fun stuff, and mainly some dance music. None of the bands I knew had that much variety but if I combined three or four of them, we could put it together. So that is what I did and it proved to be a great success. The lounge made money, all of the players made money, and they gave me a nice cut for putting it all together. They played together mixing more and more things together and adding more humor and fun until they got tired of traveling and that pretty well ended it.\"\n\n\"That doesn't sound at all like Miles of Music.\"\n\n\"No, it doesn't but the idea of mixing different styles to create a fun evening for the audience had worked. I had to go to Europe for a month and that was the eye-opener for me. Over there, music isn't as tightly classified as it is here. People go to classical concerts in casual dress and sing along or dance as the music fits. It was really a fun time. When I got back home, some of the more serious musicians and I got together including some of their serious classical music friends. They were talking about how hard it was to get paying gigs because the audiences tended to be so small. The big civic orchestras were all constantly struggling for funding and most of the musicians had regular jobs teaching and other things. The lounge owner from before called and asked if the bands would come back for another festival but that it was to be outdoors and during the day. I suggested that the original group wasn't available but that if he was willing, we could try a different concept. He said yes and the rest is history.\"\n\n\"Wait a minute; you just skipped over a lot of stuff. Explain.\"\n\n\"It really wasn't that much. There have always been cross-over songs and classical orchestras have played \"Pop\" concerts. But recently that has been more of trend towards what is called Classical Crossover. I got several of the classical musicians together and asked how we could put something together that would be serious but also fun for the audience and still be economical since the gig was almost a thousand miles away for them. The answer came fairly easily. The core group would create the program and put together the music. Then they would contact local musicians there to fill out the orchestra. So only about ten people actually had to travel and live out of a hotel. They went up a week before and worked with the local musicians to bring it all together. Since they were all serious musicians, that was all it took. One of the violinists was somewhat of a ham and showman so, he took on the role of conductor but every musical section had their moments to shine. All I had to do was coordinate everything. When it was over, we were all exhausted but higher than a kite and wanted to keep doing something like this.\"\n\n\"Where did the name come from? Miles of Music is kind of odd.\"\n\n\"When they were packing up to leave, one of the musicians said 'This has been a lot of miles to travel to just make a little music.' So, it became Miles of Music. Now we have several groups of local musicians across the country who participate. Most of the musicians you saw last night are local. The core group is the only one that travels.\"\n\n\"I see. How is the group organized? I mean, did you incorporate or something?\"\n\n\"No; that seemed like a lot of unnecessary work at the time; sorry, lawyer lady. Basically, every concert and event is a stand-alone entity. We know who was involved in it and they get a percentage of the revenue based on a formula that everyone has agreed on. When we started recording and doing videos, the same carried over. Those who participate earn royalties on everything they participate in. In general, everyone is happy. The local people play and generally make more than they can as a soloist at home. The core group people are now basically a full-time but they still do their own things at their home base.\"\n\n\"And you are the producer?\"\n\n\"Yes. I am the contact for the group and coordinate with the core people. We all agree on doing an event and how we will prepare for it. Then they do the musical work and I coordinate with the venue and sponsors. A lot of that will now be on your shoulders.\"\n\n\"I see. That sounds interesting. I am eager to dig into the details.\"\n\nHe grinned. \"You say that now but you might be pulling your hair out before it is all said and done. Come to think about it; I am going to Pennsylvania since we are doing a concert there next Saturday. Why don't you come up on Wednesday and see how it works in real life?\"\n\nShe smiled broadly, \"I would like that very much. What else do I need to know?\"\n\nHe thought for a minute before he replied, \"This is the busiest part of my life because of the travel and details. The other things are less intensive but just as important to me. But let's take another cup of coffee into the office and talk. Things will be easier in there; I think.\"\n\nThey refilled their cups before he led her down the hall to a room at the end. She immediately recognized that this was where he had his \"office.\" There was a table on each of the side walls each piled with envelopes, letters, and assorted things. On the far wall were two tables stacked with similar items but twice as high. In the middle was a table-like desk with a computer and nothing else on its surface. She wondered if she could find enough trash bags to use since she had a feeling that her first job was going to be sorting through this room.\n\nWhen she let her eyes focus on the walls, she was surprised again. Over one of the side tables were several framed book covers that she recognized along with a movie poster for a very popular movie. Over the other table was a number of photographs of singers and bands along with what appeared to be two gold records. If there was something on the back wall, she couldn't tell because of the stacks of paper on the tables.\n\nBefore she could say anything, Jeff spoke up defensively, \"Before you panic and scream, there is rhyme and reason to this and it isn't as bad as it looks.\"\n\nShe couldn't stifle her giggle. \"You are going to have to prove that before I will believe you.\"\n\n\"Ok, smart ass; I will. This table is stuff about my writing projects. This table is about my songwriting stuff. Those back there are about Miles of Music. None of this stuff is current or pending. Mostly it is just stuff that I don't know what to do with. That filing cabinet in the closet has all off the current and pending project documentation in it. Top two drawers are Miles. The third one is writing and the bottom one is songwriting. The other cabinet has projects that are complete. See; it is organized and under control.\"\n\nShe continued to giggle lightly as she said, \"Organized? Maybe. Under control? Wait a minute, you write things like books and songs too?\"\n\n\"Yes. That is kind of how I got started with all of this. I wrote a book, it sold pretty well, and then got bought by a movie company. That is the poster on the wall. I don't write the music of course, but I wrote the words and someone else wrote the music. They did pretty well too. Now Miles takes up most of my time but I want to get back to writing more. I have a couple of stories that need to be told. Satisfied?\"\n\n\"At this moment, I'm not sure whether to be embarrassed at teasing you or shocked at the diversity of things you have been successful at. And I still can't believe that you want me to get involved with all of this. Are you sure?\"\n\nHe became serious as he replied, \"No; I am certain that I made the right choice. The only issue I am concerned about is getting you through the newness and surprise so we can move forward. That is why I didn't want to talk about this outside of here. And as I said, I don't talk about it often or to too many people period.\"\n\n\"But a lot of people must know you because you obviously have been involved with a lot of people. Don't they know or ask about all of this?\"\n\n\"No, for two reasons. First, most people only know me through one thing and they know me by various names. Secondly, I don't wear any of this on my lapel. If you want a simple statement, it would be that I want people to know me because of what I do, not because of who I am. I want the work to speak for itself. Being a personality is not something I aspire to be. It just gets in the way of the work.\"\n\nIn a flash, a number of things that she had been told in the past several days became meaningful to her. Doc Miller had told her, \"... you don't really understand yourself or the life you have chosen to pursue. You are one of the hardest working students I have ever had. You don't give up and you take care of the details that most students ignore. If you get into a high-profile law firm, you will have to become a smiling face that attracts new clients and pay just enough attention to details to insure a continuous flow of billable hours. Frankly, I think that you would burn out in that world.\" \"...An opportunity like this won't come along very often but it is the world you are best suited for. For now, at least consider what Jeff has to offer. You might be surprised.\" And Jeff had told her, \"I have gotten to the point where I can spend all of my time taking care of these things or doing the work that I do best.\"\n\n\"I am sorry for laughing; I wasn't laughing at you. I am just blown away by the scope of things you have done. You should be proud. As for me, I look forward to learning everything I can and taking over the details that are getting in your way. I have a lot to learn though. I hope you can be patient with me.\"\n\n\"Hannah, I am proud of what I have done; very proud. But I don't dwell on it. I call this my Ego Room because this is where my memories are kept. Outside of this room, I am Jeff McDaniel, a guy looking for the next opportunity to make a difference. These other things might help new things to be accepted more easily but they won't make my future work any better. When I stop growing, I will start dying.\"\n\n\"Then let's keep you growing. What's first?\"\n\nThat began a three-year odyssey for both Jeff and Hannah. She learned quickly that his new pursuits included two new novels and several songs along with additional Miles of Music shows. After the Pennsylvania concert, they went into New York City for a day to talk with the publishing house about the contract for the new books. The next week, she was on the phone to the managers of several well-known bands about recording the new songs. She had to call Doc Miller a couple of times for clarifications on a number of issues since he had been Jeff's advisor for a number of years. \n\nIn the process, she also discovered that a couple of Jeff's anonymous affectations included the fact that he had no idea how much money he had or was worth and that he went under several pseudonyms in his activities. Whether by chance or intent, the Miles of Music people knew him as Mack Daniel. His books were published with the author shown as Blaine Daniels; Blaine being his middle name. His songs were credited to JB McDaniel. That gave meaning to his words, \"...known by various names.\"\n\nWhen she went into town, she discovered that he was also surprisingly well-known in the local community but mostly for his generosity as he supported the local high school with funding for computer systems, upgrades to audio-visual equipment, and sponsorships for their yearbook, school dances, and prom for which he frequently provided a regionally well-known band to play. He also regularly hosted a dinner for students who were successful or showed promise in one area or another. By then, it didn't come as a surprise to Hannah that he prepared the meals for these dinners himself although she wondered where he learned to cook.\n\nHer ventures into town had started with her looking at apartments and perhaps an office. That brought her into contact with a variety of local people who were surprised to discover that she worked for Jeff but readily accepted her as part of the community as a result of that connection. She was still commuting each day from the city until she finally found her way to the adjacent building that Jeff had offered as a potential office. What she found was a fully furnished guest house that appeared to have never been used. Jeff finally admitted that he hadn't invited anyone to stay there because he was gone so much and offered it for her to live in rather than trying to find a place in town. She readily accepted his offer and moved her belongings in the next weekend. She set up her personal office there but usually spent a lot of time in Jeff's \"office\" looking through past contracts and sorting the volume of mail that he received.\n\nAs he had promised, he traveled between two and three weeks each month, although they communicated daily by e-mail and a private social message service. After the first month, Hannah had cleared up the clutter in Jeff's office while discovering literally hundreds of thank you letters from individuals and communities addressed to Miles of Music for their recent performance. She dutifully organized them in sequence and created a historical notebook of memories.\n\nWhen Jeff returned from a trip, she let him wind down and rest before they sat down to go over important issues that had arisen. She was surprised at how good his memory for people and places was when a request for an interview or a concert was solicited. Jeff admitted that he no longer wanted to do public appearances and would only do radio interviews over the phone. When asked to do a television interview about his latest book, Jeff told Hannah to do it since it was an important show. He basically told her what was on- and off-limits to talk about. By now, she was very comfortable with his efforts to retain his privacy. As a result, she became a frequent interviewee on both radio and television for her reclusive boss. She did well enough that she gained a small following in her own right.",
        "That morning as she entered the house, she went straight to the kitchen. Up until now, he usually made breakfast for both of them when he was in town. Today, she was going to make their breakfast. Since he usually appeared around ten, she set about having the coffee ready when he came out and had the rest of the makings ready. She heard him padding his way in that direction but he stopped at the doorway.\n\n\"What are you doing?\"\n\n\"I am making breakfast today. You got in late, so here is your coffee. Park it and let me do my thing. I'm not a bad cook either but not in your league. How did you become such a good cook?\"\n\nHe sat down with his coffee, shrugged, and said a little off-handedly, \"I started when I was younger and then later, I worked for a while as a cook. I used to hate it but then when I started traveling and trying foods in different places. I got interested again and started collecting recipes to try. I have a couple hundred on my computer.\"\n\n\"Interesting. So how was this trip?\"\n\nHe was silent for a moment. \"The concert was good but a couple of issues cropped up. We will talk about them after we eat.\" They both said those last three words in unison and then broke out in a laugh.\n\nWhen they refilled their cups and went into his office, he began. \"At our pre-concert meeting, a couple of the core people said that they had some conflicts coming up that might affect some of the concerts on the schedule. One woman is in a wedding and another one is taking his daughter off to college. These are just one-off kinds of things but I suspect that there will be more as time goes on. This core group has been together for three years and are really good but it dawned on me that we are asking a lot from them. Since we have more requests coming in than one group can manage, maybe we should set up two or three core groups, perhaps regional ones. We have the local musician contacts to do more requests but we are short on the core people. What do you think?\"\n\n\"Actually, I have sort of been thinking about something like that. By the way, we got five more inquires while you were gone. They all look good but are spread out across the country; two on the west coast, two in the mid-west, and one the east coast. Oh, and we have been contacted by three hotels about New Year's events. They are each talking about a very nice payday. Take a look at some things I have been working on. This is a map for the past three years of where the concerts have been held. The color of the mark indicates the ticket sales and audience size. The nice thing is that the audience has been growing as have the revenues but some areas are still weaker than others. The other paper is a breakdown of the cost of each event. We have added some specialty acts and guest artists along with some lighting and production upgrades. Frankly, if we continue as we are, we either need bigger venues or a bigger guarantee.\"\n\n\"That's interesting. I kind of had a gut feeling along those lines but it is great to see that you worked it out like that. If we added more core groups, would that have an impact?\"\n\n\"That's a little hard to predict but if we had regional cores, we could cut the travel and hotel costs quite a bit. But if we added more events in all areas, that could make the overall more productive. BUT...you are going to have to pull back some. You can't do what you are doing now with that many events.\"\n\n\"Thank you, mother.\" She swatted his arm and then pulled back in horror. \"I am so sorry. I shouldn't have done that.\"\n\nHe laughed, \"Hannah, you are completely free to tell me what I need to do and react to my reaction the way you want. I know that I can't do that many but you know as well as I do that I will try. Yes, part of this will to be to add more producer/stage managers. The more we get into this, the more potential I see. It is tempting to just jump into it with both feet but even I know that this would be a mistake. Go ahead and put all of the requests down on a schedule and let's see what the potential is. I'll call the group and see if they know people in other areas that might be interested in being in new core groups. You are doing good work and I appreciate it.\n\nHannah felt a surge of pride when he said that. \"Ok, now to other things, your new book will be out in three months. They want you to do a round of interviews before the launch.\"\n\nHe sighed. \"The short answer is, 'no, I don't want to' but I know that I need to. Will you do the travel and primary interviews? Perhaps, I can be available for a phone segment.\"\n\nHannah thought rapidly. \"If you could do at least part of it that way, I can handle the rest I think. Let me see what I can work out.\"\n\n\"Thanks.\"\n\n\"Last but not least, your financial stuff is a mess. I am going to organize it and make sure that you stay solvent. Any problems with that?\"\n\nHe laughed. \"That might make you an old woman before your time but go ahead. I'll leave you the name of the tax guy I have used before. He has most of the tax records. You should probably also set up some investment accounts. I have kind of put that off until later. So now would be a good time to become later. I will tell you that I do have one investment account which I treat kind of separately. When I sold the rights to that book to the movie company, they paid me a lot of money and I still get royalties from it. They go into an account which I call my personal count. That is what I bought the house with. The rest, just makes money and to be honest, I donate most of that to various people and places for things. Everything else is just sitting in several bank accounts.\"\n\nThat shocked Hannah totally. \"Just sitting in bank accounts? Not making any money?\" He nodded. \"That will change shortly.\"\n\n\"Yes, mother.\" She swatted him again and then they each got busy.\n\nIt took her three months to organize his financial affairs into a coherent structure. In spite of his generosity, he had accumulated a net worth in excess of twenty million dollars. It was now residing in several safe investment accounts rather than gathering dust in a bank. It came as a shock to her to realize that in spite of everything, he had overpaid his taxes nearly every year by ignoring or understating his charitable giving and business expenses. With the help of a new tax expert, they refiled his recent tax returns which resulted in a two-year prepayment of his taxes due. \n\nAs this effort was winding down, he told her to reserve twenty-five hotel rooms and a conference room after their upcoming concert in St. Louis. When asked, he smiled and said, \"We are bringing in twenty new core people to meet with us and our existing core. Most of the talk will be done by the musicians but we need to talk to them about the mechanics of how we work and the revenue sharing plan. Will you put a presentation together on that along with the potential schedule we have right now? By the way, after that, I will be going to Europe. There is growing interest there? I am going to see how that might work.\"\n\n\"Fine; just make sure that I get a trip to Europe out of it.\"\n\n\"If things go as I hope, you will be spending a lot of time in Europe.\"\n\nA month after the successful St. Louis meeting and decision to expand, Jeff asked her to meet him in the city for dinner one night. Not surprisingly, he chose the same restaurant where they met where he again ordered Steak Diane to her salmon. \n\nFor dessert, he took her hand and said, \"Hannah, it has been exactly a year since we first met here. I told you that I was certain about hiring you and you have proven your worth and value a dozen times over and I don't have the words to tell you how thankful I am that you came into my life. Our agreement was for salary, benefits, and a bonus. Here is your bonus for this year and it represents only a partial sign of your value to me.\"\n\nWith tears glistening in her eyes, she slowly opened the envelope to find a check made out to her for five hundred thousand dollars. That was when her hands began to shake. He had told her often enough how good she had done and praised her for special efforts but this was the first professional and tangible sign that she had been successful. That made her already warm heart grow fonder of her boss although he wouldn't let her call him that in person. She only used that when she talked to others about her work and relationship with the notorious recluse.\n\n\"Jeff, if you must know, this is important to me because it tells me that I am doing good work for you but to be honest, just having dinner with you like this is just as important. I love our working relationship but I also love our personal relationship just as much.\"\n\nJeff turned red and began stuttering which she now realized was a sign that he was facing some personal turmoil. \"Han...Hannah, I um...I...crap! I don't do this very well. Sorry. I...um I like both of our relationships very much too. Um...When I am home, do you suppose that we could go out to dinner like this more often?\"\n\nHannah was surprised at the difficulty he was having asking her for a simple dinner date. Then it dawned on her that the one thing that she had never even thought about was that he seemed to only have a work life. She had never heard even a hint of a social life. She decided to keep her response very simple and replied, \"I would like that very much.\"\n\nThat seemed to relax him and he returned to his normal demeanor. But her woman's intuition was now on high alert and her antennas were tuned onto Jeff like never before. There was a huge part of his being that was missing and she was determined to find out what that was.\n\nEven though she checked around the house and office, she found no signs of his childhood or even college years. He obviously had a past but had none of the usual symbols of this part of his life. The first crack in this mystery occurred when Jeff was on his second trip to Europe. The local sheriff called and asked for Jeff. Hannah told him that he was overseas and asked if she could help him instead.\n\n\"Um...This is a little awkward. You are his lawyer, aren't you?\"\n\nHannah thought for a moment before answering, \"I am a lawyer and work for him but I am not his official attorney of record. I will be talking to him later tonight, if you need to talk to him personally. He can call you in the morning.\"\n\n\"Hmm... Well, I don't know what is right in this case. It seems he might be the only relative of a woman who just died south of here. The sheriff down there asked me to help track him down to see if he is the right guy and what he wants done with the body.\" \n\nHannah was shaken since she had never heard of an aunt or any other relative. \"Are you sure that it is this Jeff McDaniel?\"\n\n\"Truthfully, they don't know for sure if it is or not. One of the members of her church said that she raised her nephew until he got out of high school but he left and hasn't been back since. They asked me and others to check out any local Jeff McDaniel. There aren't a lot of them.\"\n\n\"Hmmm. I'll talk to him tonight and if he is the one, I'll have him call you in the morning. How is that?\"\n\n\"That would be fine but have him call this guy. He's the sheriff down there. I'd just be a middleman.\"\n\n\"Fine and thank you.\"\n\nTwo hours later, Jeff called. Hannah knew that it must be after 2:00 AM and he sounded very tired.\n\n\"Hi. How is going today?\" His weary voice asked.\n\n\"Nothing major but perhaps something personal. Do you have an aunt down south?\"\n\nThe silence that followed told Hannah that he was the right Jeff McDaniel and that there was a story about come out that she hadn't heard.\n\n\"Yes; is she...all right?\"\n\n\"Jeff, the sheriff down there has been calling around trying to find you. She passed away and they want to know what you want done with the body. Can you call him in the morning?\"\n\n\"Yes. Certainly. Um...Hannah, if necessary, can you go down there and take care of any details? I can't get back for a week or more.\"\n\n\"Sure. Jeff, I told the local sheriff that I am an attorney and I work for you but that I am not your attorney of record. You might need to tell him that so I can act in your absence.\"\n\n\"Fine but figure out what we have to do to make you my attorney of record. I trust you to make any judgement in my place. I'll call you after I talk to the sheriff. And, Hannah...thanks.\" Then he hung up.\n\nAs Hannah put down her phone, she realized that the door to his past has been cracked open at least a little. She thought through how she should handle this and quickly came up with a list of questions that she would need answers to. Then she finished her work and went to bed.\n\nJeff called her shortly before ten the next morning. He sounded much less tired than before, so she assumed that he had gotten some rest. \"I talked to the sheriff and confirmed that she is my aunt and that you would be down there today or tomorrow to make arrangements.\"\n\n\"Good. I thought of a couple of questions that I ought to know before I go. But first, what do I need to know about her?\"\n\nHe paused before answering and then said quietly, \"Hannah, to be honest I don't know a lot to tell you. She was my mother's sister. My parents were killed when I was ten and she came to raise me. She was a decent woman who didn't talk much about herself. She worked at the grocery store and went to church. When I graduated from high school, she gave me a thousand dollars and said that I ought to join the military or go somewhere else since there wasn't much future there. So, I left and joined the Navy. About ten years ago, her minister called and said that she had been diagnosed with Alzheimer's and asked what I wanted done. I went down there and had her admitted into a care facility. She didn't recognize or remember me. We weren't very close. That's about it. I have paid the treatment facility for her since then.\"\n\n\"What about any other relatives? Does anyone need to be notified?\"\n\n\"Not that I know of. She never married and there were no other relations that I know about.\"\n\n\"So, you want to have a local funeral home take care of arrangements and bury her in the local cemetery?\"\n\nHe was silent for a minute. \"My parents are buried there; I guess if a plot is near them, that would be best. Hannah...I am putting you on the spot here. I know so little about any of these things. I was young when all of that happened and my aunt never wanted to talk about this kind of stuff. I feel kind of stupid and helpless.\"\n\n\"Jeff; let that go. You can't know what you don't know. I'll go down there and find out what I can and arrange things. Don't feel bad or anything. I'll take care of it.\"\n\n\"Thank you. Just do what you feel is best. I have never had to deal with something like this but I doubt that you have either. Call me if you have any questions.\"\n\n\"Jeff, just take care of yourself; I'll take care of this.\" That ended the call.\n\nIt turned out that Jeff's home was seventy-five miles from her own hometown, so Hannah decided to drive down and take care of Jeff's needs and then spend a couple of days with her parents. She packed and left at noon. At three, she parked in front of the sheriff's office. The town was not dissimilar to her own. It was worn, dusty, and showed few signs of growth. She suspected that it looked very similar to the day that Jeff left.\n\nThe sheriff was cordial and they quickly took care of the arrangements with the local funeral home. It turned out that there was a family plot at the cemetery with an empty space next to where Jeff's mother was buried. Unfortunately, the sheriff had no memory of Jeff or his family but suggested that she visit with the school counselor since she had been involved at the school for over twenty years. Perhaps she could answer some of her questions.\n\nThe next morning, she arrived at the school shortly after eight and asked to see the counselor. She was quickly shown in to the office of Mrs. Martha Cushman, a grey-haired woman in her sixties who had a warm smile and a long memory.\n\nWhen Hannah explained her reason for being there and asked if she remembered Jeff McDaniel, the warm face darkened slightly and her memory went into overdrive. \"Oh my; I most certainly do remember Jeff McDaniel. It was my first year here as counselor when his parents were killed. His father was the band director at the high school and his mother taught piano. They were driving back from a football game when their car was hit by a drunk driver. It was the first time I had to counsel a child who had lost his parents. Jeff had been a good student but a very shy one. He seldom spoke up in class and never got in any trouble. The only emergency contact we had was his aunt. She came and said that she would take care of him. She was kind of an odd person. She showed little personality, was very quiet, and only went out to go to church. I used to ask her about how Jeff was doing and she would simply say, 'I haven't heard from him.' That was it.\"\n\n\"How did Jeff react to this change?\"\n\n\"He was obviously lost with this new set of feelings. He still did his work and made decent grades but seemed to recede even more from the other kids. That continued through high school. The only thing he participated in was choir. He worked after school and that was it. I often brought him in to talk. He didn't seem to have a dream about what he wanted to do after high school. I suggested that he might consider the military since a lot of the kids from here go there because college is not much of a reality for many of them.\"\n\n\"Did he have any other relatives that you know of?\"\n\n\"No; neither he nor his aunt ever mentioned any. I have often wondered how he turned out. Since you are his attorney, I take it that he is doing well?\"\n\nHannah smiled and simply replied, \"I think that you would be very proud of him; yes, he is doing very well.\"\n\n\"I'm glad to hear that. When you talk to him again, tell him 'hi' from me.\"\n\nAs she left the school, the sheriff was standing by her car. \"If you aren't in a rush, the county attorney would like to talk to you. Another issue popped up. He's waiting, if you are free.\"\n\n\"I am here to take care of all of the business that needs to be taken care of. Let's go.\"\n\nFive minutes later, she was seated in the county attorney's office along with the sheriff.\n\n\"Thank you for coming in, Miss Bell. Give our regrets to Mr. McDaniel over the loss of his aunt.\"\n\n\"Thank you; I will. The sheriff says that there is another issue?\"\n\n\"Yes. It turns out that his aunt passed without a will. The house she used to live in is now vacant but it turns out that the owners are still listed as Will and Margaret McDaniel. I presume that they are Jefferson's parents. To date, the taxes have always been paid annually, so there isn't an issue there but do you know what he might want done with the property?\"\n\n\"Frankly, he didn't mention it. Do you have any suggestions besides trying to selling it?\"\n\n\"That is what I wanted to explore. The sheriff has been trying to organize a sports program for the youth here to keep them out of trouble. The house is located next to the sports fields. The county has some money available to buy it if the price is agreeable. Do you think that he might be agreeable to consider this offer?\"\n\nHannah thought for a moment and then said, \"Let's find out.\" She took out her phone and punched his number. He answered on the second ring.\n\n\"Hi; is everything all right down there?\"\n\n\"Yes. Your aunt will be buried next to your mother and the funeral will be Friday. I checked with the counselor at the school to see if there might be any other relatives to notify. Ms. Cushman said 'no' and also said to say 'hi.'\" He started to speak but she cut him off. \"Right now, I am in the county attorney's office and the question about the house came up. It appears that it is still in your parent's name. The county would consider buying it for a reasonable price to be part of a youth sports program they are trying to create. What do you think?\"",
        "Jeff was silent for a moment and then said, \"Do what you need to do to donate the house to the county for that purpose. Then write them a check for $25,000 to support the program. I give you authority to sign my name for this.\"\n\n\"Mr. McDaniel, this is the county attorney. Thank you very much for both donations. These will go a long way towards bringing this project into being. I will see that you get the appropriate donation receipts for your taxes.\"\n\n\"Thank you. Give them to Hannah; without her, I would lose them. Anything else Hannah? I need to run for a meeting?\"\n\n\"Nope; I think you just brightened their day. I'll be in touch.\" The phone went dead.\n\nThe attorney said, \"Miss Bell, I can have the papers drawn up for your signature by Monday. Will you be in the area?\"\n\n\"Actually, I will be about seventy-five miles away visiting my parents. I will be back Monday morning and bring the check for the donation.\"\n\n\"Excellent. Say, ten o'clock?\"\n\n\"That will be perfect.\" They all shook hands.\n\nThat Jeff donated the house and the money came as no surprise to Hannah. It only made her wonder more deeply what the depth of his memories and feelings were of his early home. She now knew a couple of things about his youth and they did not surprise her. She had known many shy people who blossomed later in life. Most of them however, had found and even sought avenues to some degree of fame in some field. She wasn't sure why Jeff had sought success but shunned the limelight.\n\nHannah spent a relaxing weekend with her parents. While there, she idly asked them about people who shunned the limelight without mentioning who she referred to. Both her mother and father gave different answers that shed some possible light on the issue but not a definitive one. Her mother suggested that many people felt that notoriety invaded their privacy and therefore they avoided it. Hannah could acknowledge that this might be true. Her father suggested something slightly different that lingered in her mind. He had told her about a couple of people he had known at work who avoided recognition because of a fear of failure. If they became known for doing some things well, people would be disappointed in them if they did not live up to their history. They downplayed their successes so that the failures would not be magnified. That lingered in her mind because Jeff had mentioned several times about the details getting in the way of what he wanted to do. There was a possible connection in that train of thought.\n\nShe felt bright and refreshed when she returned to Jeff's hometown on Monday morning. As she entered the courthouse, she found Ms. Cushman standing in front of the car registration window trying to talk to the clerk. \"I don't know for sure, John. The car was delivered to my house Saturday morning with only this note. I don't know who paid for it. The guy who delivered it simply said that they were specifically told to deliver the car and note to me on Saturday morning. I know none of the other details.\"\n\nHannah's ears perked up and went up to the counselor. \"I couldn't help but overhear. Is there a problem, Ms. Cushman?\"\n\n\"Thank you, Ms. Bell. A car was delivered to me Saturday morning. All there was a note that said, 'I never thanked you for all you did for me.' It was signed JBM. It appears to have come from Europe. I don't know anyone in Europe. I have no proof of purchase or anything to document that the car is legal.\"\n\n\"May I see the note?\" The counselor handed her a piece of paper. Sure enough, the stationary was for a hotel in Hanover where Jeff was staying and even though the note was faxed to the dealer, the handwriting was unmistakable. She looked at the clerk and said, \"Please ask the county attorney to come help settle this.\"\n\nHe looked surprised but called the attorney's office. A moment later the man walked out and seemed to be surprised to find Hannah next to an almost crying counselor. \"What seems to be the problem?\"\n\nMs. Cushman poured out her story as before and restated that she had no idea who might have done this. The attorney looked at Hannah who motioned him aside. They stepped away and Hannah quietly said, \"I can't verify this for certain until I get on my computer but this note is in Jeff McDaniel's handwriting from the place where he is staying. I think that this is his way of saying thanks to her.\"\n\nThe attorney raised his eyebrow and replied, \"Any other time I would want further confirmation but I will take your word for it that this is genuine. McDaniel must be a very generous man.\"\n\nHannah simply replied, \"He is so much more than that. I will tell Ms. Cushman.\" \n\nHe nodded and turned back to the clerk and said, \"I am assured that this is legitimate. Go ahead and register it for Martha. Martha, you are a lucky woman today.\" He turned to Hannah and said, \"Come into my office when you are finished here. Everything is ready.\"\n\nShe nodded as the clerk began doing his paperwork. She gently took the counselor's arm and pulled her aside. The older woman looked at her with questions in her eyes. \"Ms. Cushman, Jeff said to say 'hi.' I think that he also wanted to say thanks to you personally. This was his way of doing that.\"\n\n\"Jeff McDaniel? He did this?\"\n\n\"Yes. I can't tell you anything else because I don't know anything but that is his handwriting and initials. He is staying at that hotel.\"\n\nMs. Cushman finally broke down in tears, not believing that something like this happened to a small-town school counselor. Hannah patted her on the shoulder and led her back to the clerk who was ready for her to sign the registration papers in several places. Hannah quietly took her leave with a smile on her face as she went to sign the donation papers on the house and hand over a check to help insure that the sports program got off the ground.\n\nThe drive home was pleasant as she had been part of Jeff's generousness. Now she just needed to find more about this elusive personality. She doubted that she could find out much about his naval career but she would give it a try when she got home.\n\nShe knew that he had a concert the previous night and she didn't expect to hear from him until much later or tomorrow but he called at 10 her time. \"Hi. How did everything go?\"\n\n\"Everything went fine and you made one school counselor very happy although I needed to help the process a little.\"\n\n\"Really! What happened?\"\n\n\"She went to the courthouse to see about registering it. But they needed some paperwork to verify that it was a legal transfer. All she had was the note you faxed. I got the county attorney to accept that and my word as verification that it was a real gift to her.\"\n\n\"Damn it! The dealer said that they would send all of the appropriate papers.\"\n\n\"Knowing a little about car dealerships, they probably put them all in the mail; they will arrive later this week and the county can put them together. Everything is fine.\"\n\n\"Good; thank you. I got to thinking;\" (he paused for a moment) \"when I get back, we need to take a trip down there. I need to go back I guess.\"\n\n\"Good idea. And yes, I will go with you and hold your hand.\"\n\n\"With that attitude, I might trade you to them for a used car salesman and a second-grade teacher.\" He laughed.\n\n\"Think bigger; you should be able to get at least a third or fourth-grade teacher for me.\"\n\n\"They don't have a teacher that is worth what you are worth. Anything else?\"\n\n\"Lots of things. Tell me about this tour with the Navy.\"\n\nHe paused before replying, \"Not much to tell really. I spent four years in the bowels of an aircraft carrier cooking. Yes, I was a Navy cook. In my off time, I read and then began to write. I wrote my first book while in the Navy and started on the second one. They decided they had enough cooks after four years and turned me loose.\"\n\n\"That's it? No excitement or anything?\"\n\n\"Not much; I did get the see the world or at least most of the Navy ports. I also used the opportunity to start taking college classes on-line. The Navy has a good program for sailors who took advantage of it. I left with two full years of college under my belt.\"\n\nWithout thinking, she teased, \"And a woman in every port.\" She immediately regretting saying that when Jeff started stuttering. She quickly added, \"Forget I said that. I wasn't thinking.\" But Jeff had gone silent and Hannah knew that the phone call was just about over. \"Jeff. Jeff! Dammit, talk to me. I screwed up.\"\n\nHe quietly replied, \"Hannah, you didn't screw up. You are fine. I am just...just wrestling with some old feelings. Be patient with me on this.\"\n\nHannah finally let out a slow breath in relief. \"Jeff, I will be as patient with you as you need; I just sometimes say things without thinking.\"\n\n\"Ok, let me wrestle with this and then perhaps I can try to explain it to you that makes some sort of sense. Ok?\"\n\n\"More than ok; much more. Jeff, whatever you are wrestling with is old business. The Jeff I know today is perfectly fine.\"\n\n\"Thank you. I am going to get some sleep. I'll call you in the morning.\"\n\nHannah put her phone down and broke into a serious cry. When the tears stopped flowing and she regained her composure, she made a couple of decisions. Jeff's return from Europe was on a Sunday a week later. While it was a couple of days early for their anniversary date, Hannah sent him a text that simply said, \"Meet me at our restaurant at 6 when you get in.\" She had decided that it was time for her to step up in a couple of areas and this was going to be the start.\n\nShe arrived at 5:30 and settled in the quiet area in back and waited for his arrival. While waiting, she reviewed that things she wanted to say to him. The more she thought about it, the more nervous she became. She knew him well enough to know that jumping right into his privacy would be the wrong way to approach him. She needed to gently ask entrance to his soul and even that would not be a guaranteed success but she felt that she needed to try. The glass of wine seemed to help her calm her nerves.\n\nShortly after six, a taxi pulled up and her tall boss stepped out. She knew that he would still be six hours ahead of local time and wouldn't rush him. This time it was she who rose with a smile to greet him. The look on his face told her that he did recognize the potential role reversal and grinned. For the first time when they greeted each other, he leaned forward and gave her a hug and her heart almost exploded.\n\nAll she could think to say was, \"Welcome home. How are things?\"\n\n\"Now that I am here and with you, everything is almost perfect. Thank you.\"\n\n\"Good; actually, better than good. First we eat and then we talk.\"\n\n\"A woman after my own heart. Um...I had Steak Diane last night; tonight, I think I will have the salmon.\"\n\nShe grinned, \"And I am having the Steak Diane. I want to see why you are so addicted to it.\" They both grinned.\n\nAs usual, they ate quietly with only casual talk about non-business things until coffee was poured and they were ready to talk. Per usual, Hannah began. \"So how is Europe and what do I need to know?\" She had discovered that he often needed a prod to get him on track to get the discussion started.\n\n\"Europe is fine and...and I think that it is time for us to consider structuring things over there and over here.\"\n\n\"Oh?\"\n\n\"Hannah, I have been spending a lot of time there building our base and getting the program started. I guess we have been successful. The musicians are happy and the audiences seem to love what we are doing. So much so that the requests for concerts next year have more than doubled. We did six this year and right now have requests for twenty-three for next year. We can't do that many and do it justice the way we are doing it. Physically, it is easier in Europe than here because the distances are not as far apart but the potential to lose the freshness and burn people out rises very quickly.\"\n\n\"And...?\"\n\n\"And I am burning out a little. I need a break to refresh myself.\"\n\n\"Ok. That is where we start from. We have a meeting with the European core group next month, what do you want to propose?\"\n\nHe paused and thought carefully before he spoke. \"I am not sure. I think that this may need to be your call. I am sort of thinking of a centralized administration and support function but leaving the independence of the musicians alone. How can we do that?\"\n\nHannah thought for a moment and started slowly. \"Actually, I have sort of been thinking along those lines already, mostly about the US groups. In fact, I have sort of created a phantom organization and overlaid it over the existing one. It works fairly well on paper but I'm not certain about Europe because they are countries rather than states and the labor laws are different.\"\n\n\"Explain that last part.\"\n\n\"Here, every state has different labor laws. Some are strong union states and others aren't. In California, we have to have a union stage manager. In Texas, we don't. If we had a central organization that works on the details, we could supply a union or non-union stage manager as needed. From our point of view, it would make no difference because we pay them the same. We would set our standard that they would all trained to meet. Then it just becomes planning to put the right people for the right places. I am not sure how that would work in Europe though.\"\n\nHe reached in his pocket and took out a business card to hand to her. \"Next week after we get back from our trip south, go see this man. He will be expecting your call. He is excited about the potential of Miles de Musica in Europe and can probably answer many of your questions.\"\n\nHannah grinned and replied, \"I look forward to it. Now about this trip south...?\" For the first time, he had opened the door to his past rather than her having to probe into it.\n\n\"I have been thinking a lot about that. In the past, it was something vague and something to be done some time. The death of my aunt kind of forced me to face it now.\" He paused and she waited patiently. \"It has taken me a long time to come to grips with a lot of things about that period. I don't have all of the answers and probably never will but I owe a lot to the people and areas down there. Understand, that after the death of my parents, I was kind of lost. I was always tall but also very skinny. I was not athletic at all and seemed to have no natural talents. My parents were both musical but even though I tried, nothing seemed to work for me. Other kids could pick up the piano easily and I could never get the rhythm right. I got very self-conscious of that and pulled away. I was extremely shy and didn't make friends easily. The ones I made often moved away and I was alone again.\" He paused for several minutes as he sipped his wine. \n\nHannah felt that he was talking as much to himself as much as he was to her and there was nothing short of an earthquake that would let her break this moment. She sipped her wine quietly and waited for him to finish.\n\n\"This continued into high school except that my parents were gone and I lived with an aunt who did what needed to be done for me but who was distant and didn't like to talk about life or things that I needed to talk about. I did ok at school but I didn't really fit in anywhere; so, I got a job and worked after school. I had dreams and questions but no one to talk to about them. Mrs. Cushman would often call me in to see how I was doing but I never found the words to say or ask what I needed to know. She was responsible for over 300 kids and I couldn't believe that she really cared about me even though I desperately wanted to believe that she did. Like I told you, when I graduated, my aunt gave me thousand dollars and told me to leave because there was no opportunity for me there. She suggested the military which Mrs. Cushman had also talked about. So that is what I did.\" \n\nHe stopped again but Hannah felt that he wasn't finished. She waited.\n\n\"I now realize that the Navy was very important to me although at the time, I felt like it wasn't. I started putting on a little weight; I gained physical strength through the PT; but more importantly, I began to be able to put things together. In school, everything was separate. I did ok in math but when I got the science class, the things I learned in math didn't apply. In the Navy, things began to click. I also began reading a lot. That was when I discovered a couple of things about me and learning. First, I was and am an introvert. I like people but don't relate to them very well socially. My mind is always busy thinking about something and that distracts me from being social. The other thing is that people learn in different ways and different rates. I was one of those who could hear and retain information but the ability to apply it broadly was delayed until I began to mature as an adult.\"\n\nThis time Hannah felt the urge to say something but something else held her back. A moment later, she discovered that her patience was rewarded.\n\nHe took a deep breath before he continued but almost in a whisper. \"In my senior year of high school, I thought I was madly in love with one of the girls. She was beautiful and popular but most importantly, she wasn't one of the ones who ignored me. She would smile and say 'hi.' It took me weeks to talk myself into asking her to the senior prom. She smiled and said 'thanks for thinking about me but I am going with my boyfriend. He is going to college and has a bright future. I want to marry him to have a good life.' That destroyed me. She essentially dismissed me as a guy who would never be someone or have a future.\" Hannah saw the tear in his eye before he pulled himself back and continued, \"In the Navy, some of the guys would fix me up with a date. More often than not, my lack of social skills and introversion ruined those. One even told me that she wanted to date a partier not a thinker. More than once, I went out with someone and came home alone because she hooked up with someone else who was more fun. Needless to say, my social self-esteem just disappeared. So, no; there wasn't a woman in any port; just a lonely guy trying to figure out his place in the world. It got a little better when I got out of the Navy and went to college. I didn't date but was friends with a lot of girls. I helped them with their classwork and listened to their tales of woe. But I was an old man of 22 and a Navy veteran and they were bright-eyed 18 year olds who fell in and out of love daily. So, a social life wasn't in the cards. By now, I had figured out that I needed to focus on my work and my career. And that is what I have done.\"\n\nNow when he fell silent, she knew that this was the end of the talk. He was spent. She took his hand and held it gently. He didn't pull away. Oddly, his words caused her to reflect on her own past. She hadn't had to face the traumas that he had but her path was none-the-less very similar. Perhaps this was the bond that brought them together and made them a good team. That was the first time she thought of them as a team but it felt right to think that way.\n\nShe paid the bill and led him to her car. He was asleep before they left the city limits. The next morning, they were back to their usual routine and spent some more time talking about his dream for both the European and American versions of Miles of Music.\n\nOver the next two weeks, three things happened that Hannah wasn't prepared for. The first was smaller but no less significant. She was scheduled to leave for her European trip on Sunday. On Thursday, Jeff quietly asked, \"Tomorrow, why don't we drive down south and let me take a look around?\"\n\nShe hadn't forgotten words at dinner but they had taken a backseat to the business things. \"Sure. Let's do that.\"\n\nThe drive was pleasant as he drove and she got a chance to see the scenery from the passenger seat. Once there, he drove slowly through town and pointed out places to her including the store where his aunt had worked and the plumbing supply place where he worked after school. Then he drove to the cemetery. He knew exactly where his parent's graves were and parked just feet away from them and the fresh pile of dirt under which his aunt lay. She watched in awe as he spent several silent minutes standing in front of his parent's grave and she felt that he was silently saying a prayer or talking to them. She had never seen him behave this way but was pleased. When he finished, he stepped to the fresh grave and said out loud, \"Thank you, Aunt Janette; you did your best and I thank you for that.\" Then he turned and they got back in the car.",
        "As they left the cemetery, he pointed to a house and was surprised to see a sign in front that read, \"McDaniel House: Home of the Youth Sports Program.\" All he said was, \"That is where I grew up\" but Hannah heard a timbre of pride in his voice. As they parked in front of the school, he said, \"I would like to talk to Ms. Cushman alone. Is that all right?\"\n\n\"That will be fine. You take care of that; I will go to the courthouse and see if there are any other issues to be dealt with.\"\n\nThey went their separate ways and Hannah found that the paperwork from the dealer had indeed come in two days after her last visit, confirming everything that might have been in question. The attorney was out of the office so she had nothing else to do and wandered around the shops around the square. Once again, she recognized the similarity of her own hometown. The town would never totally disappear but it would never again see its glory days. It would just continue to exist as each generation passed through. Some people left while others just stayed because they had no other place to go.\n\nAs if by intuition, she returned to the car just as Jeff was leaving the school. Based on the look on his face, the visit had been good. Once in the car, she didn't ask and he didn't say anything until they were half way home again. Then all he said was, \"Thank God for people like Mrs. Cushman. Small towns like this couldn't survive without a few people like her.\" Hannah made a note to herself to pay a visit to her own high school and say thanks to some people the next time she was there. \n\nOn Sunday, they rose early and Jeff drove her to the airport. The plan was for her to spend two weeks working out the details with the lawyer in France before Jeff arrived for the meeting with the European core group to discuss how they might make this work.\n\nAt the airport, they walked to the security gates but before she passed through, Jeff said, \"I will miss you. It won't feel like home with you gone.\"\n\nThe words shocked her but then she realized that the house had a much different feel when he was there. When he was gone, she had the run of the house to herself except when visitors came. She wasn't aware that he felt the same way but she cherished the idea that he did.\n\nThis time she leaned to him and gave him a hug before saying, \"I know how you feel. But I will be back and so will you.\"\n\n\"Yes. That will make it right again.\"\n\nThen the bustle of people forced them to say a quick goodbye before she passed through the security net.\n\nThe flight was uneventful which allowed Hannah time to process the things that Jeff had hinted at as she departed. The words and thoughts he expressed warmed her heart. She then turned her attention to the upcoming meeting. She was to be met at the airport by her host and then driven to his estate for a dinner with other interested people including several of the core people who she had come to know. She was looking forward to digging into the new chapter of Miles de Musica and perhaps the American version also.\n\nLater that evening after the guests had departed, Hannah was invited to their drawing room for a brandy. She reflected on the delightful dinner and evening with almost twenty people. She had been surprised at the banter going back and forth between the musicians and the non-musicians. It was obvious that they each experienced the same piece of music differently. That became the starting point between Hannah and her hosts over brandy.\n\nShe had commented on the earlier back and forth and how interesting it sounded to her. Her host was a genial man of about sixty-five whose wife was a charming sixty. He replied, \"This is common in Europe and I notice that you Americans often fail to understand it.\"\n\n\"Why is that, do you think?\"\n\n\"In Europe, we accept things for what they are; you American have the habit of trying to label things and putting them in small boxes. A box has six sides and all of them limit the potential of its contents. To an American, a waltz is a serious piece of music that must be played a certain way or it fails to be good. In Europe, a waltz is a dance and demands that it be danced to and enjoyed for what it is. The more enjoyable the dance, the better the music sounds.\"\n\n\"That is an interesting point of view.\"\n\n\"Understand that most of what is called classical music originated here. But it was all originated as entertainment. There wasn't any radio or television to turn to; only live music and much of that was for the nobility. But many of the pieces were originally based on traditional folk music and many of those were dances. So, our tradition is to dance and sing when the piece is recognized and known. In America, you would be asked to leave if you began dancing in the aisles to the Blue Danube Waltz at a concert hall. That is the beauty of what Jeff has begun to introduce over there.\"\n\n\"Yes, he is slowly transforming things over there.\"\n\n\"Yes, and he is thankful for you for making this possible.\"\n\n\"Me! He is the one who has made this possible.\"\n\n\"Ah, you underestimate yourself, my dear. When I met Jeff four years ago, he was a man with a dream but limits to his capability to achieve it. Then one day, he arrived with a smile on his face instead of his usual business frown. Everyone noticed that he had come alive. Then he began talking about Hannah this and Hannah that. Surely you realize that he is totally in love with you.\"\n\nHannah was stunned! \"I...he...we...I don't know what to say.\"\n\nMadame, who had been sitting quietly listening, said, \"Yes, this is true and it is just as obvious that you are just as much in love with him. You will make a good marriage.\"\n\n\"But...but...we haven't...he has never even hinted...\"\n\n\"Again, you are being an American; nothing can exist until it is spoken, analyzed, and put in writing. Listen to what Jeff does, not what he says. He speaks volumes from his heart through his actions rather than words from his mouth.\"\n\n\"But what is holding him back?\" Hannah demanded.\n\nThe elderly man replied, \"It is Jeff being Jeff. That is all. He isn't ready yet. He is close but not yet.\"\n\nHannah stared at him until Madame once again spoke in her accented voice, \"Most of the time, I would tell you to ignore that old goat but in this, he is right. Jeff is not yet ready to be the husband that you deserve. When he is ready, that will be the time. It took me five years of waiting for this one to be ready. It has been forty years and worth every ounce of wait.\"\n\nHannah could say nothing because her heart was beating faster than her mind and nothing came forward to her mouth. Shortly after that, she curled up in her bed and rethought everything that had happened that night. Just before she fell asleep, she finally admitted to herself that Jeff, indeed, had shown her love every single day since they had met. Once she accepted that, she smiled and said to herself, \"Sleep well, my love.\" Then she fell into a very restful sleep.\n\nThe next morning, she woke with a smile and prepared herself for the day with a light heart. Once the meetings began, she reverted to her business persona but was surprised at how easily the discussions proceeded. Based on her host's words the previous night, she immediately saw the difference between a European's negotiation strategies and the way Americans approached a similar conference. Americans came with a rigid agenda and were prepared to fight for every last issue. The Europeans came with the attitude that we have a good thing that can only get better. Their primary concern was which of several options would be best. She found that very refreshing. Her only focus was Jeff's mantra: make good music and allow the audience to have fun; everything else was details. And that was her specialty.\n\nTen days later, she was waiting at the airport in Frankfurt for Jeff to arrive and was prepared to tell him everything that had been decided. When she heard that his flight had landed, her heart started beating faster. She hoped that she didn't embarrass herself when she first saw him. Then he was walking into the baggage area and was heading straight for her with a smile on his face that rivaled hers.\n\nPer usual, she said, \"Hi, how have been going?\"\n\n\"Honestly? Miserable. I am not sure that I want to be away from you that long again.\" Then he leaned forward and lightly kissed her lips. Then he pulled back in horror and said, \"Oh, I'm sorry.\" With the tingle still on her lips, Hannah pulled back and slugged him in the arm. \"Ouch! What was that for?\"\n\n\"If you ever apologize again for giving me a kiss, I will kick your ass until you can't sit down. That was one of the sweetest and most wonderful things you have ever done for me.\"\n\nJeff laughed but then stuttered a little as he said, \"O...Ok, but nnn...ow you have to carry my bag. I won't be able to lift it.\"\n\nShe went on her tiptoes and kissed him back and said, \"Suffer.\" A rush of people into the baggage claim ended that moment and gave both of them the time needed to collect themselves.\n\nHannah drove them towards the estate where they were staying but stopped at a German restaurant for lunch. She looked at him and asked, \"Steak Diane?\"\n\nHe smiled and said, \"Not hardly; Sauerbraten. When in Germany, do as the Germans do.\"\n\n\"Make that two.\"\n\nWhen they finished eating, he looked at her and asked, \"So, what do I need to know?\"\n\n\"You need to know that things couldn't have gone more smoothly. Everyone readily agreed to a corporate core with each region or country having an affiliate chapter. The financial structure works very nicely as we talked about. They all like the idea of guest artists from one region being available in other areas. That will encourage camaraderie and freshness. They even agreed on where the headquarters should be. That might be the one issue where you need to put your two cents in.\"\n\n\"I already know where I want it to be; so, what do they want?\"\n\n\"Luxembourg. They feel that it is central and will avoid any political squabbling. What do you think?\"\n\n\"I think that it is a perfect choice. In fact, I put a deposit down on a place where everyone can meet and we can set up the training program.\"\n\n\"Do what? You did what? Where?\"\n\n\"In Luxembourg. I found a place at a great price right near the border with France and Belgium in the Ardennes. It is about 400 years old but has been modernized. It is central, convenient to everywhere, great banking and commercial activities. So that is a great choice.\n\n\"Back up. What training program?\"\n\n\"The one we need to start both here and at home. We have depended on virtually the same people for quite some time. Some need a break for family reasons; some of their careers may go in different directions; all of those life-gets-in-the-way-things. So, we need to be developing new talent to step in and make a place for themselves. Here, we will be expanding more into eastern Europe and the Balkans. We need to train people from there. We also need to train our support people to do things the way we need them done. That training program.\"\n\n\"Now I know for sure that I can't leave you alone for more than a day or two. Let's get on the road and share all of this with the others.\"\n\nFor the next four days, Jeff listened to everything and agreed. Then he spent time explaining the new additions to the plan. Everything excited the others and by the weekend, the agreement was finalized and their host set about doing the proper documentation for the European branch of Miles of Music International, Inc. Hannah would be doing the American version when she got home.\n\nAs they left to go to the airport for their return, Jeff directed Hannah to a short stop at the villa he had agreed to buy in Luxembourg. If she was in love with the log home back home, she swooned at the sight of the ancient (by American standards) chateau that would be their European home.\n\nOnce back home, both of them stayed busy traveling and working out details for the expansion. It did not take long before rumors of the new operation leaked out and Miles of Music became the focus of intense media interest in their plans. Jeff simple handed all requests to Hannah with a smile which she returned with a threat to his manhood. But she dutifully gave interviews in Europe and in the States as her schedule allowed. Where she once was a minor media celebrity, she now became an international figure and spokesperson for the latest musical phenomenon but also the front person for the reclusive head of the organization. She repeatedly put off discussing the head man by saying that he would be announced when everything was finalized and in place.\n\nWhen it became obvious that details about Jeff were not forthcoming, questions turned towards her and her background. A number of the media hosts asked about her life, which allowed her to talk about working her way through college and law school and then finding her niche outside of the traditional legal structure. She frequented touted the high quality of both of the schools she attended and encouraged students to follow their dreams even if they weren't clearly defined and to allow other opportunities to open up for them.\n\nThe final chapter in Jeff and Hannah's adventure began when Jeff returned from his most recent trip to find Hannah sitting in the great room with a bottle of wine and two glasses. He went to her and gave her a kiss which she readily accepted. Then she tersely said, \"Sit. We have to talk.\"\n\nSurprised, he sat down as she poured him a glass of wine. \"What's up?\"\n\n\"Jeff, have I ever asked you to do something personal for me?\"\n\n\"No, you haven't and I feel a little guilty about that too. What do you want or need?\"\n\nShe ignored his question. \"You know that I graduated from Southeastern State, right?\"\n\n\"Yes.\"\n\n\"Why have you never told me that this is where you graduated from?\"\n\nHe began stuttering, \"I...I...guess that it just never came up.\"\n\n\"Bullshit. You are still afraid to open up completely to me. I accept that you aren't ready but I kind of got floored this week and now I need to ask you to do something for me.\"\n\n\"Anything. What is it?\"\n\n\"I was invited down to the school this week to meet with the President and Deans. Homecoming is in two months and they have all of the usual activities including the big dinner dance where they announce the Alumni of the Year. Jeff, they are naming me as the alumni of the year because of all of the positive things I have said about the school. Their applications have doubled and they are getting attention from people who usually ignore them.\"\n\n\"That's wonderful. You certainly deserve it.\"\n\n\"Shut up; I'm not finished.\"\n\nHe nodded.\n\n\"They also showed me a list of some of the major alumni who annually support the school and asked if I personally knew any of them to invite to the dinner dance. Guess whose name is in the top ten; a certain man named JB McDaniel, Class of 1999. I almost wet my pants when I saw that. I told them that I might have met you. It seems that every year you send them a check with a thank you note declining to attend.\"\n\n\"I...\"\n\n\"Don't say anything. I know why. This is different.\" She paused before she continued. \"I have two things to ask. One of them is very important. First, they asked if it was possible for Miles to perform at the dinner dance. I explained how things work and that I couldn't answer for them. So, I ask you if this is possible. If so, please work about the details this woman. I don't want to be involved beyond asking you. If it won't work, see if you can book a good band for the night for them.\"\n\n\"Ok, what's else?\"\n\nHannah's lip began to tremble and her eyes watered, \"Jeff, I would be another nameless, faceless lawyer in some firm somewhere if I hadn't met you. Every single thing they are giving me credit for was only possible because of you and you hiring me. Being recognized makes me very proud but it will only be really meaningful if you are there. I don't care if you hide behind stage or sit in the back with a pillow case over your head, I would like you to be there.\" Then she dropped her eyes and waited for his reply.\n\n\"Look at me.\" She didn't move. He lifted her face and then gently kissed her lips. \"For you, I would do anything. Yes, I will be there. I promise.\"\n\nShe broke into full tears and leaned against his chest as she cried. \"I was terrified to ask you. Thank you, thank you, thank you.\"\n\nHannah was so caught up in her emotions that she failed so see that Jeff's mind was very busy and far away from this moment before he slowly broke into a smile.\n\nThe next two months were busy as usual but both of them seemed to be re-energized. Little was said about the Homecoming but it seemed to hang like a fog in the room every time they were together. Finally, the Thursday before the big event was at hand. Hannah looked at Jeff and said, \"I am leaving to go down for the preliminary things tomorrow. Is everything straight with you?\"\n\n\"Hannah, go have a good time. I don't know exactly where I will be but I will definitely be there Saturday night at the dinner.\"\n\nShe smiled a shy smile and offered a timid, \"Thank you.\" Then she left. An hour later, Jeff left also. He had a long list of things that had to be done in two days.\n\nOn Saturday, Hannah was dressing for the dinner but got a case of nerves. She quickly called Jeff but it went to his voice mail. She hadn't talked to him since she had left. She hoped that nothing major had distracted him but wouldn't be surprised if it had. She would be hurt but would get over it. Then she drove to the campus to find her parents waiting for her along with several of her old college friends. They shared a nice time getting re-acquainted before they went it to sit at the table in front of the room. It was gaily decorated in reds, blues, and golds. When dinner was over, the woman in charge of entertainment stepped to the microphone and spoke. \"We are very happy to see such a great turnout for Homecoming this year but tonight, we have something special for our entertainment. Ladies and gentlemen, get ready to have a really good time tonight.\" The lights went down and the first sound of Miles of Music started playing their signature opening number as the curtain opened. For the first time, Hannah relaxed. Jeff had come through as she hoped he would but also knew that it hadn't been guaranteed.\n\nAn hour later, the people took their seat again after dancing to waltzes, polkas, and a number of modern songs done in the Miles style while laughing at the antics of the orchestra. Without really thinking, Hannah sensed that Jeff was backstage running the show. There was just a precision and rhythm that was a notch above all of the others. \n\nThe President of the university started walking to the podium on the stage as the orchestra played \"Hail to the Chief\" to the delight of everyone in the audience.\n\n\"I'm not sure that certain high-level politicians would appreciate using that music for a mere University president.\" To which the orchestra broke into a rousing version of \"Take this Job and Shove It\" to an even greater round of applause. \n\nThe president himself had to stop laughing before he could begin. \"Annually, I am asked to introduce our honored guest but tonight, I have been warned to keep it short or the orchestra will take it out on me.\" The unmistakable sound of \"Lullaby and Goodnight\" wafted into the room to laughter and applause. \"Ok, Ok. I get the message.\" He was laughing again as he brought the attention back to the microphone. \"I am always pleased to announce our Alumni of the Year and this year is special for several reasons. First, Hannah Bell has made a major name for herself in a very short period of time. More importantly, she embodies all of the values that we teach and preach as educators. None of us know what the future will bring but those who pursue will find opportunities and some will rise to the occasion. She is certainly one of those rising stars. Miss Hannah Bell, our Alumni of the Year.\"",
        "He paused as a new voice came over the speaker which was unknown to most but unmistakable to Hannah, \"Good evening. Three years ago, a young woman walked into a restaurant to meet me. She was nervous and had no idea why she was there. Within three minutes, I had pushed her to her limits and she was ready to walk out thinking that she had embarrassed herself beyond recovery. To be totally honest, it was at that moment that I saw the future of Miles of Music. She wasn't an affected personality or a pompous stereotype but a real woman with real talents and the heart of someone who could make a difference. I hired her on the spot. At that moment, the future of Miles of Music changed from a nice group doing nice things into a dynamic musical movement that now covers the US and Europe and is growing stronger every day. The music is the province of these excellent musicians but the day-to-day details necessary to make this music happen is largely because of Hannah Bell. So, I congratulate Hannah and the entire university for recognizing this very special woman as their Alumni of the Year.\"\n\nThe audience rose in applause as the orchestra started playing Toby Keith's \"How Do You Like Me Now?\" That alone told Hannah that Jeff was close by because it was one of his favorite country western songs but the orchestra had never played it before.\n\nWhen she got to the microphone and the applause subsided, she looked at the audience as she tried to remember her prepared speech. Finally, she simply looked at the eagerly awaiting group and said, \"I am likely to get fired for what I am about to do because I was not prepared for what just happened. Hold on for a minute.\" She turned to the orchestra and yelled loudly, \"Jeff, get your ass out here! Jeff!\"\n\nA voice from the back yelled back, \"He's changing his shirt. He'll be right out.\"\n\nHannah turned back to the microphone and said, \"The voice you just listened to talking about me is the founder, producer, and heart of Miles of Music. He did interview me just like he said and I did almost walk out in tears. Obviously, I didn't. What he didn't tell you is that soon afterwards he overwhelmed me with the things that he had accomplished but virtually no one knows about. If you look at your program, he is listed as Mack Daniels. If you read the books he has written, they show that they were written by Blaine Daniels. If you are a music aficionado, his now three gold records list JB Daniel as the songwriter. All of this he had done before a simple college girl looking for a job walked in to meet him.\" Hannah heard a flutter from the audience, looked both ways, but continued after seeing nothing. \"Yet all of these people are one single man and a very special one. He shuns publicity and focuses on the work he does.\" The twittering in the audience continued. \"He made that very clear to me on that first day. Tonight, I am violating that because without the opportunity he gave me that day, I would be a nobody in an office somewhere. And if all of this doesn't impress you, I will also add that this wonderful man is also listed on the alumni list as JB McDaniel, class of 1999.\" That brought a gasp from the audience. Hannah looked to the wings again said into the microphone, \"Where is Jeff? He should be here by now.\"\n\nThe backstage voice replied, \"Look behind you, Hannah.\"\n\nThe orchestra started playing Roy Orbison's \"In Dreams\" as Hannah turned around completely and saw Jeff standing tall just behind the drums wearing a full black tuxedo with red and blue cummerbund. She almost melted on the spot as he had never looked so handsome and beautiful. Then he began a slow walk down towards the front. When he got near her, he simply said, \"You called?\"\n\nAll Hannah could muster was, \"If I look shocked it is because this is the first time I have seen him in a tuxedo. I have only seen him in a coat and tie once. Ok, big guy, I have outed you in public. What are you going to do about it?\"\n\n\"I'm going to exactly what you said I was going to do. You're fired.\"\n\n\"You know that you can't live without me.\" She replied but there was a hint of fear in her voice.\n\n\"That's true. However, I no longer need your existing services because you are now the Vice President for Financial and Legal Affairs for Miles of Music International, Incorporated and the very effective face and voice for us and this university. Congratulations.\" The audience applauded but Hannah still looked fearful.\n\n\"The other reason I am firing you is because I want you in another capacity. Hannah, will you marry me?\" As if by magic, a ring appeared in his hand which he held in front of her hand. Then he said in a voice only a few could hear, \"Yes or no, the waitress is coming with our lunch.\"\n\nShe just as quietly replied, \"I am tempted to say 'no' just to see what you will do but I am not going to risk it.\" Then loudly announced, \"Yes!\" The audience stood and applauded vigorously while the orchestra once again started playing \"In Dreams.\" Jeff took her arm and led her to the dance floor and took her in his arms. Once settled, she whispered, \"What has changed?\"\n\n\"Nothing. I have always dreamed about a woman like you. I knew that I wanted to marry you the day I met you. I just had to work off some of that baggage we talked about. I have lived most of my life without you; but I knew from that first day that I didn't want to live without you as a permanent part of my life.\"\n\n\"So, Madame was right. You just weren't ready to be the husband I deserve.\"\n\nHe cocked his head and replied, \"Did she tell you that? I told her to tell you that you just had to be patient.\"\n\n\"I'll tell you how patient I have been. We are going to leave in about twenty minutes and we are going to my hotel room. Don't plan on leaving before Tuesday.\"\n\n\"What about meals?\"\n\n\"Room service.\" \n\nAnd the orchestra played on.\n\n\"In dreams I walk with you. \n\nIn dreams I talk to you.\n\nIn dreams you're mine. \n\nAll of the time \n\nwe're together\n\nIn dreams, In dreams.\"\n\nRoy Orbison 1963"
    ],
    "authorname": "TexasFarmBoy",
    "tags": [
        "romance",
        "romantic"
    ],
    "category": "Romance",
    "url": "https://www.literotica.com/s/in-dreams-15"
}