{
    "title": "Technically We're Estranged Ch. 09",
    "pages": [
        "====================================\n\nAll characters are 18 years or older.\n\nThis story is the finale of my Technically We're Estranged series and I suggest reading the previous chapters before continuing. TWE segments are intentionally shorter. This chapter includes elements of incest and group sex (mff).\n\nThey had sex, and now Mel and Stephen move forward to tie up a loose end or two.\n\nThanks to Antematter for edits, who always seems to be able to put into words what I know is truth. Also, this final chapter is dedicated to Erica the Coed. I hope you get to read this before you finish classes.\n\n====================================\n\nRolling over in bed, I groaned as the sheets peeled away from my body, still damp and sticky. I sat up and closed my eyes, expecting a hangover and finding none. Something in my body expected one, after a night like I had gone through. And morning.\n\nMel was still lying next to me, snoring out little girlish sounds as she slept, only her legs covered by the single sheet we had pulled over top of us. Her breasts rose and fell slowly with her breathing, the left one smeared with dried cum. There was some in her long blond hair as well, and a trail of it on her stomach.\n\nI rubbed at my face and felt her dried juices there as well. The whole bed area was just carnage, the sheets soaked with sweat, both bedside tables swept of decorations by errant legs. The lamps had hit the floor at some point but hadn't broken, not that I would have cared. Mel's old cheerleader uniform was scattered about, making the whole room look like a scene from some college comedy movie.\n\nAnd this was only the scene of round three. Round two had left my bedroom a mess as well and we'd come over to the guest room to sleep. Then Mel had woken me up in the morning wearing that cheerleader uniform.\n\nI staggered to my feet and looked back down at Mel, considering waking her up. It was almost two in the afternoon. I left her, letting her sleep, and slowly made my way to the shower. The hot water, the soap, the shampoo, I found myself thankful for all of them as I cleaned myself off thoroughly. Dried fluids turned gooey then sluiced away under hard scrubbing and soon I was just standing under the water, eyes drooped closed, thinking about nothing as I concentrated on the feeling of the thrumming pressure on my back from the shower head.\n\nThe shower curtains pulled aside and I turned, finding Mel standing outside the shower. Her hair was wild as she stood looking at me, as naked as I was. I don't know how but somehow I was erect again, my eyes tracing down her body, following the remains of our fucking from head to toe.\n\nGod, you're beautiful, I thought to myself, my brain still slowly trying to wake up. For all the exploring we had been doing with each other, I hadn't just stared at her naked without something sexual going on. Well, more sexual than just naked. Her breasts, which I had been lick and biting and squeezing, were wonderfully proportioned to her athletic body after the small upgrade she had purchased while she was still married. Her stomach was nearly flat, just the slightest tummy from being full figured, and her legs were powerful, but I still always came back to her face. Beautiful, innocent, blue eyes bright even this early in the morning, wild blond hair somehow sexy instead of silly.\n\nMel eyed my erection and blinked, sighing lightly. \"Could we just-?\"\n\nI smiled and held out a hand, helping her into the shower. \"Mmmm,\" she groaned as the warm water hit her. Grabbing the soap and shower mitt, I knelt and slowly started washing her feet, carefully raising one and then the other, then moving up her ankles and shins. Mel leaned her head back and sighed, her hands resting on my shoulders as I cleaned her off. I rose, scrubbing her thighs, moving higher, then gently washed her vagina, which looked like it was still recovering a bit from the multiple reamings we had put it through.\n\nBy the time I had finished with her stomach and chest, ass and back, I was rock hard and my dick brushed against her front as I softly ran my thumbs along her cheekbones and forehead, cupping her face in my hands as I washed it. Once I was done I leaned in to kiss her but Mel's eyes flicked open and she leaned away slightly.\n\n\"You don't want to do that,\" she said. \"I probably still have nasty cum breath.\"\n\n\"Ok,\" I laughed, instead bending and kissing the side of her jaw, pulling her into my arms and hugging her. The feeling of our two freshly cleaned bodies pressed together was glorious.\n\n\"You know I meant it, right?\" I asked her. We hadn't talked about what I had said when Mel had met me at the car, and the rest of the time we had been too busy fucking each others brains out.\n\n\"I know,\" she whispered, her arms clinging to me. She took a deep breath. \"It's just a little scary, Stephan. The last time...\"\n\nI knew she was thinking of her ex-husband. A cheater and all around bastard.\n\n\"You don't have to say it back,\" I said. \"Not until you're ready, and only if you-\"\n\n\"Stephan, shut up,\" she said. Mel slid her body down mine, going to her knees, and took my dick into her mouth, sucking on it hard enough that I had to put out a hand to the side of the shower to keep steady. She sucked again, pulling her head back until it popped out of her mouth. \"I,\" she said, then sucked me again. \"Love,\" again she took me in. \"You,\" again. \"Too.\"\n\n\"Mel, you don't need to-\" I started, but her eyes flashed up to mine and silenced me. The blowjob continued and I knew Mel was trying to show me she meant it. I came after a few minutes, Mel sucking it out of me and swallowing it down quickly. She stood and I hugged her to me again. \"Thank you,\" I whispered.\n\n\"Marry me?\" she asked.\n\nFor the first long moment my mind was frozen and barren, as if an ice age had descended upon it and left everything sluggish. Then I pulled away from Mel slightly so that I could look her in the eyes. They were big with worry, her lips slightly parted as she waited for my answer in anticipation. It was that same look, serious and profoundly sincere, that I had always acquiesced to when we were teens. A thousand questions boiled inside of me, and a thousand concerns.\n\n\"Yes,\" I said.\n\nShe started crying, weeping with relief and a wash of emotions I could only begin to understand the weight of. I held her, the shower still raining warm water down on us, as she cried into my shoulder. She started kissing my chest and I squeezed her.\n\nMarriage. Holy fuck.\n\n\"Get out of the shower,\" Mel said. \"Go make us something to eat. I need to wash my hair and brush my teeth, then we can talk.\"\n\nI followed my fiance's directions.\n\nFiance. Fuck a fucking duck.\n\n**********\n\nI grilled waffles, listening to the sound of the running water as Mel continued her shower while I mixed up the batter and dug the waffle maker out of my kitchen cupboards. I had real maple syrup as well, a Canadian brand and difficult to find in Australia - one of our favorite rare treats as kids, just as rare in Hawaii.\n\nMarriage. The word kept running through my mind. I was going to get married. To Mel. My Mel.\n\nI had to focus on the waffles.\n\nThe last pair were just finishing up when Mel slipped out of the bathroom and walked past me, naked, into the guest room where her luggage was. She came back out shortly after dressed in a bra and panties, grey and lace with pink flower decorations. Mel took one look at me and rolled her eyes, stepping into my room and coming back out with a pair of boxers that she threw at me.\n\nI set the plate heaping with waffles onto the island where I had set up two place settings. Mel immediately took a waffle, drizzled it in maple syrup and took a bite. \"I mfucking rove you,\" she mumbled through her mouthful.\n\n\"I love you, too,\" I smiled back, sitting next to her. I took a waffle and had a bite, but the questions burning inside of me put food low in priority.\n\n\"So,\" I said, not really a question.\n\nMel took a gulp of orange juice I had set out to help wash down her mouthful. \"So,\" she replied, the nervousness coming back through. \"I, uh. Yeah. I asked you to marry me.\"\n\n\"And I said yes.\"\n\n\"You did,\" Mel smiled.\n\n\"Are you sure about this? How is this going to work?\" I asked.\n\nAnd so began a conversation no one ever thinks they'll need to have. How to get married, as cousins, and figure out how to merge your lives together without tipping off your family. When it came to the actual technicalities I was fairly certain we were in the clear - I was already a full citizen of Australia, and Mel still had her last name from her previous marriage. Her maiden name was also different from mine, which was also different from both of our mother's since they had been sister's and took their husband's names. You had to dig pretty far to find the cousin-connection in a purely legal way.\n\nWhen it came to family, I was already fairly distant with mine, as was Mel with hers. I didn't use Facebook at all and Mel would scrap her account, making it harder for people who knew both of us to find out. Mel would move to Australia, the official story for our families that I had surprised her with a vacation and she had loved it so much I offered to put her up as a roommate and she accepted.\n\nThe waffles were gone and both of us were a little giddy with the planning when I asked the next tough question. \"What about your camming?\"\n\n\"You mean do I still want to do it?\" she asked.\n\n\"Well, yeah. I mean, if you want to I would never tell you to stop, but honestly Mel I've always hated the fact that other people were watching you. Talking to you the way they were. Getting to share something I wanted all for myself.\n\nMel smiled and leaned over, kissing me with syrupy-sweet lips. \"Hun, I started camming because I was lonely and sexually frustrated. I think I can safely say, after last night and this morning, that won't be a problem for me any more.\"\n\n\"So you'll stop?\" I asked.\n\n\"I feel a little bad for the guys who've been following me for a while, and the ones who paid for my snapchat and stuff, but yeah. I can be done with it. Cold turkey, just disappearing into the mists of the internet.\"\n\nI kissed her again and she laughed.\n\n\"Mel, I just- this is going really fast,\" I said.\n\n\"I know, are you ok with all of... everything?\"\n\n\"Yeah, I am,\" I said, and meant it, \"But are you ok? It's barely been a week since the Skype call, and days since I showed up at your door.\"\n\nMel looked down at her hands and fidgeted nervously with a fork. \"Can I admit something to you?\" she asked.\n\n\"Of course,\" I said.\n\n\"I've wanted to fuck you since high school.\"\n\n\"Really?\" I laughed. \"Fuck, the number of times I jerked off to you back then...\"\n\nNow Mel was laughing too. \"If only we'd known. I had a crush on you for years, and when you spilled your guts out in that Skype call it all came crashing back. How you always took care of me, and how I got to take care of you once in awhile. I always loved you, I just didn't know how to express it. Or how to handle it. Showing up at my door, making it real- Stephan, that was exactly what I needed.\"\n\n\"I was terrified you would turn me away and call the cops,\" I said.\n\n\"Never, even if I hadn't wanted to fuck your brains out,\" she laughed. \"No matter what, you'll always be one of my best friends.\"\n\n\"You too, you know,\" I said. \"The best.\"\n\n\"There's one more- well, there's a lot more to figure out,\" Mel said. \"But one more pressing thing.\"\n\n\"What's that?\" I asked.\n\n\"Bella,\" Mel said.\n\n\"She'll understand,\" I said. \"She doesn't know the whole story, but she knows enough.\"\n\nMel rolled her eyes. \"Stephan, I love you, but sometimes you're an idiot. If Bella isn't in love with you too, she's at the very least in lust with you.\"\n\n\"She is?\"\n\n\"Yes, you dumb boy,\" Mel said, knocking on my forehead lightly. \"Hello, she's been throwing herself at you. Why do you think she's been doing that?\"\n\n\"I- ah, don't know? She was horny and I was there, I guess.\"\n\n\"We need to invite her over for dinner and talk to her,\" Mel said. \"Together. Tonight, if we can.\"\n\n\"Alright,\" I said.\n\n\"Go get me your phone,\" Mel said, picking up the dishes and bringing them over to the sink. \"This needs to be handled right, I'll text her as you.\"\n\n\"Yes, wife,\" I grumbled with a smirk, and she turned and smirked at me, eyes bright with happy excitement.\n\n*************\n\nWhen the buzzer went off, announcing someone asking to be let into the building, Mel shushed me even though Bella wouldn't be able to hear us. I pressed the speaker stud, \"Hello?\"\n\n\"It's me,\" Bella said, her Australian accent coming through the speaker.\n\nI buzzed her up. Mel immediately rushed around, putting finishing touches on the dinner settings at the table and checking the cooking food. We had been cooking together for the first time in years and it had come back to us naturally, moving around each other in the tight space of the kitchen. Now there was a lot more trailing fingers as we moved past though, and Mel managed to press her breasts into me every chance she got.\n\nShe positioned me in front of the elevator entrance and scampered back around the corner out of sight. She had promised me a surprise when Bella showed up, not giving back my phone but promising to let me know if someone else texted or called.\n\nI could hear the elevator moving and soon the doors opened, revealing Bella in a grey overcoat, her brown hair curled lightly into waves and falling over her shoulder, red lipstick bright against her light skin. She smiled and stepped off the elevator and as the door began to close behind her, Bella opened her coat and let it slither to the floor down her naked body. Mostly-naked, she had thigh-high black stockings on. Her breasts, small and perky, were capped by hard nipples and her pubic hair was completely gone, toned abdomen transitioning smoothly into her long, athletic legs.\n\nI had almost forgotten how sexy she was, I had been so obsessive over Mel. \"Wow.\"\n\n\"Stephan,\" Bella breathed out, stepping forward and reaching towards me. I still didn't know exactly what Mel had said to her, but if she had shown up willing to strip immediately I didn't want to lead her on at all.\n\nI took her hand, halting her move towards me. \"Bella, I have a surprise for you.\"\n\nSqueezing her hand lightly, I led her into the apartment. She had been here before, twice for simple dinner parties with legal colleagues and several times by herself when I was busy and needed something retrieved that I had forgotten. Bella hadn't ever walked into my apartment to find Mel standing in the middle of the room, though I was a little surprised as well that my cousin was back down to the sexy grey bra and panties, having stripped off the dress she had been wearing while we were preparing dinner.\n\n\"Bella,\" Mel said with a playful smirk of confidence.\n\n\"Oh my god,\" Bella said. \"Holy crap, it's you- you're here.\"\n\nMel walked over and I noticed she was barefoot instead of wearing the heels she had been pondering over. She walked right up to Bella and pulled her into a full-mouthed kiss, Mel's tongue pushing past Bella's lips. Bella was stunned for a moment then kissed Mel back, her own hands coming up to Mel's shoulders.\n\nWell, I thought, watching the two women kiss. I'm hard.\n\nMel ended the kiss but kept Bella in her arms. \"Hello, Bella. You can call me Mel.\"\n\n\"Hi,\" Bella said weakly, star struck to be facing a woman we had both been watching over the internet.\n\n\"I wanted to make sure you knew what was happening between Stephan and I. You're important to him,\" Mel said.\n\nBella glanced to me then back to Mel. \"What's happening?\"\n\n\"We're going to be together. I'm moving here to be with him, and we're going to get married. And I wanted you to know that I think your own relationship with Stephan is special and I don't want to get in the way of it.\"\n\nI could tell Mel had been practicing that little speech in her mind, emphasizing Bella's place in my, and our, lives.\n\n\"Wait, you're moving here? You're dropping everything to be with him, and moving across the world?\" She turned to me, scowling a little, \"Why did you get me to come here naked if you were going to tell me this?\"\n\nMel used a finger to turn Bella back to her. \"We have a lot of history. And we both feel right about it. But this isn't about us, Bella, it's about you. I, we, wanted to make sure you know what the rules are. I asked you to come here and strip for Stephan.\"\n\nBella glanced at me again. \"The rules?\"\n\n\"Yes,\" Mel said, keeping control of the situation. \"The rules. But first, I think I owe Stephan some pay back. You talk a lot of game in the chat room, Bella. Now it's time to put up or shut up.\" Mel tugged Bella towards the sofa and sat down on it, pulling Bella with her. She kissed the Australian again, this time raising her hands to the thinner woman's small breasts and tweaking her nipples. As the kissing continued one of Mel's hands slid lower, playing between Bella's legs where I couldn't see, while Bella brought her own hands forward to squeeze Mel's larger breasts.\n\nBella gasped lightly, leaning in to the kiss, and Mel leaned back to lay on the couch, Bella following and laying on top of her. Mel urged her to move lower and Bella complied, and as my secretary kissed down my fiance's body Mel turned to me and said, \"Sit down on the chair.\"\n\nI followed her orders and watched as Bella began to eat out Mel. My view wasn't great, and Bella simply pulled the crotch of Mel's panties aside to gain access, but I was still firmly erect and rubbing at my dick through my pants when Mel's breathing got short and she arched her back, enjoying her first orgasm of the evening. Her chest heaved wonderfully, stomach flexing as she her body responded to Bella's skilled ministrations before she relaxed back into the couch.\n\n\"I can't believe you two,\" Bella said from between Mel's legs. \"Fucking Americans. You just assumed I would dyke out for you.\"\n\nMel smirked, reaching down and running her fingers through Bella's silky brown hair. \"I'm sorry, did you not want to ride my face?\"\n\n\"No,\" Bella said, \"Maybe, I don't know. This is all- I don't know what to think. It's hot, and I'm horny, but it's also fucking weird.\"\n\n\"Have you ever had a threesome before?\" Mel asked her. Even though I had pretty much known that was where we were headed, my dick still throbbed at the words being said out loud.\n\n\"Yeah,\" Bella said. \"In college, and once after my divorce.\"\n\n\"Is this more or less awkward than that?\" Mel asked.\n\n\"There was a lot more alcohol involved in those encounters,\" Bella said with a half smirk, remembering.\n\n\"Well, we can have some wine with dinner,\" Mel smiled. She reached over and cupped Bella's face for a second then her hand slid down to her throat and she got more forceful. \"But right now I'm telling you to sit on my face. You've been talking a lot of crap in my chat room and I'm calling you out. You can lick a cunt, I want to know if you taste good too.\"\n\nBella's cheeks flushed and she leaned into Mel's hand, purring softly in her throat.\n\n\"Oh, you like that?\" Mel asked her, and I could see her fingers tighten just slightly, squeezing the sides of Bella's neck.\n\n\"Tell me what to do,\" Bella said, slowly starting to grin. \"I like a woman who knows what she wants. Tell me your rules.\"\n\n\"Rules later,\" Mel said, then kissed Bella firmly, her fingers sliding from the Aussie's neck down to pinch one of her nipples. \"Right now, you're going to sit on my face so that I can taste that naughty pussy of yours.\"\n\nThe two quickly rearranged so that Bella was in a 69 over top of Mel, her ass pointing back at me and flared open so that Mel could pull Bella down to her lips. Watching the two of them together had my mouth watering and Bella looked over her shoulder at me while Mel ate her, biting her lip and squeezing her eyes shut as her own small orgasm eventually rolled in. I wanted to stand up and get behind her, mounting her and spanking her ass in punishment for all the teasing she had been doing. Mel had told me this was payback though, and despite our expressions of love I still felt guilty about the secret I had kept from her. Payback well and truly received. ",
        "Instead, when a bingle sounded in the kitchen I stood, attending to the food. Mel urged Bella off of her and led her to the table, sitting across from her and leaving the space between them for me, and I served the dinner - salmon steak with garlic and leeks, creamy mashed potatoes and roasted asparagus. Mel started talking with Bella as if they were out at bar or restaurant meeting for the first time and Bella fell in step, leaving me glancing back and forth at the two women, one naked and the other mostly so.\n\nThey talked, and told stories about me, and chatted about surfing and how Mel was going to manage her big move and how both women had handled their divorces. I put in a comment every now and again but mostly they ignored me, both learning about the other.\n\nEventually I cleared the dishes and popped a second bottle of wine, the first one having disappeared with the meal, and both women leaned back in their chairs and relaxed. In the middle of the conversation Mel reached behind her and undid her bra, pulling it off and putting it on the table, quickly followed by her panties.\n\nNow they were both naked and I didn't know where to look, not that my eyes hadn't been roaming wild the entire night.\n\n\"Hun?\" Mel said, and it took me a moment to realize she was actually talking to me. \"Why don't you join us?\"\n\nAgain, the whole situation had me a little turned around and I didn't respond for a moment, just raising an eyebrow curiously.\n\n\"You're a little overdressed, Stephan,\" Bella said.\n\n\"Oh,\" I said, and stood and started stripping down. Neither woman said anything until I had my shirt off.\n\n\"He really does have nice abs,\" Mel mused.\n\nBella smiled and nodded, \"Just a touch more definition, maybe. He sits at a desk too much.\"\n\n\"Mmm, we should do something about that,\" Mel said.\n\nUh oh. They were making plans.\n\nI dropped my pants and kicked off my socks, leaving me in my tented boxers. \"Looks like someone is feeling a little excited,\" Mel said with a knowing smile.\n\n\"Could I see you two together?\" Bella asked Mel. \"I think it's fair, considering you saw us over the cam, and now he's seen us two.\"\n\n\"You want to watch me give him a blowjob?\" Mel asked, slipping from her chair to the floor at my feet, reaching up and lowering my boxers, revealing my achingly hard dick.\n\nBella's eyes watched my cock as it bobbed in the air in front of me and shook her head. \"No, I want to see you two fuck.\"\n\n\"Gladly,\" Mel said, standing up and holding my dick lightly with one hand. \"I've been ready since that first kiss with you.\"\n\nBella blushed and smiled. \"I could tell. You were almost leaking as soon as I went down on you.\"\n\nMel walked me over to the couch and turned back to Bella, \"How do you want us?\"\n\n\"Reverse cowgirl,\" Bella said. \"Stephan, you sit on the couch, and Mel ride him facing out.\"\n\n\"Oh, babe, I know what reverse cowgirl is,\" Mel laughed. \"I did live in Texas after all.\"\n\n\"I guess I don't have a choice in this?\" I asked, and quickly held up my hands in surrender when both women looked at me incredulously. \"I'm not saying I mind, I'd just like a little recognition that I'm not a dildo.\"\n\nMel smiled and leaned closer, kissing me softly. \"Really?\"\n\nI let her push me back onto the couch and spread my legs slightly, Mel stepping over them and backing towards me. Her ass, wonderfully round and fit from years of cheerleading and then being on her feet all day as a nurse, was near enough to my face that I grabbed her hips and held her still for a moment so that I could lean forward and play-bite one of her cheeks while making a growling sound. She laughed and ruffled my hair, and I pulled away and spanked her other cheek lightly. Mel pushed me back fully onto the couch and without any more ceremony reached through her legs to position me at her lips. I watched from behind as she rubbed the head of my dick back and forth and groaned as she slowly sat down onto it, sliding a little more than halfway down the first go, then raising up and sitting again to settle onto my lap with me buried inside her.\n\n\"Oh yeah,\" she groaned, and I replied with my own moan. She lifted up almost all the way off and then plunged down again, taking me to the root. Then Mel leaned back as she settled onto me, ass pressing into my hips and her bare back leaning against my chest. She lifted her feet and braced them on my knees after spreading them wider with directing foot. Or joining was spread open for Bella to watch and I almost asked her to take a picture so I could see what it looked like.\n\n\"Fuck me,\" Mel groaned over her shoulder to me, and I awkwardly started thrusting up into her. For all that I had done this position before, it had never been quite like in porno's; it had always been on the bed with the woman still riding and grinding. It took me some time before I could build up a rhythm, and even then it wasn't very fast. I couldn't tell where Bella was, or what she was doing or seeing since Mel blocked my vision, but my cousin seemed to be enjoying it.\n\nShe gave me a break and rolled her hips, taking control of our fucking for a bit, and I reached around her body and used two fingers to brush over her clit, teasing and squeezing it blindly. I felt Mel shudder through her back on my chest and kissed the smooth skin of her neck, her blonde hair cascading around me as she leaned her head back and moaned. Once my legs weren't burning quite so much I let her clit be and took hold of both her hips, thrusting up into her again.\n\n\"Fu-u-u-uuuck,\" Mel groaned loudly and her pussy clenched, and then I felt a new sensation, slithering on my shaft and then down to my balls. Craning my neck, I looked around Mel and found Bella kneeling between our legs. She had started by tonguing Mel's clit and was now sucking and lapping at my balls as I continued to fuck up into Mel.\n\n\"Oh, fuck,\" I groaned, the double sensation sending my balls roiling as I held onto Mel's hips and pulled her down onto me. The slapping of her ass against my pelvis was loud and between Mel's slow leaking juices and Bella's spit it was starting to sound wet.\n\n\"Holy,\" Bella said. \"I think he's about to burst, his balls clenched up and his dick looked like it flexed. That was so hot.\"\n\n\"Yeah. About to.\" I grunted out.\n\nMel wiped some hair away from her face and started playing with her own clit, her other arm steadying herself on the couch. \"Where do you want him to come?\" she asked Bella.\n\nThere was a moment of silence and then Bella said, \"If you let him cream-pie you, I'll eat it.\"\n\n\"Oh fuck,\" I said, losing control at the thought. \n\nMel bobbed her hips a couple of times as I came, the feeling of her warm confines squeezing and rippling as she laughed throatily. \"I think he liked that idea. Oooh, I love that feeling.\"\n\nAs my orgasm finished the tension in my body drained away and I gulped a huge breath of air. \"Fuck me,\" I breathed out.\n\n\"I did,\" Mel chuckled, easing herself off and then sitting on the couch next to me. We both breathed in silence and my eyes drifted to Bella, sitting on her knees at our feet. \"Do him first,\" Mel said, gesturing to my dick.\n\nBella licked her lips and glanced at me but my only reaction was a blink and raising my eyebrows. My dick was currently at half-mast, covered in both mine and Mel's cum. Bella gently reached out and took the base of my shaft between her thumb and forefinger and tilted my dick forward, then leaned and took the whole thing in her mouth. She closed her eyes and slowly let her lips drag down the length of the shaft as if she were savouring the mixed taste, the head of my dick finally slipping from her lips. Then she did it again, this time swirling her tongue around at the same time as she opened her big eyes and looked up at me.\n\n\"God damn,\" I said, my hand wandering to Mel's thigh and squeezing. She took it and brought two of my fingers to her messy pussy, swiping them through her lips, then raised my hand to her mouth and sucked on the fingers.\n\nBella hummed in surprise and released my dick, which had quickly grown full again.\n\n\"Now get up and ride him,\" Mel ordered Bella.\n\nBella looked to Mel, biting her lips with her eyebrows raised in sweet, excited surprise. She scrambled up into my lap and positioned herself just in front of my dick, grinding her clit against it for a moment before raising up and positioning on top of it. She eased down much slower than Mel had, though Mel had also taken my dick half a dozen times at least in the last twenty-four hours. I watched as her pussy lips spread to accommodate me while she held her legs in a wide stance so both Mel and I could see the action. \"Fuck, yes,\" Bella groaned, bouncing lightly up and down to get used to me. \"I've wanted this for years.\"\n\n\"You've been a good, patient girl,\" Mel whispered to her soothingly. \"Stephan's little office slut, trained to be good but always wanting to be bad.\"\n\n\"God, I've wanted him to bend me over his desk so badly sometimes,\" Bella groaned, sitting down lower, almost taking me all the way. \"I wasn't good, I've been such a tease, trying to get him to fuck me.\"\n\n\"He wasn't with anyone then, that's ok,\" Mel said. \"Now, though, he's mine. Say it.\"\n\n\"He's yours,\" Bella groaned, sitting down all the way as she took me in.\n\n\"Kiss him. Show him how much you wanted him,\" Mel whispered.\n\nBella leaned forward and kissed me, her small breasts pressing into my chest as she wrapped her arms around my neck. I held her sides, my hands roaming up and down the smooth skin there and feeling the ripple of her ribs and muscles as I kissed her back. Her hair fell around us and she smelled different than Mel, more like a wonderful spring day where Mel was the scent of strawberries. Bella started rolling her hips, easing me in and out of her, and my hands slid down her thin waist to her fantastic ass, squeezing her cheeks roughly as she flexed her legs.\n\n\"Good,\" Mel said beside us. \"Now lean back.\" Bella did so, putting a triangle of space between us, angled where we were still joined. Her taught stomach flexed as she continued to work her hips, small chest rising and falling. I loved the way her smaller breasts sat high and perky, brown nipples asking for attention. Mel stood up on the couch and stepped one foot across me so that her ass was hovering just above my head and I was looking through her legs at Bella. \"Now eat me while you fuck him,\" Mel said, wrapping her fingers in Bella's hair and pulling her face to Mel's wet pussy.\n\nI watched, enraptured, as Bella tilted her neck up and her tongue lapped at Mel's labia, slick and wet. Bella continued to roll her hips, stimulating us both, but watching her chin move, her tongue slipping up and down Mel's folds, was such a delicious sight that I almost forgot I was having sex and not just jerking off to the most vivid porn ever. Even the way Bella's neck flexed as she dipped her head and chin higher or lower to change her angle was beautiful and sexy. I watched as her lips and tongue spread Mel's labia, seeking the dark pink center of her pussy and finding a globule of my cum leaking from her, letting it melt out onto her tongue.\n\nFinally starting to wake up from the haze-like state I had been in, I realized I had been holding on to Mel's ankles and let go of them to reach between her legs and cup Bella's small breasts, her nipples poking out hard from between my fingers as I squeezed and massaged them. I let one go and slid my hand down her body to where we were joined and brushed my thumb across her clit. She jumped a little, startled by the sensation, and Mel laughed.\n\nMy fiance pulled Bella's face from her crotch and looked down at the Aussie. \"Good job.\" Then she stepped back over me and knelt on the couch. \"Stephan,\" she said, reaching over and pawing at Bella's open breast. \"Put her on the floor and show her what she's been missing. Fuck her like she's always wanted, for all the times she's craved you and you didn't give in.\"\n\n\"As you wish,\" I said, quoting the Princess Bride, and I knew Mel had caught it because she smiled and rolled her eyes. It had been one of our favorite movies when we were kids. A little part of my brain smirked at the thought that she was now my Buttercup. What did that make Bella, though? She was a princess in her own right as well.\n\nI shifted my weight and picked Bella off of me, slithering from the edge of the couch to the floor. She lay on her back for a moment, my dick having slid out of her and her pussy open and wanting. Instead of just rushing back into her and flipped her over and Bella got onto her hands and knees, back arched and ass popped out. I grabbed her hip with one hand, the other moving my dick into position, and I thrust into her. Bella pushed back, meeting me halfway, and I pulled back and thrust again. Again she pushed back, slamming our hips together. We quickly found a steady, hard rhythm of fucking as her slim, athletic body pushed back against me. Mel sat on the edge of the couch, legs wide as she fingered her pussy, wet from our juices and Mel's spittle, while watching us.\n\nSpanking Bella's firm, pert ass brought a groan out of her, so I did it again and again, the warm sting of my hand leaving red marks on her fair skin. I changed my stroke, leaning forward over her and fucking more downwards as I covered her body with my own. I was pressing against the front wall of her pussy, searching for the right angle to hit her g-spot, and I knew I found it when she cried out wordlessly and her head flung back, knocking me hard on the cheek.\n\n\"Agh,\" I said, eyes wincing as I teared up from the shocking blow, but I kept fucking her. Instead I pushed on her back between her shoulder blades and she lowered until her chest was pressed to the rug. I kept her pinned there while I fucked down into her.\n\nBella shuddered as an orgasm rolled through her, and again when I didn't stop fucking for her to recuperate. \"Fuuuuuck,\" she moaned, head sideways on the carpet as she panted.\n\n\"I'm gonna come,\" I warned.\n\nMel slid from her perch on the couch and leaned her face down next to Bella, \"Do you want to know the rules, Bella?\"\n\n\"Uh-huh,\" she groaned, and I growled a warning to Mel not to take too long with whatever her game was.\n\n\"Rule number one is you meet Stephan every morning in the office and hand him his coffee. Then you get on your knees and you blow him until he comes all over your pretty little face.\"\n\n\"Perfect morning,\" Bella groaned.\n\n\"Rule number two is that you don't ever get to fuck him again unless you beg me for it first. Do you understand?\"\n\n\"Yes,\" Bella hissed, starting to shudder again as another orgasm overtook her. I had to slow my pace, muscles tensed as I fought to hold back my own climax.\n\n\"Say it. Say you'll beg me for his cock,\" Mel demanded.\n\n\"He's yours,\" Bella gasped. \"He's your cock. But I want him so bad, he feels so good. Please let me have his cock, I'll do anything for it.\"\n\nMel leaned down and kissed Bella on the cheek. \"I know. Now get up and jerk him until he unloads all over your face. I want to know what you'll look like every morning when you call me begging for his dick.\"\n\nI knew Mel could get kinky, after all the dirty talk and camshows, and I would have felt bad about Bella and told her to stop if it wasn't for how hard her pussy clenched when Mel demanded she follow the rules. Bella fucking loved it.\n\nShe pulled off of me and spun around, gobbling my cock into her mouth for a moment before resting the head right on her chin, jerking me quickly. \"Come on my face,\" she gasped. \"I want it, I want your cum all over me.\"\n\nMel leaned in next to Bella, watching from close up as I groaned and let go, spurting three heavy globs across Bella's pretty face. Mel took control of my dick from Bella and stroked me firmly, milking out a fourth thick drop that landed right on Bella's lips. Then she turned Bella's face to hers and kissed my cum-covered secretary.\n\n\"Fuck me,\" I said again, watching the two of them.\n\n\"In a bit,\" Mel giggled, smirking at me for a moment as she broke the kiss. \"After I lick all of your cum off of Bella's face and you've had time to recuperate. I want your next load on my tits.\"\n\nI sat back down on the couch and watched as Mel's cute pink tongue slowly cleaned Bella's face in between kisses, their bodies pressing together as Mel's larger tits pressed against Bella's pert handfuls. Mel glanced at me and and a grin slipped across her lips. She was putting on a show for me.\n\nA personal one, just for me. My cousin wasn't a cam girl any more, but my fiance still liked to show off. My eyes trailed down her body, delighting in everything I saw, from head to toe. Even her feet were sexy.\n\nFeet? \n\n\"God damn it,\" I said. Both of them turned to look at me, a thin string of spittle or cum trailing from Mel's lips to Bella's. It slowly drooped and then split, falling to land on their naked chests. \"Never mind.\"\n\n====================================\n\nThe End.\n\nIt's finally finished. This is the end for Stephan, Mel and Bella for now. Perhaps the tiny fragments of ideas I have for them will eventually turn into something more, but this is the end of TWE. Thank you all for reading, and for your patience with this conclusion. I hope these last three chapters have been satisfactory.\n\nI do not know when my next release will be, but to stay up to date with me and find out what might be next you can join my mailing list by sending me some private feedback with your email address. The list recently broke 200 members, which I am still a little amazed at. I appreciate every comment and kind word forwarded my way.\n\nFinally, the 2016 Literotica Readers Choice Awards are in their final days as of this posting. Go check out the forums and vote in your favorite categories, I am sure all of the authors would appreciate your support, as would I on my two nominations.\n\n~ Break.\n\n===================================="
    ],
    "authorname": "BreakTheBar",
    "tags": [
        "camgirl",
        "blonde bombshell",
        "threesome",
        "brunette aussie",
        "australian",
        "office slut",
        "threesome",
        "secretary",
        "cousin",
        "blonde"
    ],
    "category": "Incest/Taboo",
    "url": "https://www.literotica.com/s/technically-were-estranged-ch-09"
}