{
    "title": "Plotting a Course Ch. 06",
    "pages": [
        "Chapter 6: Fleeting Moments\n\nAnother month had passed and I was ecstatic that after class tomorrow I was heading home for Thanksgiving break. I had declined Matt's many attempts at getting me to join the water polo team, but I still saw him twice a week in class. He was always friendly, and fortunately had stuck to his word and hadn't made anymore advances towards me. Matt and I paired up for another project that we presented in class today. The presentation went off without a hitch and I was happy with the result as I headed off to my next class.\n\n\"Hold up Bobby.\" Matt said as he tailed me out of the building. \"Thanks for working with me again.\"\n\n\"No problem.\" I answered as I continued walking.\n\n\"I was wondering if you'd grab a cup of coffee with me Bobby?\" \n\n\"I have class.\" I answered as I stopped to look at him.\n\n\"What about tonight, after you meet your roommate for dinner?\" Matt continued.\n\nI thought about it, there was a warning in the back of my mind, but I suppressed it. \"Yeah I guess.\" \n\n\"Cool.\" Matt said. \"The coffee shop across from campus, say 8:00?\" He smiled as he waited for my reply.\n\n\"Yeah, okay.\" I answered as I headed off to class. I couldn't help but wonder what had I just agreed to? At least I was meeting him in a public place, where he wouldn't try to kiss me again. I barely heard a word the professor said as my mind ran through the various scenarios that could arise tonight. \n\nBilly noticed my distraction when we met for dinner. \"What's got you wound so tight?\" Billy asked, noticing my hands fidgeting on the table.\n\n\"Matt said he wanted to meet me tonight. I agreed to meet him for coffee.\" I answered\n\n\"Matt, as in the guy who tried to make out with you?\" Billy's eyes widened at the thought. \n\n\"Yeah, that Matt.\" I answered. \"Meeting him at the coffee shop, I think I'll be safe in public.\"\n\n\"Do you like him?\" Billy asked.\n\n\"Like him?\" I repeated the question. \"No!\" I answered firmly. Maybe in another world, if I wasn't with Rob, I could like him, but compared to Rob, it was no contest, Rob won in a landslide. \n\n\"Let him down gently.\" Billy smiled at his joke and I shook my head, but smiled back at him.\n\n*\n\nMatt was waiting at a small table for two when I walked into the quiet coffee shop. I would be lying if I said he wasn't handsome. He had shaved off his beard, but his face showed the traces of stubble. His engaging green eyes locked onto me, they were stunning, lighter in color than Rob's, but just as striking. He waved me over and held up a cup of coffee. I had never developed a taste for the hot beverage, but took it from him.\n\n\"Thanks.\" I said as I sat down and took a sip. I couldn't disguise the look that crossed my face as the bitter liquid hit my tongue.\n\n\"You don't like it?\" Matt asked as his nose wrinkled in recognition.\n\n\"Not much of a coffee drinker.\" I admitted with a smile.\n\n\"Damn, sorry.\" Matt said as he took the cup from me and headed to the counter. He returned with a new cup. \"Try this.\" I took a hesitant sip, but smiled when the hot chocolate hit my lips. \n\n\"Mmm, better, thanks.\" I said, he smiled and sat down. \"So what'd you want to talk about?\"\n\n\"I really like you Bobby.\" He said. \"You're all I can think about.\"\n\n\"Matt.\" I started, but was interrupted. \n\n\"I know you have a boyfriend, but if there is any way, any shot, I have to take it.\" Matt reached for my hand, but I pulled it away before he could touch it.\n\n\"I'm sorry Matt, there's not a chance.\" I felt bad as his smile faded from his face. \"You're a good looking guy Matt, I'm sure you'll have no problem finding someone else.\"\n\nMatt shrugged before speaking. \"I guess, but you're so damned cute Bobby.\" I felt heat rush into my cheeks and immediately wanted this conversation to be over. \"Your boyfriend is a lucky guy.\"\n\n\"He knows.\" I smiled as I thought about how lucky I was to have Rob.\n\n\"Well if anything changes-.\" \n\n\"It won't.\" I cut Matt off before he could finish that statement. \"Thanks for the hot chocolate.\" I said as I stood up from the table. \"I'm sorry Matt.\" I was turning around to walk out the door when I felt his hand on my shoulder. I braced myself to retreat, expecting him to try to kiss me again, when I turned around he was holding out his hand for me to shake.\n\n\"Friends?\" He suggested, his mouth curled up in a slight smile. \n\n\"Friends.\" I answered shaking his hand before heading to my dorm. \n\n**\n\n\"Hey dad.\" I said into my phone as I headed back to my dorm after my final class before Thanksgiving break. \n\n\"Hey Bobby, we'll be there in about thirty minutes.\" My dad spoke into the phone.\n\n\"Good I'll be ready, I packed this morning. We're still picking Rob up on the way home right?\" I asked, feeling slightly guilty for missing Rob more than my parents and sister.\n\n\"Actually...\" He hesitated a moment before continuing. \"Rob's uncle is picking him up; he'll be at home when we get back.\n\n\"Oh.\" I tried to hide the disappointment at having to wait longer before seeing Rob. \"Alright, well just call me when you're here and we'll head down.\" I ended the call as I headed into my room.\n\n\"Hey Billy, my parents will be here in thirty.\"\n\n\"Cool, I'm ready now.\" He answered; his last class had been cancelled so he was going to ride home with us. \n\n\"You gonna see Katie when we get back?\" I asked Billy, making conversation before my parents arrived.\n\n\"I dunno.\" He shrugged. \"I only talked to her a couple of times since we've been gone. We'll see how it goes.\"\n\n\"Fair enough.\" I answered as I double checked to make sure I had everything I needed. \"I don't think she's seen anyone else.\" I shared, seeing if Billy wanted to keep seeing Katie.\n\n\"Oh yeah?\" He nonchalantly asked, but I think I saw a hint of a smirk on his face at the thought. My phone started ringing and I pulled it out and saw a picture of my dad.\n\n\"We're heading down now.\" I said into the phone as Billy and I grabbed our bags and headed down to catch a ride home. My dad's car was sitting out front and noticed that instead of my mom riding shotgun, it was Rob. He jumped out of the car and ran up to me. I dropped my bag on the ground as he picked me up into a suffocating embrace.\n\n\"I thought your Uncle Charlie was picking you up.\" I smiled happily when he placed me back on solid ground and stole a quick kiss.\n\n\"Not happy to see me?\" He teased with a smirk on his face. My dad got out of the car and opened the trunk, he picked up my bag and took Billy's and placed them in the trunk.\n\n\"I guess you're up front with me.\" Dad told Billy before he pulled me into a hug.\n\n\"Glad to see you kiddo.\" Dad said as he tousled my hair.\n\n\"Thanks dad.\" I said as we all got situated in the car. I would have been sitting in Rob's lap if my dad and Billy hadn't been in the car. I settled for just leaning against his shoulder as we all caught up on our months apart. Billy and my dad settled into a comfortable conversation about football and school. I looked over at Rob and his green eyes were twinkling fondly at me. He wrapped his arm around my shoulder and I just melted in to Rob, cuddling against his side.\n\nThe combination of Rob's comforting embrace and the movement of the car must have lulled me to sleep. When I came to Rob was lightly rubbing the hair on my head, which was in his lap. Rob smiled at me when I yawned and sat up. Dad had just dropped Billy off at his house and within a few minutes we were back at home.\n\n\"Thanks Mr. Thompson.\" Rob said as we headed to the trunk to unload our bags.\n\n\"Yeah thanks dad.\" I said as I grabbed my bag and headed into the house.\n\n\"No problem boys.\" Dad answered following us inside. My mom and my sister, Emily, were waiting in the den for us. We set our bags down and exchanged hugs and pleasantries for a while before we headed to our room. \n\n\"He didn't.\" I murmured as I opened the door to my bedroom. My old full bed was back and the bunk beds were gone. I looked at Rob who had a Cheshire grin on his face as he wrapped me in a hug. \n\n**\n\nRob wanted to go for a run so I joined him and we jogged around town. \"You care if I stop? I wanna make sure I can work over Christmas break?\" Rob asked as we approached the deli. \n\n\"Sure.\" I slowed to walk and followed him into the shop.\n\n\"Thought I'd never see you again.\" Shirley, one of the waitresses said as we entered the restaurant. Rob went over to chat with her.\n\n\"Bobby.\" I heard my name and saw the smiling faces as I walked over to join Katie and Becky at a booth in the back corner. \n\n\"Hey, how've you been?\" I asked as I slid in the booth beside Katie.\n\n\"Good, I see Rob every now and again.\" Katie answered with a smile on her face. \n\n\"Good.\" Becky answered before she took a sip of her drink. \"You won't believe this.\" \n\n\"What's that?\" I asked. Becky pulled out her phone and navigated to a profile on a social network. \n\n\"I'm still friends with Eric, look at this.\" She handed me the phone and I saw a picture of my former bully. It said he was attending school at Penn State. I thumbed further down the profile, wondering what Becky wanted to show me. I found the line that read 'In a relationship with Brad Bowden.' \n\n\"No way.\" I stammered as I looked up at Becky who was grinning.\n\n\"I told you I thought he was gay.\" She proudly said. \"Look at this.\" She took the phone from me and navigated to some pictures. She pulled an image of two smiling male faces. Eric didn't look so bad when his smile replaced his evil scowl. The other guy, who I assumed was his boyfriend was cute, a definite twink with hair so blonde it was almost white. \n\n\"Good for him.\" I said, unsure of how to react to the revelation. \n\n\"You seen Billy?\" I turned my attention to Katie beside me.\n\n\"He called me last night, we're going to dinner tonight.\" She smiled as she spoke and I smiled knowingly back at her.\n\n\"Hey.\" My charming boyfriend said as he sat across from me and beside Becky in the booth. We chatted a few minutes before Rob and I started heading back home.\n\n\"So Becky just showed me a picture of Eric and his boyfriend.\" I shared the news with Rob. He stopped and looked at me for a second.\n\n\"Eric, as in the guy who has made our lives a living hell?\" He questioned.\n\n\"The same.\" \n\n\"Good for him.\" I saw a smirk spread across Rob's face. It was pretty chilly out and Rob rubbed my shoulders trying to warm me up as we headed inside. The house was empty and I smiled at the thought. Finally Rob and I had the house to ourselves. My dad was at work and my mom and sister went across the bay to go grocery shopping for Thanksgiving. It had been almost a month since our hurried coupling in the College of Business bathroom.\n\n\"You're it.\" I said as I slapped Rob's perfect ass and sprinted up the stairs. I heard Rob laugh as he chased after me. I kicked out of my shoes and pulled my shirt off as he entered the room.\n\n\"Gotcha.\" Rob smiled as he pulled me into a sizzling kiss. I moaned involuntarily when I felt his masterful tongue slide into my mouth. It played chase with my own as he kicked out of his shoes. Our sweats hit the floor simultaneously and Rob quickly pulled his shirt over his head. \n\n\"Oh Robbie.\" I sighed as I put my hands on his well defined pecs. I felt his strong heart racing under my palm as Rob locked eyes with me. Without warning, Rob swept me off of my feet and placed me on the bed. We were both just in underwear and socks as we rolled around until we were a tangled pile of limbs. Somehow I was lying on top of Rob and I felt his strong hands massaging my ass through the cotton of my underwear. It felt amazing and I could feel Rob's hardness poking into my own as our crotches pressed together. \n\n\"You're so big Robbie.\" I groaned as I massaged Rob's growing member in his tight boxer briefs. I heard Rob chuckle and stopped to look at him. \"What?\" I asked.\n\n\"Nothing babe. Don't stop.\" Rob practically growled, urging me to continue. \n\n\"What's funny?\" I sat up, demanding an answer. \n\n\"You think I'm big, you should see Clint.\" Rob answered. I tilted my head to the side and studied Rob, not sure how to respond to Rob's admission. \"We share a locker room Bobby; I haven't hooked up with anyone, just an observation.\n\n\"Clint your roommate?\" I asked, raising my eyebrows.\n\n\"Yeah, he's hung.\" Rob bluntly admitted.\n\n\"Can't be much bigger than this.\" I said squeezing Rob's thick, eight inch bulge again between my fingers. Rob smiled and reached for his phone on the nightstand. \"You do not have a picture of him.\" My eyes widened as he swiped his finger across the screen.\n\n\"Nope, but I bet he'll send one, should I send it?\" Rob asked showing me the message he had typed out: 'Bobby doesn't believe that you are hung like a donkey.' \n\n\"Don't send that.\" I implored, immediately getting embarrassed. \n\n\"He won't care, he likes the attention.\" Rob said as he hit send on his phone.\n\n\"Robert Johnson you did not just send that.\" I was shocked and punched him in his arm as he fell back laughing on the bed.\n\n\"Come here babe.\" He patted his chest and I climbed back on top of him. He was still grinning when he pulled me against his firm chest. \"Sorry babe.\" Rob said. I could feel his chest shaking with laughter. I couldn't help but laugh with him.\n\n\"No you're not.\" I chuckled as he began placing quick kisses along my collar bone. His distraction worked and I let Rob kiss my neck and face. Rob's phone beeped with a message and he reached for his phone. I watched as he unlocked it and his eyes went wide before he turned the phone to face me.\n\n\"See babe.\" Rob said as he handed me the phone. I looked at the screen and I know my eyes bugged out of my head. The screen was a picture of Clint from his belly button to his knees. He had a toned stomach that was covered with thick fur. It looked like he had never trimmed his unruly bush, but my eyes were drawn down his groin into a thick cock that hung halfway down his thigh. His balls swung like eggs in a hairy sac. His white jockstrap was tucked under his balls and I couldn't help but stare.\n\n\"Holy shit Rob.\" I was shocked by the image in front of me. \"What's wrong with the head though?\" I questioned as I examined the image more closely.\n\n\"He's not cut.\" Rob answered \n\n\"Oh, I've never seen one like that.\" I admitted as Rob nodded. \"Have you seen it...\" My curiosity embarrassed me and I didn't finish the thought.\n\n\"Hard?\" Rob finished my sentence and I nodded. \"No, I walked in on him beating off once, but he pulled his pants up pretty quickly.\" Rob laughed and I grinned at him.\n\n\"Well this is all I want, all I need.\" I said as I squeezed his thick dick in my hand again.\n\n\"Good, cause it's all yours.\" Rob answered, pulling me in to a passionate kiss. Rob's phone beeped again and I groaned. \"Ignore it babe.\" Rob pleaded, but I had already picked up his phone. The message was from Clint and I opened it.\n\n\"Clint wants to know what I thought of it.\" I read the message to Rob who started laughing and grabbed the phone from me. He showed me the message he typed out before sending it. 'He said it might be a little bigger than mine.' I chuckled and put the phone down and reached for the waistband of Rob's underwear. He lifted his butt up as I tugged them off and tossed them on the floor. Rob's cock was leaking delicious nectar and I eagerly lapped it up with my tongue. The taste of Rob's juices and his moans had me yearning with desire. Rob's phone beeped again but I was blissfully enraptured in pleasing Rob. \n\n\"Oh fuck that's good.\" Rob sighed as he slid his phone under the pillow so it wouldn't be a distraction. I swirled my tongue around Rob's mushroom tip and was rewarded with another drop of pre-come. I slowly licked down Rob's engorged shaft and gently sucked his balls into my mouth, one at a time, lightly lolling them with my tongue. \"Bobby.\" Rob whispered as he gently pushed me onto my back. My head hit the mattress as I felt Rob tugging to release my trapped erection. The head of my swollen dick slapped against my tight stomach when it was freed. \n\n\"Mine.\" I faintly heard Rob's words before he swallowed me whole. The intense heat of his mouth enveloped me as I thrashed my head side to side while he sucked me deep into his mouth. \n\n\"So good.\" I moaned as he continued pleasuring me. My eyes fluttered shut and Rob must have sensed that I was close, because he came off and pressed my legs into me so he could have better access to my puckered entrance. I gasped when I felt his stiff tongue probing me open, slowly slithering inside, loosening my channel. I was almost thrashing on the bed, delirious with pleasure as Rob's skillful tongue maneuvered inside me. \"Robbie.\" I was panting with desire as I spoke. \"I need you.\" I opened my eyes and caught his grin as he fumbled in the drawer to find the lube. Rob dribbled the cool liquid on my trembling hole and I sighed when I felt one of his thick fingers slide inside. He quickly added a second finger, causing me to squirm, I was desperate for more.\n\n\"Please.\" I whimpered, needing Rob to fill me.\n\n\"You're so hot when you beg Bobby.\" Rob's voice with thick with lust as he positioned himself at my entrance. \"I missed you so much babe.\" I exhaled deeply as Rob slowly descended into the depths of my gut. I was filled with a warm heat and when his helmet brushed against my prostate my eyes sealed themselves shut. Rob practically bent me in half as he bred me. I lost track of the words that were tumbling out of my mouth as he pounded me harder than he ever had. His long pipe had every nerve inside me ablaze with passion. \n\n\"Don't stop.\" I begged. I was on the precipice of orgasm as he pounded me deeper into the mattress, testing the springs. With my last moment of control I squeezed my sheath tightly around Rob's thrusting organ.\n\n\"Fuck. Bobby.\" Rob roared and I exploded, feeling my insides constrict against Rob's glorious cock. I felt hot blasts splat across my cheek and then my chin as Rob tumbled over the edge with me. \n\n\"Fill me up Robbie.\" I moaned with desire as he focused on his final assault, a bead of sweat dripped off of his face. His face was tight with concentration and I felt his hard cock swell inside me. \"Love you.\" Rob stammered out and I felt his dick pulsing, sending his hot spunk into my constricting canal. I fell back limply as Rob practically collapsed on top of me. When I felt his cock slip outside of my seed-filed hole I opened my eyes to look at him. Rob's green eyes were locked on mine and I smiled, lost in the look of pure love on his face.\n\n\"I love you Rob.\" I sighed as he reached for his underwear on the floor and gently wiped my release from my come-splattered face. \n\n\"I love you more Bobby.\" Rob sighed as he slid in the bed beside me. My head was resting on Rob's chest, he had his arm around me, and I was almost asleep.\n\n\"Holy shit.\" Rob gasped and I mustered enough energy to tilt my head and look at him. He was holding his phone and he twisted the screen so I could understand his reaction. I sat up and rubbed my palms over my eyes before looking at the screen. I was speechless as I stared at an enormous, broad, long erection. The foreskin was pulled back exposing a swollen red head.\n\n\"Damn.\" I muttered as I stared at Clint's erection on the screen. \"I dunno if I should be jealous or feel sorry for whomever is taking that.\" Rob chuckled as he scrolled down to read the message. 'A little bigger?' I watched as Rob typed 'impressive' in response and pressed send.\n\n\"Me either.\" Rob answered. \"He's never talked about a girlfriend. He slammed his laptop shut that time I walked in on him.\" Rob wrapped his arms tightly around me and any thought of Clint left my mind as I felt cherished and drifted off to sleep, safe and secure in Rob's strong arms.\n\n**\n\n\"Happy Thanksgiving.\" I smiled as Rob yawned and stretched.",
        "\"Happy Thanksgiving Bobby.\" Rob said pulling me into kiss. We quickly got up, showered, and dressed. We were heading downstairs when my phone pinged with a message.\n\n'Happy Thanksgiving Bobby.' I read the text message from Matt. I looked at Rob confused, Matt had never texted me before. I responded 'you too' before putting my phone away. \n\n\"Who was that?\" Rob's eyebrows were raised as he asked the question.\n\n\"Matt.\" I answered. \"From class.\" I saw a flash of anger cross his face as he considered the information.\n\n\"He's never texted before, it just said Happy Thanksgiving.\" I said to Rob, I even handed him my phone so he could see. \"I kinda feel bad for him.\"\n\n\"I don't trust him.\" Rob stated. \"I think he's trying to steal you.\"\n\n\"That will never happen Robbie.\" I said. \"You've got your hooks in me.\" Rob smiled pulling me into a hug.\n\n\"You're mine, and I'm yours babe. \" Rob kissed my forehead before we headed downstairs to help my mom prepare for Thanksgiving.\n\nMy grandma decided she didn't want to host Thanksgiving this year. My mom worked with machine like precision and she had everything perfect. Grandma was the first to arrive, and she eagerly pulled Rob, Emily, and me into hugs. She was so accepting of my relationship with Rob that my heart filled with love just from the smile on her face. My aunt, her husband, and kids showed up a few minutes after noon, and the house filled with happy chatter. \n\nEverything on the table was delicious and Rob and I greedily enjoyed the home cooked food that we had missed over the past few months. \n\n\"You boys getting enough to eat?\" Grandma asked with a grin on her face.\n\n\"Yes ma'am.\" Rob answered after quickly swallowing another bite of food, which caused the table to erupt with laughter. \n\nAfter dinner Emily and my grandma were playing a game of Spades with my cousins. Rob and I joined them in the den and chatted while they played.\n\n\"You play Spades Rob?\" Grandma asked.\n\n\"No ma'am, I know Poker, and Rummy.\" He answered.\n\n\"Oh I think I remember how to play Rummy.\" She answered, flashing me a wink. \"You wanna play later?\"\n\n\"You're on.\" Rob answered smiling warmly at her.\n\n\"Rob.\" My mom interrupted as she looked at him. \"I invited your parents over for lunch, but they declined. I made this pumpkin pie, if you want to take it to them.\" I could tell my mom's gesture touched Rob, his mom still spoke to him, but his father hadn't said a word to him since he found out that Rob was gay. \n\n\"Thanks Mrs. Thompson, I really appreciate it. \" Rob tried to force a grin, but I could see the sadness written on his face. \n\n\"I'll come with you Rob.\" I volunteered.\n\n\"Thanks Bobby.\" Rob looked at me with a melancholy expression as I followed him out to his truck. Rob opened the door for me before we headed to his parents' house. He reached for my hand and I quickly took it, lacing our fingers together as we headed down the road. \n\n\"My aunt is here.\" Rob observed as we pulled into the driveway. I nodded noticing the extra car. \n\n\"You okay?\" I asked Rob before he knocked on his front door. He didn't answer but he looked at me and shrugged. His dad answered the door and looked at us. There was a stern look on his face as he gazed at us before he walked back inside without a word.\n\n\"At least he didn't slam the door on us.\" I said, trying to make the best out of the situation. Rob gave me a slight smile as I followed him through the open door. \n\n\"Rob, Bobby.\" Mrs. Johnson was up and smiling when she saw us enter the house. She quickly pulled Rob and me into hugs as she led us into the den.\n\n\"Bobby's mom made this for you.\" Rob said as he handed his mom the pie.\n\n\"That's sweet of her.\" She answered as she set the pie down on a table. \"I'm sure it's delicious.\" Rob's aunt was in the den with his mom. His dad was noticeably absent. \n\n\"I guess Uncle Charlie didn't come?\" Rob asked his mom.\n\n\"No Rob, your father actually invited him, but he had other plans.\" Mrs. Johnson answered with a solemn expression.\n\n\"Dad invited Uncle Charlie?\" Rob questioned, not sure he heard his mom right.\n\n\"Yeah.\" Her voice was almost a whisper.\n\n\"Is he talking to Uncle Charlie?\" Rob asked his mom about his dad's brother. \n\n\"Not really.\"\n\n\"Why didn't y'all accept the invitation from Bobby's parents?\" Rob asked.\n\n\"Your father isn't ready for that Rob. Dinner with your boyfriend's family is a little too much for him right now.\" \n\n\"Oh.\" Rob answered, considering her response. \"Well we better head back, I promised Bobby's grandma that I'd play a game of Rummy with her.\" Rob's mom walked over to him and pulled him into a tight hug.\n\n\"He'll come around Rob.\" I barely managed to hear her words as she spoke to Rob. \"I love you Rob, I'm so proud of you.\" Makeup stained tears slid down his mom's face.\n\n\"I love you too mom.\" Rob said before we exited the house and headed back home.\n\n**\n\nAs expected, my time with Rob wasn't enough. The Sunday before classes started Billy caught a ride with us back to school. Rob held my hand the entire time, tracing soothing circles on the back of my hand with his thumb. When we pulled in front of Rob's dorm he got his bag out of the trunk. My dad and Billy waited in the car as I walked Rob to his dorm. He stopped in front of the building and dropped his bag on the sidewalk. \"I'm going to miss you Bobby.\" He admitted before I felt his lips lightly brush my cheek.\n\n\"I'm going to miss you too Robbie, more than anything.\" I answered as I closed my eyes and planted my lips on Rob's. I heard the approaching footsteps and reluctantly separated from Rob. \n\n\"Hey roomie.\" I heard and I saw a mountain of a man walk up and slap Rob on the back. He was massive, at least six and a half feet tall. He had a childlike smile as he settled in beside us. \n\n\"Hey Clint, I want you to meet Bobby.\" A smile spread across Clint's face, I could feel the blush rising up my neck at the thought of meeting Clint. I held my hand out to shake Rob's roommate's hand. I was shocked when he pulled me into a hug, lifting me almost a foot off of the ground.\n\n\"The famous Bobby.\" He said snickering before he put me down. I looked wide eyed at Clint before I glanced at Rob who was trying to suppress a laugh. \"Sorry about that little dude. I feel like I know you the way this one talks about you.\" He grinned as he poked Rob in the ribs. I felt heat rush to my cheeks at the comment and he patted my back and stepped away to do a choreographed handshake with Rob. \n\n\"Nice to meet you Clint.\" I managed to say and he nodded.\n\n\"Good to meet you too Bobby.\" He put his duffle bag over his shoulder and turned towards their dorm.\n\n\"Well I'm heading in.\" Clint said. He paused and looked me in the eyes before flashing me a wink. \"He's cute Rob.\" Rob's eyes widened and he turned to look at his roommate who erupted in laughter before he headed inside. Rob shook his head before he sighed and pulled me tightly to him.\n\n\"I can't keep doing this babe.\" Rob's words caused me to pull back and look at him. His emerald green eyes were glistening with unshed tears.\n\n\"Doing what Robbie?\" I whispered in question. He pulled me closer and I felt his warm breath ghost across my ear.\n\n\"Saying goodbye to you.\" What little resolve I had crumbled as I felt a tear escape my eye. I inhaled deeply, breathing in Rob's comforting scent, and tried to regain some composure before looking at him. \n\n\"Me either.\" I clung to Rob, not wanting to relinquish my grip.\n\n*The story continues in Chapter 7*"
    ],
    "authorname": "VaRiverWriter",
    "tags": [],
    "category": "Gay Male",
    "url": "https://www.literotica.com/s/plotting-a-course-ch-06"
}