{
    "title": "Moving On",
    "pages": [
        "I stood staring at the casket being lowered into the ground. I could hear the quiet roar of traffic and muted conversation in the background as the friends and family left my wife's graveside services. My children Alexander age 21 and Chelsea age 20 stood on each side of me. We were wrapped in each other's arms and in our sorrow. I felt them shaking as they quietly cried along with me. Unfortunately their sorrow was much greater than was mine.\n\nI knew I should be more upset at Joan's death but, in a warped, perverted way I was pleased it had come to this. At least this way I was spared the pain and suffering of a divorce and the financial disruption it would have entailed. A divorce you ask? Well, yes. You see the night she died in a traffic accident was the night I found out I was married to a lying, cheating slut.\n\nI let out a wavering sigh and remembered once again the happiness of our early years and how my marriage spiraled out of control over the last two years. Joan and I had been going steady our last year of high school and first year of college. We became intimate and we found we both loved to fuck. We almost lost our scholarships the first semester of college because we took to the party scene and sex so well. Oh, sure we had to live in the dorm but we still found a way to be together nearly every night. Like the young sexual beings we were we found a place to screw several nights a week.\n\nJoan wasn't on the pill. Our birth control of choice was rubbers. Occasionally when she thought it was safe we would go bareback. We both preferred the natural feeling of unprotected sex. I asked many times for Joan to go on the pill but she refused because she did not want to take a chance of her parents finding out. As is normal, a time or two a rubber broke. We never did figure out if she got pregnant because of a broken rubber or if one time she wasn't \"safe\" like she thought she was. Whatever the reason, she did get pregnant and we elected to get married. Since she had to care for the child Joan did not finish college. I continued and promised her she could return to college to finish her degree after we were settled and the kid was old enough for day care.\n\nIt seemed like a good time for Joan to return to college never came. Finally when Alexander was a college freshman and Chelsea a high school senior Joan enrolled in college once more. She took to it like a duck to water. It was as if she had never quit, she immersed herself in the class work and, unfortunately, she decided to experience the entire college experience. She made friends that were slightly younger than her all the way down to our children's age. If they were \"good people\" she took them into her circle of friends. As the got more and more wrapped up in the college social scene she began to change. She was no longer my loving stay at home wife. She began to treat me with disrespect and got upset when I complained about all the time she spent away from home in the evenings. She began to come home later and later and many times she was drunk and her clothing was mussed. Joan became distant and resented social outings with our friends or for my job.\n\nOh, sure, she had a reason for being late coming home on non-class nights as well as nights she had classes. According to her, she had to study in the library, she had a night course then afterwards she and some of her friends went to a local hang out to discuss the class. She needed to unwind, etc. I guess I was like most cuckolds. I just didn't see the signs of a cheating slut. All I knew for sure was our sex life went from full ahead to dead stop within about a year of her returning to college. She always had an excuse—too tired, headache, has to get up early the next day and so on. I got laid maybe once a week if I was lucky and then it was as if it was just a favor she granted me. \n\nLiterally my world came crashing down on a Thursday evening. Joan had a night class that should have ended about 9:20 p.m. Considering the distance we lived from the University and traffic she should have been home no later than 10:15. I finally gave up and went to bed without her at 11:30. Of course I was angry. She had promised me she would stop staying out with her friends, that she would come home early—HA! \n\nMy doorbell ringing awakened me at 1:20 a.m. Before I got to the door someone began pounding on it. \"OK, OK,\" I yelled as I grabbed my pants (I sleep nude), turned the bedroom light on and stumbled toward the front room. \"Who is it?\" I asked. Finally I reached the door and flung it opened. I was angry, expecting to find my drunken wife wanting in and unable to get her key into the lock once more.\n\nI stopped in shock when I saw a police officer standing on my porch. I looked further out through the opened door and saw a black and white sitting in my driveway. The officer flinched back then he asked, \"Mr. Rowland?\" \n\n\"Yes.\"\n\n\"Is your wife Joan Rowland?\"\n\nWhen I nodded my head yes the officer continued, \"Mr. Rowland I am afraid I have some bad news for you. The van your wife was riding in this evening was hit broadside by a semi truck. I am afraid she and the three young men with her died in the accident. The semi driver had apparently been drinking and ran a red light at a high rate of speed. I'm sorry sir. Are you alone sir or is there someone you can call? I\"\n\nAbout that time my daughter Chelsea came wandering down the stairs. She was dressed in her robe and was rubbing sleep out of her eyes. \"Daddy, what is it?\"\n\nThe officer looked at her then he said, \"Sir, I'm sorry. If you would stop by the station in a day or two the accident report will be ready. We will also need you to view the body for verification at your earliest convenience.\" He tipped his hat and said, \"Ma'am. I'll just leave you folks now. Once again, I'm sorry.\"\n\nI stood in the door watching the police car back from my driveway then accelerate away. I felt the tears running down my cheeks and then Chelsea wrapped her arm around me and guided me back into the house. After I told her what had happened we sat together in the living room crying. \n\nWe dozed sitting together on the couch. Finally about 6 a.m., I shook myself and began to make plans for the next several days. I called my son at his apartment, then Joan's parents and my parents. I also called the funeral home and made arrangements for them to pick up the body. I was still in a state of shock but was beginning to function somewhat. Before I had much time to think of the implications of my wife's death a man from the funeral home called. He said they could not pick up the body until after I had positively identified it.\n\nI called to make arrangements to view Joan's body. While I was talking on the phone I remembered the officer had said Joan was killed riding in a van. I called the police to verify that she was not in her car. I also asked about her purse and other personal effects. The officer told me they had no personal effects of Joan's. The records showed they had identified her tentatively based upon a medical warning bracelet she was wearing. After I had identified Joan's body my daughter and I went to the university and drove around until we found Joan's parked car. I gave Chelsea the spare key. I waited until she had the car started then drove off toward my home with her following. \n\nWhen we arrived home Chelsea and I searched the inside of the car for Joan's purse and books. When they weren't there we opened the trunk and found several items—many which should not have been there. Joan's purse was lying neatly in the trunk on top of the carefully folded dress she had worn to class the night before. When we opened her purse we found several unused condoms. Later that day, to pass time I began to clean out the car and found three used condoms under the front seat. I was beginning to become upset, nay angry. \n\nOccasionally Chelsea drives our car to college instead of her small pick up truck. My first thought was she had entertained one of her boy friends in the back seat and let him discard the used condoms in the floor. I backed out of the car with the damning evidence in my hand and yelled, \"Chelsea! Come here a minute please.\"\n\nWhen Chelsea came into the garage, her eyes still red from crying I turned to her and snarled, \"How do you explain these?\" and shook the condoms in her face. I watched it turn white, then red as I resumed speaking. \"I thought...No; I hoped we had raised you better than this. You know rubbers aren't the best form of birth control. I know your mother told you the trouble you can get into using them. How could you take a chance like that?\"\n\nChelsea stood looking at me in shock, then her face broke down and she began bawling once more. Through her tears I heard her say, \"Oh, Daddy, how could you even think I would do something like that? I am on the pill and do make a new boyfriend use a condom but I would NEVER leave them in Mom's car!\"\n\n\"Are you telling me these aren't yours? You borrowed the car last weekend. Who else could...?\" I felt my stomach clench and I became nauseous. I stopped speaking and stood looking at my daughter. She was staring into my eyes and I saw the same thought hit her too. Her hand came up to her mouth as she flushed once more. \"OH,\" she said. \"Oh, no, no Daddy it couldn't be... Maybe it was Alex. He uses Mom's car sometimes.\"\n\nThe rest of that day and the next were filled with phone calls and visits from family and friends. Our out of town family began arriving for the services. Finally, I called the police station and found the accident report was ready. I told my family I was going for it and Chelsea looked up from her conversation. \"Wait Daddy. I'm going with you.\"\n\nI started to tell her no, that I wanted to be alone but she kept talking, not letting me get the statement out. \"NO Daddy. I'm going. You don't need to do this alone and besides...Well\" \n\nWhen we got to the police station and told the female officer what we were there for she got a sad look on her face. She turned and went to a file cabinet in the back. She took an envelope from a file and walked back to the window. She placed the envelope on the counter and held her hand over it. She looked at my face and said, \"Mr. Rowland I don't know how much you've been told about this accident but...\" She took a deep breath and let it out then continued, \"You really shouldn't look at this report at all if you don't have to. Just let your wife go and keep the good memories. For what it's worth I'm sorry sir.\"\n\nI stood there confused for a moment then pulled the report from under her hand. \"Thank you Officer. We'd been having some trouble but we loved each other deeply. Of course we will have the good memories of our life with Joan.\"\n\nThe officer gave me a pained look and turned back to her desk as Chelsea and I walked out of the station. When we got into my truck I took a moment and opened the report. The first thing I saw was a stack of photographs. The van was a mangled mess with the cab of the semi resting on it, the front bumper just about where the center seat would have been. I turned to the next picture and caught my breath. I felt my stomach clench and I let out a deep sob.\n\nChelsea turned to me and said, \"Daddy, what's wrong?\" I shook my head and tried to stuff the pictures back into the envelope. I was crying so hard I was having trouble breathing. I felt my stomach roll and I began to feel my breakfast trying to come up. I let the envelope drop and just got the door opened when my stomach began emptying itself onto the parking lot.\n\n\"Oh, nooooo,\" I heard Chelsea moan. I finished throwing up and wiped my mouth with the back of my hand. I turned back into the truck in time to catch my daughter as she grabbed me in a hug and began crying.\n\nWe now knew why Joan's dress had been folded in the trunk of her car. The pictures and the write up told the whole sordid tale. Joan had been in the back of the van. She was found with no clothing on and neither of the two young men in the back with her was dressed either. She had bitten one young man's cock almost off when the semi impacted the van. The other man and she had been trapped in the wreckage. He was found still trapped between her thighs. Tests showed Joan had semen from all three of the men inside her. I guess that explained why we found a neatly folded pile of her clothes in the trunk of her car along with her purse. We had wondered why they had been there when we searched her car after bringing it home. We had finally decided she had kept some clothes in the trunk in case she got dirty or something. Now I knew the truth. She was dirty but not in the way I had suspected. \n\nThere was no indication of foul play. It appeared Joan had voluntarily entered the van with the men. At first the police had assumed Joan might have been forced into the van. During the investigation, they had found several witnesses that had seen her leave with the three young men. They had apparently left the class at the mid class break. She had been flirting and talking to them for several class periods. Two women testified that they overheard her agree to go with them for \"another romp\". Two other people had seen her strip in the parking lot and enter the van after locking her clothes in the car. They said the men had dared her to do that. They had told her they thought she did not have the \"balls\" to go for a naked ride with them.\n\nOur family was devastated first by Joan's death and now even more so by her slutty behavior. I had known she was unhappy with her life but I had no idea she had became a slut. When I thought about her behavior I became scared for my own health. I didn't know how long she had been sleeping around and I was scared she might have given me a disease. I made a note to get checked for STD's immediately.\n\nThankfully I did not have to worry about my job. I owned and operated a small construction company so I didn't have to worry about work too much. I had a good management structure and my friends at work stepped in and kept the jobs going right and on time. I was a mess for several weeks. I was angry and lashed out at everyone. \n\nI was so angry with my wife and at the three boys that had been fucking her I sometimes screamed out wishing they were still alive so I could hurt them more. Hell one of them was only 19—younger than our son! The others were in their early 20's. I wanted to hurt someone but I couldn't very well do that because they were all dead. \n\nI kept putting off making a doctor's appointment for the STD test because I was embarrassed to do so. Finally my children made an appointment for me and took me to my doctor. After the test results came back I found I had Gonorrhea. Oh, I know I should have gotten the tests as soon as I thought about diseases but I just didn't. I had been hurting and burning for several weeks when I urinated but I just thought my cock was a little raw. It had been so long since Joan had let me make love with her I had begun beating off once more. When I did that I squeezed pretty hard and I thought I had hurt myself since it hurt worse when I squeezed it.\n\nOne day about three weeks after the funeral I was sitting in my living room drinking and looking over the accident report. I was wishing once again I could make someone pay for my pain when I had a brainstorm. I couldn't make my slut wife or her lovers pay but I could get to the trucking company for taking that option away from me. I decided to see if I could file a lawsuit against them. When I contacted a lawyer he almost cackled with glee. It seems that particular trucking company made a habit of hiring marginally competent drivers. They had a history of accidents and traffic violations. He thought that would help any case we brought against them.\n\nI told him to file the lawsuit and we were off. Of course it drug on as these things do but finally it was over. Almost two years after the accident I was almost 3 million dollars better off even after the attorney took his 30%! My life was still in the shitter but at least I now had the means to build a really nice shitter! Life was the pits, I didn't enjoy my work any longer and I couldn't stand to be around the house my wife and I had built for ourselves. \n\nI finally decided I was going to just chuck it all and take off. I know, I was running from my memories and hurt but so what? My son graduated from college with a degree in Construction Management in late May. He had been working part time in the company for years so I decided to turn the daily management over to him. I let him and his new wife live in my house rent free, contingent upon the guesthouse being always available to me. My daughter had her own apartment in the walk out basement. She stayed in what had at one time been meant as the maid's quarters. I made it clear she could continue living in her basement apartment until she decided to move on. I had legal papers drawn up outlining living arrangements, jobs, salary, responsibilities and so forth. I had no idea when I would come home or where I would go so tried to cover all bases.\n\nMy daughter was taking a degree in business administration and worked part time in the company also so I felt safe leaving. Three weeks after college ended I loaded up my new F250 Super Crew Powerstroke 4X4 and took off. I had no idea where I was going, when I was going to get there or how long I was going to take doing it. I had a small 26 foot fifth wheel trailer with everything I needed inside. I suppose the hippies in the 1960's would have said I was trying to find myself. I hauled my little 650CC Motorcycle on a rack I built at the rear of the trailer. \n\nSince it was early summer when I left I turned my nose north and drove. It was amazing, the farther from home I got the more relaxed I felt. The first day I drove 12 hours and only stopped for fuel and other necessaries. The second day was the same then I came to Rapid City SD. I had never been there and I fell in love with the Black Hills. I found a nice little camp ground and settled in.\n\nEvery day I would get up to see the sun rise. I would leisurely drink my coffee while I enjoyed the morning then I would have a late breakfast. Mid morning after it warmed up a little I would take a ride on my bike. If I saw a pretty place I would stop and enjoy the view or hike down a trail to the view or ride my bike to the view. I took many scenic rides on my bike enjoying the Black Hills. I especially loved the little town of Keystone SD. I rode the train between there and Hill City several times and explored both towns very well. There were sure some beautiful women running around there also. A couple of local wineries made some outstanding wine. I probably bought and drank way too much of it but so what?\n\nIn the evenings I would either go to town for supper or to a bar or I would cook in camp and have a few drinks with my three traveling companions—Me, Myself, and I. Occasionally while I was walking around the camp I would stop and visit with other campers. Sometimes someone would stop at my site and visit also. I was surprised how many of the campers were permanent travelers. Many of them had no home, only their trailers or motor homes. WOW. They all seemed so happy. We exchanged stories. At first I was reluctant to talk about Joan but I finally just said my wife had died in a traffic accident and I had to get away to heal. Many times I was never asked for more details about her and rarely about my children. It worked for me and allowed me to somewhat bury the pain. I spent three weeks in that campground then decided to move on. I kept going west on I 90 and came to a small town named Sturgis SD. Oh, you've heard of it? Well, I found out the bike rally was almost upon us so decided to stay. I found a nice place to set my trailer up and began to establish myself.\n\nI stayed until the end of the rally and whoo hooo did I finally begin to have fun! By the time the rally was in full force I had learned how to deflect the comments about the small size of my bike. Of course I suppose my willingness to provide my new friends with beer and some of the lovely ladies with a bed to sleep in helped also. I had to leave just to rest up from all the pussy I had managed to tap. I still wake up dreaming about all the lovelies that paraded around the camp showing off their wares. I just wish I had not felt I needed to use condoms when I fucked those women. Several times when I took a woman into my bed I could see someone else's sperm draining from their still red swollen cunts. Hell, I was almost afraid to even kiss them and tried not to but I sure fucked them when I could.",
        "Was I ashamed of my actions? Oh, hell no. I was no longer married and as far as I know neither were the \"ladies\" I bedded. They were willing, I was willing and if it hadn't been me between their legs it would have been someone else. I was even tempted to take a couple of them with me but common sense prevailed and I ignored the comments and hints they gave me.\n\nI continued west on I90 and fell in love with Montana also. I stopped several times in western Montana, again meeting some wonderful people in the campgrounds. One campground in particular comes to mind. It was near a small town called Rock Springs a little east of Missoula. They were having a Testicle Festival. There were cowboys, cowgirls, bikers and their bitches as well as regular folks like I was. As the night wore on and the beer flowed the tits came out and the pussies went on display, just not as flagrantly as at Sturgis. I only stayed one afternoon and night. I got to see a wonderful wet T shirt competition in the afternoon. I must admit all I did that night was watch. The women were not as beautiful as some I saw at Sturgis and I was sexually sated from my week at the Bike Rally.\n\nI moved on the next morning and by late afternoon I came out of the mountains. I decided I didn't like the country I was driving through very much. I put the pedal to the metal and roared off toward Seattle, WA. OH, my, I spent another month just sight seeing around there. I camped on the beach for several days, then went up Mt. Rainier and camped again. I was decompressing, I was forgetting my pain and it was great. \n\nFinally I decided to move south and drove down highway US 1 and 101. If I saw a place I liked I stopped. It took me another 6 weeks to get to San Francisco. I stayed there for a few days then moved south. For some reason southern California did nothing for me. There were a lot of beautiful women and on the beaches they displayed their wares for all to see. Something about their attitude left me cold. I found them uninteresting and 'fake' so I headed east along I 10. Oh, my. BORING. That part of the US consisted of miles and miles of miles and miles. Finally I arrived at one of my all time favorite cities—San Antonio. Joan and I had loved the river walk and even with the memories of her it elicited I enjoyed my week there. I found more excellent food and beautiful, willing women.\n\nI met one young lady that rapidly wormed her way into my heart. She was part Hispanic and worked at the camp ground I parked my trailer in. She checked me in and for some reason we hit it off exceedingly well. The evening I checked in I was sitting under the awning of my trailer when she walked down the road in a tiny little two piece swim suit. Her parts were all there on display and she was perfect. I estimated her age at about 22 or 23. It later turned out she was 27. She was about 5'7' tall and about 125 pounds. Her black hair was almost shoulder length and her smile lit up the evening when she saw me.\n\nThe little minx sashayed up to me and said, \"Whatever are you doing here in this heat? At the very least you should be at the pool cooling off. I know for a fact it's nice and cool. If you don't like the pool a lot of us go down to the river and swim there. The pool's cleaner though.\"\n\n\"I know it's hot here but I was just enjoying the sights. I will probably make it to the pool soon. I really needed to decompress after the day's drive.\"\n\n\"Well hurry on down. The water's great and there's usually some nice folks to visit with.\" Maria gave me a nice smile and turned back toward the center of the camp and the pool about 75 feet away from my spot. I watched the very enticing wiggle in her ass as she moved away. She walked about twenty feet then turned slightly and looked over her shoulder at me. When she saw me watching she smiled and moved onward. Perhaps there was a little more wiggle in her walk this time.\n\nI sat watching Maria until she was out of sight. I rose and went inside to change into my swim trunks then followed her to the pool. When I got there Maria was swimming, floating really, in the deep end. There were two younger children in the shallow end with a plump woman I assumed to be their mother. One older couple sat beside one of the tables reading.\n\nI dove into the water and swam a quick three laps then got out and retrieved my pool chair. I jumped into the water and climbed into the chair. It sank under my weight until just my shoulders and head were out of the water. I leaned back and opened my beer then watched Maria. She quit floating and turned to face me. Her feet could barely touch the pool floor as she moved closer to my position. The water was surprisingly cool in comparison to the air temperature. As she came closer I could see her nipples tenting the front of her swim suit.\n\nMaria walked up to my chair and rested her arms on the arm. I was disappointed because this caused her breasts to be hidden behind the plastic arm. She rested her chin on her arms and looked at me. \"You're not very energetic are you? I don't see many men sitting in a floating pool chair.\"\n\n\"No I suppose not. I used to own and operate a construction firm. I was on the go all the time and found this chair was a great way to enjoy the water, stay cool and relax when I had time to take off. I guess I still use it for that reason. I can sit in the water and just relax while I watch people. It makes it easier to talk and still stay cool too.\"\n\nMaria and I talked for over an hour before she had to leave. I found out she was the owner's daughter and had just finished a degree in Business Management. She had been married but her husband drank and whored around so she had divorced him. She had moved back home to help her parents until she decided what she wanted to do with her life. Her parents were semi retired and she was trying to decide if she wanted to operate the business for them or go into business elsewhere. She liked the relaxed atmosphere of the camp but the earnings potential was less than she could have elsewhere.\n\nThe next two days Maria and I became closer. She was easy to talk to and a lot of fun. I found myself telling her about my marriage and how I had finally just turned my business over to the kids and took off to forget. We discussed her desires and dreams. I had noticed on my trips away from the camp that there was no store or fuel station for some distance. In addition to the camp, which was a large one, there were several homes nearby. I suggested she and her parents might want to open a small store that sold fuel. Maria became excited about the prospect and we discussed feasibility studies, surveys, to see if the idea was viable.\n\nThat evening when we left the pool Maria followed me back to my trailer. I don't know when we did it but we were holding hands partway back to my spot. Maria looked up at me and moved next to me. She let my hand go and wrapped her arm around my waist. I did the same to her.\n\nWe stopped outside my door and she turned to face me. She moved closer and I felt her breasts rub against my abdomen. Her arms went around my waist and she stood slightly on her tiptoes to give me a gentle kiss. Nothing was said. She opened my door, took my hand once more and pulled me gently into my trailer. I followed like a sheep to slaughter. It was as if I had no willpower. I followed this beautiful creature into my home in a daze.\n\nMaria pushed the door closed behind us and watched my face as she first removed her top, then the bottoms of her swim suit. I stood staring in awe at the goddess that was displayed before me. I opened my mouth to speak and she placed her fingers on it. When I closed my mouth she grabbed the waist of my swim suit and pulled it down. Without thinking I stepped from the suit. Maria smiled at me once more and sank down before me in a squatting position. She reached for my rampant cock and gently bent it down. She kissed the head then ran her tongue around it. She cradled my balls in one hand and licked up the bottom of my cock, once again circling the head with her tongue. This time she took most of it into her mouth and began jacking me as she licked and sucked.\n\nIn no time I was near an explosion. I put my hands gently on the side of her head and began gently thrusting. I felt my cock swell slightly and my balls draw up. \"Maria, Honey. You better stop. I'm gonna...\"\n\nMaria looked up at me and smiled as well as she could without taking my cock from her mouth. Her eyes twinkled. She continued sucking, tonguing and jacking my cock until I could stand no more. I groaned and thrust toward her. I felt my cock throb and the accumulated seed of nearly a week burst forth. Maria swallowed repeatedly as I spent myself in her wonderful mouth. Her hand cradling my balls disappeared and I heard her moan. I looked down to see her frigging herself. I backed away from her and collapsed into a chair as she screamed and fell back onto the floor. I watched as her cunt throbbed and she worked through her orgasm. A river of clear liquid ran from her pussy down her ass cheeks to puddle on my carpet. \n\nWe remained in our respective positions for a couple more minutes then Maria rose to her feet. She reached for my hand and once more pulled me, this time heading for my bed. When we arrived she pulled the top covers off and lay in the center of the bed. She spread her legs and smiled up at me. Her finger was gently caressing her pussy. She would dip into her glistening hole then pull her finger up her crease and gently rub her little clitty. She licked her lips and held her free hand out toward me.\n\nI moved to the bed and crawled up between her splayed thighs. I bent my head down and inhaled the wonderful aroma coming from her beautiful pussy. I reached my tongue out. I ran it up her slit and across her clit. She jerked and whimpered. I settled in. I gently inserted a finger into her pussy and twisted searching for the special rough spot under her clit on the roof of her vagina. Bingo. I found what I was searching for and moved my head down so I could once more lick her clit as I gently rubber her G Spot. In moments Maria was writhing and moaning. She grabbed my head and whimpered. Her legs slammed closed holding my head in a soft vice as her hips surged. She screamed and her body jerked one way then another. I felt her pussy clamp down on my still invading finger as it squeezed and released me over and over until her orgasm ran its course.\n\nFinally Maria relaxed her legs and gently pulled me until I moved up to lie beside her. She turned and gave me a gentle kiss. \"That was wonderful. Thank you.\" She looked down at my crotch and continued, \"Can you go again? I really need you to...Please, can we make love now?\"\n\nI felt her small hand grasp my half hard cock. It surged in her grasp and I smiled. \"Yeah, I can do that.\"\n\nI moved over Maria and she gently guided me to the proper position. I thrust gently, seating my cock in her entrance. I began another thrust I planned to be gentle but Maria took control. She slammed her hips up as I moved down. She screamed out her pleasure and raked my back with her fingernails as I moved completely into her pussy on the first thrust. Maria did not slow down. I couldn't keep up with her banging hips. She was an animal slamming her hips upward and relaxing fucking up at me. Finally I got in sync with her movements and we really began banging against each other. I felt her pussy squeeze and relax over and over. She was so tight when she squeezed me it almost hurt. All too soon I felt my balls pull up and the sperm churn in preparation for departure.\n\nMaria screamed and pulled me tighter to her. She strained upward locking her back in an arch. I felt her pussy squeeze and release me over and over, throbbing through another orgasm. That was all it took. I went over the edge with her. My orgasm was so strong it almost hurt as I ejected my seed into her womb. We strained against each other for a moment then, as one, we collapsed. I caught myself and rolled to the side to lie gently holding Maria to me. She turned her head and looked into my eyes. We kissed gently and fell into an exhausted slumber.\n\nI woke the next morning at dawn. I had to piss so badly it hurt. Maria was still wrapped around me. When she felt me moving trying to get up she woke and smiled at me. I felt her arms tighten trying to hold me to her. \"Please Maria. I have to find the bathroom or there's going to be a lot larger wet spot in this bed than we have now.\"\n\nMaria smiled and gave me a gentle kiss before releasing me. I decided to use the camp restroom instead of mine. I grabbed my shaving kit, towel and swim suit then took off. I was only gone about ten minutes but when I came from the restroom I met Maria's father. He looked worried and stopped me. \"Steve have you seen Maria? She was going to the pool last night but she never came home. That's not like her. Her mother and I are worried something has happened to her.\"\n\n'Oh shit', I thought. I just stood staring at him for a moment. What could I say to this worried father? I knew how I would feel if one of my children, even as old as they were when I left home, had not came home or called to say they weren't. I heard the door to my trailer close behind me and saw Maria's father's face when he saw her. His eyes flicked to her then back to my face. I felt myself blush.\n\nMaria walked up beside me and wrapped her arm through mine. \"Daddy I'm sorry I worried you. I didn't intend to stay out all night. Steve and I just fell asleep and I didn't get a chance to call or get back home.\"\n\nI looked at Maria. She was in her swim suit. Not only had I marked her neck with a hicky but she still had that just fucked look about her. She was delightfully rumpled and her body glowed. I looked back at her father. His lips had tightened. He glared at me a moment then turned and walked away without a word.\n\nI placed my arm around Maria and said, \"Damn. That didn't go so well. Maria I'm sorry. I don't know how to fix this. You really should have called him or gone home last night. Now I suppose I had better move on before this gets any worse. Do you think I need to talk to him?\"\n\n\"No Steve. This is my fault. I'll fix it. Please don't leave over this. Please?\"\n\nMaria took off for the camp office where her father had gone. I returned to my trailer and fixed coffee. I sat on my pad watching the office. I heard raised voices and I thought I heard Maria crying. Finally I could stand no more and I walked over to the office. I entered and heard Maria and her parents talking in the back. I walked around the counter and into the small break room.\n\nAll three members of the family looked up when I entered. Maria's father and mother glared at me when I entered. Maria looked guilty and chastened. \"Mr. Hardy I need to apologize. I had no right. I know how I would feel if my daughter had done something like this. I just wasn't thinking and I'm afraid I took advantage. I let the friendship Maria and I had and my need for companionship override my common sense and honor. Please don't be too harsh on Maria. I've paid for a week here but in light of this fiasco I will leave as soon as I can today. Please, I'm sorry I caused this trouble for your family. Maria is a fine young lady and you should be proud of her.\"\n\nFelicia gasped and held her hands to her face. She started crying and said, \"How can we be proud of what she has done this night? We taught her better than to sleep around like that.\" Mr. Hardy looked to his wife then glared at me. He took a step toward me then stopped. He turned to his wife and pulled her into his embrace.\n\nI felt my face flush and I blurted out another apology. \"NO! That is not what I meant. Yes, she, we were thoughtless in our actions but that is NOT what I meant at all. Maria has a degree from a good college. She is bright, educated and capable. She is a fine young woman. I am sure she feels badly about worrying you. Look at the sorrow on her face. But be proud of her for her accomplishments and forgive her, forgive us for our lapse of propriety.\"\n\nMaria moved to my side and wrapped her arm around my waist. She leaned her head on my shoulder and looked up at my face. I could see moisture in the corner of her eyes. She turned to her parents once more and said, \"Momma, Poppa. I told you I was sorry for worrying you. I didn't mean to do that but... Momma I am a woman now and I have a woman's needs. I like this man. He is special and I let my emotions rule me last night. Momma you know he was not my first. Please don't blame him for this. I led him to his trailer and I went into it before him. I undressed myself and threw myself at him.\"\n\nMaria smiled up at me then continued, \"He is only a man Momma. He only did what nature intended when he was faced with a naked woman.\"\n\nFelicia gasped once again and blushed. Mr. Hardy glared at us both but especially at Maria. He slumped and said, \"You're right Maria. You are a woman now and have to live your own life. We just expect more consideration from you while you live under our roof. I don't like the idea of you sleeping around but that is your decision. Just, from now on, please let us know so we don't worry so much.\"\n\nMr. Hardy turned to me and continued, \"Steve I can't say I like or approve of what the two of you did. Hell, you're old enough to be her father for God's sake. How would you feel if a man your age slept with your daughter? Having said that though, there is no reason for you to leave unless you want to. What's done is done.\"\n\n\"I think it would be better if I left.\" I turned and began to leave but Maria held onto me. \n\nMaria looked stricken and said, \"NO. Please Steve. Don't leave now. Please. I want to talk to you more about the business and... Just please stay a few more days... For me?\"\n\nI relented and stayed another week. Maria and I did talk about plans for the business and for her future. I was never as close to her parents as I had been but they were civil to me. In fact Mr. Hardy became excited about the idea of opening a small market and fuel depot. I made what suggestions I had for the project and spent a lot of time with Maria. She was very special. I felt more alive with her than I had since Joan had died. \n\nBy the time I decided to leave San Antonio it was getting cool back home. Not only did I really not want to go home, I had no desire to return to winter weather so decided to go on to Florida. The day I pulled out Maria cried. She clung to me and made a spectacle of herself kissing me good bye. I even saw some regret on her parent's face. Strangely I found it hard to move on also. I had the card for the business with their phone, e-mail and snail mail address on it. I knew they had my phone number and e-mail address from my check in sheet. Maria stood watching me as I drove off. As long as the camp was in sight I could see her watching if I looked in my rear view mirror.\n\nOnce again I found myself driving down I10 heading east. At least this time the scenery was not as desolate as it was west of San Antonio. I had allowed myself five days before I had a reservation that was carved in stone. I made the most of them and had a leisurely drive east.\n\nI owned some time-share resort weeks in a company that had their resorts in the southeast. I had scheduled some time in those units or I might have stayed with Maria longer. I lay around the pools and \"chilled\" at the resorts but something was missing. I was meeting more good people and enjoying the conversations more and more as I healed but I missed the good times I had in San Antonio.\n\nI moved further south and finally into the Florida Keys, ending up on Key West. It is so crowded there I used my bike almost all the time to get around. I had to be careful drinking and driving but I spent a lot of nights in the local hangouts within walking distance of the RV Park. I also made use of the bus service there. I became friendly with many of the employees of my favorite bars and restaurants. I suppose I had become a resident because I had been there three months. ",
        "My children were upset because I did not go home for the holidays but I just didn't feel like doing that. I invited them to come see me but they declined. Christmas Eve found me in my favorite restaurant and bar drinking my margaritas and listening to the holiday music. I had finished my meal and was in no hurry to get back to my lonely trailer. It was 8:30 p.m. and the customers were almost all gone. The employees had closed sections of the establishment and were cleaning up, preparing to close at 9 so they could go home to their families. My all time favorite waitress had been waiting on me all evening. I had noticed she seemed almost as sad as I felt. She came up to my table and said, \"Last call Steve. You want another one before you go back home?\"\n\nI looked up at her and acted without thinking. I saw tear tracks on her cheek and reached out to wipe them off. She flinched when I reached for her and pulled back. I managed to grab her hand and pulled her toward me then said, \"You look as sad as I feel Amanda. It looks like you have been crying. I'm sorry I scared you. I didn't think. I was just going to wipe the tear off your cheek.\"\n\nAmanda slumped when I said that and the tears started in earnest. I pulled her onto my lap and held her while she cried. Her boss came out of the kitchen and stormed up to us. He reached for Amanda as he said, \"Damn it Steve, what're ya doin' to Amanda? I thought ya were a good guy. Now let her go and get out of here before I call the police.\"\n\nI let Amanda go and started to get up as I said, \"Hey Sid. I didn't mean to upset her. I saw she was crying and asked what was wrong. She began to cry harder so I pulled her onto my lap to hold her a while. Don't make a big deal of it. I'm sorry.\"\n\nI started to walk away when Amanda said through her sniffles, \"No, don't go yet please Steve.\" She turned to Sid and said, \"Sid, he didn't do nothing. We were just talking and I lost it. I was feeling sorry for myself all evening and... Well you know why and when he asked me what was wrong...\"\n\nSid said, \"Well OK Mandy but if he bothers you just yell. Why don't ya take off now? Me and tha boys'll finish up here. Try to have a Merry Christmas.\"\n\nThrough her sniffles Amanda said, \"Merry Christmas Sid.\"\n\nAmanda watched Sid walk back behind the bar then she followed him. They talked for a short while then he smiled and handed her a large pitcher of Margarita's and two glasses filled with ice. I watched as Amanda glided across the room toward me carrying our drinks. I felt my cock twitch as I enjoyed her \"poetry in motion\". She had the most beautiful long legs and a super tight ass. Her braless breasts were wobbling enticingly inside her tight crop top. I thought she really should be working at Hooters instead of this slightly seedy bar in Key West but I was glad she wasn't. I liked her working right here so I could watch her perambulate around the room the nights I was here also.\n\nBy the time we were half way through the pitcher Amanda had filled me in on her tears. She had been supposed to work the early shift today and had told her live in boyfriend that. Yesterday she had agreed to work the evening shift for one of her friends. The friend had wanted to go out of town for the holiday and wanted to leave early. Money had changed hands and they \"traded\" shifts.\n\nAmanda had gone to the beach and relaxed then went home in time to change clothes eat a bite and go to work. She found her boyfriend in bed with two of her female friends when she got to their home. Of course she had become angry and they had fought. Since she had been living with him in his small travel trailer he had kicked her out, thrown all her clothes out the door and locked it.\n\n\"Oh, Steve,\" she continued. \"Now I don't have anywhere to live and I don't make enough here to rent much of a place even if I could find one on Christmas Eve. Sid said I could stay in a cot in his garage for a couple of days but I don't know what I'll do after. I guess I'll have to move on, maybe go back home if my parents will let me freeload on them for a while. Hellofa thing isn't it? A 33 year old woman running back home to Momma because things didn't work for her. I catch my asshole husband cheating and divorce him and end up with nothing then I find another cheating asshole for a boyfriend and get kicked to the curb by him. Hell, every man I've found my whole life has done me wrong. I don't know why I even bother.\"\n\nI sat a while thinking about Mandy and her problem. Finally I sighed and said, \"Mandy I don't have much room but you're welcome to come stay with me for a while. You can use the other bed in my trailer if you want. It isn't much but I suppose it would be better than a cot in a garage.\" I laughed the continued, \"I guess we have enough in common with what our mates put us through to owe each other some support. Besides, you seem like a pretty nice girl and I would hate to see you suffer more than you have for something some asshole did to you. And believe me, I KNOW how you feel.\"\n\nI had to talk a little more and do some heavy convincing but that and another pitcher of Sid's really excellent Margaritas convinced Amanda to at least come with me through the holidays. When we left we could still hear Sid clanging around in the kitchen. Amanda let him know we were leaving and we staggered our way outside and down the street to my trailer.\n\nI remember having trouble getting the key into the lock and Amanda giggling as she staggered around watching me. Finally I got the door opened and pointed to the couch that turned into a spare bed. \"There's your bed Mandy. The shower and restroom are that large building in the center of the camp or you can use my small unit if you don't mind crowding. I usually use it at night and then use the camp facilities during the day.\n\nI staggered off to bed and didn't know anything else until almost noon Christmas day. I would probably have slept through that but the damn phone ringing woke me up. I fumbled for a moment then muttered, \"LO.\"\n\nI heard Chelsea giggle over the roar of conversation in the background. In a much too cheerful voice she almost sang, \"Merry Christmas Daddy. How are you? We sure miss you.\"\n\n\"I was doing fine until you woke me up Honey.\"\n\nMore giggles then, \"Woke you up? It's after noon there. Why were you sleeping this time of day?\"\n\nI had forgotten Amanda was in the trailer and wandered into the kitchen to begin a pot of coffee. I hadn't taken the time to dress and since I sleep nude I shocked her. The first I remembered she was there was when I heard a gasp. I looked up and Mandy was blushing as she turned her head. \"Oh, Crap,\" I said. \"I'm sorry.\"\n\nI turned and rushed back into my bedroom as Chelsea asked, \"You're sorry for what Daddy? It's ok if you take a nap. I'm sorry we woke you up.\"\n\nI stammered out a reply, \"What? Oh, nothing Honey. I just wasn't thinking is all. Everything is fine.\"\n\nI had pulled my swim trunks on by this time and lay the phone down while I pulled on a shirt. I wandered back into the main part of the trailer to see Amanda making the coffee. She turned and looked at me a moment and got another small blush on her face. She gave me a sickly grin and said, \"I guess ya forgot I was here huh?\"\n\n\"Yeah, Sorry. I hope I didn't embarrass you too much.\"\n\n\"Daddy who are you talking to? I thought you were still asleep? OH! Daddy, I'm sorry! I didn't mean to interrupt...\"\n\n\"NO, Chelsea, it's nothing like that. One of my friends got kicked out of her house and was sleeping on my other bed. I just forgot she was here and went into the kitchen to make coffee and startled her. You didn't interrupt anything.\"\n\nChelsea giggled and I smiled as I watched Mandy's blush turn into a deep crimson. Chelsea, Alex and I visited for a couple more minutes and I hung up. Mandy handed me a cup of coffee and I said once again, \"I AM sorry Mandy. I guess you know now I sleep nude and I just didn't think. I promise it won't happen again. At least I hope it won't.\"\n\nFor some reason Amanda and I 'clicked' and she never moved out of my trailer. The next two months flew by. Amanda insisted since I was providing the living space she provide the food and alcohol. It turns out she is a great cook and we got along super well. We became best buds but that is all. Oh, we became used to seeing each other naked and nearly naked but while I looked and appreciated her body we never had sex. We hugged and even kissed a time or two but that was all.\n\nBy the end of February it was time for me to begin moving north again. I didn't want to spend the summer on Key West and I was ready for different scenery. On one of her days off Mandy and I were lounging around the pool sipping on margaritas. I finally bit the bullet and decided I had to tell her I was moving on.\n\nI poured us each another drink and said, \"Mandy, I don't know how to say this other than just come out and hit you in the face with it. It's time for me to move on. I don't want to spend the summer here and I want to see my children again. You've helped me heal and I've enjoyed our time together but...\"\n\nI saw Amanda's eyes water slightly. There was a quiver in her voice when she said, \"I've been expecting this. I knew you wanted to go back north when it warmed up. I really don't know what to do. I'm tired of working at the bar but there's not much else available here for me. I've got a little saved. I guess I'll give my notice and catch a bus back home. Maybe I'll find something there. Tourist season will be starting soon and a lot of places in Branson hire help for the summer. Mom and Dad only live a few miles out of town so I can stay with them for a while.\"\n\nI went to the camp office that afternoon and let them know I was leaving at the end of the week. It was Tuesday and I figured I could tie up all the loose ends by then. I hoped Amanda could find a place to stay for the rest of the time she was in town.\n\nThe next day Mandy came home and told me she had given her notice. She had agreed to finish the week and train her replacement. Sid had not wanted the traditional two weeks' notice. She smiled and said, \"I would appreciate it if you could give me a lift to the bus station when you pull out Saturday.\"\n\n\"Sure. Anything for a friend Mandy.\"\n\nBy Friday evening I had everything packed and loaded into its traveling space. All I would have to do the next morning was pull the connections to power, water and sewer services and drive off. Amanda was watching me as I made the final checks. All at once I had a thought. I said, \"Hey Mandy. I'm going north and that's on the way back to Missouri. Hell, my family is only seventy or so miles from Branson. If you're not in a hurry to get there why don't you just ride along with me? I plan to stop along the way and really don't plan to arrive home until mid April but if you want to leave sooner you could. Hell, every town closer to home we get the cost of your ticket will be less. What do you say?\"\n\nAmanda sat looking at me a moment then she smiled. \"I say yes. Thank you. I would enjoy riding with you and that would save me some money. I don't think I'll stay with you the entire trip though because I will need to find a job early. Many of the places begin hiring in March.\"\n\nI decided to drive up the west coast of Florida. When I got to Ft. Myers I stopped for a week and Mandy and I enjoyed lying on the beach, swimming in the gulf and relaxing. She was special. We just seemed to know what the other was thinking and we enjoyed doing most of the same things. One evening we were in a small beachfront dive that had really excellent shrimp. We shared a couple pitchers of beer and tons of their all you can eat shrimp. A younger crowd was in the majority and seemed to resent the few older people as they classed Mandy and me.\n\nA couple of times one or another of the young men at a table near us came to ask Mandy to dance. She was always polite in her refusal but as each of them was refused the anger built. We overheard several comments about her being a tease and me being an old asshole. We decided to leave and took a restroom break before doing so. When I came out of the restroom I heard a commotion in the ladies room. Mandy was not in sight then I heard her voice saying, \"NO asshole. Get your ass out of here and leave me alone. I told you I didn't want to dance with you.\"\n\n\"Listen Honey. You're a real MILF and I wantta dance with you. Now come on. When we're done dancing if you still want to be with that old fart you're with ya can go find him again. We're on spring break and here to par tay so let's get with it.\"\n\nThe women's room door opened and one of the punks that had been harassing Mandy came out pulling a crying Amanda behind him. He saw me and smirked. Mandy looked at me in fear. I didn't say anything. I took a half step toward the punk and kicked. I hit him in the nuts. He let loose of Amanda's hand and bent forward. I raised my knee and slammed it into his face as I pushed his head down. Damn that hurt. He groaned and collapsed onto the floor. I looked at him as he writhed, one hand on his face, one in his crotch. He had left a large smear of blood on my trousers.\n\nI quickly pulled Mandy toward the door. We were almost to it when one of the men at the table saw us. He half stood and said, \"What the hell? I thought Joe went to get that bitch. Two others started toward the hallway the rest rooms were in. I sped up and pulled Amanda out the door. As it closed I heard a yell. We rushed into the truck and I raced for the street. We were several feet down the road when the door to the bar opened and three young men rushed out. They stood watching as we drove off.\n\nAmanda was crying silently. I reached for her and held her hand across the console for a moment. It took us ten minutes to get to our RV Park. I led Amanda into the trailer and pulled her to me for a hug. She was shaking and crying as I gently led her to my bed. I sat her down and took her shoes off then lay her back. I removed my shoes and crawled into the bed to cuddle her. We both drifted off to sleep. I woke once in the night to relieve myself. I then went to the front of the trailer and made up Amanda's bed. I spent the rest of the night there. The next morning Amanda woke me making our coffee.\n\n\"Steve thank you so much for last night. I know you were in bed holding me for a while. Why did you leave? I didn't mean to run you out of your bed.\"\n\n\"Mandy I had to use the rest room and, well, you didn't need an old man molesting you after what you went through last night. I decided it was better for both of us if I finished the night here.\"\n\n\"You weren't molesting me! I know you'd never do anything like that. Why would I even think...\" She looked at my morning wood tenting my pants and blushed a little then continued, \"OH. Well I know you would never do anything I didn't want you to do.\"\n\nAmanda sat quietly through coffee then looked at me. \"Steve I've had it. I want to go home. I think if you'll take me to the bus station I'll just leave you here.\"\n\n\"Well, I can do that if you want but I think I'm ready to move on also. Why don't we just pack up and pull out. If I find somewhere I want to stop again I can take you to the bus station there. That'll save you more money and it sure won't cost me anything extra since I'll be burning the fuel to move on down the road anyway.\"\n\nAmanda smiled and nodded her head yes. \"Ok if you're really going to leave anyway I'll stay with you until you stop again. Just don't leave on my account.\"\n\n\"No after last night I'm ready to move on too. I doubt those assholes will turn us in even if they did get the license number of the truck but I would just as well move on anyway. I would hate to run into them again later where all of them could come at us at once if they were feeling vengeful. I had planned to move on to Bradenton or Clearwater in a couple of days anyway.\"\n\nMandy smiled her thousand watt smile and gave me a big hug. \"Anything I can do to help get us on the road boss?\"\n\nI gave her a couple of the easier jobs then began my tasks to ready the rig for motion. It was strange but I was beginning to be anxious to return back home to Missouri. I had seen some beautiful country, met some wonderful people and relaxed but I was ready to get back into the traces. I was tired of my life of leisure and ready for a challenge, for some productive work. What surprised me though was I was not looking forward to returning to my home town and business. I still felt sickness in my soul thinking about Joan and revisiting the locations we had been.\n\nAs we were driving down the road Mandy and I talked about home. She said her parents had a large lot on the lake around Hollister, Missouri, a small town just south of Branson. She reminisced about her childhood and the fun they had in the lake and running the hills. Her description reminded me of a piece of property I had inherited from my wife when she died. It totaled a little less than 26 Acres and was on the lake near Hollister also. She had inherited it from her parents when they died. It had been her maternal grandfathers until he had died. It was all that was left of a rather substantial farm that had been appropriated by the government when the lake was built. He had retained ownership to that small parcel and at one time had operated a fishing camp on it.\n\nWhen we came to the turn off to Bradenton I kept the truck heading north. As we passed one after another of the exits for Clearwater Mandy would look over at me. I saw her looking at several RV parks that would have normally caused me to pull off and stay a while. Finally she turned to me and asked, \"Steve why are we going on? I thought you planned to stay in this area for a while?\"\n\n\"You know Mandy sometime this morning I decided I was tired of Florida and was ready to be home. It's nice weather here this time of the year but I suppose I have moved on and healed. Listening to you talk about your home and the lake and hills has made me homesick. I think I will just go on back to Missouri at least for the summer. I can drop you off at a bus station if you want but since I'm going back home I thought you could just ride along with me. I should get us back home almost as soon as a bus would and it will be a hell of a lot more comfortable for you.\"\n\n\"You sure Steve? You're not just doing this for me are you? I wouldn't like that. I appreciate all the help you have given me and the ride especially but I don't want to ruin your trip.\"\n\n\"Naw. While you were talking I remembered a small parcel of land my wife and I...Uh I own on the lake near Hollister. I haven't been there in years. My wife inherited it from her family and now I suppose it's mine. There used to be a fishing camp or resort on it. I think I'll find it and see what it's like. I may just pull my rig down there and stay a while. I am still not ready to return to my old home and face everyone. I'm sure the whole town knows what Joan did to me and I don't want to face that. For some reason I can't get excited about returning to my company either. My son and daughter are running it as well as I could from the financial reports I have been receiving so why bother. Besides if I return their income would decline some and they are young and need the money to get started in life.\"\n\n\"Ok Steve. If you're sure you're not doing this just for me I'm fine with it.\"\n\nWe made it back to Amanda's home in three days. It was a real bear getting the rig down some of the small narrow roads to her parent's home but we did it. She was welcomed with open arms and a lot of tears. After meeting them I tried to make my exit but her father would not hear of it. He had me pull my trailer up next to their house and plugged me into their water and electrical system.\n\nAmanda had told her parents how I had helped her so they treated me like royalty. I did notice a few questioning looks though and I was sure they were wondering about Mandy's virtue. I mean, come on. A beautiful sexy woman living with a man for almost three months and they aren't sleeping together. Hell, even I wouldn't believe that one even though I knew it was true. I loved Amanda to death but we were friends not lovers. I just can't explain it. She was one of the very few available women I had known that I hadn't either fucked or wanted to fuck. Oh, sure, I perved over her but not to the extent I decided to test the waters, to sample her wares. After a week I think we even convinced her parents of that fact.",
        "One evening I was sitting on the patio when her father came out with a couple of Newcastle Ales. He sat beside me, handed me the beer and said, \"Ya know Steve I just can't figure you out son. You're a fine fella as far as I can tell and I appreciate your helping Mandy like ya done but... Well, hell, I just don't understand how ya 'all can be like ya are. Hell, I know how I'd feel if my wife done what yourn did but...\"\n\nI felt a surge of pain when Frank brought up Joan. He seemed embarrassed when he saw the look on my face. I said, \"Ya know Frank I've done some things on this trip I'm not real proud of. I had my share of women, especially at first. I guess I was trying to get even with Joan or something. Hell, I don't know, maybe I was trying to prove I was still a man, still desirable to women or something. I don't know. When I first met Amanda she was working in a bar in Key West and I was attracted to her but we became friends, buds. When her boyfriend kicked her out of her home and I invited her to live with me for a few days I promised her I wouldn't bother her that way. I guess we fell into a pattern or something but neither of us felt the need to move on to something more I suppose.\"\n\nFrank looked at me and shook his head. We just sat after that and watched the sunset as night came to these beautiful hills. After the sun had dropped behind the hills Frank turned to me again and said, \"Mandy tells us ya got a piece of ground here on the lake somewhere. She said ya was agonna maybe stay there fer a while?\"\n\n\"Yeah I thought I would try and find it. I haven't been there in ten or twelve years I guess. It was my wife's. She inherited it from her grandparents. There used to be a fishing resort on it and I thought I might spend the summer there if I can find a way to get my trailer down to a good spot.\"\n\nFrank sat in thought a few minutes then said, \"Ya know, there's a piece of ground about three miles or so down the road that might be yours. There are some old docks on the shore and a few cabins that're falling down. I think some woman lives in the best of them and sortta takes care of tha place. Tomorrow's Saturday and I'm off work. We can go look at it if ya want.\"\n\n\"I've got a map in the trailer. Let me get it and maybe we can see. I knew it was close here but wasn't sure just where it was. I was going to call around and try to find someone who could direct me if I couldn't find it.\" \n\nI got the map and returned to my chair. Frank and I looked it over and he said, \"Yep. I think that's tha place.\" He looked over at my rig and continued, \"We'll take my little Jeep Wrangler if ya don't mind. Some of the roads down here can get pretty rough and are narrow. No sense in taking your truck until we know for sure we have the right place.\"\n\nThe next morning early, just after breakfast, Frank and I packed a cooler with lunch and beer then took off. At the last moment Amanda came running out and jumped into the Jeep with us. \"Hey guys. I wantta go too.\"\n\nI think we drove almost seven miles by road to get the three miles as the crow flies but we finally arrived at a gate with a \"No Trespassing\" sign on it. We were positive this was the place so I decided we would just go on in. Another three hundred feet down the narrow trail we came to a steel cable stretched across the road and another no trespassing sign on it. This time the cable was padlocked. We couldn't get past it except on foot.\n\nI said, \"Well, looks like we hoof it from here. I don't have a key for the lock with me. Not sure I even have a key.\"\n\nWe walked for about a quarter mile when we turned a corner and saw the unkempt grounds of a small resort and the cabins. Only one of them looked livable and it appeared to have been the office and bait shop. I could see a decrepit dock behind the cabins and then the beautiful lake.\n\nWe were walking around visiting when a very upset woman came out of the cabin. \"What the hell are ya all doing here? Can't ya read? This here's private property and I know ya passed at least ONE No Tresspassin' sign ta get down here.\" As she got closer I saw a small pistol stuck in the waistband of her pants.\n\n\"I'm sorry to bother you ma'am. We saw the signs but unless I'm in the wrong place I own this land so I'm not really trespassing. I wanted to come down and look it over. If it's my land I thought I might pull a trailer down her and spend some time. Did this used to be the Rory Fellows place? If it was I inherited it when my wife Joan died. I'm Steve Rowland.\"\n\nThe woman relaxed a little when I said that. She looked me over and said, \"Yeah, this used to be Rory's place and I remember little Joan. I guess ya're ok but ya shoulda called me or sumpin. I suppose ya want me to move out now huh?\n\nI looked around the place and said, \"No, there's no need unless you want to move on. As I understand it you were supposed to look after things for the right to live here. I can see you have done some work here but I would like to see more done. If you still want to live here I can use the help cleaning up a little more.\"\n\n\"Listen mister! I have to work to eat ya know. I do what I can here but I gotta work in town to pay fer food and other things too.\"\n\n\"Hey, Hey. Hold on. I didn't mean you weren't doing things here and I understand we didn't pay you anything. All I said was I could use your help to do more. With the two of us working I want to get the place looking a little better ok?\"\n\n\"Well OK but I don't like it when ya let on like I've not been doin' my job here ya unnerstand?\"\n\nFrank and I wandered around looking at the place trying to decide where I might park my trailer. Mandy stayed to talk to... Hell, I didn't even get her name. Shortly Mandy caught up to us. She said, \"I think Jolene is in a better mood now. I explained some things to her and she's calmed down some. You know Steve some of these hill folks are sortta touchy. You'll learn but you need to be a little careful how you talk to some of the folks around here until you get to know them. You've lived near here but the folks in your part of the country act a little differently than we do down here. Of course a lot of the ones who work in Branson, in the tourist industry, have adapted a little but even then, on their own ground they sort of revert to a different outlook.\"\n\nIt was still late March and cool weather was the norm. Beginning the next morning I began working to get my rig down to the camp. Getting down the state and county roads would not be too difficult but I had to cut some small trees and brush to get down the trail to the old resort. It took all day to do that. I had purchased a chain saw to accomplish that task and decided to leave it at the resort. I knew I would need it again soon and didn't see any reason to keep carrying it back and forth.\n\nJolene had been out to watch me work a couple of times during the day. When she saw me walking toward the cabin she occupied she came out on the porch. \"Hey Jolene. Guess I'm done for the day. Thought I'd leave the saw here if you have a safe place for it.\"\n\n\"Yeah, I've been using the old maintenance shed for the few tools I use here. I keep the mower in there too. Let me get the keys and I'll be right back.\" When she returned from inside Jolene handed me a key and continued, \"Here Steve. This is the extra key to the lock. If ya lose it I keep mine on a nail beside the front door and an extra door key is hanging on a rafter of the second cabin over there.\"\n\nWhen we got into the maintenance building I looked around. All the equipment was old but it appeared Jolene had taken pretty good care of it. She saw me looking and said, \"I know it isn't fancy but me and my man tried to keep all the old stuff up as best we could. Lost him to a heart attack couple of years back. Now it's just me. Kids have all moved off to town. Have one in Branson and the other's living in Springfield with his wife. Gets lonesome down here but I just can't leave. My husband's daddy was caretaker here when old Mr. Fellows still lived here. When we got married we lived in Hollister until we had to move out here to take care of him. When he died we just stayed on and did the best we could.\"\n\n\"That's fine Jolene. I appreciate it. Before I leave I'll give you my cell phone number. I guess you still have my address in case you need something? I know we've got a few bills from you in the past that we needed to pay.\"\n\n\"OK.\"\n\n\"Well, guess I'll wander around a little then get back to my trailer. I think I'll try to bring it down tomorrow. I haven't decided where I'll park it permanently but at least I will have it here and not have to drive back and forth.\"\n\nI had to be careful the next morning but I did get my trailer down to the camp. I set it near Jolene's cabin for a while so I could use the water and electricity hook ups there. That morning I spent some time looking over all the cabins and grounds to locate a more permanent place to park. I finally found just the perfect spot and went to work preparing it. It was at the far end of the more open grounds and had a perfect view of the lake. I could see the sun coming up in the east and setting in the west. I had afternoon and evening shade and thought I would catch cooling breezes off the lake too. It looked like I was cleaning up an old camp spot. I found a water pipe sticking out of the ground with a freeze less faucet on the end. When I tried it I didn't get any water flow though. There was a fallen down power pole at the edge of the brushy area too.\n\nBy mid afternoon I backed my trailer into the spot and leveled it. I spent the rest of the day stacking and burning brush and trash. When Jolene returned from work she walked part way to my trailer and stood looking around with her hands on her hips. I smiled and waved as I walked up to her. \"Well Steve I see ya found a good spot fer yer new home. You've sure made a difference in tha place too. Making me feel a little lazy though. You get twice as much done in a day as I do.\"\n\nThe next morning I went into Branson and found an equipment and tool rental business. I rented a back hoe with a front end loader on it then returned to my new home. I spent the rest of the day digging a new water line to my trailer and using the loader to push some of the smaller brush out and stack it. Once again when she returned Jolene stood and looked over the grounds. She shook her head and went into her house this time without saying anything. The next day after I laid the water pipe from the well house to my trailer I covered it and smoothed the trench out. I worked on the road next cleaning the ditches and pushing more brush away from the edge. I also cleaned a lot of the beach down to the lake and along the small stream that ran beside my trailer and into the lake. I dug up a clear patch for a garden also then returned the back hoe.\n\nI seeded grass in the areas I had torn up and covered it with straw the next day then just sat most of the afternoon and relaxed. It was in the sixties and I hung my hammock where I could look over the lake and chilled out.\n\nMy next project was to repair a part of the dock so I could get my boat out of storage and tied up. I planned to do a lot of fishing when the seasons opened. I was spending some money fixing up the old place but not much. It was cheaper than what I had been spending on my trip and I think I was happier.\n\nI had been keeping in touch with several people I met on my trip around the country and they were all interested in my project. In fact a couple of them had said they would stop and visit me if I had a place for them to park their rigs for a few nights. I got excited about that and spent several more days working around clearing pads for friends to park. I called my son and had him bring one of our back hoes and dump trucks down for me to use. I did more road repair and hauled several loads of gravel to improve it then I decided after I had ran more water and electric lines that I would pour concrete pads in the places I had cleaned up for RV's. By now Jolene was no longer surprised when she returned home and found another major change. In fact, some evenings she even came out and helped me if I was still working.\n\nI had also kept in touch with Maria and her parents. She was really interested in my little project and every time we talked she wanted to know what I had done since the last time. She kept gushing over the pictures I would send her and one time she said she would really like to see the place in person. I said, \"Well why don't you? It's really nice here in early June. Why don't you come up and see me then. Bring your parents if they want to come too.\"\n\n\"You know I just might do that. Can you make me a reservation somewhere?\"\n\n\"NO. I have a cabin here that's not in too bad a shape. I'll clean it up and fix the major problems and you and your family can use it if you all come. If it's just you that's ok too. I have several friends that plan on dropping by throughout the summer and have some pads set up for their RV's so if you all want to drive a rig up you can use one of them also.\"\n\nMy children thought I was crazy to do all the work and spend the money on the old camp but after a heated discussion they admitted it was my land and my money so if it made me happy it was fine. Besides, I think they decided they might enjoy coming down and spending a few weekends when it was warmer!\n\nIn mid May my first visitor showed up. They pulled in with a 36' fifth wheel and just barely got it down the drive! We took several minutes to site it on the pad properly then hooked it up. The first day they were there we just visited and caught up on happenings. Over the next week or so they did the tourist thing, took in shows in Branson and even used my pontoon boat for a day on the lake.\n\nJust before the first rig left another of my friends pulled in with a slightly smaller fifth wheel. We set them up and they followed the pattern of the first couple. Jolene was still unsure of her reaction to the changes but I did find her visiting with the folks some evenings. The second couple and I were visiting one evening and they were complaining about the long drive into town for groceries, beer and so forth. \"Steve why don't you stock a few things in the store over there? It would sure make it easier for your customers.\"\n\n\"Whoa there hoss,\" I said. \"I'm not running a RV site here. This place has been in my family for years and I just poured a few pads so my friends and family could park when they dropped by.\"\n\n\"What? Hell Steve you're sitting on a gold mine here. I guess I thought you were going into the business. I've been telling some of our friends how nice it is here and a couple of them told me they planned to come by and stay with ya. I'm sorry I misunderstood. I'll have to call them up and let them know they need to find someplace else to stay when they come to Branson.\"\n\nWhen the first couple pulled out they tried to pay me for the space. I refused because I had told them I considered them friends and guests, not customers. \"Hell Steve. That's bullshit boy. (He was a Texan and when he talked you knew it) I do consider ya a friend but you put a lot of work and money into fixing up this place. We've used your water, power and sewer system. You need something for that at least.\" He pushed a check at me and said, \"Here. Take this check for the power and water at least. Besides, I never did pay you for the boat and fuel we used. I know it's not as much as some of the nicer spots charge but I figured $30.00 a day for the pad and I added another $250 for the boat and fuel. Now I won't take no for an answer. Hell, me and the old Lady want to come back. This is a right relaxing place ya got here. If ya had a pool it'd be perfect.\"\n\nWhen the second couple left they also insisted on leaving me a small check 'for the power'.\n\nTo my surprise late in the afternoon of June 1 I got a phone call from Maria. \"Steve did you mean it when you said I could visit you the first of June?\"\n\n\"Of course Maria. Are you coming? I would really enjoy seeing you here. I've missed our talks and I would love to see you again.\"\n\n\"OHHHH Good. I was afraid you were just being polite. When can we come?\"\n\n\"Any time you want to show up Honey. I'm not doing a thing except puttering around here. I've already had a couple of friends stay a few days but they left last week. It's just me and the caretaker here right now.\"\n\n\"Steve we're in Hollister right now. Can we come out tonight?\"\n\n\"Hell YES! Do you need directions or I can come and lead you in. What are you driving?\"\n\n\"We brought Daddy's Motor Home. Is that OK?\"\n\n\"OH Shit! It's going to be a tight fit Honey. The camp will handle it fine but a couple of the corners on the road will be tough. The county road down here is really narrow too.\"\n\nMaria and her parents plugged the address into their GPS and before I much more than got the gate open they were there. I looked at the Class A motor home and stared. Hell I knew they were huge but this one looked like a monster trying to turn into my little narrow driveway. \n\nI watched and directed as Phil, Maria's Father, slowly made his way through my gate and started down the road. I walked in front of him and watched. There was one sharp dogleg corner that worried me. When he got to it he got half way around it when I had to stop him. His rear wheels were going off the road into the ditch and it was deep enough he would get stuck if he continued. I came up to the coach and had him back up. Luckily I still had the back hoe and a couple of loads of gravel at the camp. I went to the camp and brought several back hoe bucket loads of gravel to fill in the ditches on either side of the corner so he could drive into them and get around the corner. One place I had to cut a couple of tree limbs so he could get under them.\n\nJolene was standing in the yard staring with her mouth open when we came into her sight. She just stood and watched as Phil backed his rig into the spot nearest mine and hooked up. When he came out to hook up his lines she walked up to us and said, \"Well, I never in my wildest dreams thought I would see something like this down here. Ya all must be crazy to bring that thing back here in the hills.\"\n\nI was still listening to Jolene when a small shape jumped off the last step of the RV, dodged around Phil and jumped into my arms. Maria wrapped her legs around my hips and slammed her mouth against mine in a kiss. My arms instinctively wrapped around her supple waist to hold her. It was a moment before I kissed her back then I disentangled myself from her. I stepped back a short step and looked at her. Her eyes were shining and she was flushed. Her breasts were heaving as she breathed rapidly.\n\n\"Oh Steve it's so great to see you again. I've really missed you!\"\n\nI looked over at Phil and Felicia as she came down the steps. My mouth was hanging open and Phil grinned. He shrugged his shoulders then winked. Maria moved up next to me and wrapped her arm around my waist. To say I was gob smacked was an understatement. I didn't know how to react and I think Maria finally picked up on that. She stepped away from me a little and looked up at my face. \"Steve is something wrong here?\"\n\n\"Uh no. You just surprised me is all. It's great to see you all.\"\n\nAbout then a small car pulled into the yard near us. I looked over and smiled as Amanda jumped from the vehicle and skipped up to me. She wrapped her arms around me and gave me a kiss on the cheek then stepped back. She looked over at my new guests and said, \"Hi ya all. I'm Mandy. I didn't know you were here. I just came over to talk to Steve for a minute then I'll be out of your way.\n\nMandy's eyes were sparkling and she was almost jumping with excitement. Her beautiful breasts were bobbing within the restraints of her bra. The evening sun made her thin sun dress almost translucent. You could tell she was all woman for sure. She said, \"Steve I had to stop here first and tell you the news. Oh, Steve I got the job! I'm the new Assistant Manager at Ride the Ducks. I work from Noon until we close. Now I can pay you back for all the money you spent on me in Florida. I just had to tell you before I went home.\"",
        "\"Mandy Honey, we had a deal in Florida. You bought the food and I paid for the trailer space. You don't owe me any more than that. I would have spent most of the money I spent on the two of us if it had just been me anyway.\"\n\n\"Yeah, I know but I owe you for the trip home at least and I intend to pay.\"\n\nMaria was staring at Amanda and her jaw was set, her eyes glinting. I thought I saw tears in the corner of her eyes. I could see a hint of that Hispanic female temper I had ran into a time or two in San Antonia. She turned and almost ran into the RV. Felicia looked over at me and she followed Mandy without a word.\n\nPhil looked at me and Mandy shook his head and continued with his set up of his RV. Mandy looked at me then over at the RV. \"Steve is something wrong here? I didn't mean to interrupt anything.\"\n\n\"I don't know Mandy. This is Maria and her family. I think I told you about them? They have an RV park near San Antonio. We became friends while I was there and I invited them up to visit. They just got here and I thought things were ok until you got here.\"\n\nMandy looked thoughtful for a moment then grimaced and said, \"Awww Crap. This is the girl you were talking to all the time isn't it? The one you're sweet on? \" I nodded my head yes and she continued, \"Steve I'm sorry. I think I really blew this one for you. Crap! Hope I can fix it now.\"\n\nMandy went around the front of the RV and said, \"Sir I think I made a big mistake here. May I go into your RV and try to fix the problem with your daughter and wife?\" I didn't hear what Phil said but Mandy came back to the door, knocked then entered without waiting.\n\nI was standing watching the door when Phil came back to stand beside me. About that time I heard Maria screaming inside the RV. I couldn't make out what she said but I knew she was NOT happy. I heard a smack and Mandy shouted then I heard Felicia's voice raised also.\n\nPhil looked at me and said, \"Well Son I think we got us some real trouble here. If you had another woman I think you should have told Maria about her before we got here. You know she's not even looked at another man since you left us. All she could talk about was coming up here and seeing you son. How long you been with this lady?\"\n\nI didn't know what part of Phil's conversation to address first. I was in shock. Hell, I knew Maria and I had been close in Texas and we had screwed like bunnies but crap. Hell, I was 40 and she was what, maybe 28 now? Crap, she wasn't much older than my children and it sounded like she was thinking we were a couple. Damn, what did I do now? I admit, if I got involved with another woman Maria or one like her would sure be a good catch but damn, she was just a kid!\n\nI finally decided to cover all his questions but in reverse order. I explained about Amanda and that we were just good friends. I explained how we came to live and travel together then I said, \"Dammit Phil. I had no idea Maria thought we were more than just great friends. I...\"\n\nPhil looked over at me and said, \"Son do you think my Maria just jumps into bed with any of our guests? I thought more of you than that.\"\n\n\"Oh shit Phil. You know that's not what I meant. I just...Oh, hell, I don't know what I meant. I guess I really fucked this one up didn't I?\"\n\nThe RV had been quiet now for some time. The door opened and Amanda came out. She had a red splotch on her cheek. Maria followed her looking chastised, her gaze downcast. Felicia was last in line and she looked sheepish yet satisfied. I heaved a sigh when I didn't see any blood, well not really. I did walk up to Amanda and touch her cheek. She took my hand and held it. \"It's OK Steve. I think we have things settled. Now I have to get home. Walk me to my car?\"\n\nMandy pulled me away from the group. When we got to her car she stood on her tiptoes and kissed my cheek again then whispered, \"Steve that woman loves you to death. If you have an ounce of brains you'll lock onto her and never let her loose. Now I need to get home and you need to talk to Maria.\"\n\nI hugged Mandy then closed her car door after she got in. I watched her drive off and then I turned and walked back to the Hardy's who were standing beside their RV watching me. Maria looked guilty and was watching me with what appeared to be fear etched on her face.\n\nI walked up to the group and took Maria's hands in mine. I squeezed then reached up and raised her chin until I could look into her eyes. Neither of us said anything. I turned to her Father and said, \"Look, I hate to be a poor host but could you and Felicia sort of relax for a few minutes. I think I need to talk to Maria please.\"\n\nMaria looked fearful once more. When we turned and began to walk away I saw a slight wink in Phil's eye. I wondered if he was that confident or what? Hell, even I didn't know what I was going to say or do.\n\nMaria and I were quiet as we walked. After a few steps I felt her take my hand. I looked down at her and caught her glance up in my direction. I led her to a clearing I had opened up. I had my hammock set up there and a couple of yard chairs around a fire pit. The grotto was secluded. You could not see the RV Park from it but you could see out over the lake to watch the sunset and sunrise. There were some low bushes to protect you from direct sight of boaters unless you stood in just the wrong position because I sometimes lay in my hammock nude. I had a short path to the stream where I had a small swimming hole I used when I wanted to skinny dip.\n\nInstead of sitting in the chairs I stopped and turned toward Maria. I pulled her gently into my embrace. I kissed the top of her head, took a deep breath and said, \"Maria I suppose I'm just a clueless male here. I knew we were close and we had some great times in San Antonio. I felt closer to you than any woman I have found on this journey of mine. I think it was you that really began my healing and helped me move on from my wife's betrayal and death. You were my friend and lover when I needed both desperately. I have always looked forward to our conversations on the phone and I was very excited and happy when you agreed to come visit me.\n\n\"I just.\" I took a deep breath and continued, \"I just never considered...Hell, I have a son 6 years younger than you. I didn't understand how you felt about me.\"\n\nMaria began crying and said through her tears, \"Steve how could you? Do you think I jump into bed with just anyone I meet in the camp that is handsome and chats me up? Do you think I'm some sort of Puta, a Whore? I thought you felt as I did. Your age means nothing to me. Nothing. I don't care about the age of your children. I care about YOU. When you left I thought we had an agreement. We agreed to stay in touch while you healed further and we agreed to see each other again. After I met you and we had our times together I saw no other man who made me feel the least bit interested. You showed me a man can be gentle, loving and caring and yet be muy Hombre, all man. Now you tell me you do not love me, that I was just a piece of ass?\"\n\n\"NO. Maria, never that. I... You are so much more than that to me. You are a wonderful beautiful intelligent woman. I think about you a lot and I enjoy your company immensely even when we are not making love. I just never considered that you might think of me as more than just a great friend. If, no, when I marry again I would consider myself lucky beyond measure if I could marry someone like you...\"\n\n\"But NOT me? Is that what you're saying Steve? Not a child like me?\"\n\nI tilted her head up and gave her a gentle kiss. \"No Maria. That is not what I'm saying. I need some time to wrap my tired old brain around this...this wonderful gift you are offering me. I think of you many times even when we have not talked on the phone. I have become aroused many times just thinking about you and I have missed you terribly. Even when Amanda and I were living together I thought about you. Did she tell you we never became intimate?\"\n\nMaria nodded her head then smiled briefly before she whispered, \"I'm not sure I believe her though. She is a beautiful woman and a good person I think. I am not sure any man could live in a small trailer with her for three months and not take her to bed.\"\n\nI held Maria to me and said, \"Honey even when I saw her partly dressed I rarely became aroused. I didn't think about it until just this evening but you were the last woman I made love to.\"\n\nMaria pressed her lips together tightly then said, \"That's good Steve but how many did you Fuck after you left me?\"\n\n\"None Maria. There were many before you after Joan died but none after. I wondered about that at times but decided I was laying off because of Mandy...\" Maria began to tear up and I could see the anger in her face. I hurried my speech and continued, \"NO. Maria that is not what I meant. I meant I usually brought women to my trailer and since she was there I didn't feel...oh, hell. Anything I say now will be wrong. I admitted I didn't have any interest in other females after we parted. Oh, sure I admired a beautiful woman as any man will but I never even tried to take another one to bed with me. I just wasn't interested. Only one time has another woman been in my bed since I left San Antonio and that was Amanda. One night we were at supper and some college boys tried to accost her. She was upset and I held her in my bed part of the night. We were fully clothed though.\"\n\nMaria smiled and said, \"Yes. She told me about that night. She said her feelings were hurt when she woke and found you sleeping on the couch she usually used. She said she had wanted you to make love to her and you did not even attempt to do so. She said the next morning she found you in the bed she usually used with your morning wood and you were embarrassed and told her that was why you had left her bed.\" Maria laughed and said, \"You know I think I believe you. I think you love me and just are too stupid to see it. We will see. Now shall we go back to Momma and Poppa?\"\n\nThe second night Maria and her family were there she came to my trailer again. I had been asleep and the first time I knew she was there was when her warm naked body slid into my bed and she threw her leg over mine while she pressed her wonderful breasts against my chest. I wrapped my arm around her and pulled her tighter to me. She sighed and nuzzled my chest. We dropped off to sleep once more.\n\nI woke before she did the next morning. We were still holding each other with her head on my shoulder. I looked down at her beautiful body and felt my cock rise. I moved slowly trying to get out from under her. Maria moaned and reached her arm completely over me pulling us tighter together once more. She woke and raised her head. She moved and gave me a gentle kiss as her hand found my stiff cock. Her eyes glistened as she looked at me.\n\nMaria moved rapidly over me and held my cock. She scooted back slightly and guided me to her slick vagina. She gently set me into place then thrust her hips back taking almost half of my cock the first time. \"Ahhhhh,\" she said. \"God I've missed this.\" \n\nWe didn't do slow and gentle this time. Maria was a wildcat. She rose up to sit straight and slammed down onto me. She began rapidly rising and slamming down on me as she took what she needed. I watched her tits bouncing for a moment then reached up and grabbed them. I pinched her nipples between my index finger and thumb. I twisted slightly and Maria screamed and slammed down on me. I felt her cunt flutter and her hips twisted and rocked back and forth as she had her orgasm. The contraction and release of her cunt over and over combined with her hip movements pushed me over the edge. I groaned and grabbed her hips. I pulled her tightly against my groin as I thrust upward lifting us off the bed. I felt my seed pumping into her wonderful tight pussy.\n\nFinally we both relaxed. Maria fell forward against me and lay on my chest as we resumed our normal breathing. She lifted slightly and gave me another gentle kiss. She giggled and jumped from the bed to rush to the small bathroom in my trailer. When she came out she dressed in her shorts and a crop top that she had apparently worn into my trailer. She grinned at me and said, \"It's late Honey. Momma's fixing breakfast for us. If she's on time and she always is it will be ready in about five minutes.\" \n\nShe leaned in to me once more and I received another gentle kiss. \"I'll see you there sweetheart.\" She turned and I watched her beautiful ass wiggle from the room and out my door.\n\nThe rest of the week we visited fished, lay around the camp or took in some shows they wanted to see. Sometimes we looked over the buildings and location. The more they saw the more Maria and Phil tried to talk me into reopening as a campground and RV park.\n\nOn Friday morning Phil and I went into town to buy some supplies and groceries. I was still doing a little work every day but very little. Mostly I was buying groceries and supplies I needed to entertain Maria and her parents. When we returned Maria and Felicia were working in the cabin that was in the best shape. They had torn off a lot of rotten boards, had the carpet out of the living area and were partway done with tearing out the ruined kitchen cabinets.\n\nMaria turned when we walked into the cabin and smiled at me. She came bouncing up to me, hugged me and gave me a deep soul searing kiss. Then she stepped back and looked at me sort of guiltily. \"Honey please don't be angry with us for starting this work before we talked to you again. We had been talking this morning after you left and decided this cabin could be renovated for very little money. Even if you purchase new appliances and cabinets I think we can do it for less than $5,000.00 if we do the work ourselves.\n\n\"One of your friends called while you were gone and wanted to drop by and visit if you were going to be home and had room for their RV. I told them to come on that there was plenty of room. Was that OK? Anyway after I did that we talked about the cabin like I said before and decided to start working on it. If we can get it done next week it will be finished for them to see while they are here. I know it will rent for at least $700.00 per week and I think in the heaviest vacation season you could get at least $900.00. If you do that you will recover your renovation costs before the summer is over.\n\n\"We can send pictures with them of the cabin and the Park itself for them to show others and I know Mom and Dad would display pictures at their Park when they go back home. We have heard several of the RV'ers who stay with us say they intended to come to Branson or they had been here recently. As beautiful a park as you have I am sure that some of them would come here to stay even as far from town as it is. A lot of people don't like the hustle and bustle of a large park in a crowded area. I bet you would get a lot of the sportsmen also. Please can we complete this cabin at least?\"\n\nI laughed and hugged her. Her enthusiasm was impossible to resist. \"Ok, OK. We'll finish this cabin and I'll clean up a couple more RV sites. I'll call Alex this evening and make arrangements to keep the backhoe longer and have him send down some of the tools I'll need.\"\n\nMaria looked sheepish and said, \"Thank you Honey. I know you won't be sorry. Uh, do you think we could put in a small shoppette to sell some items people would run out of rapidly? You know, dry groceries, sodas, some canned goods and so forth. If you advertise for fishermen you could even stock some fishing supplies. I bet if you got a liquor license you would make a killing selling beer to your guests too. We sell a lot at Dad's Park. Could we do that please?\"\n\nAgain I laughed then said, \"I'm not too sure about that Maria. Jolene is living in the old office and store and that is where we would have to put those things. We'd probably even have to replace the coolers too. I'm not sure she would like to have a store back in her home.\"\n\n\"Could we ask please? Or we could set up another cabin as the office and the store if she won't let us use her cabin. I hate to say this too, uh, Jolene is a nice person but you know she really isn't doing much around here to earn her free rent either. I think you should ask her to do more or maybe start charging her something...\"\n\n\"I'm not sure I'm comfortable with that Honey. Let me think about that for a while.\"\n\nSaturday morning Maria and her mother went into town to look for carpet, cabinets and so forth for the cabin. I think Phil was taking a nap. I was sitting in the shade resting when Jolene came out and sat beside me. I decided now was the time to broach the subject of the small store and some of the other points Maria had made.\n\n\"Jolene how're you doing this beautiful morning?\"\n\n\"Guess I'm doin' ok Steve. Just feeling a little crowded or something. I guess I'm feeling guilty too. I know I've not been much help to ya around here evenings and weekends. Hell, you do everything during the week I used to do on weekends. Place's a little busier now than I was used to. Doesn't have the same feel if ya know what I mean. Steve I don't think I want to keep on here if you bring in a lot of folks always runnin' around poking their noses in things and always underfoot. I wanted to ask you what you were planning on doing here.\"\n\n\"Jolene I'm sorry. I guess I should have talked to you about that earlier. When I came down here all I wanted to do was pull my trailer in and live in the quiet like you were. Then I got some calls from friends that wanted to come see me so I made a few spaces for them when they visited. Now... Hell, I don't really know how to say this where it doesn't sound bad but I guess Maria and I...\"\n\nJolene laughed and broke in on my conversation. She said, \"Yeah, I know about that. Hell a blind woman could see what was going on there. When're ya going to make it permanent? I don't think that woman is planning on going home when her parents leave ya know. It aint right to keep her hanging on, not knowing how permanent ya want her to be.\n\n\"That aint what I was sayin' though. It looks like you're gonna make this a RV park here and I don't want to be livin' in one of those. Is that what you're doing Steve?\"\n\n\"I hadn't planned on doing that but I guess I sorta fell into it Jolene. Maria is really excited about it and Phil and Felicia think it would work. I really don't want to quit working at my age but I don't want to go back home and take over the construction company again either. I guess I'll let Maria talk me into opening a small RV Park and see what happens. Hell, she even wants to put in a small line of groceries, snacks and beer to sell to our RV customers and fishermen that she thinks will use our dock.\"\n\n\"I was afraid that was what was gonna happen. Steve would ya be upset if I found another place a little more private and moved on?\"\n\n\"No I understand. I can't say I really want to put up with the more rowdy folks either but I guess I will for Maria. Have to admit I have come to love that girl and if she wants an RV Park I guess I'll let her have it. She grew up in one so I know she knows how to run one.\"\n\nPhil and Felicia were going to stay another two weeks. That would be long enough to help me get one cabin renovated and most of the heavy work done on the store and office. After Jolene moved out Maria and I would rebuild the living quarters in the office building and move in there. We had a large living, kitchen dining area and two bedrooms in the back of the office and small store building. That was plenty for the two of us. I have to admit I had plans to make it pretty fancy too. I did like my creature comforts in a house. When I was RVing it or camping things were different and I accepted a lower level of luxury but my home was my castle and I wanted it to be very comfortable.\n\nOne day while we were in town shopping before her parents left I bought Maria an engagement ring. I don't remember asking her to marry me but I can't say I was upset at the way things worked out either. She led me into the store and we picked out the ring. Her smile lit up the sky the rest of the evening. Every time I looked at her she was either looking at the ring again or her mother was. ",
        "After the ladies had admired the ring for some time and we had done a BBQ in my private spot beside the stream Phil and Felicia disappeared. I opened the storage locker I kept in my grotto and got out a foam mattress and blanket. Maria and I sat and cuddled while we watched the sun finish going down and night fall. We sat and learned more about each other's body until we fell reached the point we had to have each other. Maria was moaning and writhing across the mattress as I finished undressing her.\n\nI could tell by the full moonlight that she was as excited as she had ever been. I kissed my way down from her neck to her wonderful C cup breasts. I alternated sucking one nipple while I pinched and rolled the other one between my thumb and index finger. After about ten minutes of that Maria came to a screaming orgasm without me ever touching her pussy. Her hips came off the mattress, her legs slammed together then she began madly thrusting her pelvis up and wiggling her ass back and forth as if she were fucking an imaginary cock.\n\nI moved down to try and lick her drooling quim when she grabbed my head and moaned, \"Nooo. Please just make love to me. You can do that later if you still want to.\" She pulled me up and over her. When I was nestled between her thighs she drew her legs up and raised her hips surging upward and moaning trying to get my cock into her hungry cunt. \n\nI bent forward and gave her a kiss then thrust my hips forward until I felt the heat coming from her drooling center. I slid my cock down catching the edge of her opening then popping out to slide downward under her ass cheeks. I could feel her discharge flooding out of her cunt and wetting the top of my cock. I pulled back and lay my cock on top of her mound then I lowered myself until my cock was trapped between us. I slowly thrust back and forth several times rubbing my cock over her hard little clit wetting the underside well. I could feel her nearing another orgasm. I stopped and extended my arms to rise over her once more. I nudged my cock to her cunt again this time searching for her opening. She held her hips tilted upward straining for contact with the cock she needed so badly. Maria rocked her hips slightly side to side and up and down until I felt the tip of my cock slip into her opening. I heard her gasp and her hands moved to my ass. I felt her pull me downward and her hips rose more slipping another inch of my cock into her hot pussy.\n\nMaria moaned and muttered, \"Please. NOW please Honey. Please don't tease me any longer. Please.\"\n\nI grinned down at her and adjusted my stance somewhat. I felt almost as strong a need as I believed she did. I leaned down slightly and slammed my hips forward and downward into her quim. I drove my entire length into Maria in that one thrust. It almost hurt when our pubic bones slammed together. I felt Maria's fingernails cut into my back as she pulled me tightly against her body and screamed. Her hips began madly thrusting upward and wiggling side to side as she thrust and rotated mashing her clit against my pubic bone. That night she almost fucked me to death. We spent the entire night under the stars napping then waking to love once more.\n\nThe next morning shortly after eight I woke to see my Maria laying on her side, head propped on her bent arm looking down at me. Her eyes were misty and her face glowed with her love for me. When she saw I was awake she bent and gave me a gentle kiss. \"Good morning my love. I promise with all my heart that I will be the best wife you could dream of. You are now and forevermore my number one priority, my reason for living. I am yours and yours alone. All I ask is you take care of me and my heart in the same manner my love. Nothing else matters to me in this world.\"\n\nWe put the mattress away and wandered down to the small stream naked as we had slept. We got into the cool water and washed the remainder of our loving from our still tired bodies with soap I kept in a can nailed to a tree for that purpose. After much fondling and kissing as we played 'you wash mine and I'll wash yours' we returned to the chairs I kept there and air dried.\n\nAfter about a half hour we wandered back to Phil and Felicia's RV holding hands. Phil was sitting in a chair under his awning with his morning coffee. Felicia was puttering around the small gas grill and stove I had placed there for campers use. Phil grinned up at us and said, \"Hey Steve. Do ya all still have cougars in these parts?\"\n\n\"Not that I know of. There have been some sightings of black bears but I've never heard of cougars. Why?\"\n\n\"Well 45 minutes or so after we went to bed last night I would have sworn I heard one screaming and caterwauling. Damn noise went on off and on all night. I just wondered what it could be is all.\"\n\nMaria's face turned crimson and she glared at her father. \"Daddy how could you?\"\n\nPhil stood and moved to wrap his daughter in his arms. He hugged her and gave her a gentle kiss on the forehead then said, \"Honey listening to you made my old heart proud. You did what a good woman does with her man. If you took care of him as well as it sounded like he took care of you you'll have a wonderful life together. I just couldn't help teasing you two a little. I sort of wanted to thank you too.\"\n\nPhil looked over at Felicia and continued, \"Listening to you two sort of got things stirred up for your Momma and me too. Been a long time since I worked that hard at night.\"\n\nFelicia turned and glared at Phil then said, \"Well you old coot. If you'd work a little less outside and a little more when we went to bed maybe something like that would happen more often.\"\n\n\"I'm sorry Honey,\" Phil said. I didn't know I was neglecting you. I'll do better from now on.\"\n\nFelicia laughed and started backing up as Phil moved toward her. She held her hands out in a pushing motion as she said, through her laughter, \"Oh, no you don't. I don't know if I could take it if you were more randy than you are now you old goat. I take it all back. You do just fine in the bedroom and the living room and the kitchen and anywhere else you manage to corner me.\"\n\nPhil laughed and grabbed Felicia. He pulled her into his arms and gave her a deep soul searing kiss. I heard her moan as she ground her hips into his. She pushed him back and said, \"Enough now. Look, you've embarrassed your daughter and future son in law again. Now sit down and finish your coffee while I get some for the kids. We'll finish coffee then I'll finish breakfast.\"\n\nFelicia turned to me and said, \"Hueovos Ranchos and breakfast burritos ok with you Steve?\"\n\nI felt my mouth water as I remembered how wonderful her Tex Mex breakfasts were. I pulled Maria to me as I said, \"Sounds great. I sure hope you taught Maria how to cook all these special meals you've been fixing for me since we met.\"\n\nFelicia laughed and said, \"Maria's a fine cook. In fact some of the meals you have liked so well were things Maria taught me to cook. I don't think you'll be unhappy with her cooking or anything else she does for you.\"\n\nMaria blushed again and said, \"Momma!\"\n\nI laughed again, sat in a chair beside Phil and pulled Maria into my lap. She sat with her back to her parents and I ran my hand under her skirt. She spread her legs slightly and I slipped my finger into her still wet pussy. Maria moaned and thrust her hips toward my invading finger. She leaned down and nipped my ear then said, \"Steve. Stop please. If you don't stop I'm going to cum here in front of my parents. Please don't make me embarrass myself like that. Please?\"\n\nI pulled my hand from under her short skirt and sucked my finger into my mouth. I then pulled her down for a gentle kiss. \"I would never knowingly embarrass you Honey. Now off with you so I can drink my coffee or I may have to take you somewhere and make us late for breakfast.\"\n\nFelicia smiled when she handed me my coffee cup. As Maria walked past her she said, \"He's just like your Papa Honey. I can tell you're going to have a wonderful life. I'm so glad the two of you found each other to help you move on from those horrible people you were married to.\"\n\nPhil and Felicia left two days later. Maria and I continued working on our new RV Park. By the end of the summer I had twelve unimproved campsites for tents, 9 pads for RV's and three cabins available to rent. We were going to have to almost completely demolish the other five cabins from the old camp and rebuild on their foundations. That would take longer so we left them for now until we were sure we would have the business.\n\nWe got our liquor license and new coolers for the beer and a few cold groceries. I mostly didn't buy anything to sell we wouldn't eat ourselves if no one purchased it. I kept two or three gallons of milk, some juice and a couple cases of several varieties of pop. We also stocked some candy bars, chips and so forth. Of course we kept some grocery items too. I stocked vegetables, soups, flour, coffee, sugar, and the basic staples. We did not keep fresh meat except for a couple packages of lunch meat. I did have some eggs, bacon, sausage and so forth. I would sell meat but I kept it frozen. That way if it didn't sell I could use it myself.\n\nEven without much advertising we began to get some calls and drive in RV units. When I put out a few signs and sent in an ad to the RV and Camping magazines business skyrocketed. Some of the later weekends in the summer we were booked solid. I had to keep adding stock to the store and we turned a little profit there too. Maria was happy and when she was happy she made sure I was VERY happy. 'Nuff said.\n\nI decided we would close the park at the end of September because most of the vacationers and fishermen were done by then. We spent a couple weeks cleaning up and repairing things then left for San Antonio to see Maria's parents and to get married.\n\nEveryone said the wedding was perfect. I suppose it was but as you know that is a woman thing so I take their word for it. I took Maria to Florida for a honeymoon then we returned to San Antonio. We had agreed to operate her parents RV park November through February so they could travel. In March we would return home and open our own RV Park for the summer. Phil and Felicia would come by during the summer for a visit leaving their park in the hands of a fairly competent assistant. Business in their park in the summer was minimal but they still spent most of the summer there to keep things running smoothly.\n\nDuring the winter when we were running Phil and Felicia's RV Park I had Amanda serve as caretaker for our park. She did minor cleaning, repairs and made sure there was no vandalism. She lived in one of the cabins. During the summer she would work in Branson in seasonal work. As the year passed I even hired her to help part time evenings and some weekends during the summer. I let her keep living in the cabin as part of her salary.\n\nOur second year of marriage Maria talked me into getting her pregnant. She said she would be happy with one child but she desperately wanted one of my babies. We had a son that we named Stephen Phillip Rowland. From the first Maria was so different from Joan. I didn't realize what a difference a marriage based on love and respect would make. Joan and I married because we had to and I think she resented it her entire life. I suspect we would not have married if she hadn't gotten pregnant but Maria? I KNOW I would die if she died or left me but her leaving or cheating is ONE think I don't have to worry about. Maria has always been hotter in bed than Joan was and she always makes sure I know I am number one in her book. Looking back I don't think I ever received that level of love or respect from Joan. She never acted as happy with our life as Maria does with ours. I hated what Joan had done to us but I understood now, perhaps, what she was searching for.\n\nI know it sounds corny but Maria and I are one. Where one goes so does the other. We work within sight of each other most of the day and never tire of the other's presence. Joan and I were never that close. I knew then and see plainly now that we both almost searched for opportunities to be apart from one another. Even when we were home with each other we were rarely in the same location together and we never took the opportunity to just touch and kiss frequently as Maria and I do. Now don't get me wrong. We each run errands or go to town shopping without the other but that is it. No running around at night without the other, no boys or girls night out and so forth. People who do that don't have a marriage. They are just living together.\n\nAmanda finally found the perfect man. I like to think Maria and I helped with that. One of my friends from home lost his wife to the big C. We invited him down to stay in a cabin several times to help him forget. After about a year we noticed when he was there Amanda was not far away from him. They kept getting closer and closer and finally it happened. Amanda came to our home one Sunday morning beaming. She showed us her new engagement ring.\n\nAmanda still helps at the RV Park and she and Wally live in the cabin we let her use. Wally got a job in maintenance at Silver Dollar City. Amanda quit her job in town. Now she is a housewife and mother when she is not helping us operate the Park. I did add a room to the cabin Wally and Amanda live in for their baby.\n\nIt took a tour of the country for me to move on after my wife's betrayal and death. At first I thought I might never get over the betrayal and hurt she caused me. I can say with certainty now I have moved on and am living a much happier and relaxing life than I ever thought I would have five years ago when the shit hit the fan that horrible night. I thank my Spanish Angel for her love and guidance in my continuing journey through life."
    ],
    "authorname": "SW_MO_Hermit",
    "tags": [
        "cheating wife",
        "widower",
        "travel",
        "new love"
    ],
    "category": "Loving Wives",
    "url": "https://www.literotica.com/s/moving-on-18"
}