{
    "title": "A Fucking Investment Ch. 07",
    "pages": [
        "Chapter 7\n\nBlond Ambition and Eve\n\nUpon returning to my house in Holdingsfield, I found plenty to keep me busy. The profiles of the membership were constantly being updated. My tour of the country with M'bara demanded my full attention. Spending the spare time I had inventing ways to excite her and stimulate her had cut into my study time and now I was behind. So I studied the profiles, arranged the information looking for the 'right ' way in, the access I could use for each of the remaining women. We had to designate the next move and I thought I found one and then slept on it for several nights. Tuesday night, I got a call from Crowley, the old crow. I had sent him a quick thought about setting up an escort service and he had concurred that the idea had merit. I gave him the new order of business which set his agenda for the next few weeks. But he is proactive, a good employee. \n\n\"Boss, I have had several inquiries about your escort service, the Prince is, shall we say, talkative? These people are serious. One of them was a woman who shall remain nameless whose son is turning eighteen and she wants get him a proper birthday present. She thinks a blond and a black woman would be just the thing. Several men are asking for a travel companion while they are in the country doing business and I have two or three politicians asking for discreet weekends.\" Crowley laughed, his voice scraping out of him like the complaint of twisting metal. \"Think of what happens when we advertise!\" \n\nI dismissed that idea because I wanted it to be discreet. \"Foil,\" I said, \"the discreet feat.\"\n\nCrowley was silent for a moment, then he said, \"Foil. Touché, the discreet feat.\" He rumbled. \n\nHe knew what I was saying, we had a simpatico about things like this; we needed a name, a label under which to operate. I immediately liked it. \"I'll think about it.\" I said. Liza had said something about an escort service and I had been pondering her comment. It was the conclusion she jumped to and she may not be the first or the last. The fact was that having all these women working off their debt with only me would likely kill me. I simply could not be the only prick in the picture. On the other hand, could I get them to agree to work their debts off with other people? I could not manage them myself and I certainly could not have Crowley or indeed anyone from my company do it or the cat would be out of the bag and I would never find out who the Chair of the board was.  \n\nThen Liza called; she and Valerie wanted to come over and 'settle up' as she said it. So they arrived that Thursday morning and we sat down and they presented me with their fuck diaries, running accounts of each 'billable sex act' they had performed and the value they assigned to each, individually and together. \n\nThe accounting was quite impressive and by the time we were well into it, I figured I would be giving them more credit before they left. Never was accounting so interesting as when you are forced to count billable blow jobs and if the groping of pussy and ass by three men in an elevator was billable or just fringe benefits. Liza was surprisingly organized and between them, they had a total of about eighteen thousand dollars in sexual favors itemized to bill to the Prince. I found nothing to quibble about. I doubted he would. He bragged about a fifty thousand dollar fuck so our rates were more than competitive. \n\nWhen we finished, I sat in thought, wondering about how to manage the situation, how to broach the idea of an escort service with these women and their roles in such service. \n\n\"Mr. Gale,\" Liza began and then stopped. \"Look, I have been thinking about what you are doing and it is great but, Mr. Gale, I do not want to insult you but you are never going to be able to collect on these contracts if you do it all yourself. Twenty-women? All laying down for you and trying to work off their debt one blowjob at a time? It is impossible. You are great but not that great.\"\n\nI started to respond but Liza held up her hand. \n\n\"Val and I were talking and frankly, we had a great time with the Prince, once you got him straightened out. He wants people to think he is really kinky but what he wants is to see his friends having fun. He gave us to his friends and several of the guys . . . \"\n\n\" . . . and gals.\" Val interjected.\n\n\" . . . who worked for him. He was always trying to get us to eat the waitresses that served us food at the restaurants—as the tip, you understand. But that is beside the point. He likes things, perhaps a little darker but he was very respectful after you settled things for him and was very content with us.\" She blushed. \"He even gave us some 'walking around money'.\" Liza glanced at Val and they nodded together. \"Three thousand each.\" She said. \n\nI extended my hand. \"That money is mine.\" I said softly. \n\nLiza blushed more deeply and Val joined her. \"It's gone.\" She whispered. \"We took an afternoon and went shopping. My gawd it had been a long time since I just splurged on myself like that! It was wonderful and when we got back, the Prince tore off our clothing and fucked us both because we looked so good!\"\n\nI shrugged. \"Add it to your balances.\" I said firmly. \n\n\"But it was ours! Our tips!\" Val protested softly. \n\nLiza held up her hand. \"No. He is right. Our bodies are his and he should be paid for letting us have what we had.\" \n\nVal pouted a little. \n\n\"Half.\" I relented. \"We split such proceeds evenly.\" I wanted to shrug and write it all off but I had learned that generosity in business leads to profligate liberality and an unrestrained sense of entitlement—give a little and they take a lot. Rules define the cost of employees and this was no exception. But this was more than an employer-employee relationship. Half seemed workable. \n\nBoth nodded.\n\n\"But that is not what I wanted to talk to you about, Mr. Gale. You are fabulous but you will never get your value from us if you have to collect it all yourself unless you raise these values. I calculated that it could take you fifteen years if you had one of us each night use this rate schedule even though the week with the Prince rather accelerated the process. I do not think anyone is going to want to be on the hook for fifteen years. So Val and I were talking and we think you should do this for all of us. You know, organize it. With your connections, I bet we could make your investment back in a hurry! I could manage it for you because you are going to need to continue recruiting. If you bring us the appointments, Val and I could take care of everything for you!\" Liza rattled this out in a rush, barely taking a breath. \n\nBoth women stared at me, tension evident on their faces. \n\nI was shocked. This seemed so impossibly easy, it had to be a mirage. I must be dreaming, I thought. For a moment, I was suspicious; my idea was coming out of their mouths. Not really, though because I actually heard the idea from Liza before, so this was just a follow up to her initial suspicions. But then I remembered the basic tenet of sales, always take 'yes' for an answer and quit talking. Till that moment, I had not really considered selling these women seriously. But the more I thought about it, the more I liked it. \"No drugs. No violence. Just basic sex, a good time; we are not catering to anyone's anything except the lack of mind blowing sex. I will let customers know that orgasms are required to have a return engagement. If they do not win your accolades, they get no call back. You know, don't call us, we'll call you? A call service but backwards to the norm. We only want those who give and seek the best.\" \n\nThe two women nodded soberly. \"We could have clients fill out surveys and we could do the same. Clients with a high enough grade could be retained.\" Val said thoughtfully. \"I can do that. Simple spread sheets to keep track.\"\n\n\"No exchange of money. That is illegal. We'll, you'll find a way to add-bill them. Everyone wins.\" I added. I was going to need a business setup to run the cash through. Sharon could handle that and fit it into the real estate acquisition. \n\n\"Consulting fees.\" Val added. \n\n\"We need a name.\" I hesitated, reluctant to suggest that I had already been thinking about precisely this. \"How about 'Foil! Touché, the discreet feat.' What do you think?\" \n\nVal and Liza glanced at each other. \"Shit, Mr. Gale, that is much better than ours.\" \n\n\"What was your idea?\" I asked.\n\n\"Trick and treat, the Halloween escort service.\"\n\n\"Too seasonal,\" Liza said. \"I like that, Foil!\"\n\nVal sighed. \"Fine, what is a foil!\" \n\nLiza beamed. \"It is a sword but a very bendable, flexible sword. It has a great deal of élan with it. Very sophisticated.\"\n\n\"You mean like Zorro uses? I am not sure you want to advertise sex for hire with 'bendable' and 'flexible' associated with the idea, do you?\"\n\nI shrugged. \"The people I will be sending you are not likely to be concerned about such things. You all will be arm-candy who put out and who do not look like it. The problem with most hookers is that they look like hookers. This will allow people to find the right woman for the occasion.\"\n\n\"But we can fulfill some fantasies, right?\" Val asked. \"That is part of the appeal, right?\"\n\nLiza and I both nodded. \"I think we take their requests and send them a surprise. Picking a woman is too tawdry for most people of the type I think we would appeal to.\" Both women nodded soberly. I was thinking about taking them to the bedroom when the phone rang. I answered it and my plans changed. \n\n\"This is Eve.\" \n\n\"Hello Eve.\" Valerie and Liza both looked up at me, raising their eyebrows. \n\n\"Where have you been? I have called every day and gotten no answer.\" \n\n\"I went to sleep, that is where I have been. I had a very tiring but productive trip.\" \n\n\"Well, I need you.\" Eve said, a sharpness in her voice. \n\n\"Glad to hear it. I am happy to accommodate you. Where and when.\" \n\nEve snapped her lips. \"I am not offering myself to you. You agreed to serve as my surrogate husband. Remember?\"\n\n\"Yes.\" I didn't remember but now I did. \"Shallow, right?\"\n\n\"Yes. She has been here three days and insists on staying till you get home. Can I tell her you'll be home tonight and we can have dinner?\"\n\n\"You mean when your husband gets home?\" \n\n\"Of course that's what I mean.\" Eve was positively snappish. While I think she hoped that she could use me as wealthy people are in the habit of using the less fortunate, I think somewhere in her baser consciousness, she feared that she may be toying with something more than a pliable cock which is a bad expression. \"We could meet you at the Astoria Steak Emporium tonight. Would you be available?\" \n\nI watched Liza and Val sitting at the table and mentally shrugged. They seemed comfortable with their positions, that is, working off their debts on their backs so there was no hurry about fucking either of them. I liked variety but familiarity breeds contempt. Foil could wait. \"Sure. What time?\"\n\n\"Seven.\" \n\nThe phone went dead in my hand. I hung up and returned to the table. \"I have an appointment I must get ready for. \" I said. \"I do want to find out what you all learned from the Prince but I am afraid I must get ready. I want to work out and shower before I go.\" I did not mention I did not want to be fucked out before I reported for unfaithful husband duty. \n\nVal held up a hand. \"Before we go, we need to clarify something. Liza keeps fucking my husband.\"\n\n\"He keeps asking me too.\"\n\n\"Yeah, no doubt, but you are expecting to move that off your account and add it onto mine, right?\" Val pressed. \n\nLiza blushed a little and shrugged. \"Well . . . \"\n\n\"No dice.\" I said. \"Liza, your ass is mine. If you are fucking around without my say so, it goes on your account, in detail. If it is with tiny Ted, then it goes on Val's account as well. Anytime he fucks any of my women, it goes on your account, Val. Do you understand?\"\n\nVal nodded. \n\n\"And you, Liza. If you fuck anyone, it goes on your account as sport fucking which means you are giving away what is mine which means you owe me for that. If I request that you fuck someone, as I did that one time with Ted, then it comes off your account. But if you do it for him or on your own, it is a credit to your account. Any questions?\" I knew I could not enforce this code, it would be the honor system but the idea had merit, even if it was up to them to 'fess up. \n\nBoth women shook their heads. They packed up laptops and left. I did work out but not hard, just enough to put a swell in my muscles since I expected I would be using them that night. I arrived about 20 minutes late, by design and parked my own car. I wanted the women settled and past their first drink. When I spied Eve, I could see she needed more than one drink. Her face was set and tense, slightly bowed so that she looked at the world through her eyebrows, which made her look both formidable and brooding. \n\nEverything the woman she sat with about the woman said sex or 'fuck me and I will fuck you'. There was no back down in her blue eyes. Her pale blond hair hung straight and long. She was fetching, with translucent white skin, completely clear and smooth. Her lips were rich and lush and she smiled as I approached, watching me even when she did not yet know me, a knowing look in her eyes. It said 'I know you want me,' without any suggestion that I could have her. She wore a sparsely cut pink dress with white embroidery, sleeveless and with a low neckline revealing her fine, porcelain breasts nearly to the nipples, showing skin to just below her belly button so that the skin was visible from her neck all the way down. A small gold chain held the two sides together. The front was straight, molded and held away from her body by apparently very, firm, quite formidable breasts. She looked like a heroine—or villain—out of a comic book. Her shoulders where small and narrow or perhaps her large breasts made them look that way. She had a small nose and high cheeks. Her neck was long and aquiline, graceful in line and curve. \n\nI arrived at the table and stood still and silent for too long before the brooding Eve noticed me. She smiled a frosty smile and said, \"Here he is. John, this is my dearest friend from University, Paula Imperial.\" \n\nPaula extended a hand and I took it, thinking of kissing it but then demurred and shook it. Her hand was small, delicate. She moved slowly, with an unhurried grace that was . . . imperious. She had noblesse oblige oozing from her pores with the emphasis more on her nobility and less on her obligation. \n\n\"Enchanted, John,\" Paula said. \"But call me Shallow. Everyone does.\" \n\nI nodded. \"Very well, Swallow it is.\" I sat down. \n\nEve was glaring at me. \"Not 'swallow', John. Shallow.\" \n\nI cocked my head. \"Ah, yes, of course. Shallow. But it could be 'swallow', right?\" I grinned but neither woman shared the fun. I felt like I had just farted at a funeral. They both had that manner, that way of looking at you which was a mixture of Olympics gymnastics judge and entomologist. I was a rare oriental wasp about to be pinned. Nobody trusts a giggly Olympics judge, hence the saying 'sober as a judge.' \n\n\"Have you girls ordered?\" I asked and the evening began. Both drank heavily and I paced myself, wondering at the clear animosity which clung to the occasion like a cloying perfume, so thick that it choked normal discourse in favor of getting a good, deep breath. Midway through the entrée, Eve's phone rang and she answered it to discover that a dear friend's daughter had overdosed and was in danger of death at the local hospital. Her friend needed a ride to the hospital. \n\n\"Do you want me to drive you?\" I asked, which I thought was perfectly natural for a loving husband to do. \n\nEve shot me daggers. \"No. John, you know how Natalie hates you. Your presence would just make things worse. Shallow, darling, I am so sorry. I really must go. I will call you in the morning. John can drive you back to the hotel. John, darling, please walk me out.\" \n\nI did so. Outside at the valet stand, waiting for her car, Eve took me by the arm and leaned close, wavering. She had drunk too much to drive but as her unfaithful husband, that was not my problem. \"That woman is insufferable. She is out to seduce us both. She made me go down on her yesterday and then she got to me this afternoon. Now she wants you. Be careful. I think there is something else in her twisted little mind.\" The car arrived. Eve presented me her lips and I kissed her, hard. She sighed into my mouth while the wine fumes wafted into my nostrils from hers. Her mouth opened and she groaned as I pressed my advantage, her body molding against mine like a new lover. She broke the kiss but only after keeping the valet waiting for a good minute. She regarded me with her serious blue eyes and then winked at me. \"Go get her, Tiger. And thank you.\" She squeezed my hand. I held on for a moment. \"Fuck her. Fuck her good!\" Eve hissed and was gone. \n\nI stood and watched her drive away. She did not hit a light post so it was a good start at any rate. I returned to the table, looking back and seeing clearly that Swallow, er Shallow could have seen us at the valet station. Good thing we kissed like we did if the charade was to actually work. I had doubts. \n\nShallow was done eating and propped her proper chin on her hand and watched me as I finished my meal. \"I gather my dear friend Eve has discussed the details of our past acquaintance?\"\n\n\"You mean your penchant for fucking everyone else's boyfriends because you were a repressed dyke?\" \n\nHer ruby red lips made a little 'oh' and her eyes twinkled. I could see the game change in her eyes. I was not going to be some blushing school boy, lured into the spider's web or a lustful, wayward husband struggling to remain true. The measuring predatory look morphed into something which could have been actual interest. I thought a good rogering was just what the woman needed and that meant we had to establish right from the beginning who was mounting whom. \n\n\"She said I was a dyke?\" Shallow asked.\n\nI shrugged. \"No. I extrapolated. You do not fuck for fun. You fuck for friction. I bet there is nothing you like better than kissing the wife of a man you just fucked, knowing you just had his cock stuffed in your mouth.\" \n\nThe woman actually colored. Her pale skin turned a cozy pink but her eyes were not embarrassed, they were dark and set, like pinholes, the natural blue darkened. If her irises got any smaller her eyes would have been all white. She did not speak. She bowed her head and then looked up at me. The color was gone and she was smiling, still a bit thinly but still a smile and her eyes had relaxed into a more human appearance. \"I do give good head. Care to try?\"\n\n\"Try? You mean you are still practicing?\" \n\nHer eyes contracted again.\n\nI chuckled deep in my chest. \"I have Eve, the best little cocksucker in the land. Why would I put my cock in the mouth of a woman who has gargled more chlorine than an Olympic diver? And second best at that.\" \n\nThe woman colored again. This time she bowed her head and was quiet for several minutes. The waiter came and I ordered a decadent chocolate desert. When it came and the waiter had gone, Paula looked like she was going to say something but I forestalled her, lying my hand on the table. \"Listen, girl, we know all about your proclivities. You fuck the husbands of your friends, just to see if you can or to humiliate them or to see if they will take a gun and put you out of your depressed misery. I do not care why. What I care about is one simple thing. Can you fuck and is there something I can offer you that will make you come more than you have ever come.\" I took a bite of the flourless tort. It was great! \"Paula, I am not interested in bullshitting you or Eve. This is a set up. Nat's daughter would never be so stupid as to overdose on coke and if she did, she would call Edwin and not Natalie. She is sending me back to your hotel with you with the expectation that I am going to fuck you. We'll see. I only fuck people who can kiss me and make my toes curl. Bad kisser, you can take your left hand to bed and let that be enough. Now, are you going to drop the routine and be a woman? Or are you going to keep the hooker act going and see how far it gets you?\"",
        "\"Hooker act? How dare you!\" Shallow's face rippled as an additional thought passed through her mind, \"and I am right handed.\" She added calmly, as a sign she was indeed in control and in control of herself. \n\nI could not tell if she was more upset that I had suggested she was a hooker or because I was not impressed with her act. I doubt she knew which either, perhaps both. \n\n\"So do you fuck around on little Evie a lot, John?\" \n\nThis woman was good, back on the offensive without missing a beat. \n\n\"You are getting a little personal, aren't you?\" Just the right amount of 'defensive' to get her that superior feeling again. She did smile, a supercilious smile which straightened her shoulders and raised her chin just that bit just before she ran a finger up between her breasts. The game was on. \n\n\"You are going to fuck me, right? How personal is that?\"\n\nI shrugged. \"With you, rather like boarding a commuter train, I would imagine.\" Swallow's face scrunched into a scowl. I called for the check to stave off the gush of imprecations she had all lined up to deliver in the most elegant and cutting fashion. Then I walked out of the back exit of the restaurant to the elevator that gave access to the parking garage. I neither acknowledged her nor offered her my arm. She clacked along behind me, trying to keep up. The swing door slammed shut behind her and I turned and had hold of her so fast she shrieked. I kissed her, hard. Her lips were stiff, unmoving but I kissed them anyway, holding her by the shoulders. I dropped the kiss and stepped back. \n\n\"You don't kiss worth a shit.\" I said. \n\n\"No.\" She said. \"Wait. Give me another chance. You surprised me.\"\n\nI glared at her. \"You come here with the stated objective of fucking not just me but Eve, too and you want some consideration? What sort of sociopath are you?\"\n\nFinally, the Barbie doll face cracked and she backed up from me. A tear appeared at the corner of one eye as she clasped her tiny little white purse to her huge visible breasts, folding them in around it like a collapsing umbrella in hurricane. \"She told you?\" Paula whispered.\n\n\"That you ate her cunt and then got her to eat yours?\" I got it backwards intentionally—she never went first, I suspected. \"Yes. And fuck you. Damn you! You do not know what you have done! Eve swore to me, no more women! She had stuck to it till now. And you waltz in here and fuck up the situation. Thanks. Now she wants me to fuck you to balance out the deal. For all I know she going to go down on Natalie as thanks for the phone call and then the whole deal starts all over again! Women calling all the time, glaring at me when they leave because they think I am competition or Eve will be complaining that she cannot have her cunt full of come when Mildred the dyke eats her. This is all your fucking fault! Fuck me!\" I turned angrily and punched the call button for the elevator. \n\nI stood facing the elevator, diluting the synthesized adrenaline coursing through my veins with stillness and deep breathing, wondering if she was going to buy the 'I hate having a bi-sexual wife' routine. Shallow clicked up behind me and laid a hand on my shoulder. \"I am sorry. In college it was not just a pointless game. I fucked them all and they all knew it. It was a test to see if their new beau was honest with them. Those who confessed were keepers. Those who hid it needed work and those who called me for another bout of shallow sex with Shallow got the boot. I provided a screening service we all needed.\" \n\nThe elevator arrived and I let the door close without moving. She was a narcissist, never thinking to ask about Eve's supposed lesbian addiction. It made no difference to her. \n\n\"We were a group of all society girls, young women who had a family fortune stuffed up our skirts and every man we met knew it. We looked the part and acted the part and most of us were not actresses. Few could dress down and fuck a stranger for the sport of it and fool anyone. And besides that is so tawdry, it insults a girl's self-image. So we played the dating game or the Virginia Reel and reel them in.\" \n\nI hit the button again and the door opened but I did not mount the car. \n\n\"No one saw us as women, girls to get to know or simple attractions to act on. When they looked at us we were either a pathway to riches, opportunity or a trophy they could bang and then brag about. I shamed them into silence for everyone else. I formed a no man's land where the other girls could watch and judge without putting their own reputation on the line. Until their new beau fucked Shallow, no nookie was offered.\" The elevator door closed.\n\n\"I was the litmus test and not a few of them would sit down with me and grill me about what he liked, what he was like, what he was good at, if he was hung, if I thought he was right for them. In practice, I kept them all safe till they could figure out how to keep their own panties on. The group before us, at Victoria Prep, nine out of sixteen heiresses had abortions before they graduated, most before they were sixteen and several had two. Two of them committed suicide in college. In my group, they are all happily, well, comfortably married. I think Eve and you are happy but not doing so well, if I gauge the situation correctly.\" Shallow stopped talking. \n\nI was impressed. She was clearly a highly intelligent woman. While I longed to just fuck her good, do her in the ass and call it good, I thought I owed Evie something more. Something that would buy more something, more than a simple kiss from her as the favor she owed me. But I felt sorry for Shallow. I'm such a sap!\n\n\"So. Are you married? Eve never discussed your love life.\" The elevator door closed again.\n\nNow tears did come to the woman's eyes and she shook her head. I was even tempted to believe they were real. They welled up and a big fat one tracked down one cheek. It was impressive! Such training, such command of her tear ducts! I was not buying it. I hit the elevator button again and the door opened, which indicated low demand. I stepped inside and Paula followed me but stood facing me. Neither of us selected a floor. \n\n\"Tell me something you have not done that you would like to do.\" I said. \n\n\"Walk on the Great Wall of China.\"\n\nI smiled and shook my head. \"No, I mean sexually. What is there that you have not tried that you think you might like? You always have to do all the work; this time, let me give you something you love, something that you dream of.\"\n\nFor an instant, I saw the calculation in her eyes and I knew I was right to be suspicious of such easy tears, no matter how much sense they made emotionally and the subtle intentions Eve feared. This woman was not a normal woman. For a moment, that thought scared me and I wondered if I was playing a game with no good ending for me. I confess, the thought gave me a bit of a thrill and increased the growing erection in my pants. \n\n\"I have never had someone watch me while I was fucking, being fucked.\" She said seriously. Her eyes did not waver. This woman had been manipulating for so long, she simply did not know how to stop. If she did, she might turn to dust and blow away. \n\n\"Does it matter who sees you? Us.\" I amended. \n\nPaula's eyes widened for a moment. \"Give me another chance. I want to curl your toes if I am able. Kissing you, I mean.\" \n\nI regarded her for a moment but she was fully in character now, feeling in control of the situation once again; back on script. \"Give me your panties.\" I said. This could be a losing gambit if she was not wearing any. I wasn't sure which to hope for. Both had great potential. What this woman must think of Eve, married to a John like me! I smiled into the silence which followed my demand. I think it must have made me seem challenging or arrogant because Paula immediately reached under her dress which only came to mid-thigh and skinned her pretty pink bikini panties down her beautiful legs. She did have perfect legs. Everything about this woman was perfect, skin, proportions, ass—which I had been able to examine by then—tits, lips . . . she had it all. My initial impression had been right on, 'fuck me and I will fuck you' was this woman all over. Paula stepped out of her panties and unhooked them from her lifted ankle and held them out to me. \n\nI looked at them for a minute, a bit disappointed. Had she been commando, I was going to unzip my pants and invite her inviting mouth to suck my dick. The idea of her on her knees in this dingy elevator when the door could open at any time had been attractive. My first idea had been to take her panties and give her the chance to kiss me again as she wanted but giving this woman a chance seemed like giving a shark the chance to lick your finger; a good way to lose your arm, IF you were lucky. \n\nSo I took the panties, stuffed them in my pocket. Then, while she watched, unzipped my pants and fished my pliable cock out of them, holding it with one hand. Paula stared at my cock and looked up at me, involuntarily shaking her head, like she could not believe I had done that. \n\n\"I have been gone a while. I need a quick one.\" I said softly. She glanced at the floor selection buttons, gauging the risk. She knelt, moved my hand away from my cock, taking it in her hands and massaged its girth and weight for a moment. She lifted the head and licked it. Then she kissed it. Looking down on this gorgeous blond woman with the dark red lips addressing my cock on her knees in an elevator got to me. Like a jolt of electricity, I started feeling her ministrations and my cock twitched in her hands. She sucked on the end and let it slip further into her mouth. Her tongue entered the fray, lashing the head of my dick and swabbing it while she sucked at it. It swelled and stiffened. She sucked harder, encouraged. It straightened and she let it poke into her cheek which bulged as she pressed her head onto the cock at the wrong angle. She adjusted her head and the cock flexed into a full upright position. Paula blew through her nose and sank her mouth about half way down my cock. I felt the head hit the back of her throat. She blew again, sounding for all the world like a horse snorting. \n\nI bent over her and put each hand down her gaping dress finding her breasts bare inside the nearly rigid front, impressively supported internally without benefit of bra or wire. The golden chain broke. I found the nipples and pinched them gently. Paula snorted again and pressed her head further down onto my towering cock. I pinched her nipples harder and she groaned deep in her throat, deeper than the head of my cock had yet descended so the sound vibrated pleasingly around me. I cupped her hanging breasts, pushing them inwards so they escaped the little restraint and support the pink dress provided. I then pulled them upwards, squeezing them both very hard. My cock went completely into the woman's pulsating throat. She swallowed around it, showing her talent and control. She blew and again and I felt her hot, blistering breath wafting through my unruly pubic hair. She inhaled again, sucking at my entire cock again. She swallowed, blew again and backed off till only my cock head was clutched in her lips. Her mouth massaged my cock, like she was sucking at a mother's nipple, pulling with her lips and leaving a smear of red lipstick on the upper side of my cock, which had gone white from the intense sucking but soon turned so scarlet the smear of her lipstick disappeared. \n\nPaula's eyes were on me. I had withdrawn my hands from her dress and had one on the back of her head. For a moment, I thought about cocking her throat again but hesitated. Like a flash of lightning the desire to be inside her body struck me, at the other end of her body. \n\n\"Stand up, Paula.\" I croaked. My voice was raspy, harsh, insistent. Paula gave my wondrously hard cock one last suck and then stood up. She began to put my cock away and I was encouraged. She did not expect it when I spun her around, and lifted the stiff skirt folding it up onto her back. I grasped her by the hips and probed her ass with my cock. I opened my pants and let them drop to my ankles. Her hands automatically went to the wall of the elevator and her head cradled against her arms. I grasped my cock and used a finger to search for her hole. I touched her lips, finding them damp and bulging. I fit the tip my finger into her entrance, feeling around until I was sure I had the hole opened a bit. I moved the head of my cock to her pussy and pushed. \n\n\"Oh god!\" Paula whispered. \"Oh sweet god!\"\n\nI pulled back but her hips followed me so I reversed direction and surged back down her love channel. She actually shuddered as I entered her. Her pussy resisted for a few strokes, I encountered her tight band and backed up, massaging her outer lips with my cock while I steadied her with my other hand. Finally, I felt her inner acceptance, that relaxing release and my cock shifted deeper for the first time. \"Christ you are tight, Paula. What a fine cunt you are.\" I hissed.\n\nPaula grunted in response. My cock flowed deeper into her body but not all the way. \n\nFor the first time, I discovered what a small woman she actually was. Her legs were long but she was short, with a short torso and a small set of hips which made her waist low and created the illusion of height when the reality was simply perfect proportions. I only had to bend my knees a bit to get my cock perfectly lined up. Then I put hands on her hips and began to stroke my cock into her. She wavered back and forth before me as we separated and then slammed together. Her pussy sloshed with liquid as I fucked her and soon it was running down my legs and hers. I bowed over her and grasped her breasts, again filling each hand barely but proportioned perfectly to appear larger than life. I grasped them and began to fuck into her body while pulling at them. Her dress was pulled back over her shoulders which arched to help my reach. Paula moaned and then her ass began to shake and quiver. \n\n\"Christ, fuck me. I am coming!\" she muttered. At that moment, the car lurched into motion descending. I pulled out of her cunt, pulled up my pants and put my cock away. She pushed herself upright and righted her dress, tucking both breasts back into place. She staggered back to me, leaning on me like she was drunk, which, I suppose she was; pussy drunk or cock drunk, if you like. I put a hand around her to steady her. She shifted her purse to the left hand and cupped my tented cock, moving it up and over so that it lay more naturally inside my pants, forming a distinct crease, almost like the Nike swoop. I leaned over and kissed her, finding her lips expressive and open, her tongue sensuous and tentative, while she probed my mouth and I painted the roof of her mouth, making her shudder in my grasp. We were still kissing when the doors opened. Her hand lay lightly along the side of my face, a curiously tender gesture. Two couples were waiting and stared at us till we noticed and one of the guys blocked the closing door. They stood aside as we staggered out. They entered the elevator with odd looks on their faces, perhaps smelling the cloying scent of aroused cunt that filled the lift. They entered the car and the doors closed. I pulled the woman into my arms and kissed her hard. With one hand I circled her shoulders and the other snaked underneath her dress and cupped her perfect little ass. She lunged against me, plastering her pussy against my leg as I kissed her, moaning into my open mouth. \n\nWhen we broke the kiss, she said, \"coitus interruptus. Dammit I was having a good one.\" \n\n\"Come with me.\" I took her by the elbow and went in search of my car. I had parked in a remote corner myself rather than use the valet service. When we arrived, I opened her door but stopped her from getting in, taking her purse and dropping it on the seat. I turned her around found the hook and zipper under one arm and loosened her dress. The moment I tugged at it her arms rose like she was doing that wave at Wimbledon, decorous but participating. I pulled it off of her. I tossed the dress onto her seat and pulled her into my arms. Her naked body shivered in the outdoor air. The sound of a car nearby disturbed our kiss. I turned so that she was shielded by my body when the headlights flashed over us from someplace deeper in the garage. When the ticking, clicking silence of the place returned, backed up by the sounds of the city traffic beyond its bleak, concrete abutments, I pulled her to the back of the car and turned her to face the trunk. She lay down on the boot, hoisting her ass which was soon possessed by my hard cock. I found her weeping entrance and shoved the steel probe home. She bleated for a moment and then, hunched back at me. She stretched her hands out before her like she was making a bowing prayer of some sort and arched her body a bit so her breasts were brushing the cool metal of the Caddy. \n\nMy cock rooted deeply in her pussy and I adjusted, trying to keep my pants from dropping off my ass till I gave up and let them fall. I began to hammer Paula from behind, while she muttered and moaned on the trunk of the red Caddy. I took firm hold of her hips and lifted her feet off the ground and then pulled her back onto my cock, with my legs straight. She dangled in the air, her feet off the ground, a cock firmly entrenched in her spasming cunt. Paula came as I hit bottom, grunting with passion but nearly helpless in that position. Since most of her weight remained on the car, I could move her ass around on my cock fairly easily and I did, changing angles. Her tits scrapped on the metal with a discreet little squeak as I shifted her body around on my cock. She finally lifted her legs and hooked them on my back in an awkward configuration but one that gave her enough leverage to pull me into her pussy with short, quick jerks of her legs which began a crescendoing rhythm. I tried to match it but she was screaming through gritted teeth and clinched lips so she did not echo into the garage. I fucked her hard and fast and then I was coming. The reason I had stripped her, I wanted to come. She must have been coming the whole time because her body bucked against me when I stopped stroking into her cunt, bucked and twisted while she whistled and wheezed through the orgasm possessing her, successfully remaining fairly, discretely quiet. \n\nI lay over her for a few moments, waiting for my heart to slow down so I could stand up without fainting. I did. She dropped her legs, probing for the ground. I panted, backing away. I pulled up my pants just as the car rounded the corner, the lights playing over her glistening white, naked body. She immediately rolled over, waved and smiled while cupping one gigantic breast with her other hand, legs wide. The car passed. She slid off the trunk and clicked over to the door and got into the car. I got in the other side. \n\nI sat there for a while doing nothing, maybe waiting for my vision to clear to return to normal so I could drive. Fuck drunk could cause accidents as well as drunk drunk would but it was more difficult to test for and would not get your license lifted. Still, I waited, as a matter of public safety. \n\n\"Fuck me that was great.\" Paula said. \"You asked if there was something I really wanted to try that I had not gotten to do, before. There is.\"\n\nI lifted my head and looked at her. \"Oh?\" \n\nPaula was nude, sitting in my car, likely dribbling our cum all over her dress, which she was sitting on. Her breasts glistened with sweat, drying in the cool air, the nipples were prominent in the middle of the brown-red patches. Her hands lay on her bare legs. She looked at me. \"Yes. There is something I always wanted to try but never got the chance.\" \n\nLights flickered behind us and for a moment I could see her eyes and I knew something was coming. The little bitch was not satisfied yet. There was something more. I had felt it all along and here it came. ",
        "\"Yes, I fucked everyone's boyfriends and now, everyone's husband. I guess once my therapist and I figured out what college was all about, I figured they owed me a crack at their comfortable little hubbies. You would be surprised how few of them made an issue of it. I never asked, I just took and maybe that was wrong but they let me ruin myself and took their benefit without ever giving me anything in return.\" She harrumphed, \"except maybe contempt. I got plenty of that. Now, I cannot devote myself to any one person. I fucked all the guys they were curious about. Several of them sent me on a cock hunt just to see if I would or to get intel on the guy. It was amusing to watch Swallow, er, Shallow bag another cock. I was doing force recon for cocks.\" She smiled crookedly. \"Yes, I play computer games, online and I am damn good.\" \n\nPaula bowed her head then. Act or true isolation, loneliness or regret, with her I could not tell. \n\n\"I was ruined and they benefitted. They owed me.\" She sounded vehement which struck me as odd, but the rationalizations of a sociopath will always seem sensible till you stop and think about them. They would always be fascinating and sometimes intoxicating. I, however, was prepared. I knew as Eve did not know that there was something more this woman desired and would continue to pursue till she got it. We, I had to find out or she would not be satisfied. I resolved to satisfy Shallow so she would leave Eve and John alone. I am such a humanitarian! I amaze myself, sometimes. \n\n\"You were right. I loved the idea of fucking both sides of a couple. While they all complained about me fucking their boyfriends, not one of them ever made a peep about me eating their cunts. Never. And most of them would return the favor as a matter of course. I do not know how many of them were pussy diving when I was not around but they all tried it one time or another with me. All of them! Several of them fed me fresh fucked pussy. Usually I could recognize the taste and smell of the spunk oozing of the them because I had drank from the source myself. I even managed to get a few of them to eat the spunk of their man or someone else's man out of me. That all turned me on, incredibly, and I always came like a freight train. But every time I fucked the guy, I would look around for them, imagining that they were watching. I just thought I felt guilty and was worried about getting caught but in fact, I learned later, I actually wanted their approval. I wanted each of them to watch me fucking their man.\"\n\n\"And join in?\" I prompted. \n\nPaula shook her head. \"No. Not so much. Although I would not kick any of those girls out of bed for eating crackers. I just wanted them to approve of me fucking their men for them. I wanted their approval. The best would be for them to invite me to come fuck their man, you know, as a gift to show their love to their man. I wanted to be that gift. No one is ever going to do that.\" \n\n\"You want them to acknowledge that you are better in bed than they are.\" I said, before I could stop myself. Revelation is good for therapy and theater but it is not renowned for creating an atmosphere for excellent sex. I feared I had blown it. I thought I knew where she was heading and everything fit. I chortled inside myself, for once, I thought I was ahead of this blond vixen, if I could keep my fucking mouth shut. \n\nPaula stared at me and then shook her head. \"Could that be it? I just want all those women to admit that I am better at being a woman than they are? That if everyone faced up to the truth, I am sexier, more beautiful, more perfect in every way than they are and so their men settled for second best when they passed on me?\" Paula stared out the windshield for a few moments and I feared, still and again, that I had lost her. But she rallied. \n\n\"I will have to think about that.\" She turned to look at me, got moment, I thought I glimpsed gratitude in her eyes but I was likely just hallucinating. \"I just want Eve to watch you fuck me. I want her to see me coming with your cock stabbed into my cunt and my legs wrapped around your back. I want her to see you enjoying my perfect body and I want her to smile and let you have me. That is the perfect fantasy.\" \n\nI started the car. \"Get dressed.\" I said. She slipped the dress over her shoulders and into place, not bothering to zip it up or wipe at the big stain blotched on the side of the skirt. Everything was clear to me. It was almost too perfect. And I could afford to be leisurely and indifferent to the outcome. I actually felt good about what I was about to do. I paid the parking and got out onto the street headed towards Paula's hotel. I fit my Bluetooth into my ear and said 'Eve' which I had programmed into the system on the way over. I had anticipated taking Shallow back to the hotel but not what I now had in mind. \n\nThe phone rang and Eve answered. \"Hello.\" \n\n\"Where are you?\" I asked. \n\nThere was a long silence during which the traffic light changed. \"On my way home.\" Eve said, her voice tense, guarded. \"She is in a coma and her mother had to be sedated so there is nothing left to do at the hospital.\" \n\nThe liar. She was going to deserve this. \"Listen, the hotel had a pipe break above Shallow's room and it has been flooded, they just called. They do not have any more rooms. Rather than force her to chase around and find someplace else to stay, I offered to let her stay at our house. She insisted I should call you before we decided what to do.\" Paula was staring at me. \n\n\"She is with you now?\" Eve asked. \n\n\"That's right.\" I returned. \n\n\"I see. Your idea or hers.\" \n\n\"What do you think?\"\n\nThat stopped her. She thought out loud. \"If you did not offer, it would look suspicious. But that means you have to stay the night in my room or she is bound to notice. That makes it sound like your idea. I am not going to fuck you, Josh. I already told you.\" \n\n\"Of course. Only until she arrives. I know we promised her a place to stay for a few days but for tonight Shallow should be no imposition, don't you think? We can change the sheets easy enough though, right?\"\n\nEve snorted. \"Fine. Bring her here.\" She was quick and caught on fast. \n\nPaula continued to stare at me open mouthed. She did not say anything though. She got her stuff and brought it down to the car in record time, without checking out since she would likely need the room again in a tomorrow. We were back at the community and pulling up to Eve's house by eleven. Paula had showered and changed and was wearing a see-through white blouse with a pretty bra and a black skirt with flats. She had dumped a bunch of water in her suit case to back up the story. Everyone was lying to everyone. \n\nEve greeted us with tight bonhomie and stiff consolation. She helped settle Shallow in the guest bedroom, on the other side of the atrium from the master. Shallow immediately retired which left Eve and I standing together on the balcony outside the guest bedroom. She looked me over and then sighed. \n\n\"Fine. Come with me.\" We went back to her room and she pulled out some pajamas from a drawer. You can wear these. Did you fuck her?\"\n\n\"Yes. But she is not satisfied.\" I said, opting for the truth rather than trying to ratchet up the pressure. I thought the truth would be enough. \"She wants something else. She wants you to catch us fucking. That is why I brought her here. Her secret desire is to fuck your husband while you watch and either join in or at least watch. Either way she wants you to approve of it. If that is her agenda, she would keep coming back trying to collect and she would figure out you duped her and the cost might increase accordingly. She is a sociopath, I think and she would not rest till she got you some other way. This way, I fuck her again, you creep down the hall and catch us and everyone is happy. She leaves you alone and tries to duplicate it with all your other friends but you are first and off the hook. That is going to take some doing to duplicate with the others so I am at least buying you time. She will figure out you have a different husband than the one she fucked but if she has managed to duplicate her fantasy with her other friends, perhaps she will give you extra credit for starting her off. She might even give you props for being clever enough to fool her.\" \n\nEve squinted at me, cocking her head. \"Sounds plausible. So, what? We go to bed, I am supposed to go off to sleep and you, unable to resist fucking her again, creep down the hall and attack her. She screams while you fuck her sooooo good and I come down and watch her coming on your cock?\"\n\nEve's lapse into gutter language signaled how unsettled her encounter with this woman had left her. I nodded and waited. \n\n\"Or, I could just go home.\" I said. Truthfully, either way was fine with me. \n\n\"No. No. This sounds exactly like something Shallow would do.\" Eve said, finally averting her eyes from mine, ending the search for subversion. \"You can sleep on the floor.\" \n\nI was ready for that. \"Nope. I am helping you. We do it my way. You said no fucking. Fine. But I am your husband and I sleep with you. Not to worry, Swallow is likely to fuck me out anyway.\"\n\n\"Shallow.\" Eve said, miffed for some reason. She nodded. \"Whatever.\" She turned away but I caught her arm. \n\n\"You have to suck my cock.\" \n\n\"What? Are you crazy?\"\n\n\"If she wants to discuss this, you need to be able to tell her you know I fucked her, you could taste her when you went down on me. I have been gone a long time, remember. We love each other and bear a great deal of lust in our loins for each other.\"  \n\nEve stared at me. She shook her head and knelt on the floor. She unbuckled my belt and pulled pants and underwear down my legs. She stared at the crusted, stained and flaccid mess that was my cock. \"At least let me wash . . .\"\n\n\"No. You have to taste her on me. I was deep inside her pussy when I came. I fucked her in the parking garage, sprawled over the trunk, stark naked. She came and came. You need to suck me off. This must be authentic or she will know.\" \n\n\"No. I'll suck you but you come in my mouth and I bite it off.\" \n\nI shrugged. I had not planned for this but it seemed like a good thing so, no come no loss. Eve stared at my cock as it began to twitch to life. She did not move and when the cock straightened and touched her lips, she grimaced and opened her mouth. Her tongue began to lick the head and I hardened, pleased with the new sensation of her mouth on my cock. She closed her eyes and began to suck on the head. I stood perfectly still. Her robe gaped and I could look down on her little breasts, standing up on her lean chest with hard, erect nipples. She enveloped more of my cock, sliding her lips up and down on the shaft, then pausing to suck on the end and lick it with her very expressive tongue. She bobbed her head and my cock disappeared into her mouth. She inhaled and for a brief moment, I was lodged all the way into her throat. She had talent too. \n\nThen she pulled free and stood up. \"There. I tasted her on you.\" \n\n\"You recognize her taste then?\" \n\n\"Of course I do. I was lapping up her juice yesterday. I know you had your cock in her.\" \n\n\"When she asks about it, what are you going to say?\" \n\nEve stopped and considered for a moment. \"I'll think about it. Not sure whether to be mad or tell her I came when she does while you are, are, a, doing her.\" Her equilibrium seemed to have returned. I wondered if the blow job helped. \n\nI used guest utensils and soon we were both in bed. We went through the charade of getting ready for bed on the theory that the devious little bitch could be listening. I lay awake for half an hour before rising and slinking down to Shallow's room. I opened the door and found some light was coming from outside so I could see the bed and her form under the sheet, the rest of the covers thrown back. I moved carefully over to the bed. It occurred to me that Shallow may be wondering which of us was stealing into her room in the middle of the night but I knew which she hoped it would be. Me. \n\n\"You awake?\" I whispered. \n\n\"Yes.\" She returned. \"What are you doing here?\" \n\n\"I want you again.\" I said. \"In bed, like normal people.\" \n\nShe laughed a quiet giggle. \"Neither of us is normal.\" She said. \n\nI striped out of the pajamas and pulled back the sheet. Her arms found me and pulled me into her embrace. Her body was naked, alive and writhing beneath me as I found her lips with mine. With one hand squeezing a breast and braced on the other one, I kissed her. Paula moaned up into my mouth. I reached over and turned on the light. She looked shocked. \n\n\"How is she ever going to see if the light isn't on?\"\n\n\"What do you mean?\" \n\n\"She jumped me before I could get to the shower and she tasted you on my cock. Of course she knew it was you, had to be since her tongue was lashing your clit earlier today right?\" \n\n\"Yesterday. She ate me yesterday. I ate her today. Did you fuck her?\"\n\n\"She was pissed, told me to sleep downstairs. Not likely. Not with you in here.\" \n\nThere was a mirror against the far wall and I could see the bedroom door in it. I saw the motion when it opened. \n\n\"Was she angry?\"\n\nI moved between Paula's legs. They opened and made room for my body, her knees caressed my sides and hips as she opened for me. My cock was hard. Her hands found me and directed me to her entrance. I pushed my cock into her body once more and she arched her body, taking my cock all the way into her molten core in one wet motion. \n\n\"God but I love cock!\" Paula hissed. \n\nI lifted my head and glanced at the mirror. The door was open and some vague light, moonlight or streetlights or something outlined Eve as she leaned on the door jamb. Paula lifted her legs and encased me in them, pulling my cock back into her body. She began a steady hunching rhythm causing a shiver to run up my spine. I settled down on my elbows and began to bang her cunt with my cock, stroke on stroke, even, regular and constant, varying the intensity a bit but keeping the pace. She began to meet me with her hips, thrusting her pussy up at me, taking me into her cunt. I lowered my mouth to her lips and kissed her, lightly then meeting her open mouth with my own, tongue on tongue, lips on lips, both blowing for breath while our hearts hammered together as we fucked. I moved my lips to her ear and said very softly, \"She is here. At the door. She is watching me fuck you.\"\n\nPaula grunted and then her whole body convulsed and her legs seized about me like a vice while her cunt hammered at me. I tried to keep the rhythm but she held me too tightly so I only managed little motions against her arched, clinched body. \"Oh god, oh god, oh god!\" She moaned. \"I am coming againnnnnn. Fuck me, John. Oh John, fuck me!\" She was speaking with a louder voice now. I glanced at the mirror and saw Eve, nude by the door. Her hands were working on her body; one between her legs while the other fluttered from breast to breast. Her back was to the door jamb and her feet were both planted firmly in the room as she masturbated to the sound and sight of us fucking. \n\n\"Look, she has her eyes closed.\" I whispered. \n\nPaula rose up, peering over my shoulder while I lay flatter on her, still fucking her. I felt her see what she wanted to see as a shiver coursing through her flesh. Her pussy began to clinch and twist at my cock, her legs dropped down and her ass began to piston up and down. \"Oh fuck me, John. Please fuck me harder. I can come again, if you fuck me hard!\" She muttered and I responded with harder, longer and deeper strokes. Paula moaned and then she was coming again, I felt her craning her neck over my back to watch Eve. We both heard the grunt from behind me, a hiss of the intake of breath and the exhale of a controlled orgasm as it seeped between Eve's clinched teeth. I glanced at the mirror and could easily make out in the light, Eve's head thrown back and her hand fluttering at her pussy while she pinched her nipples very, very hard. Her face was wrenched and she was biting her lower lip. While we watched, she came again. \n\nPaula seemed to be hooked to her. As Eve shuddered through another orgasm, Paula did as well. When the little lightning passed, she lay still and I rested, settling my cock deep into her body while she panted. \"Want to get on top?\" I asked, following a hunch. \n\n\"God, yes!\" Paula said. I moved off to the side such that I could watch the mirror. I wondered if Eve would join us, half hoping, half fearing because I was not sure I wanted to share her with Shallow. She was gone, at least out of the light. I saw the door move and Eve's hand appeared as she pushed it further open. Then I saw her head, she had crotched and was staring right up the length of our bodies. \n\nPaula got to her knees and I scooted to the middle of the bed then lay down on my back. For a moment I thought she would mount me reverse cowboy so she could look Eve in the eyes as she fucked me. But she did not, facing me instead, her face a mask of concentration as she located her hole with my cock and slide onto me, like a donut on a stick. She slide completely full of me, grinding her body against mine once I was completely rooted inside of her. Out pubic bones kissed. She placed her hands on my chest and began to fuck me, shifting her hips in short, compact strokes. I reached for her bobbing breasts and palmed them, massaging them so that she had to lean into me as she fucked. I arched my back, raising under her while I pulled her down onto my body. Shallow screamed, a full-voiced scream and she flopped forward onto my chest. For a moment she lay still and the rose up again, struggling to remain up right. I hunched my cock up into her again. \n\n\"Oh fuck, that feels great. God, don't stop!\" Paula said through gritted teeth. I began to pop my hips up at her as she rode me. Her pace quickened and she was fucking me and rubbing her tits with both hands, twisting them together and then pinching the nipples. I steadied her with my hands on her hips, pulling her down hard with each stroke. Then suddenly she screamed again and fell all the way backwards, bending my cock forward to a very uncomfortable angle. I grasped her hips and pulled her forward a little to release the pressure. She shuddered, quivering and quaking, gibberish tumbled from her lips and she came again. \n\nAfter she calmed she said, \"help me. Help me up.\" Her hands found mine and I pulled her back up right. She just sat on my cock, panting and looking about her with passion glazed eyes. I arched my back, shoving my cock deeply into her cunt. Paula grunted and hunched her body at me. She began to ride me again. It was then that I saw the shadow appear behind Paula. Eve was standing right at the foot of the bed. I could clearly see her. Her eyes were shining, watching Paula ride me. Paula leaned over me, grasping me by the shoulders \n\n\"Grab my ass. My ass. Make me come. I can come again!\" Paula shrieked, no longer aware of her conditions or surroundings. I placed my hands at her waist and then slid down to her little apple ass and jerked her body down at the same time my hips surged up, driving my cock into her. Again, she shrieked. Her whole body shook and I repeated the motion. She gibbered and cried, begging for the cock to go deeper. \"Deeper, harder! Fuck me deeper. Grab my ass and fuck me harder.\" Paula's voice was raw with strain, ululating with passion. I pulled her down onto my cock again, setting up a violent rhythm, pulling her hard down and then slowly withdrawing, settling back onto the bed before jerking our bodies together again with great force. Each time Paula would grunt or moan or shout, 'fuck!' and grind her pussy down onto my dick. I found a rhythm and stroke I could sustain and I did, striking upwards into Paula's body over and over again. She began to chant.",
        "\"Oh fuck me. Oh fuck me. Oh fuck. Oh fuck. Oh, oh, oh, ohhhhhhhhhhhhh! Fuck meeeeeee!\" She screamed as she came once more, her whole body thrusting down, grinding and twisting on the prong of my cock that was jammed deeply into her quivering, vibrating body. \"Coming, coming, coming.\" She chanted, the orgasm inflecting the words as they tumbled out of her mouth. \n\nI looked at Eve and she was standing, stooped with a hand on the bed and the other between her bare legs. Paula continued to ride me, babbling about coming and fucking and begging for me to grab her ass, over and over again, a mantra of orgasmic ecstasy in which I had not yet shared. Then finally, Paula slowed, her body still rocking. \"Tired,\" she said and rolled off me, onto her back. Eve straightened but did not move away. I sat up and turned over onto Paula's nearly inert body. Her eyes were open, staring past me at Eve. \n\n\"Fuck me John! Come in me. I want you cock in me and I want you to come. Oh god, come in me! Fill me up!\" She said in a slurred voice. \n\nI positioned myself between her legs, found her gaping opening with the head of my cock and rammed it into her. I glimpsed in the distance my orgasm, fast approaching. \n\nShallow began to speak. \"I am fucking your husband, Evie. He fucks me so good! I love his cock and he cannot leave me alone. I love his cum oozing out of my cunt. I love fucking your husband, Evie.\" Paula had set up a commentary directed at Eve who was leaning over us, one leg on the bed and a hand twitching at her pussy, thrumming her throbbing clit while before her, my ass rose and fell, driving my cock over and over into the supine body below. I rose up on my arms and began to pound Paula harder and harder. Then it happened. Eve leaned past me and kissed Paula on the lips. Paula immediately grabbed her by the head and neck and did not let go, grunting with each of my downward strokes, a flowing keening issuing from deep in her throat. The keening swelled and I was hammering her as hard and fast as I could, I wanted to touch Eve but did not have a hand to spare. Eve had a hand between her legs and her hips were shimmying then she succeeded in pulling away from Paula, standing and staggering back as I fell onto Paula's body, orgasm washing over me in an enveloping haze. Paula threw her hands wide and jerked her hips at me three or four times and the keening turned into a scream as she came the final time. Once she went silent, she did not move, even after my cock slipped out of her. \n\nI made ready to get off her and she roused and kissed me. \"Thank you, John!\" she said. \n\nI turned and looked to see if Eve was still there. She was. She stared at me. I looked back to Paula. \"Why do they call you shallow?\" I asked. \n\n\"Because I am. All I want is cock and pussy. I live for it. But I can get it so much, I have to set obstacles to make it fun, interesting. You have been all I needed and more. Thank you.\" She kissed me once more and I got up, picked up the pajamas and trudged back to the bedroom. Eve had scampered ahead of me and was sitting up in bed, nude, when I arrived. She said nothing. I showered quickly and came to bed, equally nude. I lay down on my back and I think was asleep by the time she leaned over me and kissed me on the lips. I mumbled something but conked out and I remember nothing more. \n\nBy the time I woke the next morning, Shallow was gone. Eve was sitting in the kitchen drinking a cup of coffee. Though I liked the smell I rarely drank it. I studied her and saw the haunted look in her eyes. She glanced at me, giving me a glare at first. Then she smiled a wan smile. \"Thank you for helping me.\" She said softly. \n\n\"You owe me.\" I muttered. \n\nEve stared at me, her blond hair a tangle and her eyes clear. She nodded but looked away. She sipped from the steaming coffee. \n\nI was dismissed. But I would not be forgotten. I dressed and left. I had a favor coming and I would surely collect. This fucking investment would take some time to pay off but it would pay off. Would it ever!"
    ],
    "authorname": "Contrasting",
    "tags": [
        "watching sex",
        "voyeur",
        "hot wife"
    ],
    "category": "Loving Wives",
    "url": "https://www.literotica.com/s/a-fucking-investment-ch-07"
}