{
    "title": "Three Strikes And A Home Run",
    "pages": [
        "I walked out of the courthouse a free man once more. My heart was heavy but my anger was subsiding. To my surprise I hadn't gotten screwed too badly this time. I headed for the public parking lot and my trusty old F150. It was a forty mile drive home and I really needed to get on the road. My children would be home from school soon and I needed to be there for them. I had a neighbor woman who watched them when I was busy but with their mother gone I felt I should spend as much time with them as I could.\n\nI came opposite to the door for a little hole in the wall bar just down from the police station and for some reason I entered. The noise level dropped several decibels as the patrons turned to look at me. I knew I didn't belong. Every person I could see inside wore a Law Enforcement uniform or a badge somewhere on their person. Of course all were armed as well. I stood for a moment to let my eyes get more used to the darkness after the bright August mid afternoon sunlight. I almost sighed out loud when I felt the ice cold air surround me. The thermometer on the corner bank showed it was 108 F on the courthouse square. There had not been a breath of wind. My shirt was wet with sweat but only part of it had come up during my walk from the courtroom. The courtroom had been too hot and I had been sweating from nervousness as well. I was sure my body odor was way too noticeable.\n\nI moved to the bar through smoke so thick you could cut it with a knife. Even in this day of health conscious people the clientele smoked like chimneys. It was a tension reliever as much as anything for them and they didn't seem to care if it reduced their capability to run after perps. I glanced once more around the room and took an unused seat at the bar. The bartender looked at me for a moment then she wandered up to me. She stood looking at me with a raised eyebrow and spoke not a word. She had let me know by her silence I was not welcome there. I leaned on the bar and said, \"Dos Equis Lager. No glass.\"\n\nI watched the bartender turn and saunter to the coolers in the middle of the bar. She rummaged around for a moment and pulled the bottle from the back. She popped the top and walked back to me. The bottle thumped loudly when she placed it before me on the bar. \"That'll be $4.75.\"\n\nI took a deep pull on the bottle and sat it back down carefully. Damn, that was the coldest beer I had tasted in a week. Of course Leo's claim to fame was their promise of the coldest beer in the county. They kept the cooler set at 30 degrees F. I reached into my pocket and pulled my wallet out. I found a five and dropped it on the bar in front of the tender.\n\nOnce again nothing was said as she picked up the bill and walked toward the cash register. I watched her ass wobble inside her faded jeans. When she turned away her breasts wobbled inside the loose shirt she wore. It was plain to see her D's were not restrained by any damn bra. As she moved away almost waddling her ass cheeks bounced around in her pants like two raccoons in a burlap sack. Cora had been tending bar at Leo's for as long as I had known of the place. When her husband Leo died she became the owner and only full time employee.\n\nWithout a word my twenty five cents in change was slapped onto the bar in front of me. She turned once more and waddled away. By now I had already downed almost two thirds of my Dos Equis. The bartender was studiously ignoring me. I wondered if I would be allowed another beer if I asked for it. I watched the other patrons in the back bar mirror as they resumed their interrupted conversations. The noise level increased once more.\n\nI had maybe one or two more swallows of beer left when a group at one of the tables decided to leave. Two of the patrons stared at me when they walked past on the way to the door. The third officer, a plain clothes officer stopped beside me. \"It's been a long time Dean. Why did you come back,\" he asked.\n\nI looked up at the big bastard and wondered if I could take him down again. After all these years I still wanted to try. I was in better shape than I had been years before and he looked much softer. I thought I could take him but I really didn't want to try. The last time had not ended well for either of us. I let myself relax and the tension drain from my body. \"Stupid I guess Sean. Just got out of court and decided to get a brew before I headed home. No law against that is there? I just had my third strike and got rid of another cheating skank. I needed a brew before I headed on back home.\" I laughed then continued, \"But you probably know all about that. I'm sure you or someone you know has been sampling her cheating ass too.\n\nSean smirked at me and said, \"No, I suppose legally you can drink anywhere you're man enough to but you make a lot of people nervous. Why don't you find somewhere else to drink? Somewhere you don't bother the other customers and you'll be more welcome. Hell none of us want a loser like you in here. Makes us look bad to be seen with a loser that can't satisfy his women and keep them from cheating on him.\"\n\nI laughed and said, \"Oh, I will; hell, I have. I know better than to have a drink in here with my old friends. What are some of them afraid I'll be gunning for them still? Or did some of them fuck Paula too? If they did tell them I don't give a shit. I learned my lesson when you fucked Terri. You still with the cheating skank?\"\n\nSean tensed and leaned toward me. I knew he was still married to my ex and I also knew things were not all roses in their household. They were both screwing around and had separated several times and got back together. I was surprised their marriage had lasted the seven years it had. I had only been married to the skank eighteen months before she cheated on me and I threw her to the curb. I wondered why Sean didn't do the same thing. I guess some guys just don't give a damn about things like that. \n\nWhen I found out Sean had been fucking my first wife I took matters into my own hands. Several nights when I was on duty I drove out of my patrol area off and on until I finally saw what I expected. Sean's car was parked in the street near my home. I pulled into my driveway and walked into my home. Sean and Terri were in bed together cooing and cuddling after a session of loving. All that saved me from jail that time was the video cameras I had secreted to cover the bedroom and living area of the house. I slammed the door back as I walked into the bedroom and it bounced off the door stop. That startled the drowsy lovers into frantic action. I walked into the bedroom and stood at the foot of the bed staring at my ex friend and soon to be ex wife. \n\nTerri screamed at the noise and seeing me glaring at her. She cowered back against the bed headboard and pulled the sheet up over her to her chin. I could see the fear in her face. Sean jumped from the bed and started toward me. I had known him long enough to know what buttons to push verbally. As soon as he stood I began verbally attacking him. I told him to get his ass out of my house. I also told him I was going to his home and tell his wife what I had caught him doing. I had my cell phone in my hand taking pictures as we confronted each other just in case the video camera wasn't operating for some reason.\n\nWith an oath Sean slammed into me and knocked the cell phone from my hands. He pulled his hand back to hit me once more when I tore into him. I kicked him in the balls then slammed my knee up in his face as he bent forward. I pushed his head down into my knee as it came up. He fell to the floor out cold. When I walked past him I kicked him once more for good measure. I'll let you guess where I kicked him.\n\nI told Terri to be out of the house before I got off duty. I picked up my phone and walked from the room, out of the house and back to my cruiser. I had the cameras I had set up in my home feeding into a computer in my locked office so didn't worry too much about the video I hoped to have of the little tryst. I went straight to Sean's home. It was nearly three a.m. when I rang the doorbell at the Michaels residence. A very sleepy looking wife came to the door. When she saw me standing in the door in uniform she screamed and said, \"Oh, Noooo, please not Sean!\"\n\n\"Yeah, Sean but not the way you are afraid of Mrs. Michaels. I just came from my home where I found him in bed with my wife. I have pictures if you want them.\"\n\n\"Nooooo. That can't be. He's supposed to be at the station tonight. He's Sergeant of the watch.\"\n\n\"No, I'm afraid you've been misled Mrs. Michaels. He was off duty today. Jackson is Sergeant of the Watch. Now, do you want me to send you the pictures? If you do give me your e-mail address and I'll get them to you in a day or two.\"\n\n\"No. I don't believe you. Sean wouldn't do that to me.\"\n\n\"Yeah, he would. Here look.\" I showed her some of the pictures on my phone and she collapsed on the floor crying. I felt bad for her but good about bringing more pain to good ole Sean. I turned away from the crying woman, smiled to myself and walked back to my cruiser to resume my patrol.\n\nAbout thirty minutes after I left the Michaels home I was called back to the station. I was removed from duty and placed on suspension without pay for leaving my patrol area and for attacking an officer in the performance of his duty. Get this, Michaels and Terri had told the Lieutenant that she had called him for help because she thought there was an intruder in our home. I had supposedly been coming home for a little loving when I saw Sean in the house and went berserk accusing them of cheating on me and attacked him!\n\nOf course I used the video I took from my house to defend myself of the charges made against me for attacking Sean. Those pictures saved me from being incarcerated for attacking Sean. They also cost him a reduction back to the ranks and suspension from the force for a short time. No, Sean had reason to hate me in his eyes even though I felt totally justified in what I had done to him.\n\nWell, that marriage went into the toilet and so did my job. I was fired for my transgressions and taken to the cleaners by dear sweet Terri. I lost the house and half of our savings. I was ordered to pay support to her but thankfully that ended in less than a year when she married Sean after his divorce was final. Sean hated me with a white heat. I could see his fists clenching with his desire to strike me. I almost wanted him to but I hoped he wouldn't.\n\nI glared at Sean and waited. It was his move. Finally he smirked at me and said, \"Yeah Terri and I are still married asshole. No thanks to you. I know you're the one who keeps sending us the incriminating pictures. Why don't you get a life and leave us alone?\" He laughed and continued, \"Or not. Hell you may be doing me a favor. She's heard so often that I'm a cheating bastard and seen so many pictures you sent that now I could cheat on her and she wouldn't believe it. You've caused some problems but I gotta admit you have helped me too.\"\n\nI almost told him I wasn't the main person taking the pictures and sending them to him and Terri. I had been taking some of Sean one night and another officer had seen me. He and some of his brother officers liked what I had done and began to do it also. There were a lot of officers that hated Sean's guts for one thing or another. Some of them hated him for the same reason I did. They were making his and Terri's life pretty miserable. I also didn't tell him I had only sent one set of photos. I wasn't following him or her and never had been. The one picture I had sent I had just accidently seen him with another woman in a bar shortly after my divorce from Terri. I really couldn't care less now one way or another.\n\nSean turned and walked jauntily out the door. I squinted my eyes when the sunlight burst through the door as he walked out. One of my last remaining friends in law enforcement came in as Sean left. When she saw me sitting at the bar she smiled and began walking toward me. Jackie and I had been in the police academy together. She had gone into the Sheriff's department when I went into the city police force. She glided across the floor and took the stool beside me.\n\nOur taciturn bartender looked up at Jackie and raised her eyebrows. \"Usual,\" she asked.\n\nJackie nodded her head and pointed at my Dos Equis bottle then held up two fingers. In moments a beer was sat in front of each of us. Jackie handed a ten to our host and waved her away.\n\nWe each took several sips of our beer then Jackie looked at me in the bar mirror. \"I was in the courthouse earlier. I saw you in family court. Heard about Paula. Damn Dean you sure can't pick them can you? What is it now three?\"\n\nI sighed and nodded my head yes then said, \"Yeah you know it is. Sean got the ball rolling with Terri. Hell that one only took about eighteen months. Then there was the kid's mom Suzie. At least she lasted almost five years before I caught her with the damn football coach at her school. Patty was really a surprise though. Shit, we were only married nine months when I began to suspect she was stepping out on me. Guess I should have known that would happen. Damn, I was an officer and knew how\"\n\nI looked at Jackie and saw her face tighten. I hurriedly continued, \"Sorry Jackie. I shouldn't have gone there. Hell, I didn't mean all of the women on the force were like that I just guess I'm bitter. She was a damn dispatcher for Christ's sake. Oh, hell, I don't know what I mean. Crap.\"\n\nJackie smiled and placed her dainty little hand on my forearm. \"I know Dean. Hell, it's a job hazard almost. There is so much tension and testosterone in the air that we are all tempted. Some of us just don't have the willpower to ignore the temptation and go home for our release.\"\n\n\"Yeah, whatever. I notice you and Ed haven't succumbed to the temptation though. If you guys and some of the others can do it why couldn't Patty or Sean for that matter?\"\n\n\"Hell, you know from your time on the force Dean. Some people are just weak. Some are serial womanizers like Sean. Now cheer up drink your beer and get home to those kids.\" She shook her head and said, \"That's one I'll never be able to figure out. I still can't believe Suzie just took off for an overseas job and left those darling kids with you. How can a mother, hell how can any parent just take off and leave their children like that?\"\n\n\"Don't know Jackie but I'm damn glad she did. I really thought when the court refused to let her take them out of the country she would stay here or try to take them anyway. I love having them home with me. Little Howard finished kindergarten this year and Stacy was in first grade. Everything is still new and exciting for them and they have such a zest for life. I couldn't stand it if she had stayed here and kept primary custody of them. Sometimes it's hard working and arranging for them to be cared for properly but I wouldn't do it any differently for love or money.\"\n\nJackie and I both finished our beer at the same time. We sat a moment just enjoying each other's company. Finally with a sigh Jackie stood to leave and said, \"Guess I should go. I still have to fix supper for Ed, get some laundry done then get to bed in time to be fresh as a daisy for the morning shift.\" I stood and followed her out of the dim bar into the glaring light and heat of another August afternoon in southwest Missouri. We had both parked in the same lot so we visited as we walked to our vehicles.\n\nOn the way home I thought about my last failure in the romance department. At least this time I had been smart enough to get a prenuptial agreement from Patty. We each walked away from the marriage with what we had brought into it and split the small amount we had accumulated in the little over a year it had lasted. I had been operating the family farm when my second marriage had failed but did not own it yet. Because of that I had only been required to divide bank accounts with Suzie. She had been very angry about that. For some reason she thought my mother had signed the farm over to me when Dad had died. Actually all she had done was turn over the operation to me. I suppose since Mom referred to it as my farm Suzie thought that meant I owned the land, equipment and animals. Now I wondered if that was why she had married me?\n\nMom died shortly after Crystal and I divorced and I became the owner of the farm then. It wasn't a very large farm—only about two sections—but I made a pretty good living on it. In truth I made more profit on the farm than I would be making as a patrolman if I hadn't lost my job. To top that off I enjoyed the work and freedom much more on the farm. Some days if I didn't feel like working I could just say screw it and goof off. Life was hard but I loved it on the farm.\n\nI got home about 45 minutes after I left Joplin. My two kids and their sitter were in the back yard. The kids were playing in their little wading pool while Tammy sat at the picnic table reading and watching them. Stacy jumped from the pool and came running toward me when she saw me. Howard followed behind slowly. I gave both the kids a hug and walked to the kitchen for another beer.\n\nI came out and sat at the table across from Tammy. \"Hey Dean. Is it all over now?\"\n\n\"Yeah, I'm outta the ballgame now Tam. I just had strike three in the bottom of the ninth inning.\" I sat looking out over the brown dry grass in the yard. I could barely see the small stream separating my yard from the south field through the trees that lined the stream bank. I let my mind wander to a more pressing problem than the end of my third marriage. I had to start feeding my cattle hay almost three weeks before and I was worried I would not have enough to get through the winter if it didn't rain soon.\n\nThis was the worst drought in 65 years according to news reports. Cornfields that normally yielded between 150 and 200 bushels per acre had already been chopped for silage because the grain was so poor it wasn't worth letting it mature to combine. Other crops were doing just as badly because of the lack of water. Many farmers were already selling cattle they would not normally sell because they could not feed them. It was expected to get much worse before it got better.\n\nI could survive thanks to my crop insurance but things would be tight. At least I was able to irrigate some of my grassland by pumping water from the stream that ran through my farm. I looked over at Tammy and saw her watching me. I tried to smile then said, \"Well, guess I can watch the kids for the rest of the day Tam. Why don't you get on home? I don't think I'll need ya tomorrow but I'll call if I do.\"\n\nThat fall Stacy was in second grade and Howard the first grade. Shortly after school started Tammy came to see me. \"Dean I'm not going to be able to watch the kids after school much this year I'm afraid. Things just aren't getting any better for Jack and me. Jack's already working part time at the feed mill but we're going to lose the farm if I can't find a full time job in town to help out. I'm sorry I can't stay on with you. I just need more money to get us past this damn drought. I'll watch them until I get a job or until you find someone else but you'd better plan on finding someone real soon. If you still want me to watch the kids some and we can fit it in with my work schedule I can still do that though.\"\n\n\"Crap Tam. I'm sorry to hear that. I don't know what I can do but if you and Jack need anything and I can help let me know. I sure hate to let you go. The kids love you so much. Do you know anyone that can help?\"\n\n\"No not right off hand. I'll keep my eye out though. Sorry.\"\n\nIn early October Tammy stayed to talk to me one evening after I got back in from the field. \"Dean, have you found a sitter yet?\"\n\n\"No, I did find one old woman in town that would be willing to watch them part time but I can't find anyone who wants to come out here and watch the kids in our house. Most of them aren't willing to stay late the nights I am still working in the fields or they want a guaranteed full time job. Why? Did you finally find work?\"",
        "\"Well sort of. I got hired at Wal-Mart for the Christmas season. They said I might get to stay on full time after if things work out. I'm supposed to start next week. Sorry.\"\n\nBetween Tammy, the old woman in town and a couple of friend's wives I managed to take care of my child care needs through the holidays and until early March. I was having trouble juggling helpers though. Some of them wouldn't come to the farm to sit with the kids. Some of them didn't have transportation to pick them up or bring them home so I had to stop what I was doing and go deliver the kids to the sitter in the afternoon. Then I would have to go pick them up after I was finished working. Sometimes that was really late. Sometimes I had to stop working before I was ready to do so because none of the sitters was willing to have the kids at their home late in the evening.\n\nIn early March I was working in the shop repairing some machinery when I heard a car drive up. I walked to where I could see the driveway and saw a sheriff's car in the drive. I looked toward the house and saw Jackie walking back toward her car. I smiled and yelled, \"Hi Jackie. What brings you out here into the boonies? Did they finally find the body where I left it?\"\n\n\"NOT funny Dean. Dean I've got a little problem and I thought you might be able to help me solve it. Have you found someone to watch your kids yet?\"\n\n\"Well sort of. I have half a dozen people who watch them some of the time. I have to miss a lot of work hauling them around and sometimes I have to stop working before I'm ready so I can pick them up at night. I still haven't found anyone who can be on call all the time and watch them here at the house. Why?\"\n\nJackie looked embarrassed and said, \"Well that dumb ass sister of mine is just about as poor a picker of husbands as you are of wives. She caught her husband cheating on her two three weeks ago and kicked him out. She filed for divorce and needs work. This is the second husband she's caught cheating on her. She had been a stay at home mom and you know how the job market is right now. She thinks she's going to lose the house too. They've been renting ya know. Anyway Jack and I told her they could stay with us for a while but she still needs a job. Her asshole hasn't got a very good job as it is and he is being a butthead about sending her any money so far. How about it?\"\n\nI sort of remembered Jackie's sister. Jackie had been a couple years behind me in school and Crystal was a couple years behind her. \"Jackie that would be a lot of driving for her. What is it about twenty five miles from your place to mine? \"\n\n\"Yeah but she really needs the work Dean.\"\n\n\"Well I don't know. Some days I wouldn't need her but three hours or so. Some days I would need her some in the morning and later in the evening. Would she want to stay here all day and if she did would she expect to be paid for the time she was waiting on the kids? After tax and gasoline she wouldn't make more than five dollars or so on the short days. Are you sure she really wants to do the work for that?\"\n\n\"I don't know Dean but she needs something. And other days she'll probable get twelve or fourteen hours when you're planting or harvesting so things will even out won't they?\"\n\n\"Yeah but I might not even need her some days also. Say, she has kids too doesn't she?\"\n\nJackie nodded her head yes.\n\n\"Well who's going to watch? Oh! She'll be bringing her kids down here with her won't she? Or are they in school yet? How will she handle that? Hell that would help her right there if they aren't in school wouldn't it? They could all eat here as part of the deal and she wouldn't have to worry about child care.\"\n\nJackie said the children weren't in school yet and I relaxed. This might really work out. I smiled and said, \"Tell ya what. Have her come visit with me and we'll see what happens.\"\n\nJackie and I visited for a few more minutes and she left. Said she needed to get back on patrol. Must be nice to be a Deputy Sheriff and just drive around the biggest part of the county with no worries.\n\nTwo days later just after I got the kids on the school bus a ratty old Mustang pulled into my drive. I was afraid I would have to give whoever it was driving it a gallon of oil before they could leave it was burning so much.\n\nI watched as a pretty but ran down, pale looking young woman climbed out of the old beat up car. Two young children were inside bouncing around trying to see out. I was once again in the shop. I walked toward the woman wiping grease off my hands as I went. She looked slightly familiar and I was pretty sure this would be Jackie's younger sister Crystal.\n\nI smiled as I got closer to the woman. She looked hesitant and a little frightened when I walked up. \"You must be Crystal unless I miss my guess. Jackie told me you would be coming to visit with me. I don't think I would have recognized you if I hadn't been expecting you to come out.\"\n\nCrystal gave me a tentative smile and nodded her head. \"Yeah. I hate to bother you like this Dean, uh, Mr. Thomas but I'm really desperate. My husband doesn't send me enough money to get the kids what they need sometimes and I just can't ask Jackie and her husband to furnish everything for us. I feel like such a worthless freeloader as it is.\"\n\n\"First things first Crystal. You had it right the first time. My name is Dean and whether you work for me or not that is what I want you to call me. Now, why don't you come on in and we'll see what we can work out.\"\n\nCrystal looked at me a moment then turned to the kids with a scared expression on her face. She walked to the door of her car and said, \"Now you two sit still and don't touch anything. I have to go talk to Mr. Thomas for a few minutes then we'll leave.\"\n\nI stopped walking toward the house and turned back to Crystal. \"Whoa there missy. I didn't mean for you to leave your babies out here in the heat. Bring them on in too. It isn't right to leave kids alone in a vehicle. They can't get into anything my kids haven't been into time after time ya know.\"\n\nCrystal looked up at me in surprise I thought. I got a weak smile from her then she turned and said, \"Ok you two. Get out of the car and come with me. Now I don't want you running around and causing trouble either you hear me?\"\n\nI watched as a little boy maybe four years old jumped down from the front seat. His mother tried to catch him under the arms and succeeded somewhat. He looked up at her disgustedly and said, \"I can do it myself mamma. You help Sissy.\"\n\nWhile Crystal was helping Sissy from the child seat in the middle of the small back seat the little fellow marched up to me and said, \"Hi Mister. I'm Timmie and I'm this many (he held up 4 fingers). I get to go to school next year.\n\n\"Timmie I told you to be good. Now don't bother Mr. Thomas. I looked up from where I was squatting in front of Timmie to see Crystal coming toward me with a little princess sitting on her hip. The little girl was chewing on her finger as she gave me the once over. \"Dean as he has already told you this is Tim, my son and this little angel is Celeste, my daughter but I'm afraid we call her Sissy most of the time.\"\n\n\"Hi Sissy,\" I said. \"If it's ok with your mother would you and your brother like some juice when we get into the kitchen?\" Sissy grinned at me and nodded her head before trying to hide it in her mother's shoulder.\n\nWhen I got my guests into the house I asked about drinks and seated us all at the kitchen table. I put a cookie jar in the center and gave everyone their drink and a napkin. Crystal and I talked about what I needed in a babysitter and what I could afford to pay. She agreed on $35 a day for watching my kids, no hourly limit if she and the kids could eat with us every day. She even agreed to do some of my housework and cooking the days she was here. She also agreed to stay around most days instead of driving back and forth. That would save her money on gasoline since many school days I only needed her in the mornings and evenings.\n\nI showed her around the house so she could see where things were. She agreed to begin working the next day. To my surprise Howard and Stacy took to her and her children right off. They had been somewhat unhappy with some of the women I had caring for them in town. I began working longer and longer hours with my spring planting. I had about a third of my tillable ground in winter wheat and the rest, about 600 acres I would split between corn and soy beans. I had sixty brood cows and 300 acres for them to graze on or set aside for hay for them. I also had a few chickens and hogs to round out my operation. Spring and fall were my busiest time of year.\n\nDuring the first week, to my surprise, Crystal completely cleaned my house. She had started in the kitchen, and then moved to the bathrooms and on to other rooms. I sat at the table the third day she was there and said, \"Crystal I feel bad about some of the things you are doing here. I hired you to watch the kids not to be a house cleaner. This place looks great but I don't want you to think you have to do this too.\"\n\nCrystal looked upset and said, \"I thought you said light cleaning could be part of my job too when I was here. I'm sorry if I upset you. I was just trying to help Dean. I'll stop if you want me to. I just hate to sit here all day reading and watching the kids play. OH!\" She pulled her hands to her mouth and her eyes got big. \"I'm sorry. I won't charge you for it. I know it would be a lot to pay for all the hours I'm not watching the kids and all. I just feel like I need to do more.\"\n\n\"NO, NO Crystal. That's not the problem. I just don't want you to make a habit of working yourself to death. Relax some. I appreciate all you've done and you do but you don't need to be running yourself to death all day every day.\"\n\nSeveral times over the next week I would walk into the house and find Crystal sitting watching her children play while she read. Every time I came into the house and she was resting Crystal would look guilty and begin working. Finally one day I got myself a beer and walked into the room where she was working and said, \"Crystal I need to talk to you for a few minutes. Would you please come into the kitchen with me?\"\n\nCrystal looked up from her dusting and said, \"I'm sorry Dean. I was just resting for a moment.\"\n\nI sighed and walked to Crystal. I pulled the dust rag from her hand. I led her to the couch and sat then pulled her down beside me. I turned to her and said, \"That is sort of what I want to talk to you about. Crystal have I ever said I was unhappy with what you do around here for us?\" Crystal bit her lip and shook her head no.\n\n\"Well Crystal if I'm not unhappy and I haven't complained to you about things and I haven't yelled at you for not doing something then why do you always jump up when I come in and begin working again? You make me feel like an ogre, like you're scared of me or something. I've told you and told you I don't expect you to work all the time and don't want you to do that.\"\n\n\"But Frank always said no house could be too clean and he got upset when he came in from working hard and I was resting. I\"\n\n\"Whoa there again Crystal. Do I look like Frank? Do you see me resting from time to time? Have I ever said or done anything that made you think I cared if you read a book or played with your kids? Dammit woman I hired you to watch my kids and told you that it was ok to just stay here during the day while you weren't working. You were the one who offered to do some cooking and light housework for me in addition to that.\" I smiled and continued, \"I would take it as a personal favor if you would just chill a little and relax around me. Ok?\"\n\nCrystal gave me a tentative smile and nodded her head yes. \"I'll try but I don't know if I can do that Dean.\"\n\nOver the next couple of days Crystal got better about jumping up and beginning to work when I came in. Sometimes if I stayed in the house for long she couldn't stand it and came to do something but she was better. One afternoon I had just begun working after a ten minute stop for lunch when my damn planter broke. A wheel bearing froze up and this of course stopped the wheel from turning correctly. I was screwed. I unhitched the tractor and tore off for the shop and my tools. Crystal was in the yard watching her kids play on the swing set when I came roaring into the lot. She watched as I dove off the tractor and headed for the house. I was already on the phone when she followed me into my office.\n\nCrystal stood listening while I explained my problem to the implement dealer. I was leafing through my planter manual while I talked. We got all the preliminaries out of the way and he checked to see if they had the necessary parts in stock so I could make the repairs. I told him I would be in as soon as I could. \n\nI hung up and was muttering to myself about the damn two hour drive there and back and the time I was going to lose on the repair. I felt and heard Crystal walk up behind me. She put her hand on my shoulder. I jumped at her touch and turned toward her. This was the first time I had been touched by a woman in almost three months. It surprised me and was strangely comforting at the same time. Crystal said, \"Dean I heard what you said to the implement dealer. I can drive into town and pick up the part for you if you want me to. That way you can begin tearing the damaged part out and maybe you can get back to work faster.\"\n\nI looked into Crystals eyes and saw the worry there. I also felt myself relaxing a little at the little reduction of pressure on my time. Hell, why not I thought. I can pay her for the trip and she can use my truck. It would save me at least two or three hours on the repair. I felt myself smiling and said, \"Sure, why not. Thank you Crystal. That would be a big help. I need you to take my truck though since this is farm business. When you get back could you bring it across the stream to where I'm working? When you get through the band of trees you will be able to see the machinery in the field from there.\"\n\nCrystal smiled and said, \"No problem Dean.\" She turned back to the kitchen door and said, \"Kids come on. We have to go to town for Mr. Thomas. Hurry now. We have to hurry and get a part for his planter so he can get back to work.\"\n\nMuch to my surprise Crystal and the kids had their child seats moved from her old rattle trap mustang to the rear seat of my Super Crew and were driving down my lane before I had my repair trailer hooked to the tractor. I was on my way back to the field to begin my repairs less than thirty minutes from breaking down.\n\nWhen I got to the field I began disassembling the planter for the repair. I found a weld that had broken and I rewelded it. I had some trouble getting the wheel and old bearing off. The race had gotten so hot it had partially welded itself to the shaft. I had only been done with the disassembly a few minutes when Crystal came driving into sight. I had heard her roaring through the stream and was worried because I had forgotten to ask her if she knew how to put the truck into 4 wheel drive. Many times you needed to do that because the rocks were slick and the bank steep coming out.\n\nWhen Crystal got to me she jumped out of the truck and reached into it for the parts. She turned toward me and smiled. She had a bag from the parts store in one hand and a large 44 oz insulated cup with ice tea in the other. I reached for the parts and she shook her head, \"Uh, UH,\" She said. You look like you need a drink right now. It won't take you too long for some tea then you can get back to work.\"\n\nI smiled and took the drink. I downed it in less than a minute then she handed me the bag of parts. I turned to work. I had been working for a couple minutes when I felt a presence beside me. I looked up and little Tim was squatting beside me watching. He didn't say a word. I smiled and returned to my task. I felt another shadow this time and looked up again. Crystal was standing behind Tim with Sissy on her hip watching me also.\n\nI worked on. My audience didn't say a word or move. Finally after almost two more hours I tightened the last bolt and stood. Crystal moved back and Tim stood to watch me. I was followed back and forth as I replaced the tools in my tool box on the repair trailer.\n\nI had told Crystal three times she didn't have to stay but she had. She had only returned to the house once and that was to pick up my kids when they got back from school. I looked at my audience and then turned to crystal. \"I'm going to take off down the field and see if it works ok. Would you mind waiting a minute for me to get back?\"\n\nShe nodded her head and I continued. \"If everything's ok can you take the trailer back to the shop if I hook it up for you?\"\n\n\"I suppose I can try but I wouldn't want to break it. I've never pulled a trailer before.\"\n\n\"It's pretty easy Crystal. Just park the truck in front of the shop and I'll put it away when I get back. Just go slowly when you go through the creek and it'll be ok.\"\n\nI worked through supper that night and kept on until almost midnight. I had finished planting my corn and took off for the house. Tomorrow I would begin preparing the field for the soy beans I would plant later.\n\nI pulled up to the house and almost all the lights were on in the kitchen and living room. I just pulled the tractor into the shed and left it hooked to the planter. I started the truck and pulled it in beside the tractor. I would unhook everything in the morning.\n\nI walked into the kitchen and saw Crystal standing by the stove. She was standing there in an old T-shirt. From the way she moved I didn't think there was anything but her under it either. She looked over her shoulder at me and smiled. \"Why don't you go clean up? I'll have your supper warmed up when you get back Dean.\"\n\n\"Crystal you didn't have to do this. I'm sorry I worked so late. I forgot you have to drive all the way back to Jackie's. Everything was going so well I just kept on pushing to get done.\"\n\nCrystal smiled and said, \"Don't worry about it. I could have come and got you if I needed to leave. I called Jackie and told her you were still in the field.\" She looked a little unsure of herself for a moment then continued, \"I told her if you didn't mind I would just sleep here on the couch tonight since it is so late? I really hate to wake the kids up and everything.\"\n\n\"Well I do mind Crystal. I was thoughtless and I don't want you sleeping on my couch tonight.\"\n\nI stopped when I saw the shocked look on Crystal's face. \"OH SHIT! Crystal I'm sorry. I didn't mean it like that. I just meant I was sorry I worked so late and I wanted you to sleep in my guest room instead of the couch. There's no reason for you to sleep on the couch when you can use the bed. Oh, I bet you put your kids in there didn't you?\"\n\nCrystal almost whispered, \"No. They all wanted to sleep with your two so I put Tim in bed with Howard and Sissy with Stacy. That's ok isn't it?\"\n\nI grinned and took a step toward Crystal then stopped. \"Yeah that's fine Crystal. I'm sorry I said what I did earlier. It's fine if you stay here tonight and any other nights I get a wild hair and work too late again.\" I turned and walked to my Master Bath to clean up.\n\nWhen I came back to the kitchen I found Crystal dishing up one of my favorite meals. She had made a meatloaf, mashed potatoes, green beans and whole kernel corn. It looked wonderful and tasted even better. Of course a two day old road kill skunk would have been good about then. I hadn't eaten anything since a sandwich at lunch.\n\nThe weeks flew past. My work was going better than it had in years. Crystal became almost indispensable. She seemed to almost take over the house and yard. She even began caring for the chickens and doing some of the work around the hog pen. I lost track of how many trips she made into town for me to get parts or seed or something. She was more help than any of my wives had been and two of them had grown up on a farm. Many nights I worked late she and the kids would sleep over. After they began staying so often I suggested she leave some of their clothes at the house so they would have them if they needed them.",
        "On the fourth of July I had declared a holiday for the family. I was caught up enough I decided not to work and invited Crystal and her kids, Jackie and her husband Edward to my home for a large meal and swimming in the stream. After the meal of BBQ Brisket, fried chicken and all the trimmings I watched the happy faces for a while as the women cleaned up. I had tried to help and was roughly run off. The two sisters were laughing and giggling as they worked. Ed was buried under a pile of kids.\n\nI wandered off and sat beside the stream. I watched the slow flow of water through the swimming hole at the Edge of the yard. I listened to the kids laughing as they played with Ed and the occasional laugh from the women. I could hear an occasional explosion as a neighbor set off a firework.\n\nI felt my stomach clench as my mind wandered back over my past life. What I was hearing this hot July day was what I had dreamed of throughout my three previous marriages. I had two wonderful kids and some friends but I didn't have anyone to share it with. I was alone still and was getting too old to have much hope of finding that nugget of gold other men had. Terri, the girl I had grown up with, the tomboy from the next farm over had shit on me almost from the first. We hadn't much more than moved to the big city when she took on city ways and began going out with female friends then ended up cheating on me with one of the officers I worked with.\n\nThen came beautiful bubbly kind Suzie, a teacher from the local school I met at the café in town. God how I had loved that woman. She was citified but loved it here in the country—at least until she found out what a farmer's wife had to put up with. The late nights, dust and dirt, the greasy clothes and foregoing nights in town on the weekend finally got to her. From the first, in spite of her stated love for children she resented being tied down with my work and our kids.\n\nSuzie began to spend more time with her school duties and then volunteered to be chaperone on the cheerleader's bus on away games. Then I found out she began driving herself to the games and afterward she and the head coach would stay in town and party for a while before coming home.\n\nWhen I had caught on they were cheating on me and kicked her to the curb she laughed and said, \"Well at least now I can get back to the good life. I did love you at one time Dean but no real woman can take this kind of life year in and year out. I'm so sorry but I just have to have more than sitting on the patio at night too damn tired to even go to bed.\n\nShe was awarded primary custody of the children in the divorce and tried to get some of the value of the farm. She was royally pissed when she found out mom still owned the farm and everything on it. I was being paid a wage for working the farm. To Suzie's horror she found it was a little less than hers so there wouldn't even be any support coming to her. I did get hit pretty hard with child support however.\n\nLess than a year after we divorced I found out that Suzie planned to take the children to Japan. She and her new lover had obtained jobs with the Department of Defense School system to teach there. I refused to allow her to take the children out of the country. We ended up in court again but I won on that one. She was forbidden to take the children out of the state. To my surprise she then gave me full custody. When I told her how surprised I was she said, \"What you did to me and the kids isn't right Dean. A child should be with its mother but I can't pass up this opportunity to see some of the world because you are a selfish prig. You have the children now. You can see how hard it is to have a life and a job and take care of them for a while.\" She smiled at me and hugged the kids one more time then she and her new asshole left.\n\nPatty, my third wife was not so much of a surprise when she cheated on me. I should never have married her but I have to admit I was lonesome and desperate. We had hit it off pretty well and I ignored her flirting and touching with her fellow officers at the Sheriff's Department. I had met her at Jackie's and we hit it off enough we dated. We had a lot in common too. I had been a police officer for two years before I got canned when my first marriage broke up and she worked in dispatching for the sheriff. We knew some of the same people and she had grown up on a large farm in Iowa. I remembered how we joked around when I worked in law enforcement. I ignored her actions until I went to see her one day. I found her in her car with another Deputy. They were on their lunch break and she was eating his hot dog. Damn, another brush with the law for cold cocking a law dog.\n\nAt least he hadn't pressed charges and I didn't have a job to lose that time.\n\nI continued to sit and stare across my fields while I slumped in dejection. Damn dust and bright lights had my eyes watering again. I hated that. I felt a presence nearby and turned my head. Crystal was standing about ten feet behind me. She saw my face and frowned. She walked up and plopped down on the ground beside me where she could look in my face.\n\n\"What's wrong Dean?\" She looked at me a moment and leaned toward me. Before I knew what she was doing I felt her fingers wipe the water off my face.\n\n\"Nothing. Just setting here listening to the happy sounds and thinking.\"\n\n\"Whatcha thinkin' about?\"\n\n\"Oh, nothing much. Just trippin' down memory lane I suppose. The kids sound so happy and it's sort of peaceful here. I was just enjoying the day.\"\n\n\"BULLSHIT. You can't shit a shitter here Dean. From the look of your face those weren't happy tears I wiped off your cheek. Now tell me what's wrong.\"\n\nI kept telling Crystal nothing was wrong until she did something I never expected. She hit me with her fist and began crying. \"DAMMIT Dean. I've worked for you now for four months. I've been with you part of almost every day and I know something's wrong today. I'm pretty sure it's not something Jackie or the kids or I have done because you usually tell us and you usually don't cry when you do. And don't try to feed me the old allergy or sunlight trick either. You've never had trouble with allergies and you know it and the wind isn't blowing enough to blow something into your eye.\"\n\nI finally sighed and said, \"Ok Crystal. I suppose I was feeling sorry for myself. I'm a damn loser and it hurts. I was listening to the kids laughing and playing with Ed and you girls were laughing in the kitchen and I was here all alone ok? I've been married three times and each time I chose a cheating bitch and I realized I'll never find or have a good woman for a wife ok? I'm a loser.\"\n\nCrystal looked at me in shock then she slapped me. Before I could do much more than raise my hand to feel my burning cheek she began yelling at me. \"You damn asshole. You know damn good and well there's nothing wrong with you. Well maybe there is. You're too damn gullible and you don't look at what a woman really is before you marry her. Then you're too damn trusting. NO, I don't mean that, I mean then they betray your trust and you think there's something wrong with you? Crap, the only thing wrong with you is you don't do your research before you let your heart or your dick get you into something you should run away from.\n\nI'm the one who has a problem. What man wants a two time loser woman with two rug rats? I'm a millstone waiting to attach to a man and drag them down. They don't want anything to do with me. No man wants a readymade family that will suck all his income from him. If I can admit that to myself and be happy why can't you be happy with what you have?\n\nDean you have two wonderful children, work you love and friends that would do anything for you. Dean you have it all and sometime you will find the right woman if you just keep your eyes open.\" Crystal stood and started toward the house then stopped. \"Oh,\" she said. \"I forgot. I came down here to tell you the kids are ready for cake and ice cream. That is if you can get your head out of your ass and come up to the house.\"\n\nI sat a moment staring at Crystal as she walked rapidly back to the house. Finally I got up and followed her. When I got to the kitchen I saw Ed sitting at the table looking toward the living room with a quizzical expression on his face. Ed turned to me and said, \"What the hell went on out there? I've never seen Crystal that pissed off.\"\n\n\"I guess I pissed her off. I was feeling sorry for myself and we had a talk. I don't think she liked some of the things I said.\"\n\nAbout that time Jackie came back into the kitchen and glared at me. She shook her head and said, \"Dean sometimes I think you're about the dumbest man on the face of the earth.\" She then turned and began cutting cake and putting it and ice cream in dishes for everyone.\n\nIt was quiet while everyone ate their cake and ice cream. After that mess was cleaned up everyone went outside once more into the cooler dusk. We sat beside the stream and watched the kids swim and splash in the water while the adults visited. Occasionally we could see fireworks in the sky from nearby houses and way in the distance we saw the display from Steelville.\n\nFinally about ten p.m. Ed and Jackie decided they needed to get home. They had to work the next day. Crystal rounded up her children and they all piled into Ed's SUV for the drive back. My children and I stood watching until they turned onto the highway then we went inside for their baths and bed.\n\nThis was another night I had trouble getting to sleep. I kept thinking about my past life and what Crystal had said at the creek. Maybe she was right but dammit she couldn't be could she? Hell I know she was wrong. Hell, I had known Terri almost all my life. How could I have foreseen what she would do? \n\nSuzie had been a Teacher and went to church every Sunday. Who would have thought she would be a cheater? I had known her for months before we even began dating. We had dated for almost a year before we got married. I thought I knew her for sure.\n\nCrystal might have been right about Patty. We had only known and dated each other for nine months before I married her but hell; she worked in law enforcement and had grown up on a farm. I knew what kind of character those jobs required didn't I? What was I doing wrong? What was Crystal trying to tell me?\n\nTo my surprise I was still asleep the next morning when Crystal and her children arrived. I hadn't expected her so early because all I was doing that day was making hay. Hell I couldn't start until the dew was off the grass and that was usually about ten a.m.\n\nBoy I sure came awake with a start when four children slammed through the bedroom door and hit the side of the bed. It was after 7 a.m. Stacy smiled and said, \"Come on Daddy. Crystal's making breakfast and she says you gotta come now or it'll get cold. She's making your favorite omelets and she's even making us kid's pecan oatmeal waffles.\"\n\nSissy said, \"Yeah Mr. Thomas. Come on we gotta eat now.\" She started to pull the covers off me and I grabbed the sheet.\n\n\"NO. Don't do that Sissy,\" I said. When Tim and Howard saw what she was doing they grabbed the sheet too and pulled. The three were too much for me since I didn't have a good grip on the material. The sheet pulled from over me and fell onto the floor beside the bed. I was bending over reaching for it when I heard steps in the hallway.\n\nCrystal came through the door into my room and said, \"Hey, what's the holdup here. I need you to get into the kitchen right now or the food will be cold.\"\n\nShe looked up then and stopped in shock. I was just pulling the cover back over me when I saw her blush. Little Tim just made things worse. \"Mommy why is Mr. Thomas naked? You won't let me sleep naked why does he?\"\n\nCrystal's blush deepened and she turned away from me. \"You kids get out of Mr. Thomas' room now. I'm sure he'll be along shortly.\"\n\nWhen I got to the kitchen Crystal was having a hard time with Tim. I stood listening to her explanation of my sleeping attire or lack thereof. \"Tim sometimes grownups choose to do things that aren't right for children. They uh. Well Tim its Mr. Thomas's house so he can sleep like that if he wants to.\"\n\n\"You mean I can sleep naked in our house now? That's sooo cool. Hey Sissy we can sleep naked now in our house.\"\n\n\"NO! That's not what I mean Tim. I mean sometimes adults\"\n\nI walked into the room and sat at my place. I looked at Tim and said, \"Let me help with this one Crystal. Look Tim sometimes adults choose to do things that\" I saw Crystal glaring at me and changed my thought. I continued, \"Well Tim I guess it's sort of a comfort thing and a privacy thing but mostly I think it's an adult thing. Grownups don't have to worry about being seen in the privacy of their rooms naked and sometimes it's better for them if they sleep naked. When you get older I'm sure you can figure out things like this but right now you need to do what your mother says because she knows when it is ok to do things and when it isn't. You see in the privacy of your own room sometimes it's ok to do things it's not ok to do otherwise.\"\n\n\"So if I'm in my room all alone I can be naked too?\"\n\n\"No Tim. You have to do what your mother says and you see sometimes an adult has to go check on you so you shouldn't be naked when they could see.\"\n\n\"But mommy sees me naked all the time. Why can she see me naked in the bath tub and when I'm dressing and not when I'm sleeping?\"\n\n\"Well Tim because she has to help you do those things but she doesn't have to help you sleep. You can sleep all alone and you need to be dressed then in your PJ's.\"\n\n\"So it's ok for a grown up to sleep naked because no one will see them then?\"\n\n\"Well sort of Tim. It's the grown up's choice. No one should be naked where others can see them if they or the others might be offended or if you're in public. You see I was in my bed alone and no one could see me. I was covered properly so there was no problem then you kids came in and pulled the covers from me. That was what was wrong with it. That was sort of like you were in town and someone tried to undress you. That would be wrong wouldn't it?\"\n\nTim smiled and nodded his head. \"So it was like we undressed you then Mr. Thomas. I'm sorry we did that. But if covers are sort of like clothes then why can't I go to bed naked and cover up?\"\n\nCrystal was smiling at me trying her hardest not to laugh. Finally she said, \"Ok Tim. That's enough. You just have to realize its Mr. Thomas's bedroom and his house and he can do what he wants in it. He's a grown up and if he wanted to sleep naked or in a suit he is allowed to do that. You can't do that because I'm your mother and I say I don't want you to ok?\"\n\n\"OK Mommie but I sure would like to sleep naked.\"\n\nAfter breakfast I wandered out to the patio and drank my coffee. After she had cleaned up Crystal came out with her cup and sat beside me on the swing. I looked at her. She had a smirk on her face. \"Damn Crystal. I'm sorry I caused that. Tim sure has a one track mind doesn't he?\"\n\n\"Well Dean he is a little man you know and I've never known a one of you who doesn't want to get naked every chance he gets. Thank you though for trying to help.\"\n\nCrystal and I had another cup of coffee then I decided it was dry enough to get to work. Things went well and I stopped early for a change. I was able to send Crystal and the kid's home early. For some reason Crystal seemed upset when I told her to go on and let me clean up the kitchen.\n\nFinally it was time for Crystal's final hearing on her divorce. Her husband had been dragging his feet now for a little over four months. I arranged my work so I could watch all four of the children. We decided to go to town and buy some supplies while she was in court. I needed some filters and other parts for my equipment so one of the stops was the implement dealer.\n\nThe parts clerk smiled when I walked in and said, \"Hello Dean. We haven't seen you in here for a while. Where's that pretty wife of yours today?\"\n\nI felt a cold shock rush through me and I suppose my face showed it. The clerk said, \"Oh, touchy subject huh? Sorry. I'm just so used to seeing her in for parts for you now. Well tell her I said hello when you get home.\"\n\n\"I don't have a wife any more. We've been divorced now for almost a year.\"\n\n\"What? You're divorced and she's still running all over for parts for you? Man how did you convince her to do that?\"\n\nNow I was confused. I knew Patty had never come in for parts for me. I finally got my brain working and said, \"Oh, you mean Crystal. That's not my wife. She just helps with the kids and runs errands for me sometime. She's over at the courthouse today trying to get a divorce from her cheating husband. Sorry for the mix-up.\"\n\n\"You're kidding right? Man the way that woman talks about you...Shit I wish my woman talked as good about me as she does you. Now, what'll it be today?\"\n\nI'm glad this was my last stop. I couldn't think about anything except what old man Scoggins had said at the parts counter. What had Crystal been saying about me anyway?\"\n\nCrystal and I got back to my place about the same time. When she came into the house she looked very upset. I looked at her and asked, \"Well how did it go today. Is it over?\"\n\nCrystal's face screwed up and she began to bawl. She said, \"Yes. NO. The judge granted the divorce but he held child support open pending a DNA test on the kids. That Asshole claims they aren't his kids and is trying to get out of paying child support. How could he think that? He was the one cheating. When did I ever have the time even if I had wanted to?\"\n\nCrystal collapsed onto the couch beside me. I didn't even think. I wrapped my arm around her and pulled her to my chest. I was stroking her beautiful hair when all four children came into the room. Sissy asked what was wrong and tried to hug her mother.\n\nI said, \"Kids your mother is sad because your father said some bad things to her today. Why don't you go on and play in your room while I talk to her and make her feel better?\"\n\nCrystal looked up at me and tried to smile. I felt her hand caress my chest as she wrapped her arm around me. She lay there and silently cried for several minutes. I just held her and gently stroked her in a calming manner. Her sobs slowed and stopped. I looked down and she was breathing gently, slowly. She had drifted off to sleep resting against my chest. Damn, what was I going to do now?\n\nI just sat holding Crystal while she slept. Finally almost thirty minutes after she had fallen asleep Crystal moaned and moved. I looked down in time to see her eyes pop open. She gasped and rapidly sat upright. She looked at me in shock and blushed. I grinned to myself when I saw the little indentations in her blouse from her hard nipples. \"Oh, I'm sorry Dean,\" she said. \"Why did you let me go to sleep on you?\n\n\"No problem Crystal. You obviously needed the rest and I really didn't mind. I didn't have anything better to do than hold a friend and help her feel better.\"\n\n\"Really? Well thank you anyway. I suppose I had better get supper on now. It's going to be late as it is.\" Crystal started for the kitchen then turned back to me and said, \"Dean would you mind if we spent the night tonight? I really don't feel like driving to Jackie's after supper.\"\n\n\"No problem. Crystal you really don't have to ask if you can spend the night. I enjoy having you. In fact after school starts I think you should spend the week nights here anyway so Tim can go to Kindergarten down here. That way you can keep working and not have to make arrangements for him to stay at Jackie's or go pick him up every day and take him in. We'll just tell the school you live here and they will enroll him as a resident student.\"\n\n\"Dean are you asking me to move in with you?\"\n\n\"Uh, well not exactly. I mean you should just stay here to make it easier on you and the kids. I don't mean you have to sleep with me or anything like that. We can just go on like we are now and.\"",
        "\"Oh. I guess we can do that. You wouldn't really mind? I mean I feel like we're putting you out now and if we stay even more it just wouldn't be right. I think you need to start paying me less to make up for us staying here with you more.\"\n\nOver the course of the next three weeks Crystal moved all her and the kids belongings to my house. A time or two Jackie helped her and I caught her smirking at me. Hummm. I wonder what that's all about.\n\nFinally just before school started the DNA tests came back showing Frank was the father of Crystal's children. The court made the child support award but they didn't award any alimony. It seemed what I was paying Crystal was close enough to what Frank earned that none was authorized. Even the child support was a pittance though. Crystal got $25.00 per week per child.\n\nAfter she moved in Crystal began doing even more around the place. She completely took over caring for the house, yard and chickens. In season she even did the garden work. She did all the light work with the hog operation also and helped me with the cattle. I was beginning to wonder how I ever managed to keep up doing it all by myself. Occasionally I would smile and realize I hadn't been keeping up. Now I was managing to do some of the lower priority repairs and even managed to do some cosmetic work on the house and outbuildings. I'll be damned if she didn't spend a lot of her time helping me do that also. Crap, we even had fun doing it. She was a pleasure to work with or just be around.\n\nOne of the neighbor boys went into the service and I bought his ten year old truck. I couldn't find anything wrong with it and I wanted a more reliable second vehicle than Crystal's old Junker. When I had her go with me to pick it up she went willingly. I had her drive it home for me. After we got it home I refused to take the keys when she offered them to me. I said, \"No Crystal. You keep them and put the spare set on the key board. I want you to drive the new truck or mine from now on when you leave the place. I don't want to take a chance your old Junker will crap out on you somewhere.\"\n\nDamn, just like a woman. Crystal stared at me for a minute then she broke out in tears and ran to her bedroom.\n\nThat fall we had a large Thanksgiving and Christmas right there in my old farmhouse. I didn't have any relatives living in the area but Crystal still had a brother and her sister Jackie. They and their families all came down and we had a great time. All the kids screaming and running around made the holiday so special. Oh, my, how those women could cook too. I made myself sick both days eating their good cooking.\n\nWe even had a little New Year's party on New Year's Eve. After our guests left Crystal poured us each a final glass of Port and sat with me in the dark den watching the Christmas tree lights flickering.\n\nCrystal had leaned against me and rested her head on my shoulder. I wrapped my arm around her shoulders. We were relaxing and enjoying each other's company when I felt her shaking. I looked down and she was crying silently.\n\n\"Shhhhh. What's the matter honey,\" I asked.\n\n\"What's wrong with me Dean? Why do you just treat me like one of the guys all the time? What did I do to make you not like me? I'm not easy Dean. Was it what happened the night of my divorce hearing? I mean I could understand you not making a move on me while I was still married but what's wrong with me now? Why don't you want me now?\"\n\nCrap I though. Where did this all come from? \"Crystal I thought we were getting along great. There's NOTHING wrong with you. Hell, I know you've seen me when I let my needs show but I won't do that to you. Crystal I like you better than any woman I know. You are a great help here on the place and I just love being with you all I can. I know you have my back and will help all you possibly can. How am I supposed to treat you? Crap, I think you're my best friend in the world. I just wish I had met you when I was younger before my life got so screwed up. You're a much better woman than those three I was married to. There's not a thing wrong with you.\"\n\nI felt my stomach clench and a great feat gripped my heart. Crap, she wasn't going there was she? If she was could I put myself through that again? Shit, we needed to talk big time. \"Uh Crystal if you're going where I think you are I, uh. I don't know if that is a good idea at all. I admit I have thought about you a lot in that way but I just don't know if I can make myself do that again. I'm a loser and every time\"\n\nCrystal jerked away from me and looked angrily at me. \"Damn It Dean are you trying to say you think I'm a skank like those three you married and had to divorce? Is that it? I'm a double divorcee and I'm not good enough for you. Haven't I shown you what kind of person I am? Dammit I've been living with you for almost two years now. Our kids think we're a family. Hell, we've been married in every way except for the ceremony and sleeping together. Damn it you even put my name on your checking accounts so I could buy things for you. If you didn't trust me why did you do that? Don't you love me? Is that it?\"\n\n\"No. I...I think.\" I took a deep breath and continued, \"I think I do love you but I just couldn't take that kind of pain again if we broke up. I just couldn't and I couldn't put my children through that either.\"\n\n\"What about me Dean? Don't you think I'm afraid of being hurt again too? Don't you think I want to protect my children from the pain a separation would bring? How about now? Don't you think our children would be devastated if we separated now? It would kill me and I know it would kill you too. All I'm asking is that I be allowed to show my love for you physically.\n\nDamn it Dean if you won't marry me fine. I'll just live in sin with you. Hell everyone in town thinks I am doing it now anyway so why not?\"\n\n\"Crystal I can't think about this anymore tonight. I need to get some sleep. I'm sorry.\" I stood and left Crystal sitting on the couch crying silently. I thought this was a hell of a way to fuck up a nice holiday season. I had pissed off the best thing that had ever happened to me or my kids and now I was probably going to lose her. Shit.\n\nI couldn't sleep. I heard Crystal clanging around in the kitchen for quite a while after I had gone to bed then finally the lights went out. It was nearly four a.m. when I finally gave up and got out of bed. I wandered out into the dark house. I had managed to doze for a few minutes from time to time but had not gotten any sleep. The kids would be up in two or three hours and another day, another year would start. What would it bring?\n\nI had another glass of the Glenlivet while I stared out the back window. I heard a noise behind me and turned to see Crystal standing staring at me. She gave me a wan smile and said, \"I guess I fucked up tonight didn't I? Do you want me to find somewhere else to stay? I'm sorry I said those things to you Dean.\"\n\nI don't know what happened at that time. I felt empty and scared when Crystal asked if I wanted her to leave. The way she was standing there just behind me in the moonlight was so pitiful. I didn't even realize I had moved. I wrapped her in my arms and pulled her to my body. We met in really our first kiss that had any meaning. Well, not really, we had both given each other kisses in the past but more as friends than anything. This was a lover's kiss. Crystal moaned and plastered her body to mine.\n\nI pulled back and looked down into Crystal's face. \"No,\" I whispered. \"The last thing I want is for you to leave. I would be so lost without you here. If you left us I don't think I could go on. You would tear my heart completely out if you left me. The others just broke it. You would take it with you and I would die.\"\n\n\"What\"\n\nI kissed Crystal again and felt her collapse. I had to hold her up. I scooped her up and carried her into her bedroom. Well, damn it was closer than mine was. I didn't even close the door. I placed her on the bed and crawled in beside her. When I had gotten up I had put on a pair of boxer shorts. Now my cock was sticking out the fly and hard as a steel bar. Crystal smiled up at me and then looked down at my cock. She reached out and gently took hold of it. She pulled me toward her with the other hand. \"Please Dean. Just love me right now. That's all I need, all I want. I just want you in me now please. We can do the other later. Please?\"\n\nI rolled to the side and struggled to remove my boxers. Crystal moaned and sat up. She took off her T-shirt in one smooth move and lay back onto the bed. I crawled over Crystal and nestled between her splayed legs. My cock nudged against her thigh then notched into her dripping hole as I moved forward more. I pressed downward as Crystal tilted her hips. I sank about an inch into her hot, wet love canal. She whimpered and I groaned. I thrust deeper and then slowly sank into her hot box until our pubic bones were smashed together.\n\nWe rocked, we moaned, we thrashed and banged against each other as we pleasured each other. We went over the edge together. Crystal screamed loudly enough to wake the dead and I groaned. We strained tightly against each other as our orgasms flowed through our tired bodies.\n\nCrystal bit her lower lip as she stared up at me. Her eyes sparkled. Hell, even a blind man could see the love in them. I had been so blind, so scared. I was still scared but now I was scared I would fuck up and let this wonderful person get away from me.\n\nI didn't think about my next move. I pulled away from Crystal almost violently and jumped from the bed. She looked scared. \"Dean what is it,\" she asked fearfully.\n\n\"Wait,\" I replied as I ran from her room. I almost ran down the hallway, across the living area and into my bedroom. I was rummaging through the jewelry in a bowl in my top dresser drawer when Crystal came up beside me. We had neither one taken the time to put our clothes on after I jumped from her bed.\n\nThere it was. Finally. I turned to Crystal. She was standing beside me, legs slightly spread. I could see my sperm running down her right thigh. She had tears once more running down her cheeks. I grabbed her left hand and raised it. \"I found it Crystal. I want you to have it. It was my mother's. Would you marry me Crystal? Please? I'm sure. Crystal there's NOTHING wrong with you. It was wrong with me. I was scared and still feeling sorry for myself. You woke me up. I know this is right.\"\n\nCrystal smiled. No, she glowed. She pushed her left hand slightly toward the ring I was holding and nodded her head yes as she whispered the same word.\n\nI placed my mother's engagement ring on Crystal's finger. We kissed and turned toward my bed. After we were in bed I felt her gently pull the covers over us. Crystal giggled and said, \"Well, at least this way I won't have to sleep in the wet spot.\" She giggled again and gave me a gentle kiss. \"Good night Honey.\"\n\n\"Daddy. Daddy we can't find Crystal. She's not in her room or the kitchen. Do you know where she is?\" I heard a herd of elephants stampeding across the den toward my bedroom. Crap. The door was wide open and Crystal was still in my bed. I looked over to see her breasts shining in the morning light, the sheet barely covering her bare ass. I started to cover her better when the herd stampeded through my open door.\n\nAll four kids stopped and stared at Crystal and me. The noise had awakened her too and she was pulling the covers up. She was blushing too. God she was beautiful.\n\nNaturally it would be Tim who did it again. \"Mommie why are you in bed with Mr. Thomas naked,\" he asked.\n\nI couldn't help it. I broke out in a loud laugh. Crystal stared daggers at me and blushed even deeper. I moved until I rested on the headboard of the bed and scooted over next to Crystal. I patted the edge of the bed and said, \"Why don't you kids sit here for a minute. Your mother and I need to talk to you.\n\nKids last night your mother finally made me realize I had my head stuck up my...I mean last night your mother and I decided to get married. She will be all your mother now and I will be your daddy. Is that ok?\"\n\nStacy looked at the others and broke out in a big smile. She nodded her head yes but Tim said, \"I thought she was our mother and you were our daddy. This isn't going to change that is it? But why did mom sleep here last night instead of in her own room? And why is she sleeping naked? She doesn't usually sleep naked. She said we weren't supposed to sleep naked.\"\n\nCrystal was giggling in spite of herself. I looked over at her and pulled Timmie into a hug. \"Timmie when a man and woman love each other like your mother and I do they sleep together. We sleep together naked so we can be closer to each other and love each other better. That's why you kids shouldn't just come into our bedroom without knocking and asking if you can. You wouldn't want to see your mother naked and upset her would you? That would really hurt her feelings if you did and you don't want to do that do you?\"\n\nTimmie shook his head no. Stacy was watching us and grinning. She said, \"I'm glad Crystal is going to be our new mother. We all love you both so much. When are you going to get married?\"\n\nCrystal smiled and said, \"We don't know yet Stacy. Soon I hope but we have a lot to do first.\n\nAll the younger kids had climbed onto the bed farther and were crawling over Crystal and me. The phone rang and Stacy picked it up. \"Hello. Yes. I don't know. Guess what Aunt Jackie. Daddy and Crystal are going to get married.\"\n\nI heard a shriek and tried to get the phone away from Stacy. She moved away and said, \"Ok. Unh huh. Ok, see ya.\" She hung the phone up.\n\nI said, \"Stacy you shouldn't have told Aunt Jackie that.\"\n\n\"Why Daddy. Was it supposed to be a secret?\"\n\n\"No but your mother probably wanted to tell her the news herself.\"\n\nI felt Crystal shaking beside me and turned to look at her as Stacy said, \"Oh. I'm sorry mom.\"\n\nCrystal began crying harder and I pulled her to me. \"What's wrong Honey,\" I asked.\n\nShe shook her head no and said, \"Nothing. Nothing at all. You called me her mother. She called me mom.\"\n\nI sent the kids into the den to watch cartoons while I pulled Crystal into my arms. I was kissing her gently and stroking her as she cried herself out. I heard gravel sliding and a car door slam. Our back door flew open and I heard steps stomping across the floor. I heard voices in the den then running steps came toward our bedroom. I was watching the door when Jackie came storming through in her full Sheriff suit.\n\nShe stopped halfway to the bed and stared at me cuddling her sister. Crystal's beautiful breasts were uncovered and pressed against my chest. Jackie put her hands on her hips and said, \"Well it's about time you idiot. I was sure getting tired of listening to Crystal cry and moan about you ignoring her. I was about to shoot you and put you out of her misery.\"\n\nJackie sat on the edge of the bed and said, \"Now, tell me all about it and hurry. I have to get back on patrol. How did you get the damn big lug to break down Crystal?\"\n\nI looked at Jackie and said, \"Uh Jackie could you maybe just go into the den for a minute or two? I need to get dressed and start some coffee. It doesn't look like I'll be getting any more sleep for a while.\"\n\nJackie stood and went out the door. I had just got out of bed when she stuck her head back in. \"I'll make the coffee but you hurry.\" She glanced down at my still hard cock and grinned. \"Ohhhh, Nice one Sis. Don't let him get away.\"\n\n\"Jackie!\" Crystal screamed. I just turned and ran for the bathroom and my clothes.\n\nWell, we married on Valentine's Day. We worked and lived just like we had before except now Crystal slept with me and we loved each other physically and in every other way. Late that fall Crystal came to me and told me we were going to have a child. I had promised her one of our own and considering our ages we decided to have it as soon as possible.\n\nThe young one just started kindergarten and Crystal is crying. Her baby started school and she feels old. I pulled her down the driveway toward the house. \"Honey think about it. There are no kids here. The work is caught up for a day or two. Whatever are we going to do with ourselves,\" I asked as I rolled her nipple between my thumb and index finger. \n\nCrystal stopped and pulled me to her as she moaned. \"I dunno. I bet I can think of something though.\" She pulled back from my embrace slightly and looked me in the face. Her hand came up and cupped my cheek as she whispered, \"Oh, Dean I love you so much.\"\n\nYep, I had three strikes against me in the game of life but I hit a home run at my next time at bat. It took two very special ladies to make me wake up and realize I had been going for fluff instead of substance and how to tell the difference."
    ],
    "authorname": "SW_MO_Hermit",
    "tags": [
        "cheat",
        "divorce",
        "love",
        "marriage"
    ],
    "category": "Loving Wives",
    "url": "https://www.literotica.com/s/three-strikes-and-a-home-run"
}