{
    "title": "The Physical Therapy Student Ch. 04",
    "pages": [
        "Simon sat at his cubicle. He agreed to pick up an extra shift hoping it would calm him down for tonight. Still, he felt nervous. Meeting the man who was having sex with his girlfriend. Meeting him as soon as today. Simon was mentally preparing himself but this unexpected development of meeting face to face like this blindsided him. \n\n\"Well, we'd have to meet eventually, so this might be for the best.\" \n\nSimon took his phone and backed away from his desk only to retreat back. His bulge was too noticeable to leave his desk. He stayed in his chair for the mean time. Praying that no one would notice, he crossed his leg waiting impatiently for the work day to end. It could have been worse. There was a television broadcasting the NFL playoffs. Every now and then everyone would hear Sean talking about his hatred towards the Patriots. Simon watched for a little while. The camera occasionally cutting away to show fans with signs. Right before cutting to a commercial, Simon saw a fan that he swore looked like Anna. Simon shook it off but had a small amount of doubt. \n\n\"What if that was really her?\" \n\n\"No. It can't be. The stadium is in a different state. Plus she doesn't even like football.\" He typed up a small memo to himself updating his work log. When the cheering of the crowd roared from the television, Simon looked up. He saw that it was not her at all. The skin color was way off. He sighed and wiped his tired eyes. \n\n\"She should be home right now. Making dinner for us...and him.\" Simon suddenly felt nervous. He wanted to know who it was and he didn't want to know at the same time. He pictured Anna in a white apron. Under that was a button down shirt stretching over her big breasts. To top it off, she had on a short skirt that clung to her hips. She was alone. Cooking at the stove. Stirring up the pan. The bathroom door opened and out came someone he put together in his head. It was like a better version of himself. Taller, more muscle, teeth like a movie star. He walked over to her and put his arms around her waist pulling her away from the stove. She smiled as he turned her around and kissed her. \n\n\"Get on your knees Anna.\" He demanded. \n\nShe obeyed and unzipped his pants. \n\n\"That's a good girl.\" He said putting his hand on the back of her head. \n\nSoon enough he picked her up and put her on the table. He pulled up her skirt and drove himself inside of her. \n\n\"A-Ah!\" Anna yelled. \n\n\"Yeah you like that baby?\" He said pulling her close. \n\n\"Yes!\" Anna said feeling the length deep inside of her. \n\nThe man stopped and jerked his cock while the tip was still inside of her. \n\n\"Hey Simon.\" Sean said. \n\nHe jumped in his seat. \n\nSean laughed. \n\n\"Hey, if your done over here let me know what numbers you have in the pool alright.\" Sean left his cubicle not before putting his fist in the air calling Tom Brady a cheater. \n\n\"They're not even playing yet. Right?\" Simon asked not knowing what game was on. Sean didn't hear. Simon cleaned up his desk and saw it was almost time to go. He pulled out his phone and sent a text to Anna. \n\n\"No. He's not here yet.\" She responded. \n\nSimon breathed a sigh of relief and grabbed his keys. The drive home was stressful. Simon was sweating. \n\n\"What of she lied? What if I text her right when they finished? What if...they're having sex right now?\" \n\nSimon drank from his bottle of water at a red light. He had a missed message on his phone from Anna. It was a picture of her in dark jeans. Most importantly she was wearing a plain white shirt that showed nothing at all. That kind of surprised Simon. Knowing how much he liked cleavage. Her hair put in a side ponytail. She looked so beautiful. Not even needing the added sex appeal. \n\n\"Looks great.\" He messaged her. \n\nThe rest of the drive was not as nerve racking as before. He climbed the stairs up to his apartment over the garage they shared with the landlord. Simon could smell the pasta. He saw the bathroom light was on and remembered his daydream. \n\n\"D-Dinner smells great Ann...\" Simon cleared his throat. \n\n\"Yeah, it came out great. Better than before huh?\" Anna said. \n\n\"Yeah.\" Simon got a drink of water and took off his coat. Anna came out of the bathroom fixing her shirt. She held another on a hanger noticing her boyfriend looking. \n\n\"I was thinking of wearing this since you like it but I wasn't sure if I should tonight.\" Anna held up a white spaghetti strap shirt. With it on the hanger was a push up bra. Not that she needed that. Simon swallowed. \n\n\"Um...\" \n\n\"I'll just stick with this...\" She decided putting it back in the closet. \n\n\"S-So...when will he be here?\" Simon asked. \n\n\"He should be here soon.\" Anna said walking back to the stove. \n\nSimon's heart was racing. He kept thinking of who might come up the stairs. A neighbor, a co-worker of hers, one of her guy friends. He thought of just about everyone his mind could think of. He got up and went to the bathroom. Sitting on the toilet going through all of her friends on facebook. \n\n\"There's nothing that connects. Who is it!?\" He felt his hands shaking. \n\n\"There's got to be messages on her phone. Wait. What if she has an email I don't know about?\" \n\nSimon heard a car horn beep quickly. He looked over at the door hearing the footsteps getting closer. \n\n\"You coming out?\" Anna knocked on the door. \n\n\"Y-Yeah. Be out in a minute.\" He said nervously. \n\nHe took several deep breaths. \n\n\"O-Okay. Okay. You can do this.\" He breathed in deep and exhaled. He stepped out of the bathroom. \n\n\"She must be downstairs.\" Simon said to himself. As he got closer going quietly down a few stairs, he could barely hear Anna talking. He heard a pop sound then footsteps coming closer. Simon went back up the stairs and stood by the table. The footsteps coming up the stairs were loud. Hearing another guy's voice made him question who it was. \n\n\"I'm about to meet him. Stop trying to guess you idiot.\" \n\nAnna came around the corner and looked at her boyfriend. He noticed the sound of a grocery bag with bottles banging around. Finally after all this time. He came around the corner, he looked at Simon. Then looked away quickly then back at him reaching over the table. \n\n\"Hi. I'm Michael.\" He shook his hand. \n\nHe was a lot shorter than expected. Only about an inch or two taller than Anna but the difference between the two boys was much greater. Michael had darker skin and wavy black hair with some curls. His eyes almost as dark as his hair. Simon pictured an accent on him at first but there was none. Wearing just a plain gray shirt and dark jeans with brand new looking black and white sneakers to match the neutral colors. \n\n\"H-Hi.\" Simon was still in shock. He pictured so many different guys walking in the door, but not Michael. \n\n\"Wow that smells good.\" Michael said. \n\n\"Thank you.\" Anna walked over to the cabinet next to the stove and grabbed some plates. Simon noticed Michael looking at her ass. He looked over at Simon and they both looked away. She put them on the counter as well as some plastic cups. Everyone took a turn putting the pasta on a plate. Michael opened up the bottle of sparkling cider. \n\n\"She must have told him to bring it. Grape flavor. Anna's favorite.\" \n\nEveryone sat at the square table each taking one side. The open bottle stood in the vacant spot on the table. Anna did an excellent job as always with the pasta mixed with ground beef and crusted tomatoes with a touch of garlic and parmesan cheese and small amount of spicy olive oil to top it off. \n\n\"Oh Wow. This is really good.\" Michael said. \n\n\"Thank you.\" Anna said. \n\n\"We learned how to make it from my aunt I think it was about a month ago right?\" \n\n\"Y-Yeah...yeah.\" Simon said feeling like he would be staring at Michael if he even glanced up from his food. \n\n\"Hey Anna did you do the homework yet?\" Michael asked. \n\n\"Oh you mean the thing we have to do online?\" \n\n\"Yeah it's like 50 questions about moving the muscles and what sucks is that you have to get a hundred for it to count as completed. I couldn't finish the first one we had cause I had to work so much last month and the questions change to something completely different. It was so annoying.\" Michael added. \n\n\"Yeah, I had to stay up all night for one of those. I didn't sleep until the next night. I was so tired.\" Anna said. \n\nSimon listened as they talked on and on about things he knew nothing about. Keeping an eye on the two. Where they looked, how they acted around one another and their body movements. \n\n\"So...Simon, do you go to school or do you work?\" Michael asked out of no where. \n\n\"O-Oh, um...I do both. I have a full time job and go to school.\" Simon said. \n\n\"Oh cool. What are you studying?\" \n\n\"I guess they didn't talk that much about me. Just straight to business.\" \n\n\"I want to major in computer programming. I'm in a programming class and I'm taking American history for the credit for now.\" \n\n\"That's cool.\" \n\n\"Hopefully I can transfer to a state university and get my masters and finally be done with school.\" Simon added. \n\n\"Yeah, yeah.\" Michael nodded spinning his fork in the pasta. \n\nI see you got a playstation and an xbox. Do you play pc to?\" Michael noticed the tech gadgets in the apartment. \n\n\"Yeah I've been playing an mmo and I got red dead on the xbox. Anna has an jrpg she's playing on the playstation.\" \n\n\"Cool. Do you play Apex?\" \n\n\"I haven't tried it yet. I might when I beat red dead, it depends on how much work I have.\" \n\n\"Yeah, I wish I had more time for games, not like in high school.\" Michael smiled. \n\n\"Simon couldn't help but smile with him. Knowing how much he could have done better if it wasn't for playing video games. \n\n\"Hopefully Anthem will be lit. I didn't play the demo though.\" \n\nAnna stood up and took her plate to the sink. Her phone vibrated on the table. \n\n\"Hey, it's your sister.\" Simon said. \n\n\"Oh.\" Anna answered the phone. \n\n\"Oh hey...are you serious? That's gre...oh hang on a second.\" Anna turned towards the guys looking at her. \n\n\"Everything okay?\" Simon asked. \n\n\"Yeah. I'll be right back.\" Anna stepped out of the apartment. \n\nThey could hear her going down the stairs. Simon felt uncomfortable with being alone with Michael. The guy who has been meeting with his girlfriend. Simon felt the need to stand up from the table, unsure of what to do. Michael stood up and looked at his collection of games. \n\n\"So...\" Simon said out loud not thinking straight. He froze at the sink thinking of school, work, games, anything to take the tension off of himself. \n\n\"H-How are you guys doing at school?\" Simon asked. \n\n\"Were doing pretty good. Anna seems to have a knack for it. She's a great teacher herself. If this doesn't work, she should teach.\" Michael said. \n\n\"I'm glad we're partners.\" Michael added. \n\nSimon felt dizzy and sat down on the couch. \n\n\"What?\" \n\n\"She's been real helpful, if anything I feel like I would be struggling if it wasn't for her.\" Michael sat on the couch perpendicular from Simon with a cup in his hand. \n\nHe had a confused look on his face and reached underneath him. Michael pulled out one of her sports bras from behind the pillow on the couch. He smiled. Simon stared at him. As tough as Michael tried to act, he blushed when he noticed Simon. \n\n\"Hey dude...can I ask you something?\" His tone of voice seemed to change. \n\n\"What's up?\" Simon asked. \n\n\"Your gi...Anna is a great person. She's beautiful, she's smart. She's funny. When she came to me and asked about...well, you know...that.\" \n\nSimon's eyes widened. \n\n\"I was like. What!? Like, how? How is this girl, nice and thicc gonna come up to me like this and tell me she has a boyfriend but wants to fuck my brains out?\" \n\nSimon felt weak and vulnerable. He looked away from him and wiped his hand on his pant leg. \n\n\"I was...confused. Why? Why do you want your girl to fuck other guys?\" Michael finally asked. \n\nSimon took a moment. \n\n\"I-I um...\" He cleared his throat. \n\n\"I guess you can say that someone put the idea in my head.\" \n\n\"Really?\" \n\n\"Y-Yeah...and I got curious about why guys would do this just like you were asking. I went to an online forum of guys telling all sorts of stories about lending out their wives. Some were so turned on from such a taboo that one guy passed out and woke up on the floor. Another guy stayed up all night just shaking in his bed.\" \n\n\"What the hell?\" Michael commented. \n\n\"But the thing is, they all enjoyed it. Most of them said they grew closer as a couple from the experience. I couldn't believe it until I read more confessions.\" \n\n\"How do you grow closer from cheating?\" \n\n\"It boils down to pretty much...trust. Trust and trying something new. That and staying faithful afterwards. It turned into a game for some of these people.\" \n\n\"Damn, that's crazy.\" Michael took a sip from his cup. He got up and grabbed the bottle and poured some more sparkling cider. \n\n\"But...what do you mean by a game?\" \n\n\"Well, one couple went to a bar to see who could get the most phone numbers in one night.. Another couple had a wife try to seduce their son's friend while helping him with his homework.\" \n\n\"Damn I wish that was me. I mean as the kid though.\" Michael joked. \n\n\"I know, to me, some of these games seem kind of fun.\" Simon said knowing that wasn't what Michael meant. \n\n\"Maybe I should have her help me study.\" He played off. \n\nMichael gave Simon a look like he was serious but also trying to play it cool. Simon wondered if he was actually serious. He looked at him for a moment. \n\n\"Hey, let me ask you something. How old are you?\" \n\n\"Twenty.\" He replied. \n\n\"Really?\" \n\n\"Yeah dude...and what, Anna and you are like, almost thirty or something?\" \n\n\"Twenty-eight, I'll be twenty-nine in a few months.\" \n\n\"Wow. I should be glad Anna like younger guys huh?\" \n\n\"Y-Yeah. Yeah.\" Simon smiled but felt so old in the moment. \n\nSimon paused for a minutes before working the nerve to ask his next question. He listened to Michael talk about other girls in school he noticed, mostly girls who he thought were attractive. He noted what body types they had and that's when he went into detail about Anna. \n\n\"I gotta say though. Out of all the girls in my classes. Lacey has a nice booty, uh what's her name...Monica, she got some nice tits. Heather got some nice ones to. But Anna...man, she's got everything dude. She's thicc in all the right places.\" Michael said while using his hands to draw out the shape of her body. \n\nSimon swallowed. \n\n\"H-Hey.\" Simon paused and cleared his throat. \n\n\"What...exactly. What did you do to...with...\" \n\n\"You wanna know what I did with Anna?\" \n\n\"Y-Yeah.\" \n\nMichael went in to his pocket and pulled out his phone. \n\n\"D-Did they take pictures!? Holy crap! What if they made a video!?\" \n\n\"Oh sorry, thought it vibrated.\" Michael said putting it back in his pocket. \n\nSimon felt the relief come across his chest. \n\n\"Well, where should I start.\" Michael giggled. \n\n\"You can skip to when you first met at the hotel.\" Simon suggested. \n\n\"O-Oh, okay.\" Michael sat up right. \n\n\"Okay so I got to the hotel early, you know to make sure the room was nice and clean. If it were me I'd take her in my car or in my room back home but...anyway, I checked the sheets and everything. I even took a shower right there. It was her request that I was as clean as possible before we started. She was in the room before I finished. Sitting on the bed in her tight black leggings. Some button down purplish-red plaid style shirt that she had unbuttoned around her cleavage.\" \n\n\"Ugh!\" Simon steadied his hand. \n\n\"Dude, her cleavage looked so fucking good dude. Like, oh my god, I know girls with bigger tits who can't pull it off like she can. Her booty looks so good to. Oh my god.\" Michael smiled and took a sip of his drink. Meanwhile Simon felt as if he was having a existential crisis. Simon's hands were shaking so much he decided to sit on for the mean time. \n\n\"G-Go on...\" Simon stopped. He didn't want to but at the same time he did. \n\n\"Oh right. My bad.\" Michael cleared his throat. \n\n\"Okay, so like I said she was sitting on the bed crossing those sexy legs of hers right? She says hello, I say hello. I sit down on the bed next to her. We chat for a while and get more comfortable. I move a little closer to her. She closes her eyes...and we kiss each other. Dude, her tongue felt amazing. I took my hand off of her leg and slowly went up her body. I just had to touch those tits. Oh fuck I couldn't help it, like I needed to and nothing would stop me from doing so. I gave her a nice squeeze and we both had the same reaction.\" \n\n\"U-Ugh!\" \n\nSimon felt more nervous than ever before in his life. Hearing about how someone else was fooling around with his girlfriend. Simon pictured his story in his mind, watching someone he just met touching Anna, even though she was in a committed relationship. \n\n\"She turned towards me and slowly unbuttoned each button of her shirt, pushing those tits together as she pulled away each button.\" Michael changed the way he was sitting. \n\n\"Under it she had on this black spaghetti strap shirt, cleavage game was even better. I couldn't stop myself from staring. Do you know what size her tits are?\" Michael suddenly asked. \n\n\"U-Uh...36D I think. No wait...maybe double d.\" Simon said wondering if he was wrong. He thought he was nervous. But in reality, he tried to hide his true emotions. Sweat dripping down his neck. He went to reach for his cup. Noticing his trembling hand, he stopped and used his arm to prop himself up on the arm rest. \n\n\"I stood in front of her and I couldn't help myself dude. I cupped both of her breasts and pulled her shirt down. It was so hot to see her take off her bra. So I took my cock out in front of her. She loved it.\" Michael smiled. \n\n\"Jesus Christ!\" \n\n\"I told her to touch it. She didn't at first, so I put her hand around it. Oh god I had to use those tits so...\" Michael stopped talking. \n\nThey heard Anna coming up stairs. Both of them stopped talking. She walked in to the quiet room feeling some sort of tension between them. \n\n\"Have you guys been sitting in silence this whole time?\" Anna said. \n\n\"N-No...we've been talking about video games...and stuff.\" Simon said. \n\nMichael nodded. He stood up and stretched his arms up. \n\n\"Alright...I should probably get going. I still got a lot of homework to do.\" Michael said. \n\n\"Oh okay.\"Anna said. \n\n\"It was nice to meet ya Simon.\" Michael shook his hand. \n\n\"Nice to meet you to.\" Simon responded. \n\n\"I'll walk you out.\" Anna said. \n\nSimon couldn't help but think of when she lived with her parents. Around the time they started dating. They finished the third Lord of the Rings movie holding hands on the couch in the living room occasionally kissing each other when her family wasn't around. Mid way through the movie she sat between his legs. Simon desperate to concentrate on the movie to keep from getting hard and poking her ass. Anna's hair smelled of the strawberry shampoo she used. Even looking down he could see the opening of her shirt that showed a little cleavage, still enough for a teenager to enjoy. At the end of the night, Anna would walk him to the front door. Simon was greeted by the cold air of the night. He turned around and saw she closed the door behind her and threw her arms around his neck. Embracing him with a kiss. Feeling her big breasts against his chest. His often though of how they would feel in his hands graciously awaiting the day. He was already rock hard just from the little touching he had of her tonight, Anna said goodbye and watched him back out of her driveway. \n\nSimon waited impatiently for her to come back upstairs. Feeling the bulge on his pants grow bigger. ",
        "\"God only knows what's taking so long. Anna. If you don't get up here soon, I'm not going to be able to control myself anymore!\" \n\nSimon closed his eyes and unzipped his pants. His hand was shaking as he pulled his cock out of his boxer briefs. He held it straight up and rubbing it carefully. He was worried she would come up any minute now. Simon couldn't help himself. He finally knew who the mystery guy was banging his girlfriend. A student many years younger than her. He could picture them sitting together at a table. Anna leaning in close to help Michael with his homework. He tank top tight against her showing off her chest. Michael feeling them press against his arm. Slowly rubbing them with his elbow until he pulled her in close for a kiss. Anna pulled away but Michael got behind her. Reaching around to quickly grope her. With both hands, he pulled up her under shirt and felt the weight of her breasts fall from her shirt. With no bra in the way. He pinched her nipples and kissed her neck. Simon's dream skipped forward and Michael had her bent over the table thrusting into her pussy from behind. Anna's orgasmic moaning was hypnotic. Simon had his head back and heard footsteps. He struggled to put himself back in his pants. With no choice he retreated to the bathroom to calm down until he could out his pants on right. \n\n\"You okay in there? I thought I heard you run in.\" Anna said. \n\n\"Y-Yeah. I'm fine. I'll be right out.\" Simon said as he washed his hands. \n\nAnna was wiping off the table when Simon approached from behind. He took in the sight of her nice tight ass and sensual legs. He put his hands on her hips, pressing himself against her. \n\n\"What are you doing?\" Anna playfully asked. \n\nSimon reached around her just like in his day dream of her and Michael. Giving her tits a nice squeeze. Anna playfully protested. Simon pulled her back and kissed her neck. Trying his best to recreate the dream. Anna turned her head and her lips met his for a quick kiss. She reached behind his head and felt his warm lips against her neck. His warm breath spreading all over her skin. Simon loved how she left herself open. He pulled up her shirt. Feeling the weight of her chest drop free made his groin twitch. She felt it and rubbed her ass against him. Simon turned her around unable to stop himself. He picked her up and put her on the table. \n\n\"What are you?...\" Anna questioned. \n\nHe yanked down her pants and tossed them aside. \n\n\"Your really in the mood huh?\" Anna said. \n\nOh if only she knew the half of it. \n\nSimon pulled down her underwear feeling how wet they got in his fist. He dropped it and made her lay down as he spread her pussy lips giving her a good lick to start. She closed her legs like a vice grip with his head still down there. Yet it did not stop him from wiggling his tongue between her lips. Anna looked at him seeing his mouth face buried. Her back arched when he found the perfect spot. \n\n\"Ah!\" She moaned, putting a hand on his head to push him away. \n\n\"This is where he... where Michael was. He put his cock right here. Inside of Anna's pussy. Inside my own girlfriend. He violated her. I want it to happen again! O-Oh please Anna, let him violate your pussy again!\" \n\nHer legs twitched as sounds of her moaning filled the apartment. She was squirting on his face. Simon took his head out and saw her sweating like she had run a marathon. Her chest heaving up and down trying to catch her breath. Simon felt shame within himself. In the moment he only thought of Anna's pussy taking a cock that was not his own. Simon saw the spot on his boxers. Sticky from his cum. Still, it did not stop him from going again. \n\n\"Simon! Wait!\" She begged. Still feeling light headed from her orgasm. The light overhead only made it worse. Her eyes unfocused. The light turned to three. Her head felt like it was spinning. She tried with what little strength she had to push his head away. \n\n\"D-Did it feel good Anna!?\" Simon asked. \n\nShe nodded. \n\n\"Yes. It feels good.\" She moaned thinking he meant his tongue. \n\nSimon moved to the side of the table. He put a hand between her legs and kissed her cheek. Anna opened her eyes and grabbed his face. Pulling him close. She didn't care that his tongue tasted different. She ignored the smell and swirled her tongue with his. \n\n\"A-Ah!\" Anna moaned putting her head back. \n\n\"Keep going!\" She begged. \n\nSimon pictured Michael on top of her as she spoke. His erection still up at attention twitched at the thought. Anna's body tensed up until it looked as of she had let go of everything. Then tensed up. Then let go. Then tensed up again. Simon worked his fingers in her and felt her pussy squirt in to the palm of his hand. The table was soaked. So was the spot on the floor where it dripped. \n\n\"She's gonna make me cum again! And she didn't even touch me! What's wrong with me!? God this is in...ugh! I gotta ask! Oh god please say yes!\" \n\n\"Do you want him again!?\" Simon nervously asked. \n\n\"What!?\" \n\nSimon leaned in and kissed her. Worried of her protest. She broke the kiss and looked in his eyes. Like she was trying to read his mind. Though part of her knew. \n\n\"Do you want him again!?\" Simon sounded like he was begging for it. He had a look of desperation on his face. Eye wide open piercing in to hers. \n\n\"You want him...Michael to do it again?\" Anna said just before arching her back. \n\nSimon was at a loss for words. He felt energy returning. Working her clit in his fingers. \n\n\"Oh god!\" Anna moaned. \n\n\"Simon!\" \n\nHe looked over her body moving around from his touch. Simon licked his lips. \n\n\"Go down there again! Please! Si...\" Anna begged. \n\nHe needed no words to go back to eating out her pussy. He was more than happy to do it. Putting his tongue where Michael was once before. Anna was ready to have another orgasm here but tried to hold it back as much as she could. \n\n\"AAAH!\" She screamed. \n\n\"Ugh! Anna!\" Simon took his cock in his hand and furiously jerked it using her juices. \n\n\"A-Anna! I want M-Michael to fuck you here! In our apartment!\" Simon confessed. \n\n\"Here!?\" \n\n\"Y-Yes! I want Michael...to do it right here!\" Simon moaned feeling himself ever so close. \n\n\"I can't. The only day I could do is tomorrow and what about you?...\" \n\n\"I will be at work. If you still don't want me to watch.\" \n\nAnna said nothing, but he felt a change in her body reacting to his words. Then without warning, she screamed and squirted so hard, Simon felt it hit the back of his throat. Simon ignored it and let it fall out on to the floor where he shot his load, the two substances mixing together. \n\nLater in the night. Anna emerged from the bathroom in just her underwear holding her phone and snuggled in bed next to her boyfriend. She had a big smile on her face from looking forward to one of her favorite parts of the day. Falling asleep in her boyfriend's arms. \n\n\"Hey Simon?\" \n\n\"Yeah?\" \n\n\"It took a little convincing...but he can do tomorrow.\" \n\nSimon held his breath. Another big day. No time to prepare. And already, he was getting hard. His heartbeat was faster. There was no hiding it from Anna. \n\n\"You okay?\" She asked. \n\n\"Yeah, I'm okay.\" \n\nSimon felt a hand wrap around his cock, loving every little touch of her fingers. \n\n\"You that excited?\" She quietly asked. \n\nSimon swallowed. \n\n\"Yeah.\" \n\n\"I can feel it.\" Anna teased. \n\nSimon felt a hand wrap its fingers around his hard cock. \n\n\"You're so big right now.\" Anna said. \n\n\"I-I can't help it. No matter what I did today, I couldn't stop thinking about you two.\" \n\n\"Hmph...your always thinking about that. I should have known.\" Anna giggled. \n\n\"I-I know, I'm sorry. It's just so god damn hot.\" Simon said trying not to shake from the thought. \n\nI wonder what I can tell you that I haven't told you yet.\" She hinted feeling his cock twitch with excitement. \n\nSimon was breathing heavier just from teasing. She slowly worked his hard cock in her small fingers. \n\n\"You know...there was quite a bit of flirting going on before we started.\" \n\n\"Really? Like how? What did you do?\" Simon asked sounding more eager than he wanted to show, \n\n\"You wanna know?\" She teased more. \n\n\"You wanna know how he couldn't stop staring at my cleavage, just like you do.\" She giggled working his cock slightly faster. \n\n\"You wanna know how we touched each other? Rubbing his hard bulge...him touching my breasts...that kind of thing.\" \n\n\"Nnngh.\" Simon moaned and pushed his head back against the pillow. \n\n\"B-But you weren't actually having sex?\" \n\n\"You want us to that badly? You pervert.\" \n\nShe could feel him moving his head on the pillow. As if he was nodding. Anna firmly squeezed his cock from the base to the tip. \n\n\"Ah!\" Simon exhaled. \n\n\"Hehe, you feel like your ready to do it.\" She teased. \n\n\"You know...Michael's thing was able to last quite a long time.\" \n\n\"Huh?\" \n\n\"Mmmhmm. He was able to get it back up when he finished...\" \n\n\"And...he made me cum a lot.\" \n\nSimon felt the room spinning upon hearing that. \n\n\"Really?\" \n\n\"You see, after we had our first time, he started running and exercising a lot. He said to get into better shape for next time.\" \n\n\"He went that far?\" \n\n\"Yeah, but it was kinda cute. I can't help but smile when I think about it. I think you did the same thing to.\" Anna giggled. \n\n\"I mean...I just wanted to...\" \n\n\"It also was a bit of a problem to.\" Anna interrupted. \n\n\"B-Because you came a lot?\" \n\n\"Yeah...it felt so good.\" Anna said sounding more sultry than she thought. \n\n\"I-I know I shouldn't say this but...he asked me if he feels better than you.\" \n\n\"What!?\" \n\n\"I didn't answer him...I was trying not to make too much noise...but he was so rough...\" \n\n\"Did what rough?\" \n\nAnna shook her head and smiled. \n\n\"I think you already know the answer to that.\" She said. \n\n\"Y-Yeah.\" Simon said. \n\n\"But...it felt really good. I covered my face with a pillow like with you. Michael told me my stuff went so far across the room.\" \n\nSimon thought about how her orgasms with him only squirted out a small distance. \n\n\"Holy shit! Anna felt better with Michael. His cock made her orgasm harder than mine could. Oh my god! My girlfriend had sex with another guy and it was better than me! Oh fuck!\" \n\n\"Hey...your thing feels like it's ready to explode...should I grab a towel?\" \n\nSimon said nothing, his body was tensed, she could feel it in his legs and how the bed moved. \n\n\"You're that happy...about me having sex with Michael.\" \n\nAnna...\" Simon cleared his throat. He paused trying to get the words out. \n\n\"What is it?\" Anna asked. \n\n\"A...\" Simon exhaled and took a deep breath. \n\n\"Did he...feel better than me?\" He finally got out. \n\n\"Um, well...it was really good...\" \n\nAnna squeezed upwards on his hard cock. \n\n\"It didn't matter if I came or not. He didn't give me time to rest...\" \n\n\"T-That's why...I stay with him all night...he was on top of me, then I was on top of him...\" Anna worked his cock faster. \n\n\"Ah, aaahh...Anna...I'm cumming!\"Simon said out loud. \n\nAnna worked his cock even faster in her hand, she could feel it swelling up as always when a guy was about to cum. Still she continued to jerk him hard. She licked her lips In the dark, feeling her mouth open up. Even she couldn't deny how hard she was breathing in the moment. Her heart was pounding nervously. She decided in the heat of the moment to confess what she felt inside. \n\n\"Sex with Michael...was the be...\" \n\nSimon came so hard he felt it hit his neck, she continued to jerk his cock, feeling his cum cover his torso. Anna closed her eyes feeling some of it get on her face but continued anyways to make him feel good. She kept jerking him until he went soft in her hand. Simon felt as if he was ready to pass out. Anna grabbed a shirt and cleaned up the both of them. \n\n\"Oh, there's so much of it.\" She commented. \n\n\"I'm sorry...\" Simon said. \n\nAnna smiled. \n\n\"It's okay silly.\"She said tossing the shirt on the floor. \n\n\"He said my name like you did.\" \n\n\"Huh?\" \n\n\"When he finished...he said my name out loud like you.\" \n\nSimon swallowed. \n\n\"Did you?\" \n\nAnna paused. \n\n\"Do you want me to? Should I scream out something like...Michael...I'm about to cum.\" She teased. \n\n\"We ran out of condoms after that.\" She said wishing she did not. \n\nAnna rubbed his face and heard him breathing out of his mouth. \n\n\"He fell asleep.\" Anna thought. \n\nShe smiled and put her head against his chest, falling asleep against his warm body."
    ],
    "authorname": "Arwing",
    "tags": [
        "big breasts",
        "cheating",
        "couple",
        "cuckold",
        "dirty talk",
        "girlfriend",
        "school",
        "sharing",
        "teasing"
    ],
    "category": "Fetish",
    "url": "https://www.literotica.com/s/the-physical-therapy-student-ch-04"
}