{
    "title": "Life's Changes Ch. 05",
    "pages": [
        "The next morning I woke up alone in bed. Someone was in the shower and I could smell coffee brewing. Moments later Bill came out of the shower. And Pam walked into the room holding a cup of what I hoped was coffee and asked.\n\n\"Breakfast in here or down stairs?\" I answered in a short clip tone.\n\n\"Coffee here breakfasts down stairs.\" I didn't mean to be short with her but any of you out there that are a coffeeholic will know what it's like. I grabbed the cup from her hand that she held out to me and rushed in to the bathroom. I went potty and jumped in the shower. After drying myself off I put on my garters and stocking, my panties and bra then my makeup then my suit with the knee length skirt.\n\nWith in a half hour I was ready to face the day. Hoping that today wasn't like last Monday. I went down stairs for breakfast. Bill was already there eating fresh fruit and toast. I sat down and Pam served me the same thing Bill was eating. Pam sat down with a bowl of cereal. I told Bill\n\n\"Please remember to call some contractors about the closet today.\" \n\n\"I'm going to call a closet designer instead and let them hire a contractor.\" I looked at Bill there was something different about him today. I studied him till I finally figured out what it was. \n\n\"That's probable a good idea. They can design it first before they start tearing anything out. Oh and Bill the tie clashes with your nail polish. \" Bill Looked at his nails and said\n\n\"Dam I knew I was forgetting something.\" Bill went off to remove his nail polish while Pam and I giggled about it. I took a look at Pam then said.\n\n\"Is that the same outfit you where wearing on Friday?\" She looked exactly the same as she did at the restaurant except the skirt was slightly different.\" \n\n\"No this is a different skirt and the blouse is a different one but the same color.\" I've known women like her they wear basically the same cloths all the time. You have to look closely to see the difference. \n\n\"Do you always wear the same thing I mean style?\" She nodded her head. \"Well we're going to have to change that. And we'll do something about your hair too.\" \n\n\"What wrong with my style and my hair. Bill likes it.\" She said defensively\n\n\"Has Bill actually said he likes it?\" I asked I was pretty sure Bill never told her he like it.\n\n\"Well he never said he didn't. Why doesn't it look business like\"?\n\n\"Honey, please don't take this the wrong way but you look like the school Marm on little house on the prairie. Yesterday you looked so beautiful and today you look like Miss Frump.\" I could see she was upset. I didn't want to upset her. \n\n\"Do you really think this is a bad look? I always thought Bill liked it. He never criticized it.\"\n\n\"Bill wouldn't criticize anything he's too nice of a person. If you want tonight after work we'll go buy a couple of outfits for you to wear to work and some for around here. If it's ok with you I'd like to bring Jenny with us she's very good in the cloths department.\" Pam nodded her head. \"I'll call you later to tell you where to meet us. Ok.\" She nodded her head again. I could see she was almost in tears. I put my arm around her and gave her a hug. \"I have to go to work now would you be a dear and make sure Bill has all his nail polish off and check for any make up. And later today remind him about the closet.\" \n\n\"I could find a designer for the closet myself and schedule them to inspect.\"\n\n\"That's not a job for a secretary.\"\n\n\"No it's not but it is one for a house mate. As long as my boss doesn't mind me calling.\" \n\n\"If he doesn't mind then go ahead.\" I said goodbye and called to Bill goodbye on my way out the door. \n\nI arrived at work my usual half-hour early. Ginger was there to greet me as usual with a cup of coffee that I had told her a hundred times she didn't have to get for me. And she would always say \"I don't have to get it for you I want to.\" \n\n\"Anything on the agenda yet today.\" I asked her as I drank my coffee and look though my mail. \n\n\"Oh yes you're schedule is full this morning and you have a board meeting at one this afternoon. Mr. Burns would like to see you the first thing this morning. And I do mean the first thing.\"\n\n\"See If Mr. Burns is in yet and set up a time.\" Burns was the president of the company I didn't want to keep him waiting. \n\n\"Oh. He's in already, came in a hour early because he knew you came in a half hour early he waiting for you.\" \n\n\"You know what he wants don't you.\" She nodded her head with a smile on her lips. \"And your not going to tell me. Are you?\" \n\n\"No but I will say it's been nice working with you.\" I didn't like the sound of that. I was sure if they were going to fire me she wouldn't be smiling. At lease I hope not. I took the elevator to the president's office. I met Janie his secretary out side and she ushered me right in. \n\n\"Sheri come right in. Have a seat would you like a cup of coffee.\" Mr. Burns asked. They don't offer you coffee when their going to fire you do they.\n\n\"No sir I've had plenty already today, thank you.\"\n\n\"Sheri I asked you up here for several reasons. First this Jeff Franks Incident\" I thought to my self. Oh great the little worm said something.\n\n\"Mr. Burns let me explain what happen.\" I started but he cut me off.\n\n\"Oh I know what happen. I'd like to know why you didn't fire him. You could have you know.\" \n\n\"Sir my job here is to make sure we keep the computers running. Jeff is a good Tec probable one of the best. If I fired him I'd be looking to replace him. So since I handle the situation I'd like to keep him.\" \n\n\"I heard how you handle it, good going. I like that you thought of the company first and I like the way you handled it. Next I've been looking at you personnel file you have eight weeks of vacation due you I'd like you to start taking it at lease a day off now and then. I don't want you burning out on me. Last but not leased we're creating a new position vice president in charge of Systems Information and System Procurement. Are you interested?\"\n\n\"Sure since that's what I do now.\" \n\n\"Well you can put your resume in with the others. But we are going to try and get the best person we can. VP's start at three hundred and fifty thousand a year plus stock options and perks.\" Why was he telling me this? I finally said\n\n\"I'll put my resume in this afternoon sounds like a good job to me.\" \n\n\"We should know in a month or so who it'll be so don't go quitting on us yet.\" What the hell was he talking about first he wanted me to take vacation time then talking about me quitting? I just may if I don't get that VP slot. \n\n\"Well Sheri don't forget about that vacation time and get that resume in and I'll see you this afternoon at the board meeting.\" Mr. Burns walked me to the door. After I left I asked Janie \n\n\"Has he been ill\" Janie gave me a smile and said \n\n\"He's been just fine. Why do you ask?\"\n\n\"That was the strangest conversation I ever had with him.\"\n\n\"No he seemed ok to me this morning. Oh Mrs. Macon thank you for setting Jeff Franks in place he has been such a pain.\" \n\n\"You welcome Janie and my name is Sheri.\" \n\n\"Yes I knew that.\" As I got back to my office I asked Ginger to come in.\n\n\"Now Ginger I know you secretaries have a inner office information network here. What was that meeting all about?\" \n\n\"I have no idea he just asked me to sent you up there when you came in.\" \n\n\"Are they planning on canning me over that Jeff thing. If they are I quit before they do.\"\n\n\"If they do, which I doubt they'll ask for you resignation first.\" I knew she was right about that. \"Mrs. Macon you have two hours before the board meeting if your going to the work out room you should go now. I though you might go today since you didn't get there all last week.\" \n\n\"Your right. Maybe I can work off some of this tension.\" Just then the phone rang \n\n\"It's Mrs. Marsh.\" Ginger said as she handed me the phone \"Don't forget the Gym\" Some times I swear Ginger is worse than my mother.\n\n\"Jenny sweetie what's your day been like.\"\n\n\"Busy how about yours?\"\n\n\"Really weird. I'll tell you later tonight. Do you want to go shopping with Pam and me this evening for work cloths for her.\" \n\n\"Sure how come?\"\n\n\"You seen how pretty she is. Well she dresses like my seventh grade teacher.\" \n\n\"Sure we'll go right after work. I'll see you at six outside your building.\"\n\n\"I'll be there. Oh and can you do me a favor call Pam at the office and give her somewhere to meet us.\" \n\n\"Sure no problem I see you a six.\" I said goodbye as Ginger came back in the office \n\n\"I'm going, I'm going. You're really being nag to me today.\" She gave me a stern look as I walked out of the office. In the dressing room I stripped completely and donned my work out sweats. Going into the workout room I started stretching. One other person was in the room. He was a rather tall muscular man about forty. He was doing the Stairmaster. That's where I usually start. I'll do about fifteen minutes or so on that. Then the treadmill and then on to the pull-up bar. I started the other Stairmaster on medium and got on. The man next to me turned to me and said \n\n\"Hi I'm Malcolm.\" I shook his hand not easy to do on a Stairmaster. And told him my name.\n\n\"I'm down here from the home office for the board meeting. I had a couple of hours to kill before it. So I came down here to work out.\" \n\n\"I'm on my lunch break.\" I really wasn't interested in chatting but he didn't seem to notice.\n\n\"What do you do here?\" \n\n\"Department head for systems information.\"\n\n\"I hear their hiring a VP for that.\" \n\n\"I know I'm not real happy about that.\"\n\n\"How come don't you think they need a VP for that? It's a pretty important department.\" \n\n\"Probably one of the most important. But I think I'm doing a good enough job.\"\n\n\"Well maybe they'll make you VP\"\n\n\"I doubt that. If they where then why not just give it to me instead of have me put in my resume. They know my qualifications as well as I do. They probably think I'm too young for the job.\"\n\n\"You are kind of young what are you twenty three.\"\n\n\"Thanks I'm thirty. This maybe the one time not showing my age may not be a good thing.\"\n\n\"The owner is a pretty smart guy. I'm sure he'll make the right decision.\" I looked at the clock on the It was twelve already. \n\n\"I have to go.\" I said as I jumped off the Stairmaster \n\n\"Can you stay a little longer I'd like to talk to you a bit.\" Malcolm asked \n\n\"No I really need to go shower and get dressed. If I'm not back in the office by twelve thirty my secretary will be down here with a switch to find out why. \n\n\"Sounds like a good secretary. Kind of like my.\"\n\n\"She is but sometimes I think she thinks I'm her daughter.\"\n\n\"Mine is the same way.\"\n\n\"Your secretary think your her daughter. What do you wear to work?\" We both laughed at that. I said goodbye and went to the shower. Got dressed. I when back to my office \n\n\"Mrs. Macon the meeting time has been changed it starting now. They want you up there as soon as possible.\" Ginger told me.\n\n\"Now I'm not ready. Don't these people know what a schedule is.\" I said as Ginger gave me a pen and a pad and pushed me out the door. I arrived at the board meeting once it was already started not a good thing. \n\n\"Sorry Mr. burns I just heard about the change in time.\" I said noticing my normal seat was taken and the only one left was between Malcolm and Mr. Burns.\n\n\"That's Ok please have a seat.\" seating between them I noticed everyone had nameplate with their job title on it. Burns then said \"Janie get Sheri's name plate. Every one knows about the system crash we had last week that stopped this company in its tracks for most of Monday. Well last Friday at the executive board meeting it was agreed that since Information Systems was such a vital component to our company the we should hire a VP to over see it. Malcolm would you like to take it from here.\" Malcolm stood up and said\n\n\"Most of the VP's know me but I don't know all the department heads. I'm here to hire the most talented and experienced person for this position.\" He looked right at me and said \"Regardless of age color or gender.\" Boy did I put my foot in it this time. Malcolm reached over me and turned my nameplate around. I was sure he was going to ask me a question so I looked up at him.\n\n\"I've already made my decision.\" I felt rejected I didn't even get to interview with him. I looked down at my lap I could feel everyone's eyes on me then I heard Mr. Burns chuckle. The old fool thought it was funny dangling the job in front of me then watch it yanked away. I resolved I wasn't going to let them get to me I looked up. Everyone was smiling. So they thought it was funny that someone was picked over me. Well I wasn't about to take this lying down. I went to stand when Malcolm put a hand on my shoulder and Mr. Burns tapped my nameplate with his pencil. That's when I saw it. On the brass name plate under my name was V.P. Information Systems. Everyone applauded. Mr. Burns stood up and shook my hand. I gave him a hug and kissed his cheek. He said to me so every one could hear\n\n\"Well that's the first time a VP ever kissed me\" then quietly to me he said \"After everyone's congratulated you meet me in my office.\" He and Malcolm left as everyone else congratulated me. When everyone was done Janie gave me my new nameplate and escorted me to Mr. Burns office.\n\n\"Sheri have a seat.\" After I sat next to Malcolm Mr. Burns continued. \"You will take the position won't you?\" \n\n\"I'd be a fool not to Mr. Burns. And thank you Malcolm for not holding against me what I said down in the gym\"\n\n\"You didn't say anything wrong. You spoke your mind and that's all I ask. But the next time we talk it will be over lunch not on a Stairmaster you almost killed me down there.\" \n\n\"Sheri from now on you will call me Fred no more Mr. Burns. VP's have that right. You do know Malcolm Harding don't you?\"\n\n\"I remember the name but I'm not sure where I've heard it.\"\n\n\"Most likely on your paycheck. Mr. Harding is owner and CEO of our company.\" \n\n\"Now I really feel stupid. I'm so sorry Mr. Harding I didn't know you.\"\n\n\"The names Malcolm and it's ok I don't get down hear very much. Maybe I should.\"\n\n\"Sheri Janie will show you your new office and maintenance will move everything up you'll need. You'll need to hire a secretary and a department head in a couple weeks. I'd like to see you take Fridays off for a few weeks to use up some of that vacation.\" \n\n\"I was planning on taking ten days off next month. As for secretaries I'd like to bring Ginger up with me if that's ok.\"\n\n\"I would have been surprised if you didn't bring Ginger with you. And the ten days next month is fine. If there is nothing else Malcolm we can let Sheri go and get started being a V.P.\"\n\n\"I don't have any thing. It's been nice meeting you Sheri I'm sure it won't be the last time.\"\n\nI walk out of the office and found Janie. \"Ready to see you new office. It's quite nice.\" We walked down one flight. She showed me to a set of double doors that had a plaque with my name on it. We entered the office that was about the same size as the one I already had. I thought it would be bigger. I told Janie \n\n\"I thought it would be bigger.'\n\n\"For a secretaries office its pretty big.\" She said then we stepping though another door she said. \"This is your office.\" It was immense It had large windows that looked out over the city a desk that was twice the size as the one I had now made of real wood. The office had a bar and it's own bathroom with a shower. I said to Janie \n\n\"Pinch me to see if I'm dreaming.\" Janie reached over and pinched my bottom. Which surprised me. \n\n\"Well you did say pinch you. Is there any thing I can do for you before I leave.\" \n\n\"Yes call my worthless secretary and tell her to get her butt up here.\" \n\n\"You do realize she was under orders not to say anything to you and to make sure you got to the gym. Tell me, does the stair master keep you butt so nice and firm.\" \n\n\"Yes it does do you like it.\" I asked wondering where this was leading.\n\n\"Yes I do. It's quite yummy. I'd like to see more of It.\" she said as her hand stroked my bottom. Now I knew where this was leading. I looked at her she was tall. Taller than Bill even in heels her hair was blond, not a cheap bottle blond but a real blond. Her d cup breast stood out proudly from her chest as she looked down at me with her deep blue eyes. I said \n\n\"Maybe we could work out together someday and watch each other sweat.\" \n\n\"I'd like that. I'd like that a lot.' I thought she was going to kiss me when she broke eye contact and said. \"I'll go call Ginger.\" And walked to the outer office. I watched her as she walked away I'm sure she knew I was watching. I though to my self I wouldn't mind getting some of that. She turned and said \"I hope you like what you see.\" I could feel the heat on my face as I turned red with embarrassment at being caught staring. Then she said, \"Don't be embarrassed I like that you looked. It gives me hope.\" Then she turned and left. I walked to the window to calm down. A few moments later Janie said \n\n\"Ginger will be right up she's transferring a call up from a Mrs. Marsh. I'm going back to my office now. Before I get us both in trouble.\" The phone started ringing Janie answered it. \"Mrs. Marsh on one bye now.\" I waved bye as I picked up the phone. \n\n\"Jenny what going on.\"\n\n\"You tell me I get put on hold then transfer to some VP's office and then you answer the phone.\" I thought I'd have a little fun with her. \n\n\"I'll have you know your talking to the vice president in charge of systems information and procurement. You should be in awe.\"\n\n\"Well la di da you still take your panties off the same way we all do wet and sticky.\" We both laughed. \"No really that's great I'm happy for you. Pam said that she had a designer coming over to your place at two today. I said we should meet there. What time can you get off madam vice president?\" \n\n\"I could be off in and hour I can't do anything till I get my stuff moved up here.\" I told her\n\n\"I'll meet you at your place in an hour and a half dress comfortable it maybe a long night.\" We hung up just a Ginger arrived. \n\n\"Mrs. Macon let me explain.\" I stopped her \n\n\"No need to explain I know you where under orders. I just wish you'd follow my orders the same way you followed Mr. Burns.\"\n\n\"I'm sure I don't know what you mean, I always follow your orders.\" She said taking a defensive stand. \n\n\"What about my order to call me Sheri and not Mrs. Macon?\" \n\n\"I sorry I do have a hard time doing that it's just my up bring. I will make you a deal.\"\n\n\"What kind of a deal?\"\n\n\"I'll call you Sheri when were alone but in front of others I have to call you Mrs. Macon.\" \n\n\"Good enough for me. Would you like to stay my secretary and move up here with me.\"\n\n\"Of cause I do. Do you think I want to brake in another department head after I finally have you straighter out.\" Then she paused and said. \"I'm really proud of you it almost makes me feel like.\" Then she stopped herself so I continued for her\n\n\"Like my mother the day I graduated from collage.\" She tried to put on her hard shell exterior but there was a crack in it and it melted away\n\n\"Yes that it exactly. Is that so bad?\" I took her in my arms and kissed cheek and said\n\n\"No and I love you for it.\" I held her for a few moments then said. \"We did pretty good for ourselves didn't we?\" \n\n\"Yes we did.\" She said as she looked around the office. Then the old Ginger was back. \"I think it's time that one of us gets back to work. You go home and celebrate and take tomorrow off. I'm under orders to see you start taking more time off. Meanwhile I'll get this office organized. I presume you want all your files and correspondence up here.\" \n\n\"Yes and all my personnel stuff too. And if you would pull all the personnel files on my staff I need to pick a replacement.\" ",
        "\"Ok you'll have to do both jobs till you pick one. You should plan on being off Fridays for at lease the next month. That will eat into the vacation. You do know that when you became VP. You went from two weeks a year to four weeks a year. That's why Fred wants you to take more time off.\" \n\n\"I didn't know that. What else do I get?\" I didn't know VP made out so well.\n\n\"I'll find out from Janie and type up a sheet for you now go home and celebrate.\"\n\nI arrived home forty-five minutes later. Pam was there to greet me at the door. She said. \"Oh good the designer is here. He wants to know what kind of wood you like. Come on up and meet him.\" We went up stairs and found Jon in the sewing room \"Jon this is Mrs. Macon the owner.\" We shook hands then he said\n\n\"As I was telling Pamela. Depending on what kind of wood you would like will give us an idea on how long it will take to complete the job. Would you like all real wood or all laminated particleboard or a mixture? Judging the expense of the home you should go with plywood boxes and real wood doors and draws. At lease that's what I would do, someday you might want to sell the home and you'll get more with a better cabinetry.\" \n\n\"What I want is to open this room to the walk in closet in the master bed room. Plywood boxes and real wood doors and drawers will be fine. But the drawers should be dovetailed. The finish should be white enamel that should eliminate any exotic woods but it should be durable. I want lots of hanging space for dresses and suits and storage space for things we only use once in a while and I want space for shoes a lot of shoes.\" I waited while Jon wrote done what I had said. Then he asked\n\n\"What kind of lighting.\" \n\n\"I want it bright but I'd like to be able to turn it down I don't want fluorescents light their to harsh. Jon I want a dream closet one that your wife or mother would love. Build me a dream closet. Can you do that?\"\n\n\"I can. I can build you a closet that is fit for the queen of England. The only question I have is how much money can you spend.\" \n\n\"Jon you come up with some drawings and a estimate and well go from there. How long will that take.\" \n\n\"I can have the drawings by Friday will that be soon enough.\n\n\"Friday will be soon enough. But remember dream closet.\" \n\n\"Mrs. Macon it's so nice to meet some one that knows what she want and isn't afraid to ask for it.\" We shook hands and Jon took his measurements thirty minutes later he left. After he left I changed into a pair of shorts and a pullover V neck sweater and a pair of running shoes. I asked Pam\n\n\"Did you bring anything causal to wear?\"\n\n\"No I didn't know we would be going shopping.\" I called Jenny on her cell. She was already home I asked if she had any thing for Pam to wear. She asked her size and said no problem. Jenny came over with a pair of shorts and a tee shirt and shoes for Pam to wear. I asked \n\n\"Are you two the same size?\"\n\n\"No but Ginger and her are. I just brought something of hers.\" I asked Jenny for the number to the law offices and called Bill\n\n\"Honey, I have tomorrow off and Friday as well. They want me to start taking my vacation days. Can I go to Atlanta and bring Pam with me for some cloths shopping?\"\n\n\"I guess so but don't spend to much of Pam's money. We don't know how much she has.\"\n\n\"Would it be ok if I paid for most of her things. I want her to look good for you and the firm.\" \n\n\"I don't see anything wrong with that.\"\n\n\"Ok love I see you later tonight oh we might be late can you eat with Jim Jenny will be with us.\" \n\n\"No problem I see you later tonight.\" I hung up and turned to Jenny she didn't look too happy.\n\n\"What's this you're going to Atlanta and you weren't going to tell me?\"\n\n\"Oh I was going to ask you to come. I just wanted to make sure I could get Pam off first. You know I'd never go shopping with out asking you.\" I said extremely coyly\n\n\"Don't turn that little girl shit on me I don't buy it. Bill may but I don't\" I took her in my arms and nuzzled her neck and said\n\n\"You believe me don't you lover. I'd never go shopping with out asking you to come.\"\n\n\"Sheri I love you, but you are shameless. What time are we leaving?\" I kissed her neck and said\n\n\"I though we could leave at nine and hit the stores when they open.\" Then she asked\n\n\"Then why are we going tonight?\"\n\n\"Because I'm in the mood to go shopping and tomorrow is to long of a wait.\" \n\n\"Good enough reason for me. Where's Pam?\" as if on queue Pam walked in \n\n\"I can't wear this the shirt's too short and the shorts are too tight.\" She looked pretty good to me her midriff was exposed the shorts where tight except for the panty lines they looked great. Jenny told her\n\n\"You shouldn't be wearing those kind of panties with them and the bra has to go.\" \n\n\"I can't go with out underwear.\" Pam stated \n\n\"Yes you can and you will. Go take them off and put your hair in a pony tail.\" I told her \n\n\"Sheri I\" The look I gave her stopped her short \"Yes Mistress.\" Pam went back up stairs.\n\n\"Well you seem to have her in hand. Maybe you should be come a professional Dominatrix. \n\n\"I don't think so. I rather be a VP I can tell more people what to do.\" \n\n\"Have you told Bill yet?\"\n\n\"No except for the people at work your the only one that knows so don't say anything.\" She said she wouldn't then Pam came back down looking even prettier then she did earlier. With her hair in a ponytail she looked younger. \"Wow you look hot. Doesn't she Jen.\" \n\n\"I'll say, were going to have to beat the guy's off with a stick.\" \n\n\"I feel naked without underwear on.\" Pam said\n\n\"You'll get use to it. Come grab your purses and let's get going. Where do you want to go first?\" \n\n\"The Mall. Victoria's Secret. Then to some of the other stores in the mall and tomorrow we'll go to Atlanta.\" This last part I told to Pam \n\n\"I have to go to work tomorrow.\" Pam said\n\n\"Not any more you don't Bill gave you the day off to go shopping with Jenny and me so just enjoy it.\" \n\n\"I'm not that good at shopping. It's never been that good of an experience for me, the sales girls intimidate Me.\" she informed us as if we didn't know it. \n\n\"Don't worry Jenny and I do the intimidating so you just have fun.\"\n\n\"Is Patty here?\" I asked once we arrived at Victoria's Secret. Patty came over and said\n\n\"I remember you. Ready to buy some eye candy?\"\n\n\"I sure am but it's for my friend here. We need lot's of panties and bra and camisoles, garters stocking nighties and what ever else you can show her.\" Pam held a basket while we loaded her up. Once we got every thing we where looking for I gave Pam a thong and bra set pulled the price tags off and told her to go put them on. She ran into the changing room. I paid for everything with my charge card. When Pam came out I asked, \"Feel better now.\"\n\n\"Yes thank you. My bottom still feels naked but my breast don't swing as much.\" Patty sacked up everything and we said goodbye. I knew she was happy with the commission on a five hundred dollar sale. We stopped and bought a few dresses at one of the better clothing stores. Nothing to extravagant put definitely high-end stuff. Pam said at this point\n\n\"I can't afforded this much on cloths yet.\" \n\n\"Pamie I told you yesterday that I'll pay for what I want you to wear any thing you want to get you pay for. I want you to look good at work. Appearance is every thing. Isn't that right Jenny?\"\n\n\"Definitely cloths are the first impression a client gets. Some times the only impression.\"\n\nThen we bought some shorts and tees and sweaters and shoes. After we hit all the good stores and some of the not so good ones. I said \n\n\"Well I think that's about it for this evening. Let's get some thing to eat and go home.\" Pam said \n\n\"Sounds good to me my feet are killing me.\" \n\nWe stopped at a restaurant for dinner then I dropped Jenny off then went home. Bill helped us carry everything in. After he helped Pam carry everything up stairs he asked me \n\n\"Are you sure you need to go to Atlanta tomorrow.\" \n\n\"I'd like too is there a problem?\" \n\n\"Well Pam is worried you're spending to much on her.\" \n\n\"Bill I'm really in a good mood. I feel like spending some money. I have more cloths than I need and she could use a better wardrobe. Please have her come down here.\" Bill called Pam down once she was there I said\n\n\"Pam I'm really in a good mood and I'd like to tell you both why. You are looking at the new Vice President of Information Systems and Systems Procurement\" Bill looked at me stunned then said \n\n\"That's great honey. This calls of some champagne.\" Bill gave me a hug and said. \"Wow VP at thirty that's a hell of accomplishment. I'm so proud of you. I always said your the best this just proves it.\" Bill went to get the champagne. I turned to Pam \n\n\"Pam honey come here and sit next to me.\" Pam did as she was asked I took her hands in mine and said \"Pam when I get in this kind of a mood I need to do something and shopping seems to be the thing for me to do. I can't shop for my self because I already own more cloths then some small countries. And you looked so good yesterday and the this morning you looked so different I just want you to look good all the time.\"\n\n\"What happens next Sunday and you decide you don't want me anymore.\"\n\n\"If that happens which I doubt or if you decide you don't want to be here anymore then you can go I'm not going to ask you to pay me back.\" \n\n\"Its not that. Actually I just not use to someone being nice to me for no reason\"\n\n\"Pamie there is a reason you your a really nice person and I want to make you a pretty person too.\" \n\n\"If you're sure and that it's ok with Bill.\" \n\n\"Ask Bill yourself if it's ok. I did before we went to the stores tonight.\" Bill came in with champagne and handing us each a glass he said\n\n\"To the best wife and mistress anyone could hope for.\" I got up and said\n\n\"Thank you love of my life. I'm going to leave the room for a minute and Pam's going to ask you a few questions. I want you to answer them truthfully and not to worry what I have said to her.\" I left to go to the bathroom. When I came back Pam said\n\n\"Bill said that he knows your only doing this for fun and I should just enjoy it. He also say's I should think of it as a severance package from him and you for going from one job to another. I just don't want you going broke doing it.\" I took her in my arms and said \n\n\"Honey there's not a chance in that. I'd have to build a new house to fit that many cloths in it\" Then I said. \"If all this serious talk is done with. I would like to start some serious sex games.\" Looking at Pam I said \"how about I start teaching you how to deep throat a cock. I have a nice strap on that I taught Bill to deep throat on.\" \n\n\"If that's what my mistress wants to do who am I to say no.\" Then she asked, \"Can you really deep throat Bill's cock?\"\n\n\"Sweetie I would never ask you to do something I couldn't or wouldn't do myself. Would you like to see me do it?\" she nodded her head sweetly. \"Do you want to hear me ask a really stupid question?\" She looked at me confused. \"Bill can I demonstrate my talents on you.\" \n\n\"It would be my honor to assist you in this demonstration\" He said a little too readily. \n\n\"See what I mean stupid question. Any man whether straight bi or gay loves getting a blow job.\"\n\nI had Bill stand up. I unbuckled his belt and unsnapped his pants and let them fall to the floor. I pulled down his pink satin panties as I knelt in front of him. I had Pamie knee beside me. His cock hung softly with no signs of getting hard. I hope he was demonstrating his ability to control his erection. So I said to Pam \n\n\"Since Bill can't get a hard on we'll have to go out and find someone who can.\" Then Bill's cock started to swell. \"Oh never mind Bill's got the idea now. Now remember you want to get it as wet as you can. I mean you have to use a lot of saliva.\" \n\nI took Bill's cock into my mouth and started getting it wet which was easy for me because my mouth naturally produces saliva when I'm sucking his cock. I worked down on his cock till it hit my throat. Then I ran my tongue around it, which is not real easy do to his size. I looked up at him and looked into his eyes and ran my mouth up and down his length then pulled it from my mouth. \"See how wet it is, Pam. It's almost ready to enter my throat. And remember to make eye contact with him, guys just love that. But don't try and do it all the time it's too hard.\" \n\nI put Bill's cock back in my mouth and slid my mouth down his cock. I relaxed my gag reflex and let it pass into my throat. Just the head passed though. I could hear Bill groan with pleasure as it did. As I started working my mouth up and down Bill's cock I felt Pam move closer to me. I felt her breast touch my arm and her hand on my bottom. I love when someone's hand rubs my bottom and the way Pam was doing it was really nice she wasn't groping it. She was just running her hand over it and her finger was tracing the crack up and down it really was very pleasant. \n\nI kept working more and more cock into my mouth till my lips bottomed out on his shaft. I heard a small gasp from Pam and a groan from Bill. I look up at Bill and I could see he was really enjoying the pleasure of my mouth. His eyes were closed and he had a smile of pure joy on his lips. I took his balls in my hand and gave them a squeeze. Not to hard, just enough to get his attention. As my lips continued to milk his cock I felt his balls pull up and his cock swelled I knew he was close. He looked down at me and his eyes pleaded with me to let him cum. I shook my head no and pulled his balls down away from his body. Bill groaned and his legs shook as he tried to hold off cumming. \n\nWe both knew he would but I wanted him to do it with out permission. I ran my mouth all the way down his cock and swallowed once. I heard him groan loudly and then I swallowed again. Bill legs shook violently and as his cock expanded once more. I swallowed a third time. If he didn't cum this time I would have to back off. \n\nThe third time was the clincher as Bill's knees buckled and he swore. His cock jumped in my mouth as it fired his load into my throat. I pulled back just keeping the head in my mouth as my hand pumped his load into my mouth. He kept firing squirt after squirt of hot delicious cum into my mouth. I swallowed each time he fired another load into me. My tongue savored each load of thick salty-sweet cum before it was swallowed down my throat.\n\nAs his cock slowed it's firing I squeezed his balls and suck his cock head hard to try and get every last drop of cum from him. My obsessive need to tasted Bill's cum was too much for him. His legs refused to hold his weight any longer as he fell to his knees pulling his cock from my mouth with a loud pop. He knelt in front of me gasping for breath his shirt was soaked with sweat as his cock shrunk to a flaccid state. Tuning to Pam I said.\n\n\"That's how you suck cock.\" That's when I saw what she was doing. Her shorts were undone and she had a hand down her panties and was fingering herself. Bill's transgression of cumming with out permission, I could over look. After all he really didn't have a choice. But Pam masturbating herself, I took as a lack of respect to me. I said to her in the sternest voice I could muster. \"Didn't I say tell you not to touch yourself with out my permission.\" \n\n\"Yes Mistress. But I couldn't help my self it was the sexiest thing I ever saw.\" She said as she pulled her hand from her panties.\n\n\"Well you two are going to have to be punished. Bill for cumming when I told him not to and you Pam for playing with you self with out permission.\" Bill looked at me as I said this he knew I was right but you could see he thought I was being too harsh. But I could also see a gleam in his eye. He wanted to be punished. \"I want the both of you in my bedroom dressed only in your underwear.\" They both jumped up and holding their cloths together and scurried up stairs. \n\nI was in a randy mood tonight I was feeling very dominate. I don't know if it was because of the promotion or I was really horny. But all day I wanted to tell people what to do. Gabbing a bottle of wine from the cooler and three clean glasses. I when upstairs to punish my slaves. \n\nI walked into the bedroom and found both my slaves standing next to the bed. Pam was physically shaking not sure what I was going to do and Bill had his eyes down to the floor. I put the wine and glasses on my dresser. Opening the top draw I removed the penis gage wrist cuffs and the riding crop placing them on the dresser I started lighting candles. \n\n\"Bill I believe I still owe you three lashes with crop for dropping the ball when you where learning to walk in heels. Am I correct.\"\n\n\"Yes Mistress.\" He said \n\n\"Kneel both of you.\" They both dropped to their knees. Pam looked like she was going to cry at any moment. I walked over to them with the penis gag. I pulled Pam's chin up so she could look at me before I said \"Pam I don't like hurting you or Bill for that matter but I did tell you not to touch yourself down there. Didn't I?\" She nodded her head. \"I'll go easy on you this time only three lashes with the crop. But it better not happen again. I give you enough sexual satisfaction that you shouldn't need to masturbate with out permission.\" \n\nTurning to Bill I said, \"Go get a ice bucket half filled with ice.\" Bill left to do as he was told I took the gag and told Pam to open her mouth. After getting it in her mouth and securing it behind her head I told her to stand. Moving her to the end of the bed I secured her wrists to the footboard and said \n\n\"The gag is so the neighbors don't hear you scream and the restraints are so you don't get your hands in the way.\" As I took the crop from the dresser Bill came back. I told him to fill the bucket with some water and to get a clean washcloth. I had him immerse the cloth in the water then I walked over to Pam, tears were already running down her face. After looking at her I didn't want to do it but I knew I had to. \n\nRaising my arm about half way back I let the first lash fly. The first lash landed on her right cheek with a load crack. It sounded worse then it really was. Pam screamed into her gage. The second one landed on the left cheek. Again Pam howled. I was sure I was hurting her. I was just hoping that it wasn't that bad. The third one landed so that the stem hit both cheeks at the same time. Causing a long welt to form across both cheeks. That one must of stung more than the other two it just about dropped her to her knees. Tears where flowing freely from her now. I turn to Bill and signaled that he should apply the cloth to her bottom. I dropped the crop on the bed and removed the wrist cuffs and then the gag. Taking her into my arms I said.\n\n\"There, there it's all over now.\" she collapsed on to me as she cried. My hand moved down to her pussy. I was checking to see if she was excited the way that Bill had gotten. Her pussy was soaking wet with her juices. When my finger touched her clit she came moaning in my ear. Her body shook as she drenched my hand with her cum. Once her orgasm had subsided Pam fell to her knees and said\n\n\"Thank you Mistress for punishing me and bringing me to orgasm.\" I couldn't believe that she was thanking me for punishing her. The only thing I could think to say was\n\n\"Thank me by not making me do it again. I really don't like doing this. I don't want to cause you pain.\" Then I told her \"Go fill the tub and put bubble bath in the water. It's time for Bill to receive his punishment.\" \n\nBill already had the wrist cuffs on and was holding the gag. I told him to kneel and I put the gag in his mouth. I knew he like to be whipped, the last time he came while I was whipping him. I was pretty sure he wasn't going to this time mostly because he had just came less than an hour ago and that one was pretty strong. And this time his cock wasn't going to be rubbing against the ottoman. Securing his wrist to the footboard I said \"I don't think you'll be cumming this time. Now how many do you deserve?\" I knew he couldn't answer me I just wanted to scare him a little. \"Five? Ten? Fifteen?\" His eyes got really big when I said fifteen I was really enjoying teasing him this way. I could see he was getting a little nervous now. That was more like it. \"I'll tell you what I'll whip you till I get tired. Ok?\" ",
        "Bill was really getting nervous now beads of sweat were forming on his forehead. I called for Pam. When she appeared by the bathroom door I said. \"I want you to watch this. The tub will take a while to fill. When I tell you apply the wash cloth from the ice bucket to his bottom.\" \n\nI quickly haled back and let the first one fly. Bill wasn't expecting it. He jumped away from it but it did little good. The next four where on alternating cheeks but they didn't seem to hurt him as much as they did Pam. What good was whipping someone if they didn't seem to feel it? The sixth lash, I hit him with the shaft of the crop instead of the tip. That got his attention pretty darn quick. I heard him cry out into the gag. The seventh and eighth lash he received the same way. Now he was crying too I could see the tears running down his face. I stopped there I didn't want to cause him any permanent damage. Signaling to Pam she took the washcloth and cooled down his bottom. I released the restraints then he removed the gag. \n\nSeeing Bill's hard on I realized how wet my pussy was and how horny I was. I walked over to the side of the bed and said to Bill as I got on the bed on my hands and knees \"Fuck me Bill.\" He didn't need any more than that. Bill moved behind me and put the head of his cock to the mouth of my cunt and started slowly pushing it into me. I was having none of that I pushed back taking it all of his cock into me in one push. Bill took over from there as he started pounding his cock into me. He knew what I wanted; I wanted to be ridden hard. Looking over to the bathroom I saw Pam watching us I got an idea. \n\nWaving Pam over to the bed. When she got there I pointed under me. She figured out what I wanted and slid under me. I felt her tongue start licking me, and then I heard Bill moan I figured that she was licking him as well. Then I smelled her cunt. Her scent was strong from her last orgasm. I pulled her pussy to my lips and started licking her. She trembled at the first touch of my tongue. Bill's pounding and her mouth were bringing me closer to orgasm. I knew I wasn't far off; all the excitement of the day had me on an emotional high. I concentrated my efforts on Pam's clit sucking it and rubbing my teeth over it. She started to push her pussy into my mouth. I could hear Pam moan as she attacked my clit with her tongue. Bill was groaning on each stroke as he bottomed out in me. My cunt was on fire, my juices where flowing from me and I knew that Pam was catching most of it in her mouth. I felt the tingling in my toes pulling my mouth from Pam's pussy I said.\n\n\"I'm cumming Bill, cum with me, both of you.\" I started to suck Pam's clit harder as she worked her tongue over my clit and Bill picked up the pace slamming his hard fat cock into me even faster. The tingling moved rapidly to my cunt as I came with a gut wrenching spasm. Pam's legs tensed up as she shoved her cunt into my face and came with the same intensity as I was. Bill groaned loudly as he shoved his cock all the way up inside of me and sprayed my insides with hot thick cum. His jerking cock caused a ripple affect in me giving me an over whelming orgasm. I rolled over on to my back dislodging Bill's cock from me. I felt his cum pour from me as I laid there panting for air.\n\nThen I felt someone licking up the cum as it poured out of me. I really didn't care who was doing it. I looked over to where I left Pam and saw her laying there panting for air as I was. So I figured that it had to be Bill doing the cleaning. How he had the energy to perform the task was beyond me. Maybe he was just afraid Pam would beat him to it. \n\n\"Oh god the tub.\" Pam said as she jumped from the bed and staggered to the bathroom using the wall for support. Moments later she came back to the bedroom and said, \"Your bath is ready.\" I looked down between my legs and I could see Bill busy licking up his cum I said\n\n\"Bill would you like me to roll over.\" \n\n\"No if you could just stand up over me,\" he said as he looked up at me. I agreed and with out taking his mouth from my pussy I stood up over his face as the rest of his cum flowed out of me. He must of cumed a bucket full with all that had drained out of me. Once I couldn't feel any more drain from me I stepped back and allowed him to stand. Taking his hand I walked to the bathroom. \n\nIn the bathroom I saw that Pam had lit every candle I had in there and had turned off the lights. It was very romantic with the candlelight and the bubbles in the tub. I sat on the side of the tub and swung my legs over and slid into the warm silky water. Scented bubbles flowed up around me as I relaxed. Turning to Pam I said \"Before you two get in would you please clean Bill's cock off I don't want him getting in with a cummy cock.\" Pam when to her knees and sucked and licked Bill's cock clean. Once done she asked \n\n\"Is there any thing else I could do for you?\" \n\n\"In the right hand draw of the vanity you'll find a small flowered bag and on the right hand side of the medicine cabinet you'll find a can of gel shaving cream. Would you bring them to me?\" I said. Pam got me the things I had asked for then I told both of them to get in to the tub with me. After soaking for a while I stood up and took a towel from the rack and laid it on the edge of the tub and sat on it. I took the gel and applied it to my left leg and the started to shave it off.\n\n\"May I do that for you Mistress?\" Pam asked. Shaving my legs was something I could do for myself. But she looked so hope full that I allowed her to do it for me. I never realized that the simple act of having my legs shaved could be such an erotic act when someone else was doing it for me. When she was done with my legs I had her do my pubic area as well. Once she was finished cleaning all the hair from between my legs she looked up at me and asked, \"My I kiss you Mistress?\" I nodded my head and she kissed my pussy in a very reverent way. Then she moved away as I slid back into the water. I pulled her to me and kissed her on the lips and thanked her. Then she said. \n\n\"I noticed that your toes needed touching up I could do that for you later.\" I told her I'd let her know. I didn't want Bill to get jealous of her attention to me; she was getting very emotionally attached to me. I wasn't sure how he was handling it. \n\nAfter we soaked in he tub for a while I rinsed off in the shower. I love the tub but I never feel clean afterwards. Once dry and I put on my nightgown I said to Pam. \"Some nights your going to sleep in the spare bedroom and this is one of those nights.\" She look rejected but said yes mistress and left the bedroom. When she was gone I asked Bill. \"Was I to harsh to her?\"\n\n\"I don't think so.\" I still couldn't read Bill's thoughts on how he felt towards her. I knew he liked her, but I wanted to know if he was jealous of her. \n\n\"Bill, how do you feel toward Pam? She seems to be pretty attached to me almost like I was her lover.\n\n\"You are her lover and her Mistress. You are mine as well and my wife.\" \n\n\"I know that but how do you feel about her? Are you jealous of her?\"\n\n\"Jealous of her no I'm not jealous of her. I'm jealous of the fact that she got to shave you and I didn't, but I never realized that was such an erotic act. Her hands were shaking as she was doing it. I'm sorry I never thought of doing it for you.\" He said \n\n\"It was pretty sensual. I've been shaving my legs since I was thirteen but when she did it was more like a act of \" \n\n\"Love.\" Bill said to finish my statement.\n\n\"That's it exactly an act of love.\" I said as I laid down on the bed. Bill laid down next to me and said \n\n\"I've come to realize that Pam was looking for some one who would take control of her life. She has an inner need to be controlled. I on the other hand do things to make you happy. I didn't tell you about my needs to dress in women's cloths and my desire to have sex with men because I didn't want to take the chance of losing you. I am submissive to you because I love you so much. Pam is a true submissive she needs to be told what to do. She was so upset today because you said that her cloths where all wrong for her that she was crying when I came down after you left. Because she thought you were displeased with her. She thought you where going to turn her away. It took me a half hour to calm her down. She needs you or some one like you to feel whole.\" \n\n\"So I shouldn't be worried that you won't like the attention I give her or she gives me. She was supposed to be your lover not mine.\"\n\n\"I am her lover. I love fucking her and she loves it too, but your her Mistress she wants and needs your approval. If you told her right now to strip down and walk down town she'd do to because you asked her too. I know she wants to be able to deep throat me only because you said that she needed to learn how to do it. So I'm sure some day soon she'll be able to do it as good if not better than you.\"\n\n\"Is that a challenge?\" I asked \n\n\"No there's isn't a challenge involved. She'll get good at it because she wants to please you. You're good at it to please me. You do it for love and she'll do it because she wants your respect.\"\n\nI understood what he was saying once he explained it to me I could see where she did need some one. In the stores today she was like a child in the way she did every thing to please me. Always deferring to my choices no matter how provocative they maybe. I did like the control I had over her. I made up my mind to see how far I could push her to find her limits. I asked Bill to make love to me. He knew what I was looking for not the sex that we had been having for the past two weeks. Not the high-energy sex but the kind that goes on for an hour or so till both partners are satisfied. And I really mean satisfied. When we where done I fell asleep in his arms with him still inside me. \n\nThe next morning I awoke feeling wonderful. I was happy that I had married such a wonderful man that knew what I wanted when I wanted it. Bill came into the bedroom in a navy blue suit with a red power tie on. There's only one thing sexier that a well dressed man and that's a well-dressed woman. But I'll take this man any day. \n\n\"Good morning sweetheart did you sleep well.\" Bill asked as he sat on the bed to kiss me. \n\n\"I slept extremely well. In fact I haven't been this rested in weeks. How did you sleep?\"\n\n\"Like the dead. In fact I was still in you when I woke up this morning. It was a wonderful way to wake up.\"\n\n\"You should have woken me we could have enjoyed each other again.\" I said \n\n\"I thought about it but I was already late for work. I'm sorry maybe next time.\"\n\n\"Your the boss now you don't always have to be on time you know.\" \n\n\"I know but give me a few weeks to see how the office runs and how strict Jim wants us to keep to the time schedule.\" \n\n\"I guess I'll get in the shower then. Is Pam awake yet.\" I asked \n\n\"I don't think she slept very well last night. She looks a little rough around the edges. I think the fact that you punished her and then banished her from the bedroom. Was a little too much for her.\"\n\n\"I didn't banish her I just said that there where nights that she'd have to sleep in the spare bedroom.\" I said defending myself \n\n\"Yes, but that combined with the punishment played on her mind.\" \n\n\"Mistress I have your coffee.\" Pam said from the hallway. \n\n\"Come in sweetie.\" I said trying to take a soft tone with her. Bill gave me a wink understanding what I was doing. Pam came holding the coffee cup with both hands I could still see it shake. She looked like she hadn't slept all night. She must have just woken up with enough time to fix breakfast and start the coffee. I could see she hadn't showered yet. She handed me the cup and went to leave when I said. \"Honey come and sit next to me \" Bill stood to let Pam sit. Taking her hands in mine I said. \"Sweetie making you sleep in the spare bedroom last night wasn't to punish you it was so Bill and I could make love like married couples do sometimes not because I didn't want you here. I hope you understand that?\" I could see the relief in her eyes; I could almost see a tear forming. \"You haven't showered yet have you?\" She shook her head no. \"Then we can do it together. Go get it ready and I'll be right in.\" Pam jump to the task. \"Was that ok?\" I asked Bill \n\n\"I would have to say it was perfect. She seemed to understand. You girls are going to be late tonight I take it.\" \n\n\"Most likely. Can you and Jim make out alright by yourselves?\"\n\n\"Make out that sounds like a invitation.\" Bill said jokingly \n\n\"Bill if the two you want to do something together you don't have to have my permission. You are free to enjoy yourself when ever you want, even with Pam. I know I said you couldn't but I thought better of that. I want you to enjoy yourself too. I don't want this to be a one way street.\" \n\n\"I was going to ask you about that. I just did know how to bring it up.\" \n\n\"Now you don't have to. So you two have a good time tonight I'll see you when I get home.\" I kissed Bill goodbye and went to take my shower. After we showered Pam asked\n\n\"Is there any thing special you want me to wear?\" I thought for a moment and said \n\n\"We go real causally because we do a lot of changing. The lavender smock dress the short one and your tennis shoes with anklets. The purple t hong and the matching bra should be good the dress will be easier to take on and off. And the thong will not show any panties line.\" I also wore a short dress and tennis shoes with anklets but I didn't wear panties or a bra. I knew Jenny would like that. After I put on some make up and earrings I went down stairs to get some more coffee when the doorbell rang. I let Jenny in. \n\n\"Ready to go.\" She asked\n\n\"Not yet I need some more coffee. Do you want some?\"\n\n\"Yea, so where do you want to go to today? Where's Pam?\"\n\n\"She's still getting ready. I think most of the places we went the last time.\" Jenny came over and kissed me. Our tongues battled as she ran her hands over my breast and then down under my skirt and between my legs. \n\n\"Braless and panty less very nice.\" She said as she popped open a button and felt inside for my breast. We kissed again as my hand went up her tee shirt to caress her breast. Pulling my mouth from hers I asked\n\n\"Do you know any good adult clothing stores we can go to?\" \n\n\"What are you looking for?\"\n\n\"Some place that deals in slave and dominatrix wear.\" I told her.\n\n\"Well your going whole hog on this aren't you? I know a few places but only one I would recommend. Let me make a call to see if Jackie will be in today.\" When Jenny went to the phone I notice Pam peeking in from the hallway. I waved her in. I knew she had seen Jenny and I making out so there was nothing to do about that. She was wearing what I suggested. Her hair was done up in a French braid she was so pretty with her hair like that.\n\n\"Pam your hair looks wonderful, you should wear it like that more often especially too the office. Much better than that bun you had yesterday.\" I could see she was pleased by my remarks. I saw the look Jenny shot at me she knew that Pam had seen us too and looked a little worried \"Honey what you just saw here must never be told to anyone at the office.\" I told Pam\n\n\"Don't worry I'll never say anything not even to Jim or Bill.\" I almost laughed at her innocents. Jenny hung up the phone and said to Pam\n\n\"Pam sweetie Jim and Bill know. We just don't want any one in the office to know. It's none of their business. And we don't want Jim's mother to know if you ever meet her.\" \n\n\"Please don't worry I know how to keep a secret. No one will ever hear it from me.\" Pam said I believed her I think Jenny did too\n\n\"Pam, Sheri and I are lovers and maybe some day with Sheri's permission you and I can be lovers too.\" Jenny told her. She was opening the door to bring Pam into our circle.\n\n\"I'd like that you're very pretty.\" She said as Jenny kissed her on the lips. I sat down to drink my coffee when Jenny said \n\n\"Well are we ready to go?\" \n\n\"Not till I get two more cups in me.\" Jenny huffed and sat down next to me with her cup. When Pam sat down both Jenny and I could see the pain in her face. Jenny looked at me as if to ask what was going on. I said\n\n\"Pam and Bill where very bad yesterday and I had to punish them.\" Being as curious as she is Jenny asked \n\n\"What did they do to deserve punishment?\" Looking at Pam I said \n\n\"You should tell her.\" Pam look down to her lap and said in a whisper\n\n\"I was playing with myself with out permission. I received three lashes from Mistress's riding crop.\" Jenny looked concerned and asked\n\n\"She didn't break the skin did she?\"\n\n\"No it's just sore when I sit.\" I could see that Jenny wanted to look. \n\n\"Pam stand and turn around so I can check to see if I hurt you worse then I thought.\" I ordered. Pam stood and turned around and raised her skirt. There were three bruise on her bottom. But nothing to worry about. \"You'll be okay Pam, go get your purse we'll be leaving soon.\" She dropped her skirt and when upstairs.\n\n\"You have her under control. Did you need to whip her wouldn't a paddle work just as well?\" Jenny asked. She was showing genuine concern for her.\n\n\"I could have if I had one. All I have is the whip that was suppose to be a prop more than anything else.\" I said in my own defense. \n\n\"Since we're going to Shackle's any way you should pick up a paddle there. Those whips can be murder on skin as soft as hers. Jackie will be in from noon till nine so we should go there last.\" \n\n\"That's fine. You know your making me feel worse then I already did?\"\n\n\"Good you should feel bad that had to hurt. What did you do miss on one and hit her with the shaft?\"\n\n\"Yea that must have really stung.\" I really felt bad now.\n\n\"Ok I'm sorry for making you feel bad I know it hurts you as much as it does them to do it. We'll get you a good paddle that won't cause any damage but will let them know they misbehaved. What did Bill do?\"\n\n\"He came with out permission. While I was sucking his cock. But he likes getting the whip.\" \n\n\"Boy you're a hard one. Remind me not to piss you off. Who's car are we taking?\"\n\n\"Yours, if you don't mind I like the dark windows?\"\n\n\"Good so do I. Now where is Pam?\" \n\n\"I'm right here in the hall.\" \n\n\"What are you doing out there?\" I asked \n\n\"I didn't want to interrupt you conversation. So I waited out here.\" She said looking into the kitchen from the door way\n\n\"Don't do that, you just come on in. If we didn't want you to hear what we were saying I'd ask you to leave the room.\" I told her \"Well let's get going.\" \n\nThe drive up to Atlanta was not to spectacular We shopped at the same stores that Jenny and I shopped at last week We stopped at the same food court for lunch. While Pam went to the bathroom I asked Jenny.\n\n\"Are you still having that party on Friday.\" \n\n\"Yep are ya'll coming.\" She asked \n\n\"I'd like to. I would like to bring Pam too if that's ok.\" I asked\n\n\"That I'll have to ask Jim about. He may want to wait till he sees how she behaves in the office.\" \n\n\"Is there a theme this time or just a come as you are party?\"\n\n\"You know Ginger there's always a theme. Friday it will be a costume party. And Bill dressing up in a dress is not a costume.\" I thought for a moment then Jenny said, \"What do you have cooking in that brain of yours?\"\n\n\"What are you talking about?\" I asked in a coy voice \n\n\"Oh don't give me that. I saw that smile on your lips.\" \n\n\"I was just thinking I could come as a dominatrix with her one or two slaves in tow. Depending on how Jim feels about Pam.\" I told her \n\n\"You could do that or you could do that on Saturday. And we could go to Dominators here in Atlanta and spend the night in hotel. I'm sure Sandy and Cheryl will love to come I know Jim's been itching to go for some time.\" \n\n\"Is that another private club like Bender's?\" I asked ",
        "\"Yea it's a S&M club. You may learn a few things there. It's a great place to watch too, you don't have to do anything. The only thing is you should never touch some else's slave unless you have permission or they are unruly and question your authority. You'll need a collar for each of your slaves with your name on them, to show ownership. Any slave with out one is open game for the master domi. And as a Domi if you show any submissiveness to a slave of his he'll have you tied to a pommel horse and have you fuck by a slave. So you have to be strong when they question your superiority. And if they do question you that's being unruly and you can do as you please. Just so long as you don't draw blood.\"\n\n\"Sounds rough. But it also sounds like fun. I just hope I can take Pam with us. I don't want to leave her home two night in a row.\" I told her \n\n\"Why don't you go to the bathroom when she comes back. I'll see if I can find out what you three have been doing together. I'll see how readily she gives out information.\" I agreed to the plan. We chatted for a while till Pam came back. Then I left. I when to Spencer's to look around. After about twenty minutes I when back to the food court. When I sat back down I asked Pam to get me another diet soda. After she left I asked Jenny.\n\n\"Well what did you find out?\" Jenny looked at me and said\n\n\"Right now I don't know who's telling the truth. She says your renting her a room and when you walked into her bedroom you found her masturbating. You guys have never had sex together ever. That girl confounds me even when I know the truth she will twist it around to make it sound so innocent. Either she believes everything she been telling me or she can hide it very well.\" \n\n\"So I guess she passed your test.\" I asked\n\n\"Oh yea unless you guys aren't doing what I think you are. Which knowing you I can't see how you keep your hands off her.\" \n\nBy four o'clock we had filled Jenny's trunk and had several packages on the back seat. We decided to go to Shackle's. It was just what I had hope it would be. When you first walked in the first thing you saw was the tape selection and to the right the wall was cover with magazines. In the back was where they had the clothing. The smell of leather was over powering. Once you got use to that you could smell the latex. This place had more toys for adults then Toy's R Us had for kids. I wasn't sure if Pam had ever been to one of these stores before. Now the look on her face had told me she hadn't. She took a hold of my arm and didn't let go. Her hands were moist and clammy and I cold feel her tremble just slightly. A tall woman walk up to us she was wearing a pair of black leather pants that where open in the crotch area and her backside was exposed. Under those she was wearing black leather panties. On her feet where five-inch stiletto heeled boots that went up to her knees her top was a black leather vest with small chains holding it closed and that was all. She had raven red hair under a biker style hat.\n\n\"Jenny darling, Its so good to see you. And look what you have brought me.\" She walked up to me. I realized at that point how tall she really was I would have had to stand on my toes to suck her tit's. She continued. \"Some new slaves for me to take advantage of.\" I knew I'd have to stand my ground with her. I grabbed the hand that she was using to touch my ear and pulled it away from me and twisted it and said.\n\n\"She didn't and this one's mine\" I said nodding my head to Pam.\n\n\"Fiesty isn't she?\" She asked Jenny as she pulled her hand from mine. Then to me she said, \"You'll do well at Dominators.\"\n\n\"Jackie this is Sheri. A dear friend of mine, and this is Pam.\" Jenny said jumping in between us. \n\n\"From the looks of Sheri here, and knowing you she's more than a friend.\" Then she told us. \"I have to go to dinner right now ya'll can come along or you can stay here and shop. I have to get back before Jeremy comes in and Stu leaves. Stu can handle him self in the store but Jeremy will give it away to the first dominate person to walk in here. Jeremy's not good at sales but he makes a great model and I just love the noises he makes while I'm fucking him.\" Jackie was trying to intimidate me with her language. I wasn't intimidated that easily. I'm sure Pam was. \" I have to go change, the restaurants around here don't like it when I come in dressed like this. Talk it over and I'll be right back.\" Jenny turned to me and said\n\n\"You handled that well. I would have set her straight but you took care of it. Do you want to go for dinner or just stay here? We didn't have much for lunch and I'm getting hungry. How about you two.\"\n\n\"I could use something to eat and were not going to buy anything till she comes back so we might as well go with her.\" then turning to Pam I asked. \"Are you ok with that?\" \n\n\"I'm hungry, but she scares me.\" Pam said I could see she was frightened.\n\n\"Don't worry Pam she may tease you but she won't hurt you. Well only if you beg that is.\" I could hear a murmur come from Pam when Jenny said this. \"Ok we'll go eat with her and then shop.\" A few minutes later Jackie came back wearing a simple dress and tennis shoes.\n\n\"Are y'all coming or staying here?\"\n\n\"We'll come along where do you want to eat.\" Jenny answered\n\n\"There's a little Italian restaurant down the street that makes the best pizza. We'll have a couple pizzas and some beer and get silly.\" Jackie answered we walked down the street and into a restaurant. We where shown to a table. Once seated a boy around twenty came to the table to take our order. Jackie seemed to know him and said\n\n\"Hi Paul you haven't come to see me lately.\" \n\n\"I've been busy lately Miss.\" I could see he was scared of Jackie. \n\n\"Get us a pitcher of draft would you please.\" Jackie said flashing him a big smile. The boy melted. He turned tripped over a chair and dashed away. \"Does every one like sausage and pepperoni on their pizza?\" We all said yes then Paul came back with the beer and glasses. Once the beer was poured and the pizza was ordered Paul scurried off again. Jenny asked\n\n\"Jackie what did you do to that boy?\" Jackie giggled before she answered \n\n\"You know how I like my partners young? Well the two of us were flirting with each other for about a year. Just after he turned twenty-one; about a month ago he came into the store telling me how he was going to make me feel so good. That he had what I needed. You know the standard macho bullshit. I kept telling him how I like it rough and being in charge. He was saying he could do that if I would give him a chance. Well before he knew it I had him draped across a padded saw horse with a butt plug up his ass and I was standing in front of him with my strap on poised to enter his mouth. I asked him if he wanted to leave or be fucked like the man he was. He chose to leave. I released him he was out of the door like a shot, with the plug still up his ass. I wonder if he still has it. It's a shame too he really did have a nice piece of meat on him.\" \n\nPaul was obviously watching the table because as soon as the pitcher was empty he was there with another one. Once the pizza and the beer were done and Jackie asked for the bill. I made an attempt to pay till she said\n\n\"No I got it. If you come to buy I'll make it back in profit.\" She took out two twenties and wrote a note on a piece of paper and handed it to Paul as we left. Jenny asked \n\n\"What did you say in your note? That was a hell of a tip.\"\n\n\"I just said I was sorry if I hurt him and that if he wanted to try again to come on over. You never know he might have liked it, he just got scared. I had one that came back after a year begging me to train him. And like I said he was well equipped.\" Once back in her store and she got changed Jackie asked, \"What can I get for you?\" \n\n\"I was looking for some thing to wear to Dominator's and some thing for my two submissive.\" I said \n\n\"I presume that Pam is one of your submissive the way she clings to you. Your other male or female?\" I told her male. \"Is that male or she-male?\" \n\n\"I'm not sure just yet let's just say both and well see what happens,\" I said\n\n\"What material leather, vinyl, nylon or spandex?\"\n\n\"Leather for me.\" I turned to Pam \"Would you like leather vinyl or spandex?\"\n\n\"What ever you think is best but I would like leather if it's ok with you.\" I finally got a decision out of her. She must really want leather\n\n\"Leather for her and the same for my other one.\" We walked back to where Jackie kept the leather apparel then she asked\n\n\"Do you want leather panties? Satin or spandex are easier to clean. The kid skin leather feel much better but you have to know how to clean and oil leather.\" I looked at Pam I could see the excitement in her eyes then she said. \n\n\"I'll learn to how to clean them.\" \n\n\"Ok I'll get the leather one's but it's your job to keep them clean and soft.\" I said\n\n\"I will Mistress I promise.\" Jackie picked up two garter belts and the asked\n\n\"Thong or full panty?\" I told her both. She placed two set of them on the garters then asked. \"What type of bra exposed breast or covered? Or do you want a corset?\" Pam quickly said corset. I was stun that she was making these decisions. She obviously wanted this. Jackie handed a corset to Pam and a thong and told her to try them on. Pam looked at me to make sure it was all right I told her to go do it. After she was in the dressing room Jenny said.\n\n\"I think you found something she really wants, she may have a leather fetish.\" \n\n\"Your telling me I never see her so bold as she was for that corset. Maybe we should get her some leather skirts and jackets to wear to work?\" I said, and then to Jackie I asked, \"Do you have any of those boots your wearing in a size seven.\" She told me she did. \"Can you give her a pair and some stockings to go with them?\" Jackie took the boot and stocking to Pam while Jenny and I looked at the paddles. Jenny picked up a paddle that was about six inches across and had a punch of holes drilled though it. \n\n\"This is a good one the holes are to cut down on the wind resistance. It's nice and stiff but the handle gives to save your wrist.\" I took the paddle and swung it a few times. Then said \n\n\"Now I just need some one to try it on.\" Jenny turned and undid her shorts let them fall to the floor and bent over. I was shocked to say the least. \"Jenny I didn't mean you I was just kidding.\"\n\n\"Go ahead I like a good spanking once in a while just don't go over board.\" \n\n\"No Jen I couldn't it's not right.\" I said almost pleading\n\n\"Just do it one swat to each cheek just to see how it feels.\" I hesitated then she said. \"Really go ahead I've had my bottom spanked before I know what it feels like. Just one to each cheek.\" I raised the paddle and brought it down on her right cheek there was a loud slapping sound. Then Jenny said \"Mmmmm that's nice do the other one.\" I slapped her other cheek just a little bit harder. \"Mmmm that's it now you're getting the swing of it.\" Her as cheeks where blushing up then she asked, \"Do you want to try it some more, or a different one?\"\n\n\"No I think that was good. Did you really like it?\" \n\n\"Of cause I liked it. Have you ever been spanked?\" She asked standing upright.\n\n\"No I was always a good girl.\" I said innocently \n\n\"No I mean by a lover.\" I shook my head no \"Well we'll have to change that maybe next time we get together.\" She could see the fear in my eyes \"Has Bill ever slapped your bottom in play.\" I shook my head yes \"Didn't it feel good?\" I thought for a moment then shook my head yes I always did like it when he did that. \"Well it's the same only more intense.\" \n\n\"Jenny what are you doing?\" Jackie asked she must of came back while Jenny and I where talking\n\n\"Sheri was trying a paddle and she needed some one to try it on.\"\n\n\"Well she not trying it now, pull up your shorts. I'm not running a peep show here.\" Jenny looked down. Then pulled up her shorts. \n\n\"Sorry we got to talking and I forgot.\" \n\n\"I'm glad to see she getting one what she did to that girl is cruel.\" Now I really felt bad then Jackie said, \"We'll be right out I had to get something.\" She picked up some thing and went back in to the dressing room. \n\n\"I wasn't being cruel. I'm just stupid I guess.\" I told Jenny \n\n\"It's ok now you know and it won't happen again.\" Jenny said and gave me a hug.\n\n\"Ok are you ready to see what I have created?\" Jackie asked from the doorway of the dressing room. Jenny and I said we were. \"May I introduce Slave Pam?\" Pam walked out wearing the corset and boots I had asked for. She was also wearing thigh high fish net stockings that held up by garter straps attached to the corset. Her waist was probable two sizes smaller. Her breasts were exposed being supported by the corset. Her nipples where hard and sticking straight out. Around her neck she was wearing what looked like a dog collar with a leash attached. On the collar I could see a brass tag with writing on it. The corset was heavily boned how she could breath in it I don't know. I stared at her till Jackie said. \"What do you think, couldn't you just eat her up. If it was up to me I'd pierce her nipples.\" \n\n\"Pam is this what you want? The corset looks pretty tight. Can you handle those boots? Tell me the truth.\"\n\n\"The corset is tight and the boots are high, but I just love them. I can get use to it.\" I could see she was so excited that she could burst with enthusiasm.\n\n\"Well Pam if that's what you want then you can have it.\" Pam ran to me and threw her arms around me and hugged me tight. I held her as she said\n\n\"Thank you Mistress.\" Jackie came over and said\n\n\"Here Pam you can use these till you get you nipples pierced.\" She handed her a set of non-piercing nipple rings. Just then a boy in his early twenties came into the shop. Pam didn't make a move to cover up or hide her breasts. \"Jeremy where have you been your twenty minutes late?\" \n\n\"I had to wait for a ride. I'm sorry\" \n\n\"Not as sorry as your going to be. Go dust off the vid tapes till I call you.\" Once he went back to the front she said to us. \"He does this every couple of days so I do punish he such a slut. And now for you Sheri. What can I get you? Maybe a corset for you too.\"\n\n\"I don't think so. What else do you have?\" She looked at me and then asked \n\n\"Covered or not.\" \n\n\"Covered for the club but for home uncovered. I have some really nice breasts and I like to show them off.\" Then she asked my sizes and when to get something. I told Pam to go get changed. She seemed disappointed, but did it anyway. Then Jackie came back and asked \n\n\"Can you handle a four inch heel?\" I told her I could. She handed me a pile of stuff. I went to the changing room. I stripped down then put on the panties. She was right they did feel wonderful they had side snaps so you didn't have to remove the garters to get them off. The leather was buttery soft they felt like a second skin. Then the garter belt and the fishnet stockings. Then the boots the leather was kid soft and very supple and they went up above my knees. The top was a bustier made of the same leather as the boots. My breasts fit perfectly in to the cone shaped cups. After I was dressed I went in search of a mirror. Stepping out into the display area I heard Jenny whistle. \n\n\"Wow that's hot Bill's going to love that.\" Jenny said Pam was agreeing with her. Jackie fitted a collar around my neck that said MISTRESS on it. \"I'll take it. Now what do you have for me at home to show off my tits?\"\n\n\"How about the same thing just without the cups.\" She said showing me the top in question. \n\n\"Perfect I'll take it. I have one problem with Pam's corset. Her tits show all the time.\" seeing the look in Pam's eyes I said to her. \"Honey I know you love it but until we see what this club is like I think your breast should stay covered.\" \n\n\"There are breast cups that hook to that corset. There meant for covering not support she doesn't need much support.\" Pam seemed happy that she was going to keep the corset.\n\n\"Ok how about Bill what can we get for him?\" \n\n\"If you want, go get changed and I'll have Jeremy put some thing on. We'll start with a male style then go to a she-male style.\" I quickly change back into my dress except I left the panties on they felt to sinfully delicious to take off. After retuning to the display area and gave Jackie the cloths, and told her about the panties. She said. \"I thought you would. Apparently your not the only one.\" as she held up Pam's lavender thong. \"I have the same style in different colors. I have red, brown, tan, blue, and white.\" I quietly told her to give me one of each color for Pam Jenny and myself. \"You do know Jenny doesn't wear panties?\" \n\n\"These she may if not then it's the thought that counts. Can you possible gift wrap them?\" \n\n\"Sure I can. Is there any thing else you would like to see while your waiting,\" she asked \n\n\"I'll look around. There are a few thing's I want to pick up.\" I then said to Pam \"Pam sweetie look around see if there's anything you want and let me know.\" I waved Jenny over and we started look at the toys on display. \n\n\"What are you looking for?\" she asked, looking over my shoulder to see where Pam was I said.\n\n\"Remember that thing you put in my bottom. I want one of those and some other vibrating things. Also I want to use some thing on Pam so she can get use to something up her butt. Eventually I want her to be able to take Bill up there.\" Jenny looked at me with a stunned expression before saying \n\n\"Bill up there is that possible. That's a tall order. \n\n\"And fat too.\" I said and we both laughed \n\n\"Well if your serious I would suggest that you use a butt plug. Get different sizes and have her leave them in for a while, over night if possible.\" She shook her head \"I just can't believe you going to try and get that monster up inside her.\"\n\n\"Why not? Jim's had it up him and I had it up me and I loved it.\" \n\n\"Ladies\" Jackie called, we looked over to her and she waved us over. Jeremy was standing by her wearing a black leather strap contraption that went around his chest. It didn't seem to serve any function at all. On each wrist he had a leather cuff and on each ankle one as well. Around his neck he had a collar, but this one was thicker than the one Pam or I was wearing. His pants where tight leather shorts that showed his hard on in perfect detail. On his head was a full leather mask with eye and nose holes and a removeable mouth cover. \n\n\"Jackie, what function do the straps around his chest serve?\" I asked\n\n\"Bend over Jeremy\" Jeremy bent over and Jackie stepped up behind him and grabbed a strap in each hand the started rocking her hips forward and back in a mock fucking fashion using the straps to pull Jeremy back to her. I heard a soft moan from Pam. \"I use them to for leverage when I'm fucking Jeremy in the ass with my strap on.\" I knew she said this to humiliate Jeremy. I looked at Pam her eyes where riveted on Jackie and she was licking her lips. It wasn't what I was looking for at lease not for Bill maybe Pam would like it or something like it\n\n\"Do you have anything else? That's not quite right the shorts won't work because Bill can control his erection. And the chest straps do nothing for me. But I do need something that can show my ownership of him.\" Jackie pushed Jeremy away from her. He landed on his hands and knees. Then she said \n\n\"I really don't have any thing in an all male style other than something for a dominant male.\" \n\n\"I'll take that then but instead of the shorts how about a male thong and I'll need some kind of shoe I can't have him going barefoot a sandal would probable work better.\" Jackie agreed with me then I said \"Now I need something for the feminine side of him. And if you have one of those strap thing for Pam I'm sure she'll be grateful since she hasn't taken her eyes off it.\" Pam turned red at being caught starring. Jackie asked if I want her to try it on. \"No there's no sense in her getting changed again.\" Jackie turned back to the dressing room and said",
        "\"Come Jeremy.\" Jeremy crawled on hands and knees to the dressing room\" Your such a good doggie aren't you?\" He was definitely paying for being late. \n\n\"Pam have you found any thing yet?\" I asked\n\n\"No Mistress. I'm not sure what I should be looking for.\" \n\n\"Are there any toy's you would like to try or cloths or videos you would like to watch?\" Pam started looking around and Jenny and I went to where the penis and butt plugs were. I picked up several different sizes until Jenny showed me the vibrating ones. I took three different sizes of those and two different vibrating cocks. I picked up another penis gag so Bill and Pam each had one. Pam came over with two videos. One was \"Mistress teaches her pet\" and \"Anal sex for beginners\". I handed the toys to Pam and told her to put them by the cloths we were going to purchase. Jackie came out with Jeremy in tow. He was wearing a red bustier similar to what I had on In fact he was wearing the same outfit I had the only difference was a tiny red skirt that hid absolutely nothing his ass cheeks were visible and the thong panties in front where visible including his penis. Jackie said\n\n\"He's wearing the same out fit that you where Sheri. But I added the skirt to add to his femininity.\" spinning him around she had him bend over and spread his cheeks and said. \"It's hard to see but incorporated in this thong is a butt plug that is imbedded in his ass.\" She released his cheek and gave it a hard slap. \"You can take the other bustier and with out the cups and let him go with out tits if you would like\" \n\n\"I'll take it just the way it is.\" I told her Jackie started picking out the sizes for Bill and told Jeremy to go finish the dusting. Which he did with out a grumble? Then she said to us.\n\n\"He likes it when I make him dust dressed like that. He likes it better when there's someone in here to see him. He only works here for the humiliation.\" Then she asked will there be anything else. \n\n\"No I think we have everything we need. Pam is there anything else you would like?\" She shook her head no. \"Oh yes those panties I asked for earlier I need a set for Bill too.\" After she package up everything and gift wrapped the panty sets she said to me. \n\n\"Watch what a slut he is for humiliation.\" then in a louder voice she said \"Jeremy would you help these ladies out with their packages?\" Jeremy came over and picked up as many packages as he could and followed Jenny and Pam out. \"See what I mean do you know anyone that would go out dressed like that?\" I shook my head no and said good-bye. \n\nIn the car Jenny asked, \"Are we done or do you want to pick up a few skirts?\" \n\n\"Lets go get the skirts and then we can go home.\" Pam started to protest that she had enough skirts. I silence her I knew she didn't know what kind of skirts we were getting so I put up with her protesting to a point. Once we had her try on a leather skirt she stop all protest and gushed her happiness. When I had bought five skirts three jackets two vests and a leather dress I think she actually had an orgasm if not it was close. On the way back home the car reeked of leather. Which only added to my horniness. \n\nIt was ten thirty when we arrived home I was horny but exhausted and so was Jenny I said, \"I don't know about you two but I'm beat.\" \n\n\"Your telling me next time we go on one of these shopping sprees we're staying the night.\" Jenny said \"How about you Pam.\" \n\n\"I'm fine I was thinking of trying some of these on tonight.\" \n\n\"Like the leather things?\" I asked I heard a meek yes from the back seat. Jenny and I looked at each other and both said at the same time \"Leather fetish\". We pulled to my drive way, Jenny barely got the engine turned off when both Jim and Bill came out of the house. Bill said\n\n\"We where getting worried about you three. The credit card company called about two hours ago and asked if someone had stolen your card. They said the always check when there is an abnormally high usage of the card. And yours was smoking. I told them you where on a binge. Jim, Bill and Jenny helped Pam and I carry in all the packages. Once in side I gave the gift box with Jenny's name on to her and said.\n\n\"I know you don't wear these much but they feel so great I had to buy some for you. Because your such a great person.\" Jenny took them and said \n\n\"Thanks I do wear them sometimes like when I have my period but these I'll wear for you. Actually I was curious since you made such a big deal over them.\" Then Jim said \n\n\"Oh my god. My wife's going to wear panties and she's not on the rag. What is this world coming to?\" Jenny hit him with the box and said\n\n\"Knock it off oaf or you find yourself strung up in the garage tonight.\" Jim quickly looked at Pam then at Jenny \"Don't worry about her she's one of us. As far as she'll tell me she just renting a room here and Sheri and Bill never have sex.\" She told him. Jim looked relieved then said to Pam\n\n\"You understand Pam you can never tell what happens between any of us.\"\n\n\"I understand and no one will ever hear anything from me. That I promise.\"\n\nJim and Jenny left soon after. I asked Bill if the card company did call. \"Yea they did. We're only responsible for a set amount after a card has been lost or stolen. Their responsible for the rest they would have kill the card if they didn't talk to me. So you must of had a hell of a time. Do we have any money left?\" \n\n\"I knew I had charge a lot but it was nothing we couldn't handle.\" I told him \" Are you mad at me.\"\n\n\"No. If you blew the limit on all your cards we could still pay it off at the end of the month. And your no fool when it comes to money.\" Then he said. \"What did you girls buy? Pam looks absolutely radiant. \n\n\"Oh you mean miss leather fetish. She got a thing for leather. When I bought her leather skirts I though she had an orgasm right there in the store. Where is she anyway?\" \n\n\"She took some things up stairs.\" I look around at the packages that were left\n\n\"Yep She took all the leather stuff up already.\" I saw a dreamy look in Bill's eyes. \"You too how come never said any thing?\" I asked him \n\n\"I didn't know it till I put on that leather dress on Sunday. I haven't been able to take my mind off it.\" Reaching over for the other gift box I said\n\n\"Well this should make your day.\" He ripped the box open knowing what was inside from seeing Jenny's. Bill pulled out a red pair and rubbed in on his face and said\n\n\"It's so soft. Just like your skin. I feel like I'm rubbing my face on your bottom.\" I thought to myself oh brother another one this is going to get expensive. \n\n\"So am I forgiven for spending so much today?\" Bill gave me a hug and said\n\n\"But of cause my love.\" Then he got serious he had me set down on the couch and said. \"All kidding a side Jim said he had a investment project he has been working on with a track of land south of Atlanta. And wanted to know if I wanted to get in on it. Now you know me if it was anyone else, I would have laughed him out of here but I know Jim is pretty good on this kind of investment. He said we could double our money inside of three months.\" \n\n\"How much is he talking?\" I was watching Bill his hand never stopped rubbing the panties. His legs were crossed at the knee just like a woman would do. \n\n\"\"He said I could get in for ten thousand, But if I could come up with more we'd make more. He also said not to invest more that we could afford to do with out for a couple months.\" I knew our financial situation as well as Bill did, we could afford to lose ten grand without batting an eye. Hell I think I spent ten grand in the last two days. \n\n\"How much were you thinking about investing?\" I knew Bill well he had this all thought out before he even said anything to me. \n\n\"I thought we could invest fifty grand comfortably. And even if we lose it all it won't kill us it'll hurt but we'd still be ok.\" I knew we had a hundred and fifty grand in the checking account that we called fling money. Plus our stocks and money market funds where substantial. We wouldn't have to touch those. And I doubted that Bill even considered I was getting a raise with my new position. Bill still had his severance pay that I was sure came to at least fifty grand. \n\nI said, \"We could afford that and maybe more. Invest the fifty and we'll see what happens. If this one pans out as well as Jim says then the next time we can invest more. Did he say why he was bringing you in on it? I doubt he needs your money to make the deal.\" \n\n\"He said he didn't want us to depend on what the firm makes. This way we can keep our client list low and devote more time to bigger clients and we'll have free time to play as he put it. To take trips and vacations. If we want to take a week in the islands we can with out worry. Also if we have plenty of money we won't be tempted to over bill our clients, which is some thing he hates. And I'm glad to hear. You know how I hate doing that. If a client call's me and talks for five minutes I shouldn't bill him for an hour.\" I knew he did hate that some times he would rant about it. I would just let him rant. There wasn't anything either of us could do about it. \n\n\"Well do you want to invest more? We could safely invest a hundred with out too much worry. You do have that severance and I did get a raise with the new position.\" He looked at me and thought for a second then said\n\n\"I was thinking we could just invest my severance pay and wouldn't have to touch our fling money. How much of a raise did you get?\" Bill and I never talk money as far as day-to-day living expenses are concerned he knew about what I made and I knew about what he made. We plan stock purchases together or other investments. But we where responsible with our money I never had to worry that he would go out and buy something that would clean out our bank account and he didn't have to worry that I would. I know it may not seem that way after the spending spree I'm been on but he also knew I could tell him exactly what I spent almost to the dollar if he asked. \"If you don't mind me asking how much are you making now?\" I told him He sat with a stunned expression on his face then said. \"I knew you get a raise but not that much.\" \n\n\"Why don't you think I'm worth it?\" I asked \n\n\"No. I mean yes you are. But I didn't think they'd pay you that much. Wow you're a big deal now. I mean you've always been a big deal to me, but now they think so too.\" I let him stutter through his explanation for a while. To stop him I said\n\n\"You don't mind I'm making so much? I know some men think that their wives shouldn't make so much it infringes on the male superiority.\" I knew it didn't, money was never important to him. \n\n\"Not as long as you don't throw me away for some young stud with a big cock.\" I sat in his lap facing him and said\n\n\"I have a young stud with a big cock.\" And then to tease him I said \"Some day I may introduce you to him.\" he looked at me as if I was serious when I started giggling he started laughing too. Bill gabbed my bottom and pulled me to him and kissed me. We kissed for a while till I felt a presence behind me. I turned to see Pam standing there. I could see she wanted something. \"Yes sweetie what is it?\n\n\"\"I was wondering if you would like me to fill the tub so you can soak in it.\" \n\n\"No I'm too tired to soak in the tub I'll just take a shower and then go to bed. Have you hung up all your new cloths?\" \n\n\"Yes Mistress I have and I put the cloths that you bought for yourself on hangers. I didn't know where in your closet you wanted them so I hung them on the door of your closet.\"\n\n\"That's good I have a system for my side of the closet.\" I picked up the last gift box and handed it to Pam and said. \"I thought you might like a set of these too.\" Pam opened the box almost reverently and said \n\n\"Thank you mistress. When I saw Miss Jackie picking them out I was hoping some where for me.\" I saw tears forming in her eyes when they started rolling down her cheeks. I asked\n\n\"What's the matter honey don't you like them.\" \n\n\"Yes I love them. You just made me so happy. You've been so kind to me. When I agreed to be your slave I pictured it to be like the way Miss Jackie treated Jeremy. I could live that way if you wanted me too. I would do whatever you wanted me to do as long as I belong to you and Bill. But you've been nothing but kind to me. It's just to much kindness for me to take I'm not use to it.\" \n\n\"If you're good I'm kind. If you're bad or disobey me then I'll have to punish you. I won't use the whip again but I did pick up a paddle to use instead so you two be warned.\" They both said yes mistress. \"Now let's go up and take a shower and see how Bill looks in his S&M cloths.\" I could feel Bill start to tremble was that from excitement or fear. I picked up the bag that held the toys and movies and went up stairs my two slaves followed. \n\nAfter the shower, which I had to stipulate was for washing and nothing else. I had Bill try on both S&M outfits. I still wasn't happy with the male one and neither was Bill. When he tried on the she-male one he insisted I put the butt plug in. That plus the feminine outfit defeated his control on his erection. I had Bill put on some make up to see how he looked. Pam had sat on the bed in a baby doll nightie while Bill was getting dressed. I noticed the excitement in her eyes when I was putting the butt plug in to Bill ass. She was obviously willing to try some anal sex. Bill's make up was very heavy with a lot of dark colors. I asked him about it he told me.\n\n\"From the pictures I've seen on the net this is the way they wear it. I think it's to overstate that I'm wearing make up.\" I knew I had to check t his out seeing that I'm not one for over doing make up. The he asked \"Mistress why did you buy this? I love it but it's something I would wear to a club.\"\n\n\"Jenny and I were talking about going to a club called Dominators on Saturday. I thought it was a good idea. We could stay in Atlanta Saturday night so we don't have to drive home after. We all have Monday off we could stay the weekend and go to Benders on Sunday.\" Bill's eyes brighten up on that. Once Bill finished putting on his makeup I picked up the collar from the bag. While I was walking over to him I notice that the brass plate was inscribed with \"Property of Mistress Sheri\". I asked Pam \"Honey when did Jackie do this?\" showing her the collar\n\n\"She did them while you where changing. She put one on my collar then saved one for Bill's and she gave me four more in case you get us different collars.\" She reached into her purse and handed me the other tags. \"She said I should keep them since I was in charge of cleaning the leather.\" \n\n\"Then you should keep them.\" I told her before walking over to Bill and place his around his neck. He stood up and look at him self in the mirror. I could see he really liked the look. \"Well which one are you going to wear to the club?\" I asked as if I didn't already know.\n\n\"I really like this one, but how do I get from the room to the club?\" \n\n\"You could wear a trench coat over that. And take it off when we get in the club.\" I told him \n\n\"Won't I look like a guy in make up? If we see anyone in the hotel.\"\n\n\"Sweetheart you don't look like a guy in make up now. You do look like a two dollar a night hooker though.\" Bill got a kick out of that. \"You can take it off now.\" When I said this Bill gave me a disappointed look. \"Ok you can leave it on for a while but you can't sleep in it. And don't get that skirt wrinkled.\" I took the pillows and placed them on the foot of the bed. I put the anal sex tape in the VCR of the bedroom entertainment system. The movie started and Pam started watching it. With out her seeing what I was doing. I took out the smallest dildo I bought and a small butt plug a tube of lubricate and I got a hand towel from the bathroom. \n\nI took off my nightgown and lay down on the bed. Once I got comfortable I had Pam remove her nightie and lay down in front of me. She laid her head on my arm and I cuddled up behind her draping my leg over hers. \n\nThe movie started real clinical like. Almost like those films you watch in heath class in high school. It told of all the things that could go wrong with anal sex if it's not done right. And the importance of lubricate. Though this part I would rub my hands over Pam's back and front and kiss her shoulder and back and nibble her ear. Pam was almost purring at this attention. I'm sure she knew something was going to happen. \n\nMean while Bill had sat down on the bed behind me. When the guy on the tape started to demonstrate how to lube up the anus I handed Bill the lube and he squirted some on my finger. I started to trace the crack of her bottom with my greased up fingers. I could feel her tense up just slightly. I didn't want to scare her so my fingers stayed just on the surface. I wanted her to push back to take more in to her. I knew the less I pushed the more she'd be willing to go further. After a few minutes of this Pam bottom started to move back to me. When I pulled my fingers away to have Bill give me more lube I heard her whimper. When my fingers started tracing her crack again her ass moved back taking my fingers between her cheeks. The movie by this time was completely forgotten. When I started to massage her anus Pam's reflex was to tighten up. I could feel her cheeks flex up then they relaxed immediately. I had Bill relub me then when I started massaged her hole again she turned her head and said\n\n\"Mistress please, but your finger in me.\" I asked her if she was sure. \"Yes Mistress I want you to.\"\n\n\"Then take my hand and push it into you.\" Pam reached back and took a hold of my wrist and pushed my finger into herself. I held back so she didn't hurt herself. When my finger pierced her hole she winced slightly then gave a slight ahh sound. She released my wrist as I started finger fucking her. After a minute of this I asked \"Would you like another finger?\"\n\n\"Yes please Mistress.\" I slid in a second finger and kept up my fucking motion. After a minute of this she pleaded. \"Mistress please another finger Mistress please.\" As I slid a third finger into her she gasped. Her hands kept going down to her pussy but she stopped them before they touched. Her bottom would shove back on my in stroke and she would whimper on my outstroke. She was sweating heavily as her breath quicken. Then she pleaded. \"Mistress please another finger please.\" I whispered in her ear.\n\n\"I can't It's too hard to use four.\" A moan escaped her lips. Then I asked. \"Would you like to try something bigger. Something longer?\"\n\n\"Yes Mistress something bigger and longer fuck me please Mistress\" Bill had found the dildo and had it all greased up for me. When I pull my fingers out of her hole her ass followed trying to capture them again. When I pushed the dildo between her cheeks she grabbed my wrist and try to shove my hand forward. I held back as best I could till the head of the dildo pierced her anus. \n\n\"Oh god yes oh fuck that feels so good. Please Mistress fuck me fuck my ass.\" She was taking about half the dildo and her ass was pumping back to meet my hand. She was trembling I knew she was close to cumming but couldn't get there. I then asked her \n\n\"Do you want to cum now baby do you want to cum with this dildo up you ass?\" \n\n\"Yes Mistress please let me cum please let me cum with the dildo in me please Mistress please.\"\n\n\"Go ahead baby use your hand on your clit and cum for your Mistress.\" Her hand flew to her pussy, as she came I shoved the dildo in as far as it would go. I pushed my hip against her ass to hold the dildo in place as I wrapped my arm around her and held her. \"There, there honey cum for you mistress baby cum for me. Doesn't it feel good to cum with a dildo up your ass?\"\n\n\"Yes Mistress it does feel so good. Can we do this again please\"?\n\n\"Yes we can. And someday I want to fuck you with my strap on. But we'll have to stretch you out more before we can do that.\" ",
        "\"How can we do that Mistress? I want you to use your strap-on on me.\" She was so sweet like a child trying to please me. \n\n\"You know that butt plug I put inside Bill earlier?\" She shook her head but I could feel her tense up. \"I have a small one I want to put in you. Can I do that?\" She hesitated for only a second then shook her head yes. \"I want you to leave it in over night. Ok? \n\n\"Yes Mistress what ever you want.\" she said with conviction.\n\n\"Ok roll over on to your tummy.\" She did as I asked I handed the plug to Bill to lube up. Once he had it lube I spread her cheeks and pulled the dildo out Pam moaned at its loss. Then before her hole closed up I slipped the tip of the butt plug in. Holding her cheeks apart I watched as the plug slid in to her. I watched as her sphincter muscle closed around the bottom of the plug holding it in place. I released her cheeks and gave her bottom a light slap. \"There how does that feel?\" \n\n\"Kind of like I have to go potty. But it does feel good like I still have that dildo in me, it's just not as deep.\" She had a smile on her face so she wasn't in pain. \n\n\"Well I don't know about you two, But I'm going to sleep I'm exhausted. Remember Bill you have to take that off before you go to sleep. And wash that plug\"\n\n\"Can I leave the panties on?\" \n\n\"No. Why would you want to do that?\" I knew why but I wanted to here him say it.\n\n\"Well the plug does feel good I was hoping to leave it in.\" Standing to put my nightgown on I said \n\n\"Well since you where a good boy and you didn't complain when I spent so much money. I guess I can give you a treat. Take that outfit off wash the plug and then come here and lay on the bed.\" when Pam sat up I saw her wince just a little. I asked her \"Does that hurt?\" \n\n\"No it doesn't hurt. It's a little uncomfortable is all? It'll be ok once I get used to it.\" \n\n\"Are you sure we could take it out.\" I asked \n\n\"No Mistress it's ok I want to keep it in please.\" \n\n\"Ok if you're sure. If it starts to hurt tell me and we'll take it out.\" \n\nPam stood up and put on her nightgown and put the pillows back at the head of the bed. I stopped the VCR and rewind the tape. Bill came back from the bathroom. He put his outfit away and came to the bed. I told him to lie down. I pulled a plug from the bag. I saw Pam's eyes get real big and I said, \n\n\"No honey the one I put in you isn't near this big. Yours is very, very small.\" Taking the tube of lube I put a big dollop on the plug then handed the tube to Pam. \"Do you want to lube up his hole for me.\" \n\nPam put some lube on her finger and tried to spread his cheeks. Doing it one handed is not that easy. I took one cheek while she took the other and we spread Bill's cheeks apart. I could see that Bill's asshole was very relaxed in fact it was still open slightly from the other plug. \n\n\"Spread it around real good and don't forget to get some inside too.\" I told her. \n\nPam applied the lube around the hole then she slid a finger inside, Bill made an ooing sound that seemed to please Pam. I saw her face light up as a grin came to her lips. She looked up at me and I told her to put in a second finger. She slid her second finger in along side the first and sawed then in and out. Bill was moaning pretty well now. I could see Pam was really enjoying herself she slid in a third and then a few moments later she tried a putting in her pinky as well. When she realized that it was too hard she just stayed with the three till I said. \n\n\"Ok that's enough we don't want him cumming all over the sheets.\" \n\nI took the butt plug and slid it in. He took two thirds of it easily. The last third I had to push it till his asshole closed around the base. Thank god for the flange at the base it might have went all the way in. I slapped Bill on the ass harder than I did Pam. He turned over and said \n\n\"Boy that ones big. Is that the biggest you have?\" \n\n\"No sweetheart I have bigger and your bigger then any of them.\" \n\n\"God I feel so full. I can't imagine how you felt.\" He said. \n\n\"Wait till I give you to Max then you'll really be full.\" I could almost see fear in his eyes. \"Don't worry honey I wouldn't do that. Unless you really piss me off.\" I told him \n\n\"If I get close to making you that mad hit me with a baseball bat it'll probable hurt less.\" Bill's cock was rock hard. I took his cock in hand a started an up and down motion with it. Pam was starring intently at what I was doing. Then I said \n\n\"Bill do you want to wear pretty lace and satin.\" He moaned that he did. \"Do you want to wear a pretty dress and stocking?\" More moaning. \"And really tall high heels maybe four-incher. Have your face made up and dangly earrings in your ears.\" \n\nBill had stopped trying to answer me he was to close to cumming and I knew it would be a big one. The head was a deep red and pre-cum was flowing out. \"Bill wouldn't you like to take Max to bed and have him fuck you like a real girl.\" \n\nBill came hard his first load shot two feet into the air before landing on his chest. His remaining loads where weaker till cum just poured out of his cock covering my hand in cum. I continued to pump his cock till it stopped cumming and started to go soft. Taking my cum soaked hand from his cock I tasted it. The cum was cold and not very appealing. I moved my hand over to Pam and said, \"Clean\". Pam took my hand and licked it clean of cum. Once she was done I said \n\n\"Lick up the rest and feed it to him.\" As I got up to the go to the bathroom to wash my hands. I returned just in time to see Pam lower her mouth to Bill's as she feed him his cum. \n\n\"Now that you two have cum can I get some sleep?\" Bill and Pam jumped up off the bed and pulled down the covers. I set the alarm while Bill showered. I laid down in the center and had Pam lay down next to me. Bill came back in just a pair of panties and laid down on my other side. \"Honey where's your night gown.\" \n\n\"I wouldn't have worn these if I had any male underwear.\" He said obviously upset over something. \n\n\"What's wrong sweet heart I know you like wearing panties and night gowns? So you must be upset about something.\" I asked \n\n\"Well you were upset when I came while you were talking about Max. And you didn't eat my cum.\" \n\n\"Bill you've been hard for over two hours, no matter how hard you tried to control it you couldn't. You watched two very lovely ladies have sex within a foot of you. And you have a butt plug up you ass. I jerked you off telling you all the things you wanted to hear. Of cause you came when I said them that's what I wanted you to do. As far as you having sex with Max or any other man for that matter that's your decision. Just like when I have sex with a women. It's my decision and no one else's. I have your permission as my husband to do it. But I won't do it because someone tells me too. Pam doesn't have sex with any one she doesn't want to or do anything she doesn't feel comfortable with. I won't force her to do anything against her will, that's the same as rape. And there's too many ways to have sex then to rape someone. Have I made either of you do any thing you didn't want to do.\" They both shook their head no. Then Bill said \n\n\"How come you did have sex tonight?\" Now we had gotten to the root of his problem\n\n\"Sweet heart you know I love sex? But to tell the truth I'm tired I'm walked probable thirty miles today and made three hundred decisions concerning cloths for Pam. Who couldn't decide on what she wanted until it came to leather. I'm not complaining I loved doing it. But sweetie I'm just tired. So for tonight I'm abstaining from sex, but tomorrow watch out. Because I'm going to want it bad. From both of you.\"\n\n\"Are you sure. I don't want to lose you.\" He asked\n\n\"Bill you are the most understanding man I ever met. But sometimes you can be so blind. Why would I want to leave you I love you with all my heart. I can do just about anything I want to. I don't have to worry about you screwing around on me or having some bimbo shacked up somewhere. What would I leave you for, what could be better then what I have right now.\" \n\n\"I'm just afraid that some day you'll want a real man and not a sissy man.\" Now I was pissed. I sat up and looked him in the eye and asked.\n\n\"Bill want do you consider a real man.\" he didn't answer he knew I wasn't really looking for an answer. \"What's a Real man? What I consider a real man is one that doesn't hide his feelings behind some macho provado. Who is sensitive and caring to the ones he love and honest in his dealing with every one. A Real man doesn't complain when his wife is bitchy at certain times of the month. A real man thinks what will make others happy before himself. I've known only new one real man all my life. I knew if he didn't ask me to marry him I would have died. I was lucky he did ask me and I married him. And I've never, never though of leaving him. Leaving him would be like cutting out my heart. Now if you want to stay that real man I just described then go and get you nightgown on and come to bed. If you want to be your description of a real man then take all those cloths I bought you and though them away. But want ever you decide do it, be that man.\" \n\nI though myself down on my pillow and buried my face in it so he couldn't see me cry. I felt the bed shift then I felt Pam trying to console me I pushed her away. I didn't want her consoling me I wanted it to be my Bill. My sweet dress wearing cocksucking devoted husband Bill to come back to bed and I feared that it wouldn't be him. \n\nMoments later what seemed like an eternity I felt the bed shift again. Then I felt his hand on my shoulder. I wanted to push it off but I couldn't. He turned me and pulled me in to his arms. I had closed my eyes to try and stop the tears, to no use. Pulling my head on to his shoulder I felt satin on my cheek. He had made the decision I hope he would. I started crying even more but this time with joy in my heart. Bill notice my crying had increased and said\n\n\"Wrong choice I'm sorry.\" \n\n\"Right choice. Your my real man.\" I said though my tears\n\n\"Oh good. But someday your going to have to tell me about this other husband you have. I'd like to meet him he sound like a great guy.\" \n\n\"Oh he is. And he has a really nice cock.\" Which had us both laughing. \"Bill even if you decide to change your sex I still want you to be my husband.\"\n\n\"I don't want to go that far, but I would like a set of small tits.\" He said.\n\n\"In a couple of weeks we can go to Jamaica and see the same doctor that Jim did.\"\n\n\"Jim has tits. I just thought he was muscular.\" I forgot that Pam was still in the room. I turn to her and was about to say something she stopped me and said. \"Don't worry I won't say anything and I'll look surprised if I ever do see them.\" \n\n\"Ok now can I go to sleep? After all I have to be a vice president tomorrow. I'm really not sure how that's going to work out. I hope Ginger knows what I'm supposed to be doing. I laid my head on Bill's shoulder and pulled Pam in behind me and the next thing I knew it was morning.\n\nSo ends Part Five Please tell me how you like it even if you don't. And if I should send in more parts."
    ],
    "authorname": "Scribler",
    "tags": [
        "thing pam",
        "mine pam",
        "lashes crop",
        "leave night",
        "card company",
        "bill likes",
        "clothing stores",
        "fifty grand",
        "question looked",
        "mrs macon"
    ],
    "category": "Fetish",
    "url": "https://www.literotica.com/s/lifes-changes-ch-05"
}