{
    "title": "Dominant Species Ch. 55-56",
    "pages": [
        "Donald had to keep his head low as he rushed under the back of the truck, so when he reached his man there was no time to jump. The punk never knew what hit him; one moment he was closing the tailgate and leering at a crying young woman, the next his groin exploded in pain. Donald bit deeply, shaking his head as the momentum of his charge knocked his man on his back. He didn't wait, he released his bite and lunged for the man's unprotected throat. This time when his teeth bit deep, he held on. Viciously shaking his large head side to side, his wolf in full control, he ripped and tore at his throat until his head was rolling along the sidewalk.\n\nBANG! He looked for the source of the shot, it was the man who had been beating the old woman in the crowd. He didn't get off a second shot, Barry leaped onto his back, his teeth gripping him by the spine. The man screamed as he fell forward, his gun dropped from his hand as he tried to grab the wolf off of him. Barry slammed him into the pavement with his full body weight, then shifted his grip and tore his throat out.\n\nDonald looked to his right, Terry had already finished off his man and was running to Brian's side. Brian had not been as lucky in his attack as his man had moved during his leap, and he only succeeded in biting his shoulder and knocking him to the ground. The man rolled clear and pulled a knife with his good hand, pointing it at the huge wolf who had just attacked him. They could smell his fear as his eyes went from Brian to Terry, then to the others. The two wolves looked at each other, then made a space in the circle for Barry. These assholes had tormented and killed innocents, and they were going to make ONE of them pay with more than a quick death.\n\nTerry moved first, leaping forward from behind and grabbing his knife forearm with his powerful jaws. The man screamed and dropped the knife, he tried to pull his arm away but it wasn't going to happen. He reached across with his injured arm, but Barry got to it first. The man screamed again as he went to his knees. The two wolves pulled in opposite directions, holding the man in the prison jumpsuit upright as Brian growled in his face. \n\nHe pissed himself.\n\nDonald smiled as he watched his friends take the man apart strip by painful strip. The townspeople watched in a combination of horror and relief as his screams were finally silenced. It was such an effective distraction, no one saw him shift into his human form. Pulling the shorts from the man Terry killed since his guy had blood all over them, he stood up and faced the town. \"ENOUGH,\" he yelled.\n\nThe three wolves sat down looking at him, and the townspeople gaped at the bare-chested stranger who had just shown up in their midst. \"My name is Donald Ross, I'm with the North Fork pack of werewolves. We come in friendship, and mean you no harm.\"\n\nThe statement set off a cacophony of yells, statements and questions that he couldn't begin to answer. \"Quiet, please.\" He waited for the noise to die down. \"I know you don't believe it, but let's face it, there's a lot we can't believe about these last few days. Terry, Barry, go get some clothes. Brian, come here.\"\n\nBrian padded over as the others ran off, despite being covered with blood he was trying to be as friendly and non-threatening as he could. The scent of fear was still prevalent as Donald took the jeans off the man Barry had killed. The crowd moved back nervously as the two approached. Donald looked at them, then back at the three women in the back of the truck who were peering over the tailgate with frightened eyes. \"Just watch. Brian, shift.\"\n\nBrian turned away from the large group and sat down before smoothly shifting to his human form. As the people behind him gasped and talked, he pulled on the jeans and stood up to face them. \"It's all right,\" he said. \"We aren't here to hurt you, we are here to help.\"\n\nOne of the men in the group stepped forward. \"You are real...\"\n\nDonald nodded. \"We've lived among you for centuries, we are your friends, neighbors, coworkers. We just have a little extra.\"\n\n\"Why are you here? I mean, we appreciate you getting rid of those guys, but why?\" The man looked around, some of the people behind him nodding their heads.\n\n\"I am looking for the parents of Abigail Dawson.\" \n\nThere was a shriek from the crowd as a middle aged woman with her dark hair in braids started to cry. \"Abigail? My baby is alive?\" She ran to Donald and hugged his bare waist as he comforted her. \n\n\"Yes, she's alive Angela, she's in North Fork, Idaho with my people.\" She looked up at him. \"And Autumn is doing fine too.\" He rocked her gently as she sobbed into him. \"Your husband? Did Bruce make it?\"\n\nShe pulled back and looked at the bank building. \"He... he's dying.\" She looked down at the ground. \"He tried to come get me, I was working at the bank when it happened, and he was blinded. Now he's got a fever, he's coughing up blood. We've tried to help him, tried to help all of them but nothing works.\"\n\n\"How many people are sick in there?\"\n\n\"Thirteen. We lost five today, they don't think the rest will make it too much longer.\"\n\nJust then Terry and Barry came back wearing clothes they had taken from a nearby house. Donald looked at the people and made another decision he didn't like, but he had to. \"We can help, we have a doctor down in Salmon and he knows how to save them. Terry, Barry, help them retrieve the sick and let's get them in the truck.\"\n\nSeveral people from the group on the sidewalk moved back into the bank, so Donald turned to the truck. \"Ladies, I'm sorry for what happened here.\" Looking back at the crowd, he asked a few women to find clothes for them then he dropped the tailgate.\n\nDigging in his borrowed shorts, he pulled out a keychain that luckily had a handcuff key. He quickly freed three girls, then moved to the front of the bed where the fourth was sitting against the cab, her head down. \"Miss, I'm just going to...\" He stopped when he lifted her chin and saw the hole in the center of her forehead. Her eyes were open and glazed.\n\n\"FUCK!\" He checked for a pulse, but there was none. His outburst attracted the other girls, who started to scream and cry for their friend Kim who now was cradled lifeless in Donald's arms. He called for a blanket, and one was passed in. He had it set down then covered her with it, rolling it around before he picked her up and carried her out. The townspeople were aghast at the change in fortune, the young bank teller had been well liked.\n\nTwo women moved forward and relieved him of his burden. \"We'll take her. We have a grave in the park we are using for the dead.\" They moved off, several more watching, as the sick and wounded made their way out. The girls were given clothing and helped down, they moved quickly to their friends and family in the crowd.\n\nTerry looked over at Donald as he sat on the steps of the bank. \"What now, Donald? We can save a few, but the rest are sitting ducks. Imagine what happens tomorrow night when the guys in Missoula figure out their men didn't come back.\"\n\nHe looked around. \"I don't know, Terry, we only have one car and the night is half over already.\" He got up and went to the group still gathered on the sidewalk. \"Are there any vehicles still running in this town? Especially big ones?\"\n\nAn older man nodded. \"There are a couple old buses at the school district garage, they have the old diesel engines. I fired them up last night, I just didn't have a place to go. We figure the bank with all the steel and concrete was what saved us from getting sick, so we didn't leave.\"\n\n\"Can you go get them?\" He nodded, pulling another man with him as they walked down the street. Looking at the rest of the people, he stood tall and gave them the only choice he could. \"You can stay here, but we have to take your wounded and we can't protect you if they come back tomorrow. We do have enough room for you in North Fork. If you want to go with us, grab what food and clothing you can carry and be back here in fifteen minutes to get on the buses.\" Some people left immediately, others stayed and asked questions, but soon they had all gone to get ready.\n\nThe four men looked around, and Barry looked at the people in the back. \"Good a time as any, boss. The sooner we bite them the faster they heal.\"\n\nDonald nodded, jumping up into the truck as they closed the tailgate. He pulled off his shorts then shifted to wolf form, then moved from person to person biting their arm or leg. It only took a few minutes and he was back down. They could hear the buses coming. \"All right, Terry will be with me in this truck, we will be lead. I want each of you to be in a bus, be up front where you can get out quick if we run into trouble. Tell the drivers to stay together, but keep back from us a quarter mile or so. If we get it trouble, do what you have to in order to reach North Fork or find a place to hide for the day.\" \n\nThe three nodded, it seemed like a good plan.\n\nThe townspeople had started to return and loaded up the buses, in addition to the wounded in the truck they had forty-seven more in the buses by the time they left town. Donald drove the army truck, leading the way south. He and Terry were busy scanning the road ahead and the surroundings for danger, but it was eerily quiet. It didn't get fun until they approached the first town they had bypassed, Hamilton. A man ran out into the road, frantically waving his arms. They slowed down and stopped next to him. \n\n\"Thank God you're here! I can't believe it!\" The man was about eighteen years old and smelled of stress.\n\n\"Why?\" Donald looked around, the town of over four thousand was strangely quiet.\n\n\"Well, because the Army is here to take care of us!\" He looked behind them, he could see the lights of the buses coming.\n\n\"I hate to break it to you, boy, but we aren't Army and we aren't here to take care of you. We're evacuating some injured and refugees. What is the situation here?\"\n\nThe kid pointed towards downtown. \"We've got a few hundred survivors, we are mostly in the town hall, except the sick are at the clinic.\" He pointed to the building a few blocks down.\n\n\"How many sick?\"\n\n\"Maybe thirty, I don't know, they've been dying off pretty quick.\" He shook his head. \"Nothing we do helps them, they end up choking on their own blood.\"\n\nDonald sighed, he didn't have much room but he wasn't going to leave more people to die. \"All right, you wait here for the buses and tell them to meet me at the clinic. We'll grab who we can. Meanwhile, who is in charge here?\"\n\n\"The Sheriff, I guess. He's acting like that, anyway.\"\n\n\"All right, when you get done with the buses, you find this Sheriff and have him meet me at the clinic.\" They pulled away and stopped outside the single-story building. He told Terry to wait with the truck while he went inside.\n\nHe was met by a middle-aged woman in scrubs. \"Who the hell are you?\" Her eyes were sunken with dark circles under them, she clearly hadn't slept in a long time.\n\n\"I'm Donald, I'm evacuating wounded to Salmon where we have a doctor who can help them.\"\n\n\"How? I've been treating these people for days, there is no effective treatment for radiation sickness this severe other than palliative care. If there was, I would be doing it!\" \n\nDonald smirked. \"The cure, it isn't one in the medical books. It does work, though.\" He looked at her name badge. \"Doctor Jenkins, I'd like to start with the most serious cases, we can load them in the truck. A few buses will be here shortly for the rest.\"\n\n\"No one is going anywhere, mister, until I'm convinced that they will get better care elsewhere.\" She folded her arms across her chest, glaring at him.\n\n\"Fine. You want to see how we heal them?\" She nodded. \"Don't scream.\" He stepped back and dropped his shorts, then shifted into his large wolf form. He moved to her, she was frozen until he touched her hand, then she started to scratch his ears. He shifted back, immediately turning to get his shorts back on. \"I'm a werewolf, if you haven't figured it out. When we bite them, the change starts, and the change has regenerative ability. We've saved over a hundred people this way, people with blindness, sickness, even on the brink of death. There is no other way, you of all people know that the ones who haven't recovered yet, won't.\"\n\n\"Well raise my rent, you ARE the kid.\" She shook her head, still trying to get her mind around it. \"I'm coming with, though. They are still my patients.\"\n\n\"Fine.\" She led him back to where the most serious cases were, and between the gurneys and him carrying them they had four people loaded in the truck before the buses got there. Barry and Brian exited the buses, while the other people looked out the open bus windows. \"We're taking Doc here and their sick with us. It's going to be tight, so please cooperate.\" Five minutes later, the bus and the truck were full just as a Sheriff arrived.\n\n\"What the hell is going on here, Doc?\" He looked at the half-dressed men and the buses. \"And who are these people?\"\n\n\"I'm Donald Ross, from North Fork. I evacuated most of these people from Corvallis. There is a criminal gang out of Missoula, they sent people south to loot and kill. They are dead, but tomorrow night they might come here. I suggest you be ready for them.\" Everyone else had loaded up, so Donald shook his hand as he got ready to leave. \"I'll send reinforcements when I can, we will honk the horn three times as we approach so you know we are friendly. All right?\"\n\nThe Sheriff looked at Donald, then up at Dr. Jenkins who was in the middle of the seat next to Terry. \"You agree with this, Doc?\"\n\nShe nodded. \"We have to go, keep everyone safe, all right? Let them know that I'm taking my patients to Salmon for care.\" Donald hopped up and put the truck into gear, and they moved off with the buses following.\n\nDonald pushed the truck up as fast as he was comfortable as they went down Highway 93, still nervous as they hadn't cleared this part of the road. Terry was answering Doc's questions, and she had a lot of them. Donald had to answer about the changes, the process, the symptoms, everything. Finally, as they saw the sign for the next town, Donald realized that they still had decisions to make.\n\n\"We've got Como, Gorus and Darby still before we hit the mountains. What about those people?\" Doc's question hit them hard; even though the towns were smaller, they still could have survivors.\n\n\"I'm hoping the Sheriff can stop any bad guys in Hamilton, that gives us a little time.\"\n\nTerry looked out. \"Yeah, but that doesn't help any sick, and it doesn't ensure the towns are safe for us to pass through.\"\n\nDonald noodled on it, he didn't like the answer but it was the best one. \"You'll have to link this to Barry and Brian. I'm going to just drive straight through the towns, if they don't attack we'll assume they are friendly. Have Brian bail out in Como, Barry in Gorus and you in Darby. Scope out the people, change those who are sick, and organize the rest. Top priority is vehicles, food and drugs. I'll bring reinforcements back tomorrow night and we can pick them up.\"\n\n\"You sure they'll want to go?\"\n\nDonald nodded. \"Most will, we can offer them safety and community. If they don't, fine. The towns are close enough together that you should be able to pass messages along.\" He waited for Terry to finish his linking, then finally it was agreed on. Just in time, Donald thought, as they pushed through the first town.\n\nHe didn't slow down too much as he passed through the one stoplight town, the stoplight of course not working. He had to stop and push a vehicle out of the way to clear the road, but it was enough for the coming buses. They were out of the town without incident. This repeated at the next two towns, and soon they had reached the mountains again.\n\n\"Are we going to make it, Donald? It's not too long until sunrise.\"\n\n\"I think so, Doc. We've been through this part of the road, it's clear and safe. I don't think we will make Salmon but we can at least stop in North Fork for the day.\"\n\n\"That won't affect our sick?\"\n\n\"The first ones are going to start getting the fevers in a few hours. Our Pack has enough people to help them out, and you'll be there to monitor.\" This led to a long discussion about Pack structure, what had happened in their Pack and Salmon, and other details that kept him busy until they were close enough for him to link his Pack.\n\nAlpha Calvin was surprised to hear from him so soon, more so when he was told what he was bringing. He promised they would be ready, and he said he would make sure Abigail was there to meet them. \"What do you want me to tell Silvia, Donald?\"\n\nHe sighed. \"Tell her I have to go back, that I couldn't get farther north than Corvallis. I'll explain it to all of you when we are settled.\" He wasn't looking forward to that conversation.\n\n\"I will. And Donald?\" Calvin waited a moment. \"I know you did what you had to do, she won't hold it against you.\"\n\n\"I hope so, Alpha. I really hope so. I hope she doesn't hate me if she finds out her family didn't make it because I didn't go there like I said.\" He cut the communication off, wiping his eyes as he needed to focus on the road ahead.\n\nWhen they pulled into town, the whole Pack was there to meet them. He came to a stop, and before he turned the truck off people were already starting to unload the sick from the back and carry them inside. He looked around for his Silvia, and his shoulders fell when he didn't see her. \"Welcome back, Donald.\" Calvin embraced his Beta as they looked back at the buses.\n\n\"GRANDMA!! GRANDMA!!\" An excited Autumn raced forward as Angela stepped off the bus. They both started to cry as she hugged her granddaughter to her. The pair was quickly embraced by a crying Abigail. \n\n\"Mom? Is Dad...\"\n\n\"He's still alive, honey. He's in the truck, he was very sick. Donald said that biting him would save him, so that's what he did.\"\n\nAutumn started to jump up and down. \"Yay! Grandpa gets to be a wolf too!\"\n\n\"Too?\"\n\n\"Yep, watch me Grandma!\" Autumn pulled off her dress and shifted into her pup form. She jumped up with her front paws and started licking her face as she leaned down.\n\n\"Oh my, it's true!\" Angela knelt and hugged the pup to her. \"You're beautiful, Autumn!\"\n\nDonald walked towards the hotel, he was completely wiped out and the others would take care of all the people he had brought with. There was only one person he wanted to see, and she was hiding in her room. As he got closer, the door opened and his mate stepped out, her scent both calming and exciting his wolf.\n\n\"My family?\" She looked at him with hope in her eyes.\n\n\"I'm sorry, Silvia. Missoula is under the control of a criminal gang, I couldn't get close enough to find them, and then I had to deal with all this.\" He looked over to the others.\n\nHer face fell, and she closed the door on him without saying another word.\n\nDonald sat in front of her door, his hands over his face, and he sobbed as his mind went back through everything that had happened, wishing it would have turned out differently.\n\n--\n\nDonald sat by her door, his wolf whining in his head at the separation from his mate. He had stopped crying twenty minutes earlier, he knew it wouldn't help to rehash his decisions. As he looked at the people settling in, he knew deep down he had made the right choice for the Pack to bring them here, to save the sick and dying.\n\nIt wasn't right by his mate, though, and her disappointment crushed him.\n\nHe listened as she moved about the room, feeding and then changing Michelle and putting her to bed. Abigail and her family had passed him as they went into the room next door. She was crying as she hugged him and thanked him for saving her parents. He told her it was the right thing to do, and he almost believed it. They had seen Silvia's mood and had taken Zach into their room, he was going to sleep with the puppy pile in one bed while Abigail and Angela shared the other.",
        "The moon had set, but the dawn was quickly approaching. Soon he would have to go back to his home or find another place to sleep, as the light was still too strong to bear. He stood up, his old bones cracking and protesting from too long spent on the pavement, when the door opened.\n\n\"Donald?\" His mate stood there in the door, a long T-shirt covering her body. She was tired, and he could see the tracks where the tears had gone down her face before being wiped away. \"Can you... can you stay with me?\"\n\n\"Of course, Silvia.\" He watched as she turned around, walking slowly towards the bed. He linked a Pack member, asking for clothes to be brought to him so he wouldn't have to leave. He followed her in and tucked her in bed, leaning down to kiss her. \"I will always be here for you, Silvia. You never have to ask.\"\n\nHe gently stroked her hair as she fell asleep. There was a gentle knock on the door and he got up to get the clothes, then checked to make sure Michelle was sleeping soundly before he stepped into the bathroom. He lit the candle and stepped into the shower, for once glad that the cold water could be put to productive use. He scrubbed the dirt, grime and blood from his skin as he tried not to picture how the light penetrated the loose shirt Silvia had been wearing. His mate had luscious curves, a body made for loving and bearing children, and he and his wolf couldn't wait to see it and touch it.\n\nHe cursed to himself, as he'd gotten excited just thinking about how he shouldn't get excited. Directing the cold spray on the offending member, he did math problems in his head until it had subsided. When he was truly freezing, he turned off the water and dried himself off. Quickly dressing, he shaved and brushed his teeth before leaving the room.\n\nThe sunrise provided a gentle light in the room, enough for him to see that nothing had changed during his time in the bathroom. He looked at Silvia in her bed, curled up on herself on the left side of one bed. The other bed was empty, and this was his next important decision. She had asked him to stay with him, but was she ready to share a bed with him? The safe play would be to take the other bed.\n\nHe moved to the other side of her bed and quietly slipped beneath the covers. He was on his side facing her back, and his wolf was pressing him to touch her, to hold her in her arms. He scooted over until he was close enough to kiss her shoulder, then he put his arm over her and gently pulled her back into his chest. She stirred in her sleep, moving her hips back to his and snuggling in to a spoon position before dropping back off to a deeper sleep.\n\nHe smiled to himself, the pull of the mate bond was working on her, and with that thought he drifted off to his own sleep.\n\nHe opened his eyes to find himself on a rocky hilltop, with fog moving between the broken stones. The full moon bore down upon him, the mist occasionally getting in between. He was walking with his wolf alongside him on the strange landscape when he saw them.\n\nThe woman was beautiful in an otherworldly manner; her hair was so white it almost glowed, her face was pale and clear, her eyes swirled with power. The dress she was wearing was loose and torn, it was a light material that shifted in the wind while barely covering her body. By her side were two white wolves, both male and female reeked of power and dominance. When she looked at him, her power overwhelmed him and he quickly dropped to his knees, his wolf lying down beside him. There was no mistaking who this was. \"Luna...\"\n\nHe bowed his head as she approached, soon her bare feet were in front of him and she had cupped his cheek with her hand, raising his head to look at her. \"Walk with me, my child, we have much to discuss.\" She held out her hand and he took it, the hand was warm and sent tingles up his arm, he was instantly comforted as he stood up.\n\n\"My Goddess, so many times have I prayed for your help.\" He couldn't look at her as they started to walk along the clouded path, the three wolves following close behind. \"There was so much I did not understand, now more than ever.\"\n\n\"The ways of the Gods are not always smooth. Yes, I am a Goddess, I have powers over the hunt, and over werewolves, but I do not control it all. What has happened was the work of the Sun God, not me. I have been doing my best to help and to save my people, but it is not easy. There is so much anger at the way the world has turned out, most of the Gods wanted a reset and they got their way.\"\n\n\"So all of this death...\"\n\n\"Yes, and there will be more, and to prevent that and to keep my people alive I need you, I need people like you. You've seen what is going on up in the valley, there is true evil at work there. My people were not prepared, I was not able to save but a few when this happened. There needs to be a Pack up there, but right now I have no Alpha pair to lead it. That is why I have chosen you, and have given you a worthy mate. You need to be the Alpha that saves those people and makes them into a strong Pack.\"\n\nHe looked at his wolf, doubt creeping into his mind. \"But I am not an Alpha, I am a Beta... I am strong, but I do not have the power.\"\n\nLuna laughed to herself as the wolves chuffed. \"Where do you think that power comes from, Donald? I give it to those who I deem worthy to have it. You have demonstrated with your entire life, not just the past few days, that you are worthy. You didn't seek power or land or glory, you sought justice; and when hard decisions came, you always placed the Pack above your own desires. You are exactly what is needed.\" \n\nShe placed her right hand on his chest and chanted a few words, her hand began to glow and then it spread to his whole body. He felt the power, his wolf was more powerful, the Alpha influence coming to rest inside of him. When the glow stopped, he fell to his knees and held tight to his wolf. It took a few moments to collect himself before he could stand.\n\nHe looked at his Goddess, and one question that had plagued him forever came forward. \"Luna? I don't mean disrespect, but I'm fifty years old. Why did you wait so long to give me a mate, and then it is a human who isn't ready for me?\"\n\nShe looked out, her hands gently scratching the ears of her two companions, as she thought about how to answer. \"Sylvia is your mate, but she's actually the third woman I've paired with you.\" He froze as the implication came in. \"Your first mate was a warrior in a pack in Colorado, she was killed in a battle months before your scheduled visit there when you were twenty-two.\"\n\n\"Wait, you're a Goddess, how did you not save her? Or know that she would die first?\"\n\n\"Yes, I am a Goddess, but only the Goddess of Fate knows the future. When I pair wolves together, I make the best match I can, and then try to influence things so the two meet. Most times it works, other times it doesn't.\" She wiped the tear from his face. \"I then paired you with a child in a Cascade pack; when she grew up, she fell in love with another man and never sought you out. Last year she killed her wolf.\" She looked at the moon. \"She took a large dose of wolfsbane, so that as a human they could be together and have children. As you can imagine, this displeased me but since she was human she was no longer one of mine, and there is no going back from what she did.\"\n\nDonald was crying now, he had sat heavily on the ground as his wolf rubbed against him, howling his pain and loss to the moon. His whole life, two mates taken from him before he even met them.\n\nLuna sat at his side and placed her arm around him, the two white wolves pressing up against their backs from behind. \"I was going to find another, maybe one who lost her own mate, when all this happened. There was so much death, so many wolves died in that first couple days. Then I saw you on the road to Salmon. Did you ever wonder why you didn't recognize your mate's scent when you first smelled her on the men who attacked her on the road, but you did when you found her in the car?\" He nodded. \"It wasn't until I started to look at her that I knew she would be a good mate. She was so strong in the face of things; I know she is a mess right now, but there is steel within her. She is passionate, loyal, everything I was looking for in a match for you. Since her husband was killed, I put the bond in place between you and you know the rest.\"\n\n\"It's so difficult though, she resists the pull.\"\n\n\"She's in your arms now, isn't she?\" Luna smiled. \"It is different when I put the bond with a human, since they don't belong to me and they feel it differently. I have been doing this a lot lately, as you have seen. It was important that we bring humans in, to rebuild our Packs and allow us to survive the coming years. Now with Silvia, she doesn't understand everything, but the bond will do what it must. Treat her well and with patience, and she will rule by your side.\" She got up and pulled him up after. \"It is time for me to go, Donald. I will help you as I can, but your future is very much in your hands. You have the right ideas and instincts, so think of the people of the Bitterroot Valley as your Pack and you will do the right thing.\"\n\nHe stood there as she walked away, the two wolves by her side, as she was swallowed up by the mist. The darkness came, and when he next opened his eyes he was looking at Silvia's hair in front of his face. He smiled, his wolf content with her in his bed. He rolled to his back and looked at the ceiling as his mind processed the dream. He had never expected the Goddess to answer, much less what she had told him. It changed everything, and he was starting to get excited about the prospect of being the Alpha of a large pack with her by his side.\n\nHis thoughts were interrupted by Silvia's nightmare. She started to toss and turn, she was begging the men to stop, to leave her alone. He reached for her and this just caused her to scream and fight him. He gripped her wrists, holding them to his chest as he called her name and finally she woke up. \"Donald?\"\n\n\"You're safe, love. I've got you.\" With that, she rolled over and buried her face in his shoulder as the emotions poured out. He held her tight as she told him of that night, finally letting go of the guilt from her assault and rape. It took an hour for her to get it all out, but she finally fell asleep in his arms. \"I love you, Silvia. I always will.\"\n\nThe sound was so soft he could barely hear it, but he did. \"I love you too.\""
    ],
    "authorname": "partwolf",
    "tags": [
        "werewolf"
    ],
    "category": "NonHuman",
    "url": "https://www.literotica.com/s/dominant-species-ch-55-56"
}