{
    "title": "Fantasy Man Ch. 09",
    "pages": [
        "\"Zack, put me down. You're being ridiculous,\" Terri protested as Zack carried her up the flight of stairs to her apartment. \n\n\"No, sweet, I'm being the type of man that you deserve,\" Zack replied, nuzzling into her neck. \n\n\"I hope this isn't my present. Because if it is, it's nice, but not what I was expecting.\"\n\n\"And just what were you expecting, Buttercup?\" Zack asked, pulling his face back with a mischievous grin on his face. Hopefully, she was expecting exactly what he was going to give her. \n\n\"Umm, well, judging from the look that you gave me in the car, I was kind of expecting wild sex on various surfaces in the apartment.\" Terri could feel her cheeks heat as she thought about just what they could do on those surfaces. Surfaces like the kitchen counter, the dining room table, the couch...As the list went on, Terri could feel the moisture pooling between her legs. Zack knew how to put it down and do it so good that she was no good for the rest of the night. \n\nZack let out a husky chuckle before speaking. \"Oh, someone's feeling like being a naughty girl tonight. I like it.\" \n\nZack supported Terri while she unlocked the door. He carried her into the house and closed the door with his foot. Terri reminded him that the door needed to be locked, so he twirled around, spinning quickly, so Terri was able to lock the door. Well, after she stopped holding on to him for dear life. \n\n\"So are you going to put me down now, stud?\" \n\n\"No. I kind of like holding you in my arms. Plus, this way, you can't get away from me. I want to give you your present now.\" And to illustrate his point, he lowered her so that her rear end brushed his hard on. \n\nTerri smiled and bit her bottom lip. She never got over how well-endowed Zack was. It was long, thick and the man really knew how to use it. She didn't need him to be hung like a fucking horse, but it sure was one hell of a perk to being with him. \n\nShe continued to hold on to him as he carried her to his room. After they had officially started dating, Zack had gotten rid of the old bed and upgraded to a king size canopy bed. Terri had teased him about it being a princess bed and had actually called him princess a few times, but after he grabbed her, tossed her into the bed, and showed her a few of the reasons he had for getting the bed, she held her tongue from then on. She especially loved it when he tied her up with some of her scarves and had his way with her. She wasn't a bondage chick, but the way he made her feel, desirable, beautiful, helpless and yet safe, well, it was an addictive combination. Or maybe she was just a kink and Zack was just able to discover the things that turned her on, things she didn't even know turned her on. \n\nZack laid her down on his bed and climbed in after her. He couldn't decide what to do, jump her or go through with what he was planning. After looking at Terri and watching the rise and fall of her ample bosom, he knew that it would be over quickly if he was in charge. He had been on edge all night, watching Terri strut around in her dress. If he had his way with her, he would be in her right then and it would be a hard, fast coupling, with both of them screaming out their climaxes. But, as a present, he figured that the sex should last longer than 20 minutes and should include some foreplay. \n\nZack gave Terri a cheeky smile before stripping out of his clothing, slowly. Terri's eyes greedily took in Zack's form, watching him peel the layers off until there was nothing left. Zack's cock pointed upwards, coming close to his belly button. He was so hard, mostly because of the way Terri was staring at him. She was hungry for his body and who was he to deny her a feast?\n\nZack came back to lay beside Terri in the bed. He turned to her and looking into her expressive brown orbs, glazed over with desire, he said, \"Your present is me, to do with what you will.\"\n\nTerri's eyes widened, at the sight of Zack laying there and looking extremely fuckable. She wanted to mount him right then and there, but she guessed what his intentions were. He wanted to draw their lovemaking out, even though she could tell he was itching to lay it down so hard the bed creaked and the neighbors called the cops for all of the screaming that would go on. Since Zack wanted to take it slow, she would oblige...and have some fun of her own. \"What if I want to throw you out?\"\n\nZack frowned up at her before answering. \"You mean fuck my brains out? Because that would be ok with me.\" \n\nTerri laughed. \"In your dreams, Zack.\" \n\n\"Every night, sweet, every night.\" A slow smile spread across Zack's face. \"Why don't you show me what you think about at night, Buttercup.\" \n\nTerri arched an eyebrow. \"What are you talking about?\" \n\nZack propped himself up on his elbow. \"Don't think I haven't noticed...It's hard not to when you're making those amazing little sounds that I love so much. Although, I would probably appreciate them more if I was the one making you moan.\" \n\nTerri felt her face heat. He knew!?! Of course the bastard hadn't said anything. He just laid there all those nights and watched as Terri brought herself to orgasm, thinking about his cock and how she wanted it inside of her right then. \n\nZack chuckled. \"I love to watch you masturbate, Terri. It is one of the most sensual things that I have seen in a long time. Just looking at those long brown fingers of yours plugging up your hole and rubbing your clit gets me going. And to know that you're thinking of me, when I hear your little breathless pants and the way you say my name. Mmmm...Buttercup, you drive me wild. It'd be nice if you woke me up so I could play too, though.\" \n\nTerri punched Zack lightly in the arm. \"I didn't want to wake you up. I was being nice.\" \n\n\"Babe, anytime you need pleasure, feel free to wake me up, even if I'm just pretending to be asleep. I live to give you pleasure. I live to hear you say my name as you come.\" Zack paused to lick his plump pink lips. \"Show me what you think about.\" \n\nTerri smirked. \"I thought this was about me and what I wanted.\" \n\n\"It is. And what better way to please you than to help you live out a fantasy? I can be your fantasy man and you can be my queen.\" \n\nTerri giggled. Fantasy man? Zack obviously didn't know that he had been her fantasy from the very moment that she laid eyes on him. He was always her fantasy man. Now he was her love. Terri smiled warmly at Zack. \"I thought I already was your queen.\" \n\nZack frowned at Terri. \"You're thinking too much. Stop thinking and start doing before my cock breaks in half.\" \n\nTerri laughed and pushed Zack until he laid back down. Then she stood and undressed, letting her dress slip down her frame. She stood there, watching Zack's cock get even harder, before she began taking off her bra and black lace boy shorts. Zack loved her in them, mostly because he enjoyed the way her ass hung out at the bottom. Terri giggled as Zack's hand snaked down to grab a hold of his member. She turned and pushed her underwear down to the floor, spreading her legs slightly and giving Zack a view of her freshly shaved pussy. Zack growled, \"You are such a little tease. Get over here and get on my cock.\" \n\nTerri stood upright. \"No.\" \n\nZack pouted. \"No?\" \n\n\"No. You're mine to do with what I will. And what I want right now is to have you on your knees in front of me.\" \n\nZack sighed before sliding to the floor. 'I should have just taken her. She's driving me crazy,' Zack thought as he came face to face with her dripping wet pussy. \n\n\"Lick it.\" \n\nZack smiled and then attacked her pussy. He lapped at it like a kitten with a bowl of cream. He quickly turned her around and sat her on the bed before spreading her legs more and diving in. Once again, Zack found himself lost in the sensation of being face down in the pussy of the woman that he loved. His tongue bathed her folds, teasing the little spot right by her clit that seemed to set her off the most. His fingers pumped in and out of her hole, tapping her spot every time his fingers plunged into her depths. Zack listened to Terri's yelps and moans, noting that they were getting louder and more disjointed. It was a sure sign that she was about to cum and cum hard. \n\n\"Zack...\" Terri whimpered. \"I...I'm so close.\" \n\nZack doubled his efforts, assaulting her clit with his lips and tongue. His fingers moved faster and he maneuvered his other hand so that he could insert a finger into Terri's tight little asshole. Terri bucked as she came, screaming out her pleasure. Zack watched as she came back down to earth. When Terri finally caught her breath, she lifted her head and looked down at Zack, who was still perched between her thighs. \n\n\"Anything else, my queen?\" \n\nTerri twisted her mouth up as she thought about what she wanted next. \"Get your cute behind up here and put that hot cock in my mouth.\" \n\n\"Your wish is my command, my queen.\" Zack hopped onto the bed and swung his body around so that his cock was lined up with Terri's mouth and his tongue was ready to delve back into the depths of her pussy. If he was going to get his cock sucked, there was no reason that he couldn't make it a mutually gratifying experience. \n\nTerri grabbed a pillow to help prop her head up and took part of Zack's meaty cock into her mouth. She often had trouble fitting the entire thing in her mouth, because it was so long, but she wasn't going to stop trying until she could deep throat Zack's monster with ease.\n\nTerri's moans were muffled by Zack's dick in her mouth, but the vibrations that it caused around Zack's cock made him crazy. Zack's tongue worked its way into Terri's hole and he gave her a demonstration of what he was going to do as soon as she gave him the go ahead. The more turned on he became, the more vigorous his attack on her pussy. Soon, Terri couldn't continue her loving ministrations. She had to let his cock fall from her mouth while she bellowed out her pleasure. She felt as if she was going to explode. As her orgasm built, she began to writhe beneath Zack. As it hit, Zack flipped over and took his place on top of her. \n\n\"Buttercup, I need to be inside of you.\" \n\nTerri looked up at Zack, the raw desire in his eyes making her even wetter. She smiled as she took in the face of her lover. His blond hair was disheveled, but he wore his bedhead well. His blue eyes burned for her and her alone. His cupid's bow lips and his chin were ringed with her essence. Terri lifted her head, her tongue snaking out to taste herself on his face. Zack felt lightheaded at the feel of her tongue brushing across his lips. All the blood in his body felt like it was rushing to his cock. \n\n\"Terri, please. Baby, I need to feel you cum around my cock,\" Zack whispered. His look turned from desire to desperation and Terri couldn't hold him off any longer. \n\n\"Alright, baby. Bury that cock in me and give me your cum!\" \n\nThat was all it took. Zack lined his hard member up and plunged it into her. Terri shouted out and arched her back. Zack could feel her cumming and he couldn't help how pleased he felt. He pulled out until just the tip of his cock was still inside of his love and then he rammed it back into her. Over and over again, he plowed his lady love. He watched her expressive face as it told him just how much she was enjoying the way he was working her. He pushed into her from a number of different angles before he ground his penis into her, letting it graze her spot over and over. She came alive beneath him, cumming so hard that she nearly lifted him off of her as her body arched and bucked. \n\nHer mouth was open in a silent scream and Zack decided that she never looked as beautiful as she did right then...and he was the one who got to see it. She continued to buck until her orgasm subsided. As soon as it had, Zack was back to hammering her into the bed. The bed squeaked in protest, right before it began tapping out Zack's rhythm into the wall. Zack couldn't understand why he was so wound up, but it didn't matter. He was going to show Terri just how much he desired her body and if the wall needed a new paint job or the bed broke in the process, so be it. \n\nTerri could barely think. She could barely move her mouth to make the noises that spilt from her lips. Zack was voracious and she was loving every minute of it. Terri wrapped her legs around Zack's waist and hung on for dear life as he continued to pound into her, hard and fast. Because she was feeling a little masochistic, she panted out, \"Faster, baby.\" Those two words were really all that she could manage and when Zack obliged her wish, she knew that speaking was probably out for the rest of the night. She was going to end up screaming herself hoarse. \n\nZack could feel the orgasm that he was trying to hold off burst out of his cock and into Terri. His roar of completion was louder than Terri's final yell. Zack collapsed on top of Terri after the last of his cum was deposited inside of Terri's tight channel. She made a motion to hold him, but her arms fell weakly back to her sides. Zack smiled smugly. Another job well done as far as he was concerned. \n\nAfter a few minutes, Zack rolled off of Terri and gathered her up into his arms. Terri opened her eyes and spoke. \"You have pleased your queen.\" \n\nZack chuckled. \"I do believe that is an understatement.\"\n\nTerri was going to protest, but that would have taken more energy than she had at the moment. Besides, the man deserved his due. He had taken her to heaven and back a couple of times. Terri snuggled up next to Zack. \n\nZack breathed in her scent, one that was mixed with the aroma of sweat and sex, the one that he wanted to smell for the rest of his life. As much as it scared him that somehow the woman in his arms had wormed her way into his heart without really trying and that he was ready to commit to her for a lifetime, he knew that there was no one better for him. In fact, there was no one else for him. Terri Hunter was his life. He lived for her...and it was time to start telling her that. \n\n\"Buttercup.\" \n\n\"Mmm?\" \n\n\"I love you.\" \n\nZack felt Terri stiffen against his chest and wondered if it was the wrong time to tell her. Maybe he should have waited until they were out of the bed and fully clothed. Zack was about to begin berating himself when he was interrupted. \n\n\"I love you too, princess.\" \n\nZack squeezed Terri tight, willing to overlook the princess part because the woman he loved had the same feelings as he did. He was willing, but he had to say something.\n\n\"Princess? Doesn't that make this a bit incestuous, my queen?\"\n\nTerri laughed. \"You're such a pervert. You're obviously a princess from another land. We look nothing alike and I'm so much prettier than you.\" \n\nZack gently bit Terri on the shoulder. \"You are a lot prettier than I am, my queen, and I am the luckiest princess...er, I mean, prince in all the land to be able to be with a woman like you.\"\n\n\"Damn straight. So do you really love me?\" \n\n\"Every day, all day. Probably since the moment I met you. I felt a spark then and there was something about you that just fired me up. Now my love is like a blazing inferno. It consumes me and I can't get enough of you.\" \n\n\"So it was my fault that you broke up with Amanda?\" Terri questioned, not sure if she wanted to hear the answer. She really didn't want to be that woman, even if it turned out to be the best thing that ever happened to her. \n\n\"Yes and no, love. No, it's not your fault because it was bound to happen. I didn't really want to be with Amanda. I...How can I put this? I was using her to get off, but I never returned the favor, mostly because she cheated on me all the time. I never wanted to take the chance that she might give me something. I was holding on to her until something better came along and that something just happened to be you.\" Zack smiled down at Terri and traced her face with the tip of his finger. She really was beautiful. \n\n\"I was selfish before, all my relationships were all about me, and now I know what it is to give all of myself in a relationship. You've helped me become a better person and I thank you for that. You're the one that I want to spend all of my time with...the rest of my life with. I love you, Terri. I was lost from the moment you delivered my pizza. So yea, it was your fault. It was your fault for being so amazing and loveable. I couldn't stay with her knowing that you were out there, waiting for me. I need you in my life, Terri, and now that I have you, I'm not letting you go.\"\n\nTerri could feel the tears streaming down her face. What Zack was saying was so sweet and exactly what she needed to hear. He wanted her...for the rest of his life. Was she ready for such a step? Maybe she was...\n\n\"Are you asking me to marry you?\" \n\n\"Not officially. You'll know when I'm doing it for real, I just want you to know how I feel. I want to marry you sometime in the future. I want you to be the mother of my children. I want to take Viagra and try to get into your old wrinkly ass with my shriveled up cock when we're 90. That is my intent. I will never willingly be without you again.\" \n\nTerri was still laughing from the mental image of a 90 year-old Zack trying to get inside of her. Knowing him, he'd probably break her hip or something trying to pound into her pussy. She could feel the tears once again rolling down her face, but these were tears of joy, the tears that often came when she laughed too hard. In between fits of laughter, Terri proclaimed, \"I love you, Zack. When you want to get hitched, just let me know, because my intent mirrors yours. I want to be with you for as long as you'll have me.\" \n\nZack gathered Terri close and sighed. 'So, this is what it's like to be content. It feels nice to know that I don't have to look anymore. I have my soulmate right here.' Zack's smile grew as the thought entered his head.\n\nTerri's thoughts had turned from Zack to her future with Zack. They had only been dating for a short time, but somehow she knew that she was with the man that she would grow old with. As long as he didn't think that their getting married meant that she didn't have to work anymore, they would be fine. Terri knew that there were things that they needed to talk about, but for the moment, she would just revel in the feelings, the feeling of being thoroughly fucked and the feeling of being loved by the man that had been a part of her dreams for so long. She could worry about all the rest in the morning. "
    ],
    "authorname": "angelicsounds",
    "tags": [
        "drama",
        "romance"
    ],
    "category": "Interracial Love",
    "url": "https://www.literotica.com/s/fantasy-man-ch-09"
}