{
    "title": "Female Masturbation, Japanese Style",
    "pages": [
        "This story is inspired by a series of Japanese videos titled \"Female Sexual Esthetique.\"\n\nEriko had always been close to her Grandmother, who had spoken at length about her life in Japan until she died last year. Eriko was amazed at the stories her grandmother told, things that her mother would never even mention. During her grandmother's life, the sexual norms in Japan were quite different, woman submissive to men. There was also a booming fuzoku or Japanese adult services. While most catered to men, there was one that also catered specifically to woman, Seikan Massage. Woman would go there to satisfy their sexual desires without any complications.\n\nEriko was Japanese or Japanese-American, her parents born in the United States just as Eriko was. Her black hair hung down almost to her waist. She had rather large breasts for an oriental, full hips and a luscious ass, or at least the boys were always telling her. She wore short skirts that always showed a lot of leg, but it was more the style then her desires. She was a bit shy, although you wouldn't know it unless you dated her. Then you would find that she was modest, almost ashamed of showing her naked body to anyone, though she had lost her virginity to her last boyfriend, finally giving up her innocence after twenty-one years, quite an accomplishment nowadays. That was her problem. Her boyfriend broke up with her almost as soon as he took her virginity in a quick sexual encounter in the back seat of his car. It was as if he only wanted her virginity and then he discarded her for one of the cheerleaders at the University they attended; Eriko sure that the cheerleader was more sexually experienced. Eriko had taken it hard, not dating for over six months now. \n\nThat was when she started to devise the plan. She had never visited Japan. She was going next week with her parents and she had been planning a side trip for months now, inspired by her Grandmother's stories. She was surprised that the fuzoku was still booming in Japan, the Internet providing more than enough information to begin to plan. She found that in Tokyo, there were at least four Seikan Massage parlors that catered only to women. Her Grandmother's sexual exploits as a young girl in Japan made Eriko want to try something daring. She would go to a Seikan Massage parlor and get a massage. She only hoped she could keep her nerve once the day came.\n\n* * *\n\nThey had been in Tokyo for three days, but Eriko was unable to escape from her parents. Finally the opportunity came. The big banquet for her Father's company was tonight and Eriko faked a stomach illness, easily able to fool her father but not sure if her Mother bought the whole story. They finally relented, letting Eriko stay in her hotel room while they attended the banquet. She hurriedly dressed as soon as they left, slipping into a short skirt and sweater. She would have at least eight hours before they would come back, as the banquet was expected to run late. Eriko slipped out the back of the hotel, not wanting anyone catching a glimpse of her. She walked around to the corner and quickly hailed a cab, at least three pulling over, men always paying attention to a girl with a lovely body. She got into the first one, hoping the driver spoke English. She gave him the address, a surprised look on his face.\n\n\"That's Shinjuku Eastmouth you know,\" seeing that she was American even though she was oriental. \"The Kabukicho is there.\"\n\n\"Kabukicho?\"\n\n\"Yes, the red light district. A lovely girl like you do not look like the type that needs the Kabukicho.\"\n\n\"Just take me there or I'll find another taxi that will,\" trying to sound adamant, though she was more embarrassed than anything else. She hoped he would take her, not wanting to go through this again.\n\n\"Anything the lady wants.\" He turned around and started to drive, at least the fare might be good, hoping that she was a big tipper. It took almost a half an hour, the traffic terrible. He looked down the street before he saw it, pulling up to the bright pink neon light that was flashing, JOUNO YOROKOB. \n\nShe was nervous now, the place not what she expected. It was a small shop on a street littered with sex clubs and bars. She took a deep breath, throwing some money over the seat to the driver and rushing out of the cab before she could change her mind. She looked around, more men on the street than woman, moved quickly to the door, wanting to get out of the bright lights. The door opened, Eriko passing inside, a small bell ringing as it closed behind her. She was in a small waiting room with a couple of chairs and a table and a counter in front of them. She looked around but there was no one in sight.\n\nHe went into the front room when he heard the bell, surprised to see her. Obviously an American, though she was Japanese. She was young, had to be about twenty. The girl was startled when she turned around and saw him.\n\nHe suddenly appeared as if out of nowhere. He was about forty or so, the same age as her parents. He was not handsome by any standards, long, wavy black hair and a pair of black glasses. He wasn't ugly, but not what she expected.\n\n\"Good evening. Are you in the wrong place?\"\n\nShe was glad he at least spoke English, not sure what she would have done if he didn't. \"I don't think so. I am looking for a massage.\"\n\n\"Then you are in the right place, although I am not sure why such a lovely girl as you would need a massage.\" He looked at her, a lovely body, sure that many boys would love to satisfy her sexually.\n\n\"That's none of your business. Let me speak to the masseuse.\" She sat down in one of the chairs, her skirt riding up too high on her legs as she squirmed to pull it down, his eyes staring at her as if he were stripping her naked.\n\n\"You are speaking to him. Now why would a lovely girl like you need a massage? You do realize that we cater only to woman that want to obtain sexual gratification.\" He decided to be blunt, not sure if the American knew what she was getting into. He could see her squirming, uncomfortable at having to talk to him. It wasn't his looks that made him desirable, but his hands.\n\nShe wasn't sure she could do this, the man not what she had expected or desired. She wasn't sure what she expected, maybe someone her own age, handsome, someone that would excite her. She could hear her Grandmother telling her about the time she went to a place like this and how exciting it was. The man looked like he didn't even want to do it. \"Yes, I know what you do.\" She hesitated as he waited for her to continue. She finally spit it out. \"I broke up with my boyfriend over six months ago and haven't dated since. I'm looking for sexual release.\"\n\n\"Why here? Can't you just masturbate?\"\n\nHe was asking her more questions then she thought would happen. She thought she would just pay and it would begin. This was getting embarrassing. \"I want a man to do it. But I don't want the emotional or physical attachment I would have with a date. He would expect me to reciprocate. I don't want to do that.\"\n\nHe saw the look of desperation on her face. \"Well the only thing you have to reciprocate with me is to pay me. In advance,\" he added.\n\n\"How much?\"\n\n\"Thirty five thousand Yen.\"\n\nShe calculated quickly, over three hundred dollars. That was more then she had figured. She looked into her wallet, counting the money. She had enough. \"Are you that good?\"\n\n\"I never had a customer that didn't cum for me.\"\n\nShe rose and handed him the money. \n\n\"What is your name?\"\n\n\"Eriko.\"\n\n\"You realize that you will need to get naked for me?\n\n\"Of course,\" though it sound harder now.\n\n\"And I am going to touch your naked body. All over.\"\n\n\"Yes.\" She put her head down, not wanting to see his face.\n\n\"Then step into the next room. Take off all of your clothes except your bra and panties. There is a robe for you. Go into the next room after you are ready. I will be waiting for you.\"\n\nShe almost ran from the room, closing the door behind her, finding herself in a small changing room. She leaned against the door, breathing deeply. What was she thinking? How could she do this? She already gave him the money, sure that he wouldn't give it back if she changed her mind. \"I can do it Grandmother. Just like you did.\" \n\n\"Everything okay?\"\n\n\"Yes,\" she stammered. \"I'll be out in a minute.\" She took off her shoes and socks first, trying to forestall the inevitable. She was still breathing heavily when she pulled her sweater over her head, folding it neatly before slowly putting it on the table. Her skirt was next, grabbing it before it fell to the floor. She placed it on top of her sweater, quickly pulling the white robe around her, tying the single belt around her waist tightly. The robe was thin cotton and provided little protection. She felt a wetness between her legs as she stood in her underwear, ready for a massage. She was actually going to do it, let a strange man run his hands over her body. And if successful as he said, masturbate her until she came. She took a deep breath and opened the door. He was waiting for her, his eyes looking her over as she entered. A large massage table took up the majority of the room, covered with a white blanket, a pillow at one end.\n\n\"On the table, face down.\"\n\nShe climbed on the table, putting her head down on the massage pillow, glad she wouldn't be able to see. She felt him move next to her, her body tense as she waited his touch. She felt a light blanket thrown over her body, covering her from head to foot. He arranged her head so she was staring to the side. She didn't even have time to think about it when she felt his hands on her body. He began to rub her, starting at her neck and quickly moving down her body until he reached her feet, then moving back up again. Twice he ran over her body, Eriko not even able to protest when his hands ran over her ass cheeks. He moved back to her neck, his hands kneading her from her neck down to her waist, his strong fingers digging into her back.\n\nHe climbed onto the table, perched over her as he began to push hard on her muscles. \"You are tense. You must relax.\"\n\nShe could barely speak even if she wanted to, his hands pushing hard on her back. It began to feel good, her muscles loosening as he began to rub the tension away. His hands moved down her back again, this time stopping on her ass, his hands moving back and forth rigorously, her cheeks jiggling, his hands moving back up and down her body before she even realized it. His hands moved down her legs, running down one side until he reached the end of the table. She was shocked when his hands grabbed her ankles and spread her legs until they were almost to the edge of the table, grateful for the blanket and the robe that covered her.\n\nShe felt him kneeling between her spread legs on the table, pulling one of her legs out wider, his hands kneading her legs, moving up until he began to rub her inner thigh, his hand so close to her sex. He continued to rub her inner thigh, the blanket and robe pushed between her legs as he made her flesh jiggle as he robustly massaged her inner thigh. He moved the other leg open wider, Eriko feeling his hand on her naked leg, the blanket pulled back as he kneaded her other leg, stopping again at the juncture of her thighs, his hands rubbing vigorously as her flesh jiggled again. He was moving so fast, Eriko was unable to keep track of his hands.\n\nHe got off the table, pulling the blanket to modestly cover her legs again, moving to the top of the table. His hands ran down her back, his powerful fingers kneading her tight muscles. Suddenly he was gone, returning with another pillow. He finally spoke again.\n\n\"Turn over onto your back,\" pulling the massage pillow from underneath her and replacing it with a large pillow.\n\nShe turned over as he pulled the blanket off of her, Eriko moved quickly to pull the robe down over her naked legs where the robe had ridden up from his hands. She lay back down on the table, the blanket thrown over her again, his hands straightening it out. His hands began to run over her body again, this time moving quickly down her front, moving back and forth. Even when he moved away and went back to over her head, his hands would rub over her body, rubbing her stomach and running quickly over one breast as if it didn't even happen. She closed her eyes as he stood over her.\n\nHe ran his hand over her arm under the blanket, his fingers rubbing against the edge of her breast. His hand moved quickly to her side, beginning to rub the edge of her breast vigorously, making the firm flesh jiggle back and forth. He moved to the other one, Eriko feeling strange as he made her breasts dance. He went from one side to the other three times, Eriko's eyes clenched tightly as she could only imagine how it looked, her breasts jiggling as he started down at her. He finally stopped.\n\nThen she felt it, his hand on her breast, just like a boy would do to her but more boldly. His hand began to massage her breast, moving back and forth over it, making the firm flesh jiggle again. She could feel her nipple hardening, her breasts sensitive to touch. His hand quickly moved down her stomach, rubbing the rest of her body just as he did to her breast. She felt him move down to her abdomen, moving back and forth as he put pressure on his hand, pushing into her flesh.\n\nShe felt his hand on her inner thigh again, rubbing back and forth, forcing her leg to bow out from his strength, ashamed at how she must look. His hand rubbed back and forth over her tender inner thigh, almost too harshly as he rubbed so close to her pussy that she could feel her juices begin to flow. He moved to the other leg, forcing her to bow her leg out again, feeling obscenely exposed as he rubbed so close to her pussy, his hand moving so fast that she could even comprehend any longer.\n\nShe closed her legs tightly as the heel of his hand pushed hard on her mound, rubbing back and forth. She opened her eyes, his eyes staring intently at her face as his hand pushed harshly back and forth over her mound, feeling her lips pushed back and forth. She closed her eyes again, unable to see his stare. Her body rocked back and forth as his hand rubbed her. Relieved, he stopped, his hand moving up and down her body, rubbing her breasts, his fingers even running across her face as he moved back to the end of the table again.\n\nHis hands ran down one leg, along her inner thigh until he reached her ankle. She was shocked when her bent her leg back, moving to her other ankle, but not before he threw back the blanket and robe that covered her. Suddenly her legs were pushed back almost to her chest, hearing the bones crack in her back as he made her body rock by pushing on her knees. She could only imagine how exposed she was, her panties the only thing hiding her sex, her legs thrown back as if he was going to fuck her. He rocked her body back and forth, feeling as if his eyes were burning a hole in her crotch.\n\nShe was relieved when he put her legs back down, leaving them spread slightly. He began to rub her inner thigh again, this time his hand on her naked flesh. She couldn't help herself when his hand moved to the edge of her panties, running up and down the edge. She felt her leg spread wider, unable to comprehend that it was her that was doing it. He banged his hand into her sex, the touch on her pussy sending her into spasms of pleasure. His hand moved to her other leg, Eriko unintentionally letting her leg bow out as he rubbed her inner thigh with both hands before touching the edge of her panties. God, she wanted him to touch her pussy, no longer caring. His hands were suddenly gone again, the blanket pulled modestly over her legs again, Eriko disappointed. His hand ran up her body again, massaging her breasts, moving down her thigh, moving back up into the heel of his hand pushed into her mound again. He pushed, moving back and forth. She didn't close her legs this time, in fact they parted, the heel of his hand sliding lower, rubbing back and forth over her mound.\n\nShe knew he was watching her reaction as his hand masturbated her pussy, her body rocking back and forth as he pushed harder. She spread her legs wider for him, eager to feel his touch. \n\nHe stopped again, this time moving to her head. She felt him lift her up, her strength drained by his hands, her body so relaxed she couldn't even sit up without his help. She felt the blanked fall away, his hands moving to the belt of the robe, quickly slipping it over. Before she could protest, he was pulling it off her body, manhandling her limp body until he had it off. She shivered in fear as she was clad in only her bra and panties.\n\n\"On your belly.\" His voice broke the silence of the room.\n\nShe turned over onto her belly, putting her head back down on the pillow. She hadn't thought about this. She had only imagined him looking at her breasts and her pussy. She didn't even think of her ass. His hands were unclasping her bra before she could even lay down, his hands sliding it from her body, Eriko glad she was on her belly, her naked breasts hidden from his view. At least for now. She didn't feel the blanket this time, her legs tightly together as he moved to the foot of the table. His hand ran up her naked legs, moving to run over her panty covered ass cheeks, rubbing them sensuously. \"Noo,\" she tried to protest, but her panties were quickly pulled down her legs, leaving her naked on the table. His hand moved up her leg, this time finding her naked cheeks as he rubbed her. She heard him move away, her hands clenching the edge of the table as she waited for his return. And the return of his touch. She almost wished she didn't open her eyes when he walked back, seeing him carrying a small container of oil. He was going to rub it on her body, Eriko sure that her ass would also be included. No one had ever touched her there, Eriko couldn't even fathom it when she thought of this.\n\nShe felt his hands grip her ankles again, spreading her legs again as he sto0d between her legs. He began to dab drops of oil on her, starting with both of her feet, the back of her knees, moving up to drop a dollop just below her cheeks. A drop on the center of her back, moving up from her waist to her neck, each time spreading oil on her, readying to massage her. He moved back down to the top of her ass. No, she cried silently to herself, her hands turning white as she clenched the edge of the table. His oiled finger had moved between her crack, finding her anus unprotected, rubbing his oiled finger back and forth over her tiny hole. It seemed like hours as he oiled her anus, pushing with his finger until the tip entered her, her anal ring burning as he pushed inside her. She couldn't move, if she did, she would further impale her anus on his finger. She suffered under the rude fondling. But the strange thing is that her pussy drenched the towel under her as she suffered his fondling.\n\nHe finally pulled his finger from between her cheeks, Eriko feeling relief, although she felt a bit empty. He moved down to the foot of the table again, seized her ankles again, spreading her legs wide to accommodate him. He rubbed the oil into her skin, beginning with her foot, massaging it. He moved up to her calve, rubbing her flesh back and forth until she felt her skin slick with the oil. His hands moved to her inner thigh, her leg forced to bow outward as he vigorously rubbed her skin, his hands straying close to her pussy, Eriko shivering in lust. He began to rub her ass cheeks, massaging them as if it wasn't anything different. She could feel her cheeks pulling apart, her oiled anus exposed to the cold air. He moved back down to her inner thighs, rubbing them with both hands, so close to her pussy. She felt him move away to the back of the table, his hands moving up between her legs.\n\nHer ass arched up into the air when he touched her. Touched her pussy. It wasn't just close this time, his hand slick with oil ran up her slit and between her cheeks to run over her anus again. He pulled his hand back down again, Eriko arching up again as she felt his fingers between her slick pussy lips. God, she could almost cum from his touch, her body so hot.",
        "He rubbed her pussy after he massaged her ass cheeks, her body bouncing around under his powerful hands. His fingers moved slower when they passed between her legs, one thick finger sliding easily between her lips before running through her crack, running across her anus. She couldn't control her muscles, her anus clenching uncontrollably each time it was touched. Eriko couldn't believe that it could be so sensitive, the tiniest touch of his finger sending her pussy wet with arousal. He moved to the end of the table, spreading her legs wider, massaging her other leg, starting with the soles of her feet, moving up until he ended at her thighs, his hands almost hurting as they pushed into her sensitive inner thighs. His fingers tickled her pussy from behind, fluttering on her lips as she arched her ass up, offering her pussy to him. His finger moved up and down her slit as she bucked underneath him.\n\nHe massaged her back, Eriko's body going limp as he rubbed the muscles. Each time he changed position, his hands slid over her ass or between her legs as if he were casually touching her, her body jerking to attention each time. He rubbed the oil in her back before he moved to the head of the table. He lightly ran his fingernails over her skin, moving from her armpit, down her side, Eriko fighting to stop from moving. Each time he moved down to her body, her ass would arch up again, her legs spreading wider. He moved up and down as she shivered in arousal. His hand moved down the center of her back, pushing on her backbone as they moved back over her ass, her ass arching up as they ran between her cheeks and through her pussy lips. \"MMM,\" she moaned in pleasure as his fingers gripped her cheeks, pulling them apart, one thick finger sliding effortlessly up and down her pussy and anus.\n\nHe went behind her again, his hands slowly running up her hips, low on the table, his fingertips barely grazing her skin as she arched up. His hands slid along until the grazed her breasts, Eriko pushing up, wanting to feel his hands on her naked breasts. His hands slid along her slit, pushing aside her lips as she shuddered from the intimate touch. His hands moved to her hips, this time urging her hips up, forcing Eriko up onto her knees, his hands guiding her into a kneeling position. Eriko hid her face into the pillow. She could only imagine how she looked, her ass arched high up into the air, her head down submissively. His hands moved between her legs, stroking her inner thighs as he kept her from moving back down.\n\nHe continued to stroke the back of her thighs, his hands sliding up and down over her ass cheeks, rubbing her pussy from behind as her hips began a gentle motion. \"Mmmmmew,\" she cried as he stroked her, her head hung in shame as he masturbated her. Each time she would try to lay back down, his hand slid between her legs, his fingers running through her slit, forcing her back up again. Once up, his fingers would run through her cheeks, his slick fingers running sensuously over her anus. Her hips would try to move back down, his hand again gripping her sex.\n\nShe never felt so exposed before, his hands continually running over her ass and pussy, her cheeks pulled apart, her anus and pussy exposed obscenely. \"Meeeww,\" she cried, arching up, his finger sliding along her slit until it reached her cheeks. \"Nooo,\" she tried to protest, but his finger continued to rub her anus, his slick finger finding its way inside her up to the first knuckle. His hands kept her in position, on her knees, her ass thrust up obscenely as if she were a submissive wife being readied by her husband, her anus impaled on his slick finger. Suddenly it pulled from her anus, Eriko feeling a burning sensation as her little hole shrunk back down.\n\nHis fingertips went under her body, grazing over her hanging breasts, teasing the nipples to hardness. They tickled her hips before sliding between her legs to run sensuously between her thighs. She felt him grab one of her inner thighs. \n\n\"Spread your legs wider Eriko.\" \n\nHe grabbed her thigh, pulling her leg open, then moved to the other thigh and extending her legs until she was obscenely spread. Her legs almost ached from the wide expanse. His fingers ran over her ass again, her cheeks spread wide, allowing complete access to her pink inner pussy. His fingers ran up and down her slit, paying special attention to her vagina, teasing the open hole.\n\n\"Your pussy and asshole are so open for me Eriko. Do you like being on your knees and spread for me?\"\n\n\"Mmmmew,\" she moaned in pleasure as his hands seem to be everywhere, her body unprotected, unable to stop him from touching her intimately. Her hips moved up and down in mock fucking as he caressed her flesh so intimately. How did she get into this position? She only came her a half hour ago and already he had her naked and was masturbating her spread body. Not even her boyfriends had done as much. Nor had they ever made her feel so good before. The humiliation of being in such an obscene position before a stranger somehow clouded the issue of the pleasure he was extracting from her body.\n\nShe felt the edge of his hand slide between her cheeks, sliding up and down, his hands moving over her ass cheeks, down between her thighs and back up her pussy. \"Eeeh,\" she moaned in pleasure, her ass rising up and down. He kept one hand on her back, keeping her down while his other hand kept her ass thrust up for him. \"Mmmmew,\" she moaned as his hands played along her sides before moving to her hips, his other hand sliding along her slit. He stopped, leaving her needing his touch.\n\n\"Turn over.\" \n\nHe left her as she turned over and lay back down, her hands at her sides, her head turned, her breasts arched up, eager for his touch. She heard him return, seeing the bowl of oil in his hand again. She closed her eyes tight as she waited his touch. He let his fingers lightly graze her bush. \"Mmmeww,\" she moaned in pleasure as her hips urged up, seeking his fingers, her legs spreading wider. She couldn't even control her body any longer, his fingers extracting the actions from her. But he had deserted her, moving to the foot of the table. She felt him pull her legs apart, sure that he had an unobstructed view of her naked pussy between her legs. He began to leave dollops of oil on her body. He started with her ankles, her knees, and finally her hip bones. His hands returned to spread the oil, starting with her feet, her flesh massaged with powerful hands. He pulled her thighs open, her legs forced to part as he kneaded her thighs, moving close to her pussy. He rubbed up and down her inner thigh, making it slick for his hands, Eriko spreading her legs wide as his fingers teased so close to her pussy. He moved to the other side, her leg bowed out by his powerful hand, her pussy opening wide from the obscene spread, his hand oiling her body. She could only imagine how she looked, her legs spread wide, her pussy lips pulled back. His hand rubbed her inner thighs, moving so close she could feel it in her pussy. Each time he came close to her sex his hand would slow down, teasing her as it almost came in contact with her pussy, her breathing stopped while she waited the touch. But he would speed away, his hand moving back down her leg. Eriko even spread her legs wider, bringing them up, hoping to entice him to touch her, but it did no good. \n\n\"Eeeh,\" Eriko shivered as the cold oil was spilled into her belly button, his hand moving quickly to massage it into her skin. His hands moved in circles, slowly moving lower until he finally brushed over her bush, the tiny follicles of hair exciting the skin beneath. Her hips moved up and down as his fingers rubbed along the edge of her labia, massaging in the slick oil. Again she was left empty, his hand moving up, leaving dollops of oil between her breasts. \n\nEriko brought her legs back up, keeping them spread for him as she waited for the touch on her breasts. Her nipples were extremely sensitive, sure she could cum from just the touch on her nipples if someone would work long enough on stimulating them. She held her breath as his fingers began to massage the oils in her firm breasts. No one had ever touched her breasts as he did. He used two hands on one breast, slowing circling around the base with all ten fingertips, pushing in towards the center as he compressed the flesh into a tighter and tighter circle until it felt as if he was pushing all the blood into the tip. He moved to the other breast, his hands repeating the action. Each time his fingertips would reach her nipple and pinch the hard tip. \"Mmmeewww,\" she moaned in pleasure, her legs closing tightly, wishing it was his hands between her thighs. His fingers pinched tightly on both of her nipples and pulled them up. Eriko arched her back, her legs spreading out. \"EEEehhh,\" the pleasure in her nipples too much to quietly endure. He released them, suddenly yanking them back up again, Eriko's ass arching up from the bed.\n\nEriko's legs relaxed for a minute as his fingertips lightly traced along her sides before moving back up between her legs to end up between her breasts again. His fingertips lightly traced across her nipples, three fingers tapping the hardened bud as she moaned in pleasure, this tips growing in size as he stimulated them. He took her arms, pulling them over her head, her breasts arching up as she assumed the position he wanted. It felt almost as if he were tying them over her head, her hands gripping the edge of the table. He put more oil on the sides of her breasts, now so exposed. Each time he would return to a breast, his two hands massaging the oil into the flesh as he pushed his fingers in circles until they encircled the hardened nipple, his fingertip pinching tightly on it as arched her back up, moaning in pleasure.\n\nHis hand moved down over Eriko's stomach, over her leg and back up the other side until they swept over her up thrust breasts again. \"EEEHhh,\" her legs pulling up, bowing out as she opened herself for him, thrusting her breasts out for his touch. He touched her nipples again, the hard tips feeling as if they would burst. His hand pushed her legs flat on the bed again but spread them, his hand running up and down one naked leg, rubbing slickly over the oil.\n\nHe pushed her inner thigh until one leg bowed out, his hand running up and down the slick flesh, stopping before he actually touched her pussy. His other hand plucked at one of her nipples, her leg spreading wider as she opened herself up for his touch. He moved to the other thigh, her legs bowed out obscenely as he rubbed her thighs. He returned to her nipples, this time paying special attention to them, his fingers plucking and tugging on them. Eriko could only moan in pleasure, her legs opening and closing as if he were training her to open her pussy up for him. \"EEEEHHH,\" she cried out as he pulled on her nipples. They hurt, but it was a delicious kind of pain, his powerful fingers crushing the flesh beneath them as he twisted them.\n\nShe could feel him close to her, his hands tightly gripping her nipples. \"Do you want me to touch your pussy?\" He twisted her nipples as she moaned in pain or pleasure, her body unable to comprehend the difference any longer.\n\nEriko brought her legs up and spread them for him. \"Please touch me,\" she begged. Her toes curled in expectation.\n\nShe arched up her ass as his hand slid down to rub her inner thighs, almost touching, but teasing her pussy. He moved to the other side, rubbing her thigh. Eriko opened her eyes, seeing his gaze between her spread legs, knowing that all of her charms were naked for him. \"OOOHH GGGGODD,\" she moaned, her ass arching up from the bed as his hand slid between her legs and slowly dragged between her pussy lips as her hips followed upward. It was gone just as fast, rubbing her breasts again. Eriko's pussy flooded with her juices, his one touch almost made her cum, her nipples even more sensitive if that was even possible.\n\nHe moved back down to her legs, forcing them flat on the table. He grabbed one ankle and pulled her leg up, bending her knee, bringing it up her chest. His hand slid underneath to massage the oil into her thighs. He brought her leg almost straight up into the air, the cool air blowing on her superheated pussy, his hand sliding below to caress her open crack. He moved to the other leg, bending it back, Eriko sure that her pussy was obscenely spread for him, his hand running up her slit again, but not before pausing over her anus. She could feel the tiny hole opened by the wide expanse, his fingertip running over the anal pad. He pinched a nipple as one finger drew through her pussy lips. \n\nHe left her pussy empty again, his fingers moving to her breasts again. He played with them for over five minutes, his fingers hurting and pleasuring all at the same time, his large hands easily able to grasp her breasts in his palm and squeeze tightly. Eriko's nipples were yanked harshly, pulled from her body as she cried out in pleasure. His fingertips rubbed back and forth over the tip, the pleasure giving way to pain as they began to get raw from the attention. But it didn't hurt, not the way you would think it would. The pain mixed so much with the pleasure, her nipples wanting both. Eriko's ass bounced up and down on the bed, her legs opening and closing, looking for any stimulation, the touch of his fingers on her pussy leaving her wanting.\n\nHe moved one hand down between Eriko's legs again, his hands forcing her legs to spread, her knees drawn up and bent. She knew it was finally time. He was going to stop teasing her and masturbate her until she came. \"MMEE,\" Eriko screamed in pleasure as two slick fingers slid up between her lips, her ass arching up in pleasure, his other hand pushing down on her hip, holding her open for his probing. The fingers slowly drew through her pussy, her body arching up as they passed over her swollen clit. He must have oiled his finger again, because it returned, pushing deep between Eriko's lips as the fingers moved from the bottom to the top in a slow, torturous movement that stopped her breath. The oiled fingers returned again, mixing with her juices as they took the torturous trip between her pussy lips, pressing hard as her ass rose up. \n\nTwo fat fingers pushed her lips aside and began a gentle masturbation up and down her slit. Her nipple was met by two fingers, tightening on the swollen nub and twisting as she moaned in pleasure, her hips beginning a gentle fucking motion on the masturbating fingers. Eriko's legs went back flat on the table, but she spread them wide for him, his gentle masturbation continuing to arouse her.\n\nEriko's hips moved side to side, her legs spreading wider, her breathing ragged as his fingers ignited the pleasure between her legs, her sensitive nipples never alone, his fingers or hands always keeping her nipples as hard as darts. \"OOOHH,\" Eriko moaned in pleasure, imagining how she must look, like some street whore, lying naked on the table as a stranger masturbated her, his hands running all over the most intimate parts of her body. Why would a twenty-one girl strip naked in a bright room and let a forty-plus year old man take liberties with her naked body? She could think of only one reason. He paid more attention to her pleasure then any boy had ever. They wanted only to put their cocks between her legs, maybe a bit of sucking on her nipples, but that was quickly forgotten once they got into her hot, soft pussy. His only reason for touching her body was to bring her pleasure.\n\nHe suddenly ran his palm down Eriko's slit, the other hand followed quickly behind, back and forth his hands changing as her legs drew up and parted, leaving her open to his fondling. \"Mmmm,\" at least three fingers slid up and down her slit slowly, dragging across her swollen clit, pushing hard on her sensitive pink insides. Eriko moaned noisily in pleasure when he drew his fingers up, the oiled fingers pushing and pulling on her clit as they moved.\n\nHe surprised her again, her pussy lips pulled back wide, his fingers began to strum on her open insides. Slapping was more like it as it increased in tempo, the three powerful fingers almost spanking Eriko's pussy, her tender inner pussy. She spread her legs wider, feeling her lips part, not knowing whether she was trying to escape from his fingers or welcoming them, the thought of her pussy being spanked sending shivers between her legs.\n\nEriko's ass rose up from the table when his fingers moved down, pausing at the entrance to her vagina. The moment of truth was upon her. A strange man was going to put his fingers inside her. Eriko's answer was bowing her legs out wider, hoping to accommodate him. It didn't even seem to matter any longer that he was a stranger or as old as her parents. The only thing that mattered was her orgasm. \"OOOOH.\" Her hips moved to the side as she felt her pussy opening up to his probing finger. \"EEEEHHH,\" arching up higher, feeling the muscles of her pussy grasping on the thick finger as it slowly entered her. It twisted and moved inside her, her hips unable to stay still as it bore into her inner soul. He pushed his hand lower down, moving his finger upward, making Eriko take more of it. \"EEEEHHH,\" the finger feeling as if it was going to come out her mouth, as he pushed hard inside her. He fucked her with his finger, pushing in and out, her pussy grasping on to it each time he withdrew, not wanting it to leave. It shoved back in again, her hips rising up as he impaled her, his knuckles finally banging on her lips when he was in as deep as he could. In and out he would fuck her with his finger, his other hand never leaving her nipples and breasts alone, the pleasure of his touch on her sensitive tips continuing to arouse her.\n\nEriko was disappointed when he took his finger out of her, her pussy feeling empty. He began the gentle masturbation of her pussy, two fingers rubbing up and down her slit, pausing to rub over the head of her clit as her body shuddered in pleasure, Eriko's breathing ragged, her chest heaving up and down. Two fingers became four, pushing her lips harshly apart as they began to run up and down her slit, faster and faster. Eriko spread her legs, raising up her ass, letting him have his way with her. \"EEEEHHH,\" she mewed in pleasure. Her hips bounced when his fingers suddenly went lower, two fat fingers quickly impaling her empty pussy, her ass rose up high as she welcomed the fullness they brought to her. \"AAAAWWW,\" his fingers sliding in and out her slick pussy, her muscles gripping them as they moved in and out, her pussy feeling the bumps of his knuckles as they moved inside her.\n\nHe moved from standing over her, Eriko feeling the movement on the table as he sat down, drawing one of her legs back, feeling it bend until it must be on his shoulder, drawn up, the plane of her sex open. His hand returned, one finger entering her pussy, fucking back and forth as her body began to rock from the constant finger fucking, his knuckles smashing pleasurably against her pussy lips. He fucked her for ten minutes, her lips mewing in pleasure, gasping when he would drive his finger in deep, the sound of slapping flesh as she was finger fucked by him. His other hand continued to pluck at her breasts, the tips swollen to double their size, sensitive buds sending pleasurable shivers down her spine.\n\nAnother five minutes, varying the speed from slow to fast, taking long, deep strokes inside Eriko, gripping his finger with her muscles as it slid in and out. He took her other leg, bending it back, spreading her wider, her imagination catching the image of him sitting on the bed between her widely spread legs, his finger fucking in and out her drenched pussy while Eriko withered on the bed in ecstasy. \n\nHis other hand left her breast and moved to the top of her mound. His thumb pushed down on her clit, smashing it down into her pubic bone and began to move it back and forth. Eriko's hands moved up, gripping his arm as his other hand began to finger fuck here faster, her body rocking back and forth as her crying became louder. Eriko's breasts bounced up and down, her stomach rippled from his powerful finger fucking. She could hardly catch her breath, her orgasm close. Then he stopped. Eriko waited while his finger left her, his thumb continuing to rub back and forth over her clit. ",
        "Eriko wanted his finger back. What she really wanted was a thick cock inside her, but that would have defeated the purpose of coming here. An unattached and non-reciprocating orgasm. And she was so close.\n\nEriko arched her ass up again when his finger returned, puzzled but glad as it filled her again. Then she felt it, a cold wet finger pressed against her anus. It didn't move, it just sat on her anal opening. Eriko held her breath. Eriko was surprised at how powerful the nerve endings were around her anus, surprised that it was almost pleasurable when she was touched back there. She didn't think she would ever let a boy touch her there. But this was different. \n\nEriko was submitting to the expert, letting him play her body to draw the orgasm from her. And an expert he was. He had been arousing her for almost an hour and Eriko was close to achieving the orgasm that she so desired and needed. Was he going to impale her asshole with his finger? She was sure, it didn't move, her body tense as she waited nervously.\n\nEriko finally opened her eyes. He was staring at her, his eyes questioning her without having to say anything. He wanted her approval. This was all about her pleasure and he wanted her acceptance, not wanting to force anything on her that she would find distasteful. Eriko looked around the room, so bright, her naked body covered in sweat and oil, her legs drawn up and back, his fingers poised at the entrance of both of her intimate openings. Eriko was embarrassed and humiliated for letting him see her naked and allowing him to masturbate her. Yet she was also aroused to be taken in such a manner, his expert fingers bringing such pleasure to her. Eriko's breathing was ragged, barely able to get out a word as she fought to breathe. Her only answer was to close her eyes, settling back down on the pillow and slowly raise up her hips until she felt his finger began to enter her. Eriko had to fight to do it, feeling her anal ring stretching to take his finger inside her, grateful that it was lubricated.\n\n\"EEEEEEHHH,\" Eriko screamed so loud that she was afraid the police would come. He had taken her acceptance, his fingers entering her in a swift movement that drove both fingers into the depths of her most intimate opening at one time, dually impaled. They seemed to meet somewhere deep inside her, rubbing back and forth against the thin layer of skin that separated the two. Then he began to finger fuck her again, this time two fingers pulling out and pushing back in again, her pussy and asshole receiving the probing. Eriko never felt as full as she did at this time. Even one finger felt like a giant log, especially the one in her asshole, the finger moving around in her rectum as it massaged the clenching muscles. It slid in and out, her anal ring gripping it as it moved in and out of her tight asshole. Eriko's hips never hit the table again until she climaxed. Which only took two minutes. Eriko gripped his arm as she came, biting her lip as she screamed, her pussy and asshole gripping his fingers so tight he could barely move them inside her. Eriko must have drowned his fingers in her juices, her body shuddering and shaking, her breasts heaving up and down as she had the most explosive orgasm in her life. And his fingers never stopped moving, a second orgasm shaking her body as she began to sob in pleasure.\n\nHe finally stopped, his fingers slowly dragging out of her, a tiny yelp from Eriko's lips as the finger pulled from her asshole. Even after they left, it still felt as if she was impaled. He got off the bed, slipping a blanket over her. He returned with some warm washcloths, slowly washing the oil and cum from her naked body, paying special attention to her pussy and asshole, the warm washcloth feeling good. He finally left Eriko to get dressed, unable to stand on her feet for ten minute, her muscles feeling like jelly. Eriko was embarrassed to go out to the waiting room again, afraid of looking him in the face.\n\nHe smiled when she came out, no acknowledgment of anything but a pleasant smile.\n\n\"Are you in Tokyo much longer?\"\n\n\"Until the end of the week,\" she answered.\n\n\"I'm open until midnight every night if you want to come back.\"\n\n\"Thank you, but I experienced what I was looking for. And it was everything and more than I could have ever wanted. But I don't think the second time would be as exciting.\"\n\n\"You would be surprised. Have you ever been bound? Can you imagine lying naked on the table, your hands bound above your head, your legs bent back and tied, a thick rope running back under the table, keeping your legs spread painfully wide.\" He saw the look in her eyes.\n\n\"And I have a friend that is also in this business. Can you imagine four pairs of hands working over your lovely naked body? She would love to bring you pleasure.\"\n\n\"She?\"\n\n\"Yes, she only works on girls. And she knows places in your body that would bring you such pleasure.\" He picked them up. \"And I have these. I think you would find them very enjoyable.\"\n\nHer eyes opened wide. There were two of them. They looked like little metal squares about an inch wide. The only thing odd about them was the tiny metal screw on one end. She looked at them. When the screw was tightened, one side of the square moved in. If pressed far enough it would touch the other side. She instantly knew what they were for. They were for crushing a pair of hard nipples. Her pussy was soaked, imaging being bound as they put them on her nipples, tightening them, Eriko unable to stop them from making them as tight and painful as they wanted. And to feel the soft hands of a female as they probed the depths of her body, moving inside her, seeking out the parts of her body that brought her the most pleasure.\n\n\"How much?\"\n\n\"Sixty thousand Yen.\"\n\nShe quickly figured to be over $500.00. She had her credit card, she could get an advance. But her parents, could she fake being sick again? \"Nine o'clock tomorrow night.\" She gave a sigh of relief. She knew she would masturbate tonight, imagining all of the things they would do to her tomorrow.\n\nHe smiled. \"You will not be disappointed. We will make this very enjoyable for you.\" He watched as she left, making the telephone call to arrange everything. She would enjoy it very much, he thought, imagining her naked on the table, her arms bound, her legs spread wide and tied, her nipples crushed between the unyielding metal clamps as four hands ran continually all over and inside her naked body as she withered in ecstasy on the table.\n\nThe End"
    ],
    "authorname": "Powerone",
    "tags": [
        "female masturbation",
        "massage parlor masturbation",
        "male masseuse"
    ],
    "category": "Toys & Masturbation",
    "url": "https://www.literotica.com/s/female-masturbation-japanese-style"
}