{
    "title": "Red Eye Pleasure",
    "pages": [
        "The following is true and was totally unplanned. It's a dark little secret I carried and longed to tell but couldn't for fear of embarrassment, even to my best friend. It did open up a fetish I never knew I could had and prompted me to explore my desire of public masturbation. Hopefully, more to follow. :-)\n\nThankfully, I stumbled across Literotica and can now finally tell my tale. \n\n++++++++++\n\nI'm a nice girl, mostly always have been. Never ran with a bad crowd, got good grades in school and although my mouth sometimes got me in trouble, for the most part I stayed out of trouble. I'm petite and a bit on the short side, dark brown hair just past my shoulders with some highlights and a bit of a curl. I weigh a little over a hundred pounds, my Italian ancestry gives me a nice little golden tone in my skin and I consider myself a pretty girl. I have a nice set of 32C boobs, which I like to admire in the mirror, especially after a shower when I lotion up. They have small areoles, my nipples are super sensitive, kind of big, dark pink and easily get hard. \n\nSometimes it's embarrassing and I have to watch what I wear. I love thin bras but they can be dangerous as my nipples easily poke through, usually when I don't want them to like when I'm wearing a tight blouse or sweater. Like most girls, I love the effect of showing off my boobs but nowadays I've calmed down quite a bit and don't show as much cleavage as I used to, but still I sometimes tease and like the looks I get from guys. And girls. \n\nMy best friend is Denni, who I've known since junior high, and we'd gone down to San Diego for spring break one year in college. Denni had family in the area so Mom and Dad felt comfortable about me going there instead of some place fun like Mexico or Florida. We stayed in a hotel, had a great time and visited with her folks but on our last night Denni and I stayed out late and had a few too many drinks. \n\nWe got a little loose and both ended up entering a wet T-shirt contest. The water was ice cold and my nipples were so hard they were aching which got me really excited. I would have won if it hadn't been for that tramp who kept playing with herself. I have to admit it did turn me on a bit though, my hard nipples helping my excitement. Denni too, as it turned out, and we ended up making out back in the hotel. \n\nWe showered and rubbed soap over each other which got us both pretty hot. She has gorgeous hair and I loved shampooing her and massaging her scalp. She looked so sexy with shampoo running down her tits and flat stomach. We kissed and fingered each other relishing in rubbing our soapy bodies together. \n\nAfter the shower we dried off and faced each other while mutual masturbating. I got so turned on watching her run her hands over her tight little body, playing with her little tits and pinching her perky nipples while she stroked her clit. I knew she was getting turned on watching me play with myself. My nipples were still so hard and I enjoyed pinching and pulling on them. Denni loves my boobs but was always jealous of them. I always thought her tiny tits were so cute and sexy and I told her so many times. \n\nAfter we both came she surprised me with a little vibrator that she brought along and we ended up using it on each other. It felt so good with her sliding it in and out of my pussy, teasing my clit with it while sucking on my tits. It was the first time I'd ever used a toy and it made me cum so hard. We fell asleep in each other's arms and were rather sheepish the next morning but I could tell Denni enjoyed it. I certainly did. That was the extent of my lesbian experience and since then have always been curious about tasting another girl's pussy. I sometimes regret I didn't go that far with Denni. \n\nShe since met a guy in school, was getting married, and asked me to be a bridesmaid. I live in Alaska and caught the red eye flight down to Seattle a few days before the wedding. Being it was late, I was really tired and couldn't wait for take off so I could catch some shut eye. I sat by the window and was fortunate that the middle seat was empty. The guy on the aisle was cute but really nerdy and had his nose buried in a book. Okay by me as all I wanted to do was sleep. \n\nWe took off on time and I leaned the seat back a bit, kicked off my shoes, took my jacket off and draped it on top of me as a blanket. It was long enough to cover my shoulders to just past my butt. I closed my eyes and curled up, tried to get comfortable and find sleep. \n\nAlthough we kept in touch, I hadn't seen Denni in a couple years, my mind kept slipping back to our time together in San Diego and our lustful night of debauchery. I tried to shut it out but couldn't and kept thinking of Denni and her sweet little tits. I felt myself getting wet, the cabin air was cool so my nipples were already hard, and I could feel them getting harder the more and more I thought about Denni and what I wanted to do to her. I found I couldn't keep my hands off my boobs. \n\nThe flight attendants had started the drink service and I had thought about getting some wine but I was really horny by then. Feeling bold and a little daring I thought I might tease myself a little before going to sleep. With the middle seat empty and Nerdly absorbed in his book I felt like I was in my own naughty little world under my jacket. I gripped it a little tighter, guiltily looked around, and unbuttoned my jeans. They were the tight ones which showed off my sweet little ass, but sitting there I could barely get my fingers down to my clit without being super obvious. I pressed on my crotch from the outside but all it did was raise my desire to touch myself. \n\nI glanced over at Nerdly, he was concentrating on his book and I risked trying to hitch my jeans down a bit. With my chin on my jacket, I rolled a little like I was trying to get comfortable and managed to scoot my jeans down just enough to grant my fingers access to my throbbing wet pussy. In order to pull this off I knew I had to be careful. Facing the window, I slowed my breathing in anticipation of touching myself and sucked in a breath as I slid a finger over my slit, slowly making little circles inside my pussy lips. \n\nSomebody a row or two in front coughed loudly which startled me and made me realize where I was, what I was doing, and what could happen if I got caught. My paranoia amped and I almost stopped and pulled my jeans back up but I felt so naughty secretly masturbating with all these people around, the occasional passenger walking up and down the aisle, drink carts clinking, and people chattering, totally oblivious as to what I was doing. It made me just that much hornier and decided to risk it and enjoy myself. \n\nWith my eyes closed I turned more towards the window, hitched my jacket up a little to cover my face, and leaned my knee on the side of the plane giving me better access to my clit I continued to stroke it under my jacket and thinking about Denni. It felt so good, so sweet. I pushed down further and inserted my middle finger into my moist pussy. Fortunately the cabin and flight noise drowned out the moan I let slip out. I was so wet! I needed more. Carefully without letting my jacket slip I unbuttoned my blouse all the way and moved it aside to get full access to my boobs. I silently moaned as I squeezed my right breast through my bra and ran a finger over the nipple, feeling the rise under the lacy fabric. \n\nThe flight attendant startled me and asked if I wanted a drink. She was very pretty and I looked her right in the eye, politely declined, and undressed her with my eyes, never taking my hands off my clit and continuing to tease my nipple with my nails. The smile on her face made me think she might have known what I was doing but with the pleasure I was feeling I didn't care. \n\nTurning back towards the wall, I felt an orgasm approaching and stopped stroking my clit allowing my body to cool down. I sat there a while with my pussy throbbing and controlled my breathing, forcing it to slow. I lay there in the semi-dark daring myself to be bold. \n\nWith both hands I pulled my boobs out of my bra and folded the cups under freeing them and panicked a little as my jacket slipped down. I hastily put it back in place realizing had anyone noticed they might have seen my blouse undone and some ample boobage. I was playing a dangerous game, in dangerous territory, but the thrill of possibly being seen and getting caught made me so much more excited. \n\nSafely tucked under my warm jacket-blanket I resumed stroking my pussy. With my tits out under my jacket they were free to be fondled and cuddled. I love having them squeezed and played with and sometimes do it in the office at work when I'm bored. I stroked and caressed them imagining Denni being there doing it for me. I drug a fingernail across a naked, erect nipple and shivered at the sensation, moaning again as I pinched it between my nails and pulled it, my breath coming faster as I reveled in the delicious pain on my nipple. I decided then it was time to get them pierced. I concentrated on slowing my breathing, edging an orgasm, as I continued to lightly stroke my clit and play with my tits. \n\nThe cabin lights had dimmed and the only noise was from the engines and the slipstream outside. For so long I enjoyed my foreplay; I was in ecstasy, sitting there in my delicious pleasure, playing with myself for so long in the dark, knowing I had to concentrate on being still and quiet. I had gone too far with my tease and it was too late to back out. I edged the orgasm as long as I could until I couldn't hold it and it crashed over me, cumming and cumming, wave after wave of such a pleasurable, long overdue orgasm as I squeezed my eyes shut and gritted my teeth, held my breath and forced myself not to convulse. \n\nWhen it subsided I slowly let out my breath and regained normal breathing. I felt a little shame and looked around through slitted eyelids feeling the eyes of the entire airplane upon me. All was normal, dark, and quiet. Even Nerdly was still glued to his book. \n\nI realized I hadn't stopped stroking my clit and felt desire building again. I cruelly grabbed a nipple, pulling it, and imagined Denni being with me, kissing me, squeezing my tits under my jacket, pinching and rolling my nipples, sucking on them. I imagined sucking on Denni's tits as I squeezed my tits and rubbed my clit. My desire grew quickly and I knew another orgasm was fast approaching. \n\nMy pussy was so wet, my fingers and panties soaked with my juices. I tried to edge the oncoming orgasm but my fingers couldn't stop stroking my clit and pulling my nipples. A small orgasm passed through my body making me quiver and I kept going feeling another coming on. I eased the stroke on my clit to slow my breathing and edge another orgasm but I came anyway, my body rocking uncontrollably. \n\nThis one wouldn't go away, it kept itself in the background, a hot ember waiting to rekindle, as I continued to slide my finger over my drenched clit faster and faster, mercilessly pinching and pulling my nipple trying desperately to keep still, the delicious, excruciating pain of my nipple reignited my orgasm into a full mind-blowing spasm of pleasure. I squeezed my eyes shut and gritting my teeth somehow kept from gasping and rocking as the orgasm passed over me. \n\nFour orgasms in such a short time period, I had never done that before. I felt exhausted but satisfied, sweat glistening on my forehead, and I let my breathing slowly calm as the fire in my sated pussy dwindled to a cool flame. I wiped a bead of sweat off my eyebrow, smiled and almost giggled to myself at my naughtiness, I couldn't believe at what I had just gotten away with. Sleep was rapidly approaching and I let myself doze off for a sweet little post self-pleasure nap. \n\nThe next thing I knew the cabin lights snapped on and the flight attendant blared an announcement of our decent into Seattle. I had slept through the rest of the flight and panicked when I realized I still had my jeans undone. I hurriedly pulled them up and buttoned them. I swung my jacket around to put it on only to realize too late that my tits were still out. I managed to shield myself as I slid an arm in, then the other, and hurriedly zipped up with my blouse still undone and my boobs jiggling outside my bra as I flipped my hair out. I was thankful and fortunate that no one saw anything. \n\nMy right nipple was extremely sore and they both tingled as they brushed against the satiny fabric of my jacket. What a delicious way to end a sexy flight, half naked under my jacket. I gave them a like jiggle and grinned with erotic satisfaction to myself. I looked around as I ran my fingers through my hair trying to straighten up. Everyone had been oblivious to the pleasures I had experienced and, still feeling naughty, I unzipped my jacket a bit to give a teasing little show. My panties were soaked and I was thankful I had the mind to pack an extra pair in my purse. \n\nOnce we got off the plane I found a bathroom to change out of my soggy panties, put my boobs back in my bra, buttoned my blouse, and clean myself up. The wet stain on my jeans was surprisingly small and my jacket covered what little showed. I had a couple hours before my next flight and wandered around the terminal with my pussy still tingling from it's luscious workout while searching in vain for a piercing salon."
    ],
    "authorname": "Lorelei907",
    "tags": [
        "lesbian",
        "masturbation",
        "public",
        "public sex",
        "lesbian sex"
    ],
    "category": "Toys & Masturbation",
    "url": "https://www.literotica.com/s/red-eye-pleasure"
}