{
    "title": "Visit to a Stud Farm",
    "pages": [
        "It was Saturday afternoon and Roy had been in the bar playing pool and hanging out with his friends for an hour when he saw the girls come in and take seats at the counter. They were both dressed in western wear including cowboy hats. The tallest one had long brown hair hanging in a braid down her back. She had a pretty face with big brown eyes, a straight nose, and generous lips. She had large breasts and her butt looked great in the denim jeans she wore. The other one had short blond hair and a cute face with a smattering of freckles across her turned up nose. She had a tight little body with perky breasts and a cute little butt. She too wore jeans and a western shirt. Both girls glanced his way when he walked over to stand at the end of the bar.\n\n\"We'll see you on Monday,\" his friend, Nick said as the guys walked past the bar on their way out the door.\n\n\"Yeah, see you,\" he answered. He had been planning to leave himself but decided to hang around and see what these two were up to first. He leaned against the counter and motioned to the bartender for another beer. He didn't really want another one but it gave him an excuse to be there. He turned slightly toward them so he could see them as he sipped his beer. It had been a long time since he had been with anyone and his long, lean body knew it as he rested against the bar.\n\nKatie and Shelley had noticed him noticing them from the moment they sat down. He was older than the guys they usually dated but they could see he had a nice butt when he bent over the pool table to make a shot. He was tall, with broad shoulders, strong arms, and capable hands. His hair was dark with a touch of gray at the temples. His eyes were blue and they held a hint of amusement as he watched them trying not to look at him.\n\nThe bar was empty except for them and the bartender. As the bartender brought them their drinks, Roy reached out and laid some money on the bar. He motioned for the bartender to take the price of their drinks out of the money. The girls picked their glasses up and held them up to thank him. That was all the invitation he needed to say hello.\n\nThe girls told him they worked on a horse ranch outside of town. They were in town for the day and had gotten bored so they decided to see if there was any fun to be had in the bar. Roy told them they were a little early but if they wanted to stick around, things would get hopping later on when the live band got there. They looked at each and nodded. Roy didn't know what they were thinking but the grins on their faces intrigued him.\n\n\"So, would you like to have some fun with us until then?\" Katie asked.\n\n\"What kind of fun did you have in mind?\" he asked.\n\n\"Well, we have been out on the ranch for a while and we could use some fun if you think you can handle both of us,\" she winked at him so there was no mistaking her meaning.\n\nRoy could feel a stirring in his pants as he thought about seeing these two naked. Katie was the more serious of the pair with her long dark hair and dark eyes. She arranged for him to follow them so he would have his own transportation home later on if no one felt like returning to town. Roy watched the two of them walk out of the bar in front of him and he couldn't wait to get to their place and see what they had in store for him.\n\nHe was surprised when they drove past the house when they finally arrived at the ranch. They drove past the barn where he could see a magnificent stallion pawing the ground with his nostrils flared. As Roy watched, a man walked out and led the huge beast into the barn. Eyes back on the girl's pickup, he followed them down a dusty road to a clearing a couple miles beyond the house. It was a pretty spot next to a small creek. Roy parked his pickup next to theirs and got out. The girls had a picnic basket and they were arranging blankets on the ground. Shelley motioned for him to join them so he sat down between them. The three enjoyed some cheese and wine and he was feeling a little mellow when he lay back on the blanket. He propped himself on his elbows with his long legs stretched out before him. He was waiting to see what would happen when Katie said she needed to check her messages on her cell phone back at the truck. She left them alone and Shelley wasted no time once they were alone.\n\nShe had been sitting cross-legged on the blanket near where Roy reclined and she scooted over closer to him. She bent down above him and pressed her lips against his in a long kiss. Her tongue slid out and into his mouth as the kiss deepened. Roy reached up and pulled her down across his chest so she was half lying on top of him. He cupped one of her pert little breasts in his hand and rubbed the heel of his hand against the hardening nipple. He heard her moan before she pressed her breast harder against his palm. When they came up for air Roy rolled her over so he was above her. He reached for her shirt and began unbuttoning it. Her breasts were covered in a white, lacy bra and he made short work of the fastener so he could feast his eyes on her. He rubbed his hand across her breasts and took one of the nipples between his thumb and index finger. He rolled and pinched it a little and then replaced his fingers with his lips. He sipped at her nipple until it popped into his mouth. He sucked and licked her nipple until it was red and swollen. Then he moved to the other one and gave it a wet tongue lashing, too.\n\nShelley couldn't keep her own hands still and it wasn't long before Roy felt her fingers unbuttoning his shirt. She didn't stop with that and he felt her fingers at his waist unfastening his jeans. He held himself above her as she worked the zipper down and reached inside. He couldn't hold back a groan when she pulled him out, hot and hard into her hand. He pressed down against her and felt her taut nipples stabbing against his chest. He wondered briefly where Katie might be but Shelley's invitation was too blatant to ignore. She was pulling his jeans down in back and lightly raking his ass with her fingernails. He lifted himself up so he could help her out of her jeans. When they were down around her ankles, she kicked off her boots so the jeans would slide off.\n\nHe took advantage of her motions to remove his own tennis shoes and jeans. When he turned back toward her, Shelley moved under him and spread her legs wide apart. Roy reached down and toyed with her clit for a minute before moving between her legs and pushing his swollen cock deep inside her pussy.\n\n\"Oh Roy, more. Give me more,\" she moaned raising herself up a little so she could put her lips against his nipple. When her tongue peeked out to lick him it felt like a spark connected his cock to his nipple and he moaned, too. He thrust into her again and she wrapped her legs around his waist.\n\n\"You feel so big,\" she whispered. Her hot pussy milked his cock and he found himself close to release. \"Slow,\" she whispered as she felt how close he was to cumming.\n\nRoy slowed his thrusts and reached between them to rub her clit. He pulled back so his cock slipped out and her legs slid down his back. He took his cock in his hand and rubbed the velvety head against her swollen clit. She threw her head back and began humping her hips against him. He continued to hold himself back from cumming as he rubbed her hard clit more quickly. She moved against him with more force and finally grabbed his hand and mashed his cock down on her clit as she came.\n\n\"Oh, that was good,\" she breathed as she lay back flat on the blanket. \"Did you see the stallion in the coral as we drove past the barn?\" she asked.\n\n\"Yes, he's a gorgeous animal,\" he answered.\n\n\"He is being used to breed one of our mares this afternoon. He's going to get up on her and fuck her while a bunch of people stand around to make sure neither of them gets hurt. Would you like to fuck me like that, Roy?\"\n\n\"Oh yes,\" he answered eagerly. He could feel his cock throb in response to her question. The thought of fucking her from behind with her cute little butt stuck up in the air was very exciting.\n\nShelley quickly turned over and stuck her ass in the air. Roy moved to kneel behind her and thrust his hard cock into her slippery pussy. He could feel her muscles closing around him and it felt heavenly. He reached around and cupped her breasts, pulling her nipples down while she thrust back against him. He pictured himself as that stallion and thrust hard inside her again. He heard a noise from behind but he was so lost in the feel of her wet pussy squeezing his cock that he paid no attention.\n\nSuddenly he felt a hand on his ass. He looked back over his shoulder and saw Katie kneeling next to him. She was watching him thrust into her friend and her eyes were openly lustful. She wasn't wearing anything but her cowboy hat and she held something in her other hand. She moved closer to him as he slowed his thrusts and she raised her face to his. Her hand went around behind his neck and she kissed him long and deep as Shelley continued to wriggle back against him.\n\n\"Can I play, too?\" she asked.\n\n\"Oh, yeah.\"\n\nKatie moved around behind him and pressed herself against his back. She reached between his legs and slowly caressed his balls. He spread his legs a little further apart but kept his cock buried in Shelley's cunt. He continued to pinch and pull at her nipples as Katie rubbed against his back.\n\n\"Do you want to fuck me, Roy,\" Katie asked.\n\n\"Yes,\" he moaned. He was so close to cumming and he didn't know which girl to fuck. Should he keep fucking Shelley or pull out and fuck the gorgeous brunette behind him?\n\nKatie saved him from having to decide when she moved back and he heard her fumbling with something. He glanced back to see what she was doing and saw her fastening the leather harness on a strap-on dildo.\n\n\"Since you can't fuck me, Roy, I'm gonna fuck you,\" she stated.\n\nRoy had been with women who played with his ass before and had even been in a threesome involving a woman and another man once but no one had ever penetrated his ass.\n\n\"Are you a virgin?\" Katie asked.\n\n\"Yes,\" he replied.\n\n\"Ooooo, I'm gonna fuck your tight little hole, Roy,\" she told him.\n\nRoy didn't know how she was going to do that. His hands had stilled their play with Shelley's nipples and he was holding himself still inside her. She was getting impatient and had started moving herself back and forth against him.\n\n\"Fuck me, Roy,\" she begged.\n\nHe wanted so bad to do just that but he didn't know what Katie was going to do to him. He started thrusting into Shelley again as Katie picked up a blue bottle from the blanket near his leg. He watched as she squirted something liquid on the dildo and rubbed it all around. She pushed against his shoulder to bend him down against Shelley's back and squirted a liberal amount of the liquid on his ass. She began rubbing it around with her finger and he began fucking Shelley harder.\n\nThen he felt the head of the rubber cock press against his asshole. He was bent over against Shelley thrusting hard into her when Katie started pushing against him. He had nowhere to go and felt the dildo begin to penetrate his ass. As he pulled back from Shelley, the dildo slid further in and when he pushed into Shelley, the dildo slid back out. Finally Katie gave a shove and he felt the dildo slide all the way in. Roy moaned. As she continued to slide her cock in and back out, he pressed deeper and deeper into Shelley.\n\nShelley began to moan and begged him to fuck her harder. He didn't know if he could with Katie behind him fucking his ass. Then she gave another hard thrust and he felt the rubber cock slide all the way in.\n\n\"How does it feel to lose your virginity?\" she asked. \"Do you like having your ass fucked?\"\n\nRoy could only moan. It did feel good when that dildo pressed against his prostate. Katie was pressed tightly against him and Shelley was so hot beneath him. Her pussy clamped his cock and he could feel his release building.\n\n\"Oh God that feels good,\" Shelley groaned out. \"Faster!\" she begged.\n\nKatie flipped the switch that made the button on the back of the dildo vibrate against her clit. She grabbed Roy's hips and thrust harder against him so the button would press harder against her clit. Shelley was close to cumming and she bucked harder back against him.\n\n\"I'm cumming,\" Shelley screamed.\n\n\"Oh God,\" Roy moaned as his cock was squeezed hard by her pussy. The cock in his ass continued to thrust in and out with Katie's movements. He was close to cumming himself.\n\n\"Do you like that,\" Katie asked. Her mouth was close to his ear as he stretched back to thrust into Shelley. \"I'm fucking your ass,\" she whispered. \"Do you like it, stud?\"\n\n\"Ah, don't stop fucking me,\" he moaned as his cock began to pulsate inside Shelley. \"Please don't stop,\" he begged. \"Fuck me!\"\n\nThere was no way Katie was going to stop. Her clit was being stimulated by the vibrator on the back of the dildo and she was so turned on knowing she was giving him pleasure. Roy's cock continued to throb inside Shelley who was quickly moving toward her third orgasm.\n\n\"I'm cumming,\" Roy shouted as he threw back his head and filled Shelley's pussy with hot, steaming spurts of creamy, white cum. Katie pushed him back down against Shelley and forced the dildo harder into Roy's ass as she felt her own explosion coming on.\n\n\"I gotta cum,\" she moaned and then she made a final thrust against him. Her body quivered against his back as she collapsed onto him. Roy knew Shelley was close to another orgasm so he reached under her and flicked her clit with his finger. She hollered again and he felt a shudder run through her as she came for the third time.\n\nKatie pulled the dildo out and rolled off him onto the blanket. Shelley collapsed face first and Roy rolled off her to lie between the girls. \n\nKatie undid the harness and laid it on the blanket. She rolled closer to Roy and began licking his nipples. His cock was still half hard and he felt it tightening as she continued to suck and kiss his nipples and chest. She got up on her knees and her mouth began to move ever closer to his sticky cock. She was pressing against his side when he felt her breath directly over it.\n\n\"Ahhhh,\" he groaned when she began to lick it all over. He knew she was tasting his cum and Shelley's as she cleaned him up. She continued to lick his cock and moved further so she could get one of his balls into her mouth. Her pussy was near his shoulder so the natural thing to do was touch it. He brought his hands up and grabbed her leg. She looked down his body as he lifted the leg up over his head. When he set it down her pussy was directly over his face. She spread her legs further apart and he moved his hands up to spread her pussy lips wide open. He could see how wet she was from her earlier orgasm.\n\nHe stuck his tongue out and licked from her clit up to her hole. \n\nHe felt her lips closing over his cock as she sucked most of it into her mouth at one time. She sucked it to full hardness as he licked her juices up. Soon he had her moaning around his cock as he teased and stabbed her clit with his tongue. He could taste a continuous flow of pussy juice when he stuck his tongue into her hole. As he rubbed his tongue back and forth across her clit he felt her mouth leave his cock.\n\n\"Oh God, don't stop,\" she moaned as her hand circled his cock. She was humping herself against his face as she began to slowly jack his cock up and down. \"Please don't stop.\"\n\nIn answer he began moving his tongue faster and was rewarded by a flow of juice as she came hard against his tongue and mouth. He saw Shelley get up and walk around to the other side of the blanket. He was busy licking up Katie's cum so he didn't see her pick up the harness and strap it around her own waist. His legs were drawn up and spread wide apart as Katie went back to licking and sucking his cock.\n\nSuddenly he felt something pressing against the backs of his thighs. He couldn't see with Katie on top of him but he felt her hands pulling his legs up just above the knees as she let go of his cock. He lifted his hips up a little since she seemed to want that. That was when he realized what the girls were doing. Shelley was on her knees and she had her legs spread apart so her thighs were supporting him. She kept scooting further under him as Katie pulled him up. He was up on his toes when Katie let go of his legs.\n\nThat was when he felt the head of the dildo between his cheeks. He knew he was about to get fucked again and he didn't know whether to protest or let it happen. In the end the pleasure he felt the first time won out. He spread his legs a little further apart and settled back on top of Shelley's thighs.\n\n\"Look here Shelley,\" Katie said as she grasped his cock again. \"He must want to be fucked again because he is leaking,\" she said excitedly as she bent to lick the pre-cum off the head of his cock.\n\n\"Oh God,\" he groaned out. Shelley was rubbing more lubrication against his asshole. She rubbed her finger around and around pressing against his hole and letting the tip of her finger penetrate him. Finally she was satisfied and he felt her position the dildo so the head was against his tight, little asshole. She pressed it in and out very lightly. He was so excited from anticipating the penetration that he couldn't bear her playing with him anymore. He moaned.\n\n\"Do you like this, Stud?\" she asked. \"Do you want this in your ass now?\"\n\n\"Oh God,\" he moaned again. He tried pressing himself down on her but Katie's hold on his cock wouldn't let him go far without pain. \"Please,\" he moaned.\n\n\"Beg for it,\" Shelley demanded.\n\n\"Oh yes, fuck me! FUCK ME HARD!\" he hollered.\n\nShelley immediately bucked her hips up and the head of the cock popped all the way into his ass. He arched a little above her and she scooted further under him. This time when he pressed down against her the rubber cock slid all the way into him. He felt his cock jump in Katie's hand.\n\nHe slid two of his fingers up and into Katie's pussy hole as she took him in her mouth again. She only sucked him for a second or two before she let go and started jacking him again. Shelley was humping her hips against his ass in a slow rhythm. He couldn't keep the longing out of his voice when he begged her to go faster. She turned the vibrator on and arched her back. Her hands pressed down on either side of her for balance. The vibrator hummed against her clit and each thrust pressed it harder against her. She couldn't get much leverage though with his weight on top of her.\n\nKatie must have realized what the problem was because she pressed herself back against his face and released his cock. She pulled his legs up and toward her exposing more of his ass for Shelley. It was enough so she could start pounding in and out of him faster as her hips rose and fell beneath him. Roy fastened his mouth on Katie's waiting pussy and started licking her faster and faster. \n\nIt was hard to concentrate with that big rubber cock going in and out pressing so far inside him and he knew he was close to cumming. He wanted Katie to jack him again but she was lost in her own pleasure. Her pussy pressed harder and harder back against his mouth as she ground her hips against him. Just when he didn't think he could take much more, Katie shuddered and came against him again. He continued to lick her as she subsided against him. Finally she lifted herself up from him and he could see down between them.\n\nShelley's head was thrown back and he could see her perky little tits bouncing as she concentrated on fucking him with the fake cock. He could see she was deriving a lot of pleasure from it herself. He watched as Katie held his legs and his cock throbbed between them. It seemed to swell even larger as Katie moved her tits near it.\n\n\"I'm cumming,\" he moaned and she pressed them down on his cock. He knew each spurt landed on those gorgeous tits of hers. The thought made him cum harder. Just then he felt Shelley make one last thrust and hold herself against him and he knew she was cumming, too. All he could do was lay there and gasp for breath as his cock continued to empty against Katie's tits.",
        "Finally Shelley pulled back and he felt the dildo slide out. She crawled over beside him and collapsed onto her back. Katie let go of his legs and lifted her leg up so she could turn around and lie on the other side of him. He put his arm around her and felt the warm stickiness of his own cum as she hugged herself up against him. He moved his arm and pulled Shelley against him on the other side and the three lay there in contented silence. Katie ran her hand up and down his chest as they waited for their breathing to return to normal. Shelley looked up at him and smiled as she nestled closer. \n\nRoy thought about what they had done and knew these two twenty-five year olds had taught him a new trick. His tight little asshole felt stretched and he knew it would be a while before he forgot this afternoon. These two could have anyone they wanted and he was just glad they picked him."
    ],
    "authorname": "wyo_girl",
    "tags": [
        "threesome",
        "strapon",
        "wet",
        "ass fucked",
        "tight asshole",
        "sucking cock",
        "outside",
        "sucking her clit",
        "stud",
        "between the girls"
    ],
    "category": "Toys & Masturbation",
    "url": "https://www.literotica.com/s/visit-to-a-stud-farm"
}