{
    "title": "My Way To Wake Him Up",
    "pages": [
        "Getting my things together, I find myself daydreaming; my thoughts have been wandering all night. I think I am starting to enjoy this night shift. Especially on your days off, knowing your home; asleep; in that big bed. Oh but you won’t stay asleep baby. Grinning to myself I head out the door and to my car, still thinking and planning.\n\nWe’ve known each other for years now. Friends first. I think at first you were scared of me. I wonder why that is. At first all we did was talk abit. Every time you’d come in, we’d talk, usually about nothing. Sometimes about your kids, or about what was a good deal. I remember when you got divorced. Then I got divorced. I started flirting then with you; and you’d turn red, especially when you heard me talking to my helper about what a nice ass you had. I can still see you walking towards the registers your head red. You were shyer than I thought. \n\nAfter two years of flirting I had to ask you when you were going to take me out. No wonder it took so long. You did not realize I was divorced. I remember that first night. I felt drunk. You were so sweet, so tender. We talked almost two hours on the phone before I even came over, and it still took you over an hour to kiss me. Do you remember that? How you grinned after and leaned back saying “waiting on that were ya?” I remember your hands and your mouth on me. The first time I got to suck your cock, have I told you you have a perfect cock? The showers we took, not sure why we took so many that night butt I enjoyed each one. \n\n I remember the first time I explored your body with my tongue. How you moaned. You were shy about it too; but you could not dislike it. The first time I slide my finger into your ass you said later you didn’t like it. But, you would also tease me about using a strape_on on you in the heat of out playing a lot too. That in itself told me you were more interested than you pretended. Then you let me try my small vibrator on you. Again you claimed not to like it. But, who was it that ordered a new one when mine quit working? HMmmmm…and who brought over the anal bead wand?? Oh yes, you do like it baby. You love it when I slide those beads into your tight ass. You moan louder with those pushing into your ass than you ever did before.\n\nDid I tell you how I love how you thrust your cock into my mouth with those beads are working deeper into your ass?\n\nAnd how you tell me you have to have your cock in my pussy now with the beads in your ass? You have even ordered a strape_on for me, may have been out of stock but you still ordered it. I think you are hooked baby. You know you love me fucking your ass. Should I remind you also of the time when you admitted to trying the butt plug one night when I was not there? Oh I remember quiet well borrowing the batteries out of it and forgetting to replace them, butt oddly enough they were in there the next time I picked it up. I knew Sweetie.\n\nI move quietly when I get home, not wanting to wake you too soon. Slipping soundlessly in to the room, I see you sleeping on your side facing the door. A shiver runs thru me as I look at you, just wanting to touch you excites me. Moving towards the bathroom as you mumble in your sleep, I push the door almost closed and check to make sure I have the things I need, before I change clothes. Reaching in the closet, I pull out the shoebox I have hidden behind the sheets and quietly bring it into the room. Laying it on the ground beside the end of the bed so it will be in easy reach, I walk back out of the room and turn on the hall light. Watching as the light cast onto the bed you quickly roll away from the light as it falls on your face. Perfectly planned, I grin and stand still letting you settle.\n\nAs I slip back into the room I have enough light now to see, I reach under the corners of the mattress as pull the elastic strips out, testing them but not attaching them yet. Moving up to the head of the bed I pull out another one where your arm is pushed under the pillow and set it by your hand. Not sure how this will work yet, but so far three look to be easy. Moving down to the foot of the bed I sit down gently and slide each loop over an ankle loosely. Then move back to the head and do the same with the one wrist, just laying it over your wrist. Standing up, I have to think this thru. Not sure how you’ll react in your sleep, and I don’t want to have you lashing out while your asleep, I need to move slow. \n\n  Sitting down again at the foot of the bed, I slide my hands over the back of your thighs. You breathing changes but you lay still, even asleep your body reacts. Moving up I lean over your thighs and slide my hands up over your cheeks and caress your back and shoulders. Kissing the back of your next I whisper to you not to move, just let me caress you. As my hands glide over your warm skin I can hear you moan softly. Planting kisses over the back of your neck I work my mouth down your spine, my hands moving slowly over your ass and down your legs. You breathing evens out as I work my hands back up I start on your shoulders. Nudging your arm I pull it out parallel to your other one as I massage the muscles. Working down each arm I work the muscles and spend time on each wrist massaging and looping the elastic over your right one loosely too. With each arm well rubbed I move down your back, rubbing on the muscles on either side of your spine. Adjusting myself I sit gently on your ass as I massage your inner thighs, my fingers brushing over your balls slightly causing you to lift upwards slightly. \n\n Suddenly I lean down and pull the elastic loops around your ankles, as you move to look, your wrist pull the loops tight around them. I move up and lay against your back, licking softly again at your neck. I can feel you tremble as I blow over your wet skin. \n\n    “I have thought of this all night,” I inform you, ever since yesterday I have planned and thought on it. You have teased me without even knowing it. Reaching for the box I lay it on the bed, letting you see its contents as I dig thru it and take out the lube.\n\n   Slapping you ass softly, “whose ass baby?” you moan and your ass lifts upwards but you don’t reply. Slapping your cheeks harder I ask again, louder, “WHOSE ASS?” quickly sliding a finger between your cheeks. \n\nYou moan out “yours” as my finger teases your tight rose bud.\n\n \n\nDripping the lube between your cheeks, you just as the cool drops touch your skin. Quickly I thrust a finger thru the lube and into your tightness. “Tell me again Baby, whose ass?” as I work my finger deeper into your ass.\n\n     This time your eager ass pushes up and pulls my finger completely in as you moan, “Yours, completely yours, Please its yours” \n\n     “Please what Baby? What will you have me to do with it?” I as I pull my finger out and wait, watching your ass wiggle. \n\n  “Anything you want” you tell me, “fuck me, fuck my ass, your ass” your hips thrusting as you plead.\n\n    \n\n  Standing up, I walk back to the box and move it to the side on the bed and gather up the pillows telling you to lift up as I push two under your hips. Kissing your neck. Indeed I am baby, I have this addiction to your ass you know, an addiction to seeing how excited you can get. As I move back down to the end of the bed I adjust the straps spreading your legs wider as I pull the straps to the sides of the bed. Looking at you, perfect I think to my self, your ass raised just so, legs apart just perfectly. \n\n Leaning down I spread your cheeks wide and slide my tongue between them lapping down to your balls and back up over and over. The sweetness of the lube touches my tongue as the scent of your cologne reaches my nose. I do love your scent Baby. Oh yes, just perfect I think again as I tease you, my tongue moving faster between your balls and your tightness, as you moan pushing up to meet my tongue. Stopping long enough to remind you of how I have thought of doing this very thing for hours. \n\n  \n\n“I love how you respond to my tongue most of all I think, of how you moan and wiggle and beg” To prove it a push my tongue into your tight ring, feeling how it tightens and then relaxes as my tongue pushes into you causing you to moan more. Quickly I pull my tongue out and nibble on your balls, reaching for the strape_on I got yesterday morning. \n\n    You look at it, your eyes widen, “Yes, I tell you, it’s the one you ordered, the one I told you they said was back ordered. It came yesterday while you were at work. I just kind of hid it,” laughing “You should see the look on your face right about now” Strapping it on I lube it…stroking it as I watch you. “Want to tell me again whose ass it is?” I question you as I slide two fingers deeply into your waiting ass as your body pushes back violently, “you want this cock don’t you Baby? You want it buried in your tight ass huh?”\n\n  Thrusting my fingers faster into your ass I position myself between your legs, as your hips move with my fingers as they push deeper and deeper. Each time they hit your prostrate you moan louder, my fingers probing as your hips push back roughly. Pulling them out slowly, I inform you its time to try the new toy, but I just wait and watch you. Looking over your shoulder you eyes move from me to the toy and back. A look of fear it seems, but then you give me that grin and tell me to do it, “Fuck my ass Baby. Ride me”. \n\nLeaning forward I press the head against your tight opening, holding it there as you push back slightly. Watching as it pushing in, the head spreading you open and your hips still, waiting as you relax as push back taking more of the cock into your ass. “Oh yes baby” take it I moan as I see how much you like this.\n\n \n\nReaching down I grip your hips and push my hips forward, the cock sliding the rest of the way into your ass as your moans get louder. “Yes yes, fuck me now, fuck me!” your words getting muffled as you want more and each word is mixed with a moan. Pulling out and thrusting in deeply I take your ass now as mine. Deeply. Completely. Thrusting harder now as I work the cock into your ass, meeting your movements as your hips raise up for more of the cock. Grinding the cock completely into your ass as I roll my hips, working it deeper each time before I pull back. Just seeing how the cock fills your ass makes me wild, your grunts and moans adding to it.   \n\nPulling your hips back as I slam the cock into your ass I moan too, I can’t help it. Just hearing you moan and plead for me to fuck you harder is making me wilder as I plunge the cock harder into your ass. Letting your hips go I slap your ass cheeks hard remembering how many times you have slapped mine as your cock had plowed into my ass and pussy. \n\n   “I am going to fuck you until you cum, I am going to keep filling your ass until it’s completely mine” I tell you and I smack your cheeks again. Slamming the cock deep into your ass I roll my hips again, burying the cock deep in your ass as you head lifts, your back arches, your body tenses up and you yell your are going to cum, you have to cum, holding the cock deep I work my hips in small rotations, keeping it full but pressing deeper and deeper as you let loose and buck under me. Taking the cock deep into your bowels as your cock jumps on the pillows, your cum gushing out in spurts. Reaching down I wrap my fingers over the head and hold tightly to your cock as your hips move oddly, your body shuddering. \n\n  As your body stills I pull the cock slowly out and ease down and undo the loops on your ankles, then your wrist, whispering to you how much I love my ass I kisses your neck and slide into bed against you, telling you since its your off day you get to sleep a while longer. You roll over and close your arms around me and we drift off to sleep together. Wonder who will wake who up next time?"
    ],
    "authorname": "kttysbehind",
    "tags": [],
    "category": "Toys & Masturbation",
    "url": "https://www.literotica.com/s/my-way-to-wake-him-up"
}