{
    "title": "The Chair Ch. 06",
    "pages": [
        "The next time they met, The Chair had finally begun to look like a chair - albeit a chair with many perverted attachments. \n\nIt now looked like a simple black vinyl chair with cuffs attached at several points. The base pedestal was now covered with 4 plywood panels that had been covered with a thin layer of batting and vinyl. These panels were secured to the base with Velcro, enabling easy removal for servicing. While in the normal sitting position with the leg supports together, the thrusting units and their linkages are concealed underneath the leg supports. Currently, a cable ran from the base to the computer that had been setup on a nearby table. In the future he planned on replacing this cable connection with a wireless link. A power cord from the base was plugged into the nearest 110 volt wall outlet. \n\nThis time when she saw it, she wasn't disappointed at all. In fact it was quite apparent by the look in her hazel eyes that she was most excited. She anxiously asked when she could try it out. He told her that it was ready for a complete test drive right now. Out of excitement, she jumped into his arms, wrapping her legs around his waist. He told her that he wanted to record this trial so he could examine the performance of The Chair later. As she undressed, he setup the video camera to record this historical moment. \n\nThis time she needed no assistance climbing into the chair. Once she was comfortably seated, he began fastening the cuffs. Her ankles and thighs were soon securely bound to The Chair. He then fastened a large strap around her torso just beneath her breasts (he opted not to use the upper strap at this time). He then tightened the cuffs around her wrists and upper arms. He stood back to have a good look at his subject as she sat there securely bound to The Chair. This also gave the video camera an unobstructed view of The Chair and its captive. \n\nHe then returned to her side and retrieved the 2 nipple cups from a compartment under the seat of The Chair. As he placed the first one on her left breast, he flicked the switch within the compartment and the vacuum pump started to seat the cup firmly around her nipple. He then placed the other cup over her right breast and it too was sucked into place. \n\nHe asked her if she wanted him to tell her what was about to happen or if she just wanted to be surprised. She picked being surprise, as he thought she would. He then went to the table with the computer and repositioned it so he had an unobstructed view of her and The Chair as he entered commands on the keyboard. \n\nSuddenly the motors in the base began to whir and her legs began to spread apart while she was still in a sitting position. The sound was almost imperceptible with the base panels in place now. When her knees were about 12 inches apart, the back began to recline. Simultaneously with the back, the armrests began to drop, keeping her arms level with her torso. Once the back was fully reclined, the leg supports pivoted upward at the \"hip joints\" while remaining bent at the knees. This motion ceased when her thighs were once again at a 90-degree angle with her torso. This position resembled the launch position of an astronaut. The leg supports then spread apart a little more, providing easier access to her nether regions. \n\nHe reminded her that if anything should become unpleasant or painful, to let him know and he would discontinue all actions. With that out of the way, the primary thrusting unit withdrew from its concealment and began moving into position. The primary thrusting unit was currently fitted with a gel-filled vibrator 10 inches long and a little over 6 inches around (2 inches in diameter). As it neared her pussy, the unit began to spray a fine mist of lubricant. This unit had also been modified with a series of holes along its sides that would continually secrete more lubricant while it is in motion. This prevented the lubricant from dripping when the unit is not moving. \n\nAs her head was facing the ceiling and her knees were bent upward, she could not anticipate precisely when the first unit would begin to penetrate her. As she felt the mist of lubricant, she guessed that the moment was near. And she was right. The first 4 inches of the thrusting unit penetrated her swiftly and then came to a stop. It then withdrew 3 inches and stopped. It then thrust in 4 more inches (1 inch further than the initial thrust). This sequence continued until her pussy had enveloped all 10 inches of the vibrator. Of course since she had not seen the unit, she was not aware that it was a vibrator until the moment it began to vibrate after having been completely inserted. Her first orgasm accompanied the start of the vibrations. The computer then began randomly varying the intensity of vibrations from mild to maximum. The unit then began to slowly thrust in and out at the same time. \n\nShe was so absorbed in the feeling that the primary unit was providing her, she didn't notice when the secondary unit began to spray her asshole with lubricant. She did however notice when it began to penetrate her rear. This unit was designed to \"nudge\" its way in, based on the resistance the subject offered. This meant that the more the occupant's asshole relaxed, the further the unit would penetrate. This triggered her second orgasm, not as intense as the first, but stronger than normal. Being no novice to anal sex, it didn't take long before the secondary unit had completely imbedded itself in her ass. The anal unit was of moderate size, about one and a quarter inches across and 6 inches long. At least that's how it started out. Now that the unit was completely inserted in her rectum, the internal mechanism began to expand the unit. The unit stopped expanding when it reached a diameter of one and three quarter inches. She was glad it had stopped when it did as she was just about to yell stop herself, fearing that the unit was about to tear her asshole wide open. As it was, it provided a deliciously full feeling. \n\nHer body was now glistening with sweat from her head to her toes with the exception of the portion of her breasts that were enclosed in the nipple cups. The entire time the anal unit had been inserting itself and expanding, the primary unit had continued its thrusting. He then typed a few more commands into the computer and watched her reaction as the nipple cups increased their sucking action. From his vantage point he could see her nipples being sucked into the cups and elongated a good inch. The expression on her face (as this was the only part of her body she could actually move) conveyed the sense of utter pleasure she was now experiencing as her third orgasm rolled over her. This one was as intense as her first but lasted much longer, two minutes to be precise. \n\nThe primary unit began to increase its rate of thrust. Her nipples practically ached from the intense mechanical sucking they were receiving. The anal unit in her ass now began to vibrate. As the primary unit was now thrusting very rapidly, both penetration units were vibrating at their maximum intensity, the nipple cups decreased their suction intensity. Simultaneously both penetration units began to \"ejaculate\" into her pussy and ass. This triggered her fourth, and most intense, orgasm of the afternoon. It was more accurately a series of orgasms that continued to spasm through her pussy even after both units had stopped vibrating and thrusting. \n\nThe anal penetration unit had shrunk down to its original diameter and withdrawn from her ass. The primary unit then pulled out as well. As The Chair returned to a normal seating position, her orgasms continued to ripple through her body, forcing The Chair's \"cum\" to gush out of both her well-fucked pussy and asshole. \n\nAs she laid blissfully in The Chair, coming down from a sexual high like she had never known, he approached her and proceeded to gently and lovingly clean the combination of fluids and sweat from her body with a damp cloth. \n\nOn his way from the bathroom with the damp cloth, he had shut off the video camera that had been documenting the inaugural test run of The Chair. The videotape was meant as a means to evaluate the performance of The Chair. To examine in detail the various motions or positions that might not be just right. He has always been a bit of a perfectionist. He had previously tested the individual components, but this had been the first time with all the pieces integrated and with a living subject. Based on the exhausted and contented look on her face, he considered this test a complete success. \n\nAs he released her from The Chair and she began to recover her strength, she said that she wanted to see the videotape. You see she had never seen The Chair in operation from an observer's perspective. She had also never seen herself orgasm on video. So they both moved to the sofa in front of the TV to watch the just completed video. Being comfortable with her body, she remained nude. She was a little self-conscious watching herself as the video began, but as she watched the first vibrator entering her pussy, her self-consciousness was quickly replaced by arousal. By the time she was nearing her first orgasm on tape, she was so aroused that she began playing with her clit. At the same instant that she came on tape, she came again on the sofa. In the same way that her arousal didn't end on tape, neither did it here on the sofa. It seemed as if the more she came, the more aroused she got. While initially he had been watching the video from a technical perspective, he was now concentrating solely on her. The openness/freeness with which she masturbated while watching herself on videotape was enticing. After she had cum for the second time on the sofa, her hands and arms grew weary. This was due to their restriction previously while in The Chair as well as her recent activities on the sofa. \n\nStill she had not yet appeased her state of horniness, it was as if she was now insatiable. She turned away from the TV and gazed at him watching her. She leaned over, grabbing him by the collar and gave him a big passionate French kiss, sucking his tongue into her mouth. Before they separated from the kiss, she had torn his shirt open popping all the buttons off. She then pulled him on top of her and, in a single fluid motion, slid his pants over his ass and down his legs. She had been transformed into a creature of passion. Not that she wasn't always passionate, but this was something at a much greater and more primal level. \n\nAs he struggled to kick his pants off his feet, she was already releasing his massive erection from his boxers. In one swift movement she pulled him into her moist pussy and wrapped her legs around his ass to provide leverage. No, this wasn't going to be a long leisurely lovemaking session, this was going to be a hard fast and furious fucking. It's what she wanted (or more accurately needed) ... and who was he to refuse? \n\nAs he began to thrust into her, she would increase the intensity and depth of penetration by pulling him further into her with her legs wrapped around behind him. In this way she could let her hands and arms get a much-needed rest while still taking care of her almost insatiable desire. As he continued to thrust into her, he reached down between them and began to finger her engorged clit. After only two minutes of this treatment, she climaxed for about the fifth or sixth time this afternoon. This time was just as intense as it had been in The Chair. It was almost as if this session had triggered a sort of \"sense memory\" that brought back the intensity of her previous orgasms. As she came, her pussy began a series of intense involuntary contractions. These contractions in turn brought him to climax simultaneously with her. \n\nAs he looked down at her light skin and red hair covered with perspiration, he noticed that she had passed out from the pleasure. But even in her unconscious state, her pussy continued to milk his cock. With the grip that she had on it, he wasn't sure he would even be able to withdraw it without some level of pain. So he remained like that, on top and inside her, until her contractions had finally stopped -- 5 minutes later! \n\n-----\n\nAs she awoke, she was totally refreshed and she felt a type of sexual contentment she had never known before. She was a little disoriented, as she was no longer on the sofa, or even in the same room for that matter. She was in the bedroom, stretched out on the king size bed. She also was no longer naked, she was now wearing a light blue silk shirt with a single button holding it closed. It obviously wasn't hers as the sleeves were bunched up on her forearms and when she stood, the shirttail came down almost to the knees of her petite 5'0\" frame. And through the window curtains she could see the sun shining brightly. She felt certain that feeling this refreshed, she must have slept several hours and it must be evening by now. \n\nThat's when he walked in carrying a tray. He said that he had heard her stirring around, so he had prepared lunch for her. As she sat up in the bed and he served her a small feast, he explained how she had passed out the day before. After allowing her to sleep on the sofa for several hours, he had picked her up and carried her to the bedroom where he put his shirt on her and laid her on the bed where she could get a much needed and well-earned rest. That had been around 7:00 p.m. yesterday. It was now noon the following day. She had slept soundly for 19 hours. \n\nHe went on to explain how he had been concerned about her, as her sleep state was virtually as motionless as death. Had it not been for her extremely deep breathing and the corresponding rise and fall of her beautiful 34D chest, he would have called 9-1-1. As she was obviously alive, he had spent most of the night at her side simply watching her breathe. \n\nAfter she had finished her lunch, she then took a long hot shower, washing away any remaining traces of the previous day's activities. She then got dressed in the same tank top and jeans that she had arrived in the day before and joined him in the other room where she found him tinkering on The Chair. "
    ],
    "authorname": "Rickd_1960",
    "tags": [
        "penetration units",
        "leg supports",
        "began spray",
        "unit began",
        "securely bound",
        "primary thrusting",
        "quarter inches",
        "nipple cups",
        "damp cloth",
        "thrusting unit"
    ],
    "category": "Toys & Masturbation",
    "url": "https://www.literotica.com/s/the-chair-ch-06"
}