{
    "title": "It was Uncomfortable at First",
    "pages": [
        "If you haven't read \"They Said \"SURE\" and \"Cindy Called Back\" you might want to go back and read those so this story will make better sense. This tells what happened the next day. \n\n*\n\nSee, I was at a three-day teacher's professional development conference in Little Rock on teamwork and I was paired with three other female teachers. There aren't that many male teachers in my grade level. \n\nJennifer was the oldest teacher, besides me. She was 46, married, two teenage kids, and pretty much had a middle-aged body, kind of wide, extra padding, like me, and probably the alpha of the group. She was a take-charge type person and turned into our group leader.\n\nCindy was 24, in her second year teaching, cute as a button, blond, tiny, probably 5' 1\", maybe 110 pounds. Newly married. Not much older than my daughter.\n\nSamantha was in her middle 30s, married with two small kids, a very attractive woman, quiet.\n\nWe all developed a great working arrangement throughout the first day. At 4:30 the conference was over for the day and Samantha, who lived just outside of Little Rock, went home, but the other three of us were from out-of-town and had booked rooms in the hotel the conference was in.\n\nSince you already read the first two stories you know what happened that first evening. After Cindy left my room about 5:30 the next morning I relived the evening's experiences before I hit the shower. I spent a good deal of time in the shower, thinking about Cindy and her lovely body cumming so many times.\n\nWhen I got down to the restaurant, Jennifer was already there. She waved me over to her table. Samantha had come in early and they were having breakfast together. Jennifer made it obvious that she wanted me to sit next to her so instead of making a scene, I did. Samantha didn't say anything, but she had this real funny look on her face. \n\nAs I settled in, I felt Jennifer's hand slide over my thigh and she patted my cock. I gently removed her hand and tried to act like nothing happened. I caught Samantha looking. She quickly looked away and I saw her neck flush. What did THAT mean?\n\nIn a minute Cindy joined us. She said hi all around, sliding into the chair to the left of me. Conversation was a bit strained at first. We all agreed that we slept well, especially for the first night out. Jennifer made it plain that she slept extra hard, with a smile.\n\nAs we loosened up I noticed that Samantha was extra quiet, stealing glances at me. She had ahardly paid any attention to me the day before. I caught her a few times and she blushed each time. What was going on?\n\nAs breakfast wore on I kept noticing knowing glances being exchanged between Jennifer and Samantha. When I would catch them Samantha would blush again but Jennifer would always wink. Something WAS going on.\n\nSamantha left to go to the bathroom so I asked Jennifer, \"What's going on?\"\n\n\"What do you mean?\" Jennifer asked with a smile. \n\n\"You and Samantha. Something's going on between you two.\"\n\n\"You're imagining,\" Jennifer laughed. \"It's just an inside joke.\"\n\n\"About me?\"\n\n\"Maybe.\"\n\nI suddenly got it. \"DID YOU TELL HER?\"\n\nJennifer got real embarrassed. \"Well, I might have mentioned that something happened last night.\"\n\n\"WHAT DID YOU TELL HER?\" I hissed.\n\nSamantha walked up right then. \"Everything,\" she said with a smile. \"She told me everything big boy.\"\n\nI was totally humiliated. \"How COULD you?\" I asked Jennifer. \"You promised! You said it would be our secret.\"\n\n\"Our dirty little secret,\" she said with a laugh. But she could tell that I was extremely upset with her.\n\n\"Joe, don't blame her. I pulled it out of her. I knew when I saw her this morning that something had happened. I thought she picked up some guy and I was really letting her have it. She was trying to defend herself and it just came out. I couldn't believe it, but I also think it was the hottest thing I've ever heard. I wish I had stayed,\" Samantha said with a wink.\n\n\"It was,\" Cindy said, joining the conversation. \"Joe it an extremely sexy man. It wasn't dirty at all. It was very erotic.\"\n\nI was furious. I was embarrassed. I was confused. I was....getting turned on. Samantha, a very attractive woman, was just smiling and looking at me.\n\nIt was time to get back to get to our conference and the conversation ended, thankfully. \n\nI was not participating in the conference this morning very well. It was obvious that I was upset. The tension in the group was obvious. Everyone was uncomfortable. Jennifer tried to quietly apologize several times but I was not having it.\n\nHow COULD she? It was OUR private time. Yes, it was extremely erotic...and fun, but it was NOT for public consumption. I was glad that Cindy could keep a secret.\n\nSeveral times I caught Samantha looking at me. She immediately looked away. Then she started not looking away, smiling.\n\nAt the break Samantha pulled me aside. \"Joe, you have nothing to be embarrassed about,\" she said. \"Truly I pulled it out of her. She didn't want to tell me but I accused her of sleeping with some stranger and she defended herself saying she didn't sleep with anyone.\"\n\n\"So how did MY name come about?\"\n\n\"I asked. Was it Joe? She turned bright red. Joe, you are a handsome guy and I knew all day yesterday that Jennifer liked you. But she responded and said 'I told you I didn't sleep with anyone'. But her face told me I was onto something. So I told her to spill it.\"\n\n\"She hemmed and hawed and finally said 'you wouldn't believe me'. We went back and forth for a while, then she finally blurted out that you masturbated for them.\"\n\n\"Joe, needless to say that shocked me. I would have NEVER thought that in a million years,\" she laughed. \"But I wanted ALL the details. So she told me.\"\n\n\"She shouldn't have said anything. It was just a spur of the moment thing. A fantasy. Mine...hers, we played it out, that's all,\" I tried to explain, deeply embarrassed.\n\n\"Why are you embarrassed Joe? You're a good looking guy. You have fantasies too. We ALL do.\"\n\n\"Yeah, but we don't normally act them out,\" I retorted. \n\n\"You were far from home, it had been a long day. You probably would have gone to your room and masturbated anyway, right? You just let two women watch,\" she laughed.\n\nI was quiet. Embarrassed. And a little turned on.\n\n\"I wish I had stayed,\" Samantha whispered. I looked at her with a surprised look. \"You're not the only one with fantasies like that,\" she said quietly. Now SHE turned red. \"I would LOVE to watch you.\"\n\nI looked at her. \"Those days are over. Apparently people can't keep a secret.\"\n\n\"I can,\" she answered, turning even redder. Then she said very quietly \"Jennifer also told me what was needed for a repeat performance.\"\n\nI looked at her with a strange look on my face. She nodded. \"You mean?\" I asked.\n\nShe nodded again. \"As I said, we all have our fantasies. And I haven't been able to think of anything else all morning.\"\n\n\"You? You want to get naked for me and masturbate with me?\"\n\nShe nodded again. \"We have an hour and a half for lunch,\" she said.\n\nNow, while Cindy is very cute, she is also young. She has a nice body, but Samantha is a WOMAN. She has nice curves. I blatantly looked over her body. Good sized boobs. Nice rounded ass, but too big...womanly.\n\n\"What would the others think if we disappeared during lunch?\" I asked.\n\n\"Who cares! We know they're all perverts too,\" she laughed. \"They had their chance. If they want a repeat performance they can get naked tonight for you.\" \n\nI laughed. The tension was broken. I really wanted to see Samantha naked. I didn't have a problem with getting naked for her. But last night we had had a discussion beforehand about being faithful to our spouses...kinda. \"Um....just masturbation. No....screwing, right?\"\n\nSamantha laughed. \"Yes, no screwing. I've never done that on my husband and I don't intend to.\" She laughed again. \"Jennifer said that you have a really nice...uh...penis...and I would like to see it.\"\n\n\"Penis? She said penis?\"\n\n\"Well, no....she said cock,\" she laughed.\n\nMy cock was getting very hard and she noticed. Looking down she said \"is that a yes?\"\n\n\"OK, lunchtime, my room.\" I couldn't believe my luck. Masturbating with two women in less than 24 hours. Break was over but I noticed that neither Samantha nor I was able to concentrate too well with the task at hand.\n\nGood ole Jennifer noticed that something was different. When we broke for lunch both Samantha and I said we had an errand to run and couldn't eat lunch with them. Jennifer suspected something. \"Same errand?\" she laughed. Neither one of us said anything. Cindy smiled and winked at me.\n\nWe walked out of the room through different doors. Our plan was to meet on the fifth floor.\n\nI got to the fifth floor first and hung around the elevator. When it open and Samantha was standing there, I could feel my cock rise.\n\nI took her by the hand and we nervously walked to my room. She slipped her arm around my waist and I did the same. \n\nAs we got to my room I let my hand slide off her waist over her butt. She giggled.\n\nI opened the room and stood aside as she entered. I got incredibly nervous all of a sudden. She walked over to the bed and laid down her purse and turned toward me.\n\nWe gave each other a nervous smile. I looked over her body and she looked over mine. Her eyes lingered on my crotch.\n\n\"What do we do now?\" I laughed.\n\n\"Well, I guess we take off our clothes,\" she answered.\n\n\"I mean how. Do we strip together or do you do a striptease for me first.\"\n\n\"I would like to see what you showed the other girls.\"\n\n\"They saw everything,\" I laughed. \"I was hoping I would see everything too.\"\n\n\"Well, I'm quite nervous right now. You have to understand that no man beside my husband has seen me naked...so far. And you've had experience along those lines,\" she laughed.\n\nI sighed and said, \"OK, sit on the bed, please.\" She did so and I repeated my performance from last night. When I pants came off she stared at my bulge. I stayed there for a bit before I hung up my pants, letting her look. \n\n\"That's SOME bulge,\" she said nervously. \"And there's a wet spot on the top!\"\n\n\"Anticipation,\" I said, winking. I walked to the closet and hung up my pants. I could feel her eyes on my ass.\n\nI walked back to her and stood in front of her. \"Would you like to take my underwear off?\" I asked.\n\nShe looked up at me with wide eyes. \"Yes,\" she said nervously.\n\nI stepped toward he and she ran her hand over my bulge. My cock jumped and she giggled. Then she leaned forward and kissed my cock through my underwear and ran her cheek over it. \"You probably won't believe this but this is only the second...penis...I've ever touched.\"\n\n\"You can call it a cock,\" I said. \"But you still haven't touched it,\" I smiled down at her.\n\n\"OK.\" She hooked her fingers into my waistband and slowly began to pull my underwear down. When the head came visible she leaned forward and kissed it. \"Now I have,\" she laughed nervously. \n\nShe continued to expose my cock, looking intensely at it. \"It's beautiful,\" she whispered. She ran her hand over the underside. My cock was standing tall for her. When my underwear cleared my balls she cupped them. Her other hand pulled my underwear off and I stepped out of them. \n\nShe took hold of my cock and began to stroke it. \"I like that slight upward curve,\" she said, looking up at me. Then she got an evil look in her eye and slowly lowered her head, looking me in the eye, and put my cock in her mouth and began to suck.\n\nOh, my! What a mouth. Her tongue was swirling around the head and her other hand was holding my ass, pulling me tighter. I put my hands on her head and slowly fucked her mouth. But it was all going too fast.\n\nI pulled out of her mouth. \"If you go any further, I'm gonna cum I n your mouth and that's not what we're here for,\" I said. \n\nShe had a pouty look on her face. I took her by the hand and stood her up. \"Your turn.\" She turned red.\n\n\"Now I'm embarrassed,\" she laughed.\n\nI'm standing here stark naked in front of you and YOU'RE embarrassed?\" Come on, start stripping,\" I laughed.\n\n\"OK, sit,\" she said and started to sway. Her hands went to her blouse and she began to unbutton it. \"I don't know about you, but I am really turned on right now,\" she said. Then she looked at my crotch. My hand was slowly stroking my cock. \"Oh, I guess you are too,\" she laughed.\n\nShe slipped her blouse off and laid on the chair. She was wearing a light blue bra and I could see that her nipples were hard.\n\n\"What next, bra or skirt,\" she asked.\n\n\"Skirt please.\"\n\nShe continued to sway as her hand went to the side of her skirt a she lower the zipper. She let the skirt fall to the floor and she stepped out of it. Her panties matched he bra.\n\n\"A matched pair,\" I commented.\n\n\"Always,\" she smiled.\n\n\"Good to know,\" I laughed.\n\n\"Now what?\"\n\n\"Turn around, let me see you.\"\n\nShe really had a nice body. Her ass was rounded, but was not at all large. I really like it.\n\nShe reached behind her and unclasped her bra. She turned around, holding the bra to her breasts.\n\n\"I'm ready,\" I said.\n\nShe gave a great sigh and whipped her bra off, dramatically. \"Tada!\"\n\nThey were magnificent. A good D cup, with just a slight sag. Her nipples were rock hard. She had those little bumps around her nipples showing that she was really aroused.\n\nShe lifted them up with her hands as if she was offering them to me. Then she tweaked her nipples. \"Mmmmm,\" she moaned.\n\nI wanted to applaud, but she wasn't done. I motioned for her to continue.\n\n\"Do you want to take them off,\" she asked nervously.\n\n\"Of course. Come closer\"\n\nShe stepped closer and I did what she did. I cupped her crotch. \"They're damp,\" I commented.\n\n\"They should be. I'm not sure I've ever been so turned on.\"\n\nI rubbed my hands all over her panties, her ass, her hips, her pussy. She held onto my shoulders and leaned back with a heavenly look on her face. \"Hurry, please. Take them off. I wanna be naked like you,\" she sighed.\n\nI hooked my fingers over the waistband behind her and slowly lowered the back, letting my fingers rub her ass. The panties began to lower in front exposing her pussy hair. \n\nHer pussy hair was thin. Light brown, coming more and more into view. And then the top of her slit appeared. And then her clit that was already extended through her lips. I kept going until her entire slit was exposed to my eyes. As I lowered her panties to the floor I leaned forward and kissed her pussy lips....she ran her fingers through my hair and help me there....so I licked up and down her slit. She shivered, then pushed me away.\n\n\"Come on. Start stroking that cock for me,\" she laughed.\n\n\"Start rubbing that pussy for me,\" I countered with a smile.\n\nShe looked at the bed. I said \"you put some pillows against the headboard. I'll get the rest of the pillows and set up on the other end of the bed. With mutual masturbation, you have to have good sight lines,\" I said.\n\n\"Boy, getting naked was hard enough...and erotic,\" she laughed. \"But now we have to let each other see the most personal thing anyone ever does. I am so nervous, but also so turned on,\" she said as she crawled on the bed. \n\nWhat an ass, I thought to myself. \"You have a great butt,\" I told her.\n\nAs she settled in she said \"not bad for a 42 year old woman, huh?\"\n\n\"You're 42? I figured you for 35. You are AWESOME!\"\n\n\"Thank you,\" she answered. \"You're not bad yourself.\"\n\nI positioned my pillows on my end of the bed and settled in. \"Thank you very much, naked lady,\" I laughed. I spread my legs for her so she could see everything. \n\nShe was settling in her end but had her knees close together. As she took in my cock, I took hold of it and started stroking.\n\n\"Oh, my! That is so hot! You really DO have a nice cock.\"\n\n\"Thank you, I'd say you have a nice pussy, but.....I was really too close to see it. You did taste good though.\"\n\nShe turned red. \"I guess it's time, huh.\" With that she spread her knees and let me see her sweet pussy. One hand went to her boobs and one hand slid down her belly to her pussy, which she cupped and began rubbing.\n\nThe room was quiet except for some light squishing noises as I stroked my cock and she rubbed her pussy. We were both watching the same places, but I snuck a look at her boobs. She had magnificent boobs, nice small nipples that were very hard right now. Just a slight sag that really made them look sexy.\n\n\"I've never even done this with my husband,\" she said. \"But I will now. This is SO hot! I've masturbated for him and he's masturbated for me but we've never done it at the same time. We Will!.\"\n\nHer breathing was getting deeper. So was mine. She slid her fingers into her pussy and pulled out and up, through her clit. \"Mmmm,\" she moaned.\n\n\"Mmmmm,\" I moaned. My cock was so hard and it was feeling really good. I needed to slow down. I started playing with my balls.\n\n\"Oh, that is so hot,\" she said. \"Your balls are so big.\"\n\n\"They're ready to unload,\" I said with a smile. I felt my asshole clench a few times.\n\n\"Wow! What was that?\" she asked with a smile. \"Are ya happy to see me?\"\n\n\"Very much so. Your chest is flushing so nice. I can tell you are feeling really good right now.\"\n\nShe spread her legs even more and slid a finger down to her asshole and circled it. She came back to her pussy and stuck two fingers in and used her thumb to rub her clit. Her other hand was busy on her nipples.\n\n\"Would you like to eat me?\" she asked.\n\nI laughed. \"Of course I would. Who wouldn't?\"\n\nShe started to get to her knees, surprising me. \"Slide up here closer and lay flat,\" she ordered me. \"I want to suck your cock while you're eating me.\"\n\nI was surprised by her aggressiveness. I did not expect that from the quiet, gorgeous woman. I'm not complaining and I obeyed her, sliding up the bed as she moved to the side of me.\n\nShe slid her leg over me with her pussy toward my head and her head toward my cock. I got an even more intimate view of her cunt and it was magnificent. She lowered herself onto my mouth and took my cock in her hand and began stroking.\n\nI grabbed her ass and pulled her down to my mouth and began eating her out. She had a nice tasting pussy and she was SO wet.\n\nShe took my cock into her mouth and I could feel her head bobbing up and down on my cock....her tongue flicking my head. She was gonna make me cum. I better get down to business.\n\nI decided that I was gonna make her cum first and it seemed to become a contest. There were times when she had to stop sucking me and would lay her head on my belly, rotating her ass in my hands and encouraging my tongue to go where she wanted. Then she would start licking and sucking again and I would lose MY place for a while.\n\nI couldn't believe this quiet shy woman who was now riding my face. I could see her little asshole beginning to clench as I licked her pussy. I knew she was close, so I slipped my finger over there and took some of her pussy juice and spread it around her asshole. She jumped and humped my face even more. \n\nShe was humming on my cock. \"Mmmmmmm.\" I could tell by the pitch that she was getting close but she wouldn't let go of my cock. Her ass was bouncing up and down, I was trying to hold onto it so it wouldn't break my nose. But I kept licking her clit, licking deep, suck what Y could get ahold of. \n\nAnd then she came...ALL over my face. I've never known a woman to squirt with me, but I think that maybe she was squirting. And in an instant, so was I. And she took it all. My face was soaked and her pussy was twitching over my mouth. My cock was being licked clean. Then we both collapsed and just enjoyed the afterglow, with me lightly stroking her ass. \n\n\"Wow!\" she said. I think that was the most intense orgasms I have ever had.\"\n\n\"I think you squirted all over my face.\"\n\nShe got up on her hands and looked back. She laughed. \"Look at your face! Did I do that?\"",
        "\"Yes, you did. All over my face and chest and the bed. I'm gonna have to call housekeeping to change the sheets,\" I laughed.\n\nWe disentangled ourselves. I looked at her body as she took the sheet and wiped off her legs and pussy. She also wiped up may face and chest. Her boobs were right in front of my face. She saw me looking.\n\n\"Would you like to kiss my boobs?\" she asked. \n\nI couldn't believe this woman. Here I thought she was an attractive conservative soccer mom and here she was stark naked on her knees in front of me, feeding her boobs in my mouth. I took her around her waist and pulled her in as I kissed and licked he boobs.\n\n\"Oh, I love to have my boobs licked,\" she sighed as she leaned her head back. My hands went down to her ass so I could hold her up.\n\nSuddenly she jerked up. \"Oh my god! Look at the time!\"\n\nWe were ten minutes late getting back. She jumped off the bed, grabbed her clothes and ran to the bathroom. Watching her ass was amazing. I quickly got dressed and she emerged from the bathroom fully dressed.\n\n\"What will they say when we come in at the same time?\" She laughed.\n\n\"Nothing...just smile,\" I said with a laugh as we left a room that smelled like sex."
    ],
    "authorname": "secret_admirer72116",
    "tags": [
        "mutual masturbation",
        "exhibitionism",
        "strip"
    ],
    "category": "Toys & Masturbation",
    "url": "https://www.literotica.com/s/it-was-uncomfortable-at-first"
}