{
    "title": "Addison's New Friend",
    "pages": [
        "\"What are you going to do this summer, Addison?\" Michelle asked.\n\n\"Hopefully, fuck every guy in town.\"\n\n\"I don't believe that's a realistic goal for an eighteen year old,\" the psychiatrist said calmly.\n\n\"If I only get half of them, is that considered a success or failure? C'mon, Michelle. What do your books tell you? Would my cunt be half full or half empty?\"\n\n\"Why do you feel it's necessary to talk like that, Addison?\"\n\n\"Like what?\"\n\n\"Using so much profanity,\" Michelle said.\n\nAddison looked at her with surprise. \"Excuse me. Let me start over. I'm going to have sex with every guy in town. And would fifty percent mean my vagina is half full or half empty?\"\n\nMichelle stared at her.\n\nAddison continued, \"That changes the meaning completely, doesn't it? Puts it into a whole new light. Shit.\"\n\nMichelle typed a few notes on her laptop and looked up at her patient. She had been seeing Addison for almost a year. She was just one of many teenage girls Michelle treated, or tried to treat. Why was it that the prettiest ones were the most distressed, Michelle wondered?\n\nAnd Addison was beyond pretty. She was easily the most attractive eighteen year old Michelle had ever laid her eyes on. Long blonde hair, green eyes, luscious lips and a body to die for should never be allowed in one package—but Addison had it.\n\nNow, finally, after a half dozen visits, Michelle felt like she was getting closer to the solution of the Addison puzzle. The suppressed anger in the teenager's voice was always a sign that Michelle was touching a nerve. Too rarely in their visits had Addison ever expressed anger.\n\n\"When was the last time somebody told you what to do, Addison?\"\n\nThe girl slouched in her favorite chair; the one closest to the door, with the huge, padded arms that Michelle let Addison fling her leg over. \"Yesterday. My fucking Mom wanted me to clean my room. Again! Like I've ever done that. She practically screamed at me this time. It was kind of funny.\"\n\nMichelle typed away. \"Did it make you mad?\"\n\n\"Hell, yes.\"\n\n\"Did you do it?\"\n\n\"Hell, no.\"\n\n\"Why not?\"\n\n\"I'll clean it when it needs cleaned.\"\n\nMore notes. \"Why do you hate men, Addison?\"\n\nMichelle hadn't used this method of questioning in a long time, but the time seemed right to try it on somebody who repelled every other attempt to get inside her head. After Addison's initial gaze of confusion, she said, \"They all think they're so fuckin' smart. They think they can say something nice to me, or offer me a drink, and I'm going to fuck them. Assholes. I'll decide who, and when, and how.\"\n\nShe sat upright in the chair, a tension radiating from her body that Michelle felt clear across the room.\n\n\"They should BEG me. But most of them put a hand on my ass or take a swipe at my tits and think I'll roll over for them. Nobody tells me what to do!\"\n\n'Bingo!', Michelle typed.\n\nTen years in psychiatry with young people taught Michelle to pause. Normally, no question she could ask brought a better response from the patient than a pause after an outburst. Michelle took the extra time to admire, once again, the girl in her chair.\n\nThe long, tan legs that extended out of Addison's obscenely short shorts were unblemished. The gentle curve of the calves and nearly-mature thighs could have belonged to a model. Addison's sleeveless top rode up her body as she slumped, exposing a few inches of firm abs. Her breasts threatened to fall out of the loose shirt.\n\nAddison rolled the end of her blonde hair around a finger and stared out the window. There was no indication she was going to break the silence.\n\n\"Who's your closest friend right now, Addison?\"\n\nThe girl's eyes swung back to Michelle. She looked depressed again, or tired, or bored. \"My dog.\"\n\nMichelle fought the urge to laugh. In fact, she was better at repressing her emotions than most of her patients who were being treated for just that condition. Oftentimes, it leaked into her life away from the office and she had to consciously let it out. \n\n\"Is that by your choice?\"\n\n\"Not totally. He had something to do with it, too.\"\n\n\"You've told me before that you dated. You don't consider any of those guys friends?\"\n\nAddison laughed. \"Fuck no.\"\n\nMichelle typed for a few seconds, stalling to properly phrase the next statement in her mind.\n\n\"I want you to try something, Addison. Before we meet again, I'd like you to make one new friend. It can be somebody you already know or somebody you meet,\" Michelle said. \"Are you willing to do that?\"\n\nMichelle closed the lid of her laptop and looked at Addison.\n\nThe girl nodded, her mouth curling into a frown of resignation. \"I guess.\"\n\n###\n\nMichelle flopped onto the family room couch and sighed out loud. She turned on the TV and tossed the remote aside, not really caring what channel came on. She closed her eyes and ran her fingers through her hair.\n\nShe loved these evenings when her police officer husband was on duty and she had the house to herself. She could lie unmolested in her t-shirt and panties, attempting to wipe all the day's sessions out of her mind.\n\nBut evenings after she'd seen Addison proved to be the hardest. The teenager was an intriguing case, first of all. The thirty-five year old psychiatrist was used to dealing with younger patients, but almost always she could figure out what was going on inside their brain. It wasn't so easy with Addison, although progress might have been made today.\n\nThere was another problem when it came to Addison, however.\n\nMichelle rolled onto her back and settled her head onto a plush pillow. Then, as she always did on post-Addison evenings, she ran her hand up the inside of her thigh and brought the bottom of her t-shirt with it. She raised her ass off the couch and bunched the t-shirt around her waist. With her tiny panties now uncovered, Michelle slid her hand inside.\n\nShe touched her clit one time and felt the all too familiar tingle in her pussy. She would not return to that most sensitive spot for a few minutes, knowing that only the slightest provocation with Addison on her mind would start her down the steep cliff toward an orgasm. Instead, she would tease herself with the payoff being a more intense climax.\n\nMichelle's panties stretched out as her petite hand probed the moist area around her hole. She gathered moisture on her fingertips and separated the flaps of skin to allow access to her vagina. Her hand slid up and down, the fingers finding the opening, but not entering.\n\nJust as she was about to slip a finger inside her body, her cell phone buzzed.\n\n\"Fuck!\"\n\nShe pulled her hand out and reached behind her head for the phone. On the second ring she found it and looked at the screen. There was no ID of the caller, but it was a local number. Very few people had the unlisted number and she rarely got crank calls. Being the professional that she was, she answered the call after the third ring in case it was an emergency.\n\n\"Hello.\"\n\n\"Hi. Michelle?\"\n\n\"Yes.\"\n\n\"Hey. This is Addison.\"\n\nMichelle thought she was ready for anything when she answered the phone. She wasn't prepared for this.\n\n\"Addison? How'd you get this number?\"\n\n\"It's amazing what you can get when you promise to have sex with a dude that works at the phone company,\" Addison said.\n\n\"That's illegal, Addison.\"\n\n\"Having sex with a guy from the phone company is illegal?\"\n\n\"Stealing unlisted phone numbers.\"\n\nThe scent of her sex wafted from her fingers as Michelle held the phone. That, and the sound of Addison' voice, only made her wetter.\n\n\"Sorry. Didn't know it was unlisted. Anyway, I wanted to talk.\"\n\nMichelle didn't believe her pleading of ignorance, but she knew better than to refuse to talk to her.\n\n\"About what, Addison?\"\n\n\"About you.\"\n\n\"Me? Why me?\" Michelle asked.\n\n\"I've decided you're going to be my new friend. I'm really excited.\"\n\nMichelle's heart raced. \"I'm glad you're excited, Addison. But we can't be friends.\"\n\n\"Why not?\"\n\n\"I can't objectively help you if we have a close friendship. We can be friendly to each other, Addison. But we can't be friends.\"\n\n\"That sucks,\" Addison sighed. \"Because I think you really like me.\"\n\n\"Of course I like you.\"\n\n\"Michelle, I see the way you look at me when we're together. I know that look. Men give it to me all the time. You look at me that way, Michelle.\"\n\nThe pause that followed could never have been long enough for Michelle to formulate a sensible response. She said, \"What are you suggesting, Addison?\"\n\n\"Damn it, Michelle. Quit being the psychiatrist for just five minutes. Can you do that for me? And how does that sound to YOU, anyway?\"\n\nThe familiar sudden anger shouldn't have surprised Michelle, but it did. She tried desperately to escape the role of analyst, but she also didn't want to lose the ground made up earlier in the day.\n\n\"I don't look at you in sexual terms, Addison.\"\n\n\"You're lying. And I can prove it,\" the teenager said with a confident voice.\n\n\"How?\"\n\nMichelle regretted asking the question as soon as it left her mouth.\n\n\"What are you wearing right now?\"\n\n\"A t-shirt and panties.\"\n\n\"Are you alone?\" Addison asked.\n\n\"Yes.\"\n\n\"Michelle, I want you to reach inside your t-shirt.\"\n\nMichelle felt her breathing become heavy. She thought about appropriate responses; all the things she learned in school; possible directions to take with this girl.\n\n\"OK,\" was all she could say.\n\nA sigh came across the phone. \"Michelle, this isn't going to work if you don't listen to me. Now put your hand inside your shirt.\"\n\nThis time Michelle obeyed. Her hand slid under the shirt, resting just above her navel.\n\n\"Do you have a bra on, Michelle?\"\n\n\"No.\"\n\n\"Good. Never wear a bra when you know I'm going to call.\"\n\nMichelle didn't ask the obvious question, allowing the teenager to stay in control.\n\n\"Do you want to know what I'm wearing?\" Addison asked.\n\n\"Tell me,\" Michelle said without any emotion.\n\n\"Nothing, Michelle. I'm in bed naked.\"\n\nMichelle felt herself losing control over her nerves. Shivers flowed through her body in waves. Somehow she had to hide it all from Addison. She needed to know where Addison was taking this, but at some point it had to be stopped.\n\nAddison said in a very soft tone, \"How often have you wanted to see me naked, Michelle? Every time I visit you?\"\n\nMichelle would not answer.\n\n\"Reach up and touch your breast.\"\n\nMichelle's hand stopped at the bottom of her breast.\n\n\"Pull the shirt up, Michelle. Over your breasts.\"\n\nWhen her nipples were exposed, Michelle laid the shirt down.\n\n\"Now wrap your fingers around one of your breasts, Michelle.\"\n\nShe followed the orders exactly.\n\n\"Squeeze it. Feel the soft skin, Michelle. Close your eyes and imagine it's me you're holding. You're reaching out and fondling my tit like you've wanted to since the first time you saw me.\"\n\n\"Addison, that isn't...\"\n\n\"Shhhhhhh. Just listen to me, Michelle. Now take hold of your nipple and roll it between your fingers. Pinch it, Michelle. Harder.\"\n\nHow did she know? How could her patient know that nothing aroused her more?\n\n\"Pull on it. Can you feel it clear down to your pussy? Play with your tit, Michelle, until you can feel the quivers inside your stomach.\"\n\nMichelle felt those quivers several minutes ago, but the renewed attention to her nipples caused a flood of pleasurable feelings to stream through her.\n\n\"I want you to tell me if your panties are wet. Touch them.\"\n\nMichelle didn't have to. But she did.\n\n\"Yes.\"\n\n\"Yes, what?\" Addison insisted.\n\n\"I'm wet.\"\n\n\"So am I, Michelle. You make me wet. I love your tits and the hard nipples. I wish I could suck on them right now.\"\n\nMichelle winced and her eyes closed so tightly it almost hurt.\n\n\"Now rub the top of your panties. Press your panties into your pussy, Michelle.\"\n\nShe glided her hand back and forth across the thin material. She spread her legs a little farther apart and rubbed some more.\n\n\"That's it. Now find your clit. Rub your clit through your panties and tell me how good that feels.\"\n\nMichelle rubbed, but she did not speak.\n\n\"Tell me, Michelle.\"\n\nStill, no response.\n\n\"I can hear you breathing, Michelle. Tell me how it feels.\"\n\n\"It feels good, Addison.\"\n\n\"What does?\"\n\n\"Rubbing.\"\n\n\"Rubbing what?\"\n\n\"It feels good to rub my clit.\"\n\n\"Tell me about it.\"\n\nMichelle wanted to scream. She couldn't be letting this happen. A teenager—a depressed teenager—was making her describe her masturbation over the phone. Her hand moved back and forth.\n\n\"I can feel the panties rubbing my skin. And my clit is hard. Every time I touch it...\"\n\nMichelle's brain finally caught up and let her understand what she was saying.\n\n\"What, Michelle? Tell me.\"\n\nAddison's voice once again put Michelle's brain on hold. \"Every time I touch it, I want more.\"\n\n\"God. You're going to make me cum. Hearing you say that is so cool. I'm rubbing my clit, Michelle. I feel it, too.\"\n\nThere was a long pause, with nothing but the sound of their breathing on the phone. Finally, Addison said, \"Take off your panties.\"\n\nMichelle put the phone down. She quickly pushed her panties down, lifted her legs, and pulled the underwear off. She tossed the panties onto the floor next to her.\n\n\"Are you naked?\" Addison asked.\n\n\"Yes.\"\n\n\"Now play with your clit some more. Rub it harder until you think you're going to cum. But don't cum, Michelle.\"\n\nWithout the last command, Michelle wasn't sure she could follow these instructions. But the simple fact she wasn't going to cum almost made it alright. She'd play Addison's game a little longer.\n\nMichelle masturbated silently, allowing her heavy breathing to send its own message to the teenager on the other end of the line.\n\n\"Think of me sitting in your chair naked. I'm holding my tit in one hand, the other hand between my legs playing with my clit. I have a leg hanging over the arm of the chair, Michelle. You can see every inch of my pussy.\"\n\nThe young voice seemed to Michelle to be shaking, or at least rough and unsure of itself. Michelle had the image Addison described in her mind. She was, in fact, looking between the teenager's legs.\n\nSuddenly, she was on the verge of an orgasm.\n\n\"Oh God!\" Michelle exclaimed. \"I have to, I'm stopping, Addison. Oh my God.\"\n\n\"That's alright, Michelle,\" Addison said soothingly. \"That's alright. Rest for a few seconds.\"\n\n\"No. Addison. We can't...,\" Michelle panted.\n\n\"Shhhh. Rest for a second.\"\n\nMichelle lie spread-eagle on the couch, one hand holding the phone and the other covering her eyes. Tears tried to escape, but she composed herself, took several deep breaths, and tried to relax.\n\nA moment later, Addison's voice was back. \"You OK?\"\n\n\"Yes.\"\n\n\"Now...tell me how wet you are.\"\n\n\"I can't, Addison. This has to stop.\"\n\n\"Why?\"\n\n\"You're my patient and...\"\n\n\"Bullshit. Why can't you touch your pussy and tell me how wet you are?\"\n\nThe silence lasted fifteen seconds. \"Because I'll cum.\"\n\nAddison smiled without a sound. \"Touch it, Michelle. Touch your pussy.\"\n\nMichelle put a hand between her legs and spread the lips apart. She searched out her hole and immediately her finger was covered with juices.\n\n\"Tell me how wet you are.\"\n\n\"I'm very wet. My finger is soaked.\"\n\n\"Now put it in.\"\n\n\"No.\"\n\nAddison heaved an audible sigh. \"Put it in.\"\n\nMichelle curved her fingers over the top of her pussy and let the tip of a single finger slide inside.\n\n\"All the way, Michelle.\"\n\nThe middle finger slid in until the knuckles wouldn't let it go any farther.\n\n\"Slide it in and out.\"\n\nMichelle began to masturbate.\n\n\"That's my tongue, Michelle. My tongue is sliding in and out of your wet cunt. I can taste your sweetness. I can feel the inside of your pussy on the tip of my tongue.\"\n\nMichelle was nearly frantic in her motions.\n\n\"Tell me what you want, Michelle?\"\n\nAfter a long delay, she said, \"Lick me.\"\n\n\"Where? How?\"\n\n\"Oh God, Addison. Stick your tongue in me and lick me. Lick my clit.\"\n\n\"Do you want me to suck on your clit, Michelle?\"\n\n\"Yes. Yes! Please!\"\n\n\"Touch it. Now.\"\n\nMichelle's hand flew up to her clit and began to rub it frenetically. Any thought of NOT cumming had totally left her mind. She was now on the sole quest of releasing the pressure Addison' had built up in her. And it wouldn't take long.\n\nWithout further instruction from Addison, Michelle masturbated to the very edge.\n\n\"God! Addison! I'm...I'm...going to...\"\n\nMichelle let the phone fall to the couch beside her. With a series of loud moans, the psychiatrist started to cum. Mutual attention to her clit and nipples prolonged the climax and allowed new ones to start as soon as one was finished.\n\nOn the other end of the line, Addison listened to it all. Eventually, her own body succumbed and she came, unbeknownst to Michelle.\n\nA couple minutes later Michelle was able to pick up the phone, two tears winding their way down her cheeks.\n\n\"Michelle, are you there?\"\n\nThe psychiatrist felt an odd security in hearing the voice again.\n\n\"Yes.\"\n\n\"Wow! That was awesome! The best ever!\"\n\nMichelle would never, in a million years, let the teenager know how right she was.\n\n\"You should go now, Addison.\"\n\n\"Friends?\"\n\n\"Friends.\"\n\n###\n\nTen minutes before Addison was due to arrive, Michelle was in the ladies room, brushing her wavy brown hair and fixing her makeup. She could count on one hand the number of times she ever did that before, each time for a young man.\n\nMichelle returned to her office and waited. When the knock on the door finally came and Michelle walked over to open it, a myriad of possibilities awaited her.\n\nAddison had a wide smile on her face as she stepped in. Once Michelle closed the door, Addison kissed her cheek—a first for the doctor and patient. The cheerfulness of Addison's voice when they welcomed each other, and the beam on Addison's face, sent positive signals to Michelle that something was up.\n\n\"How have you been, Addison?\"\n\n\"Great.\"\n\nAddison wore a short, summery skirt that revealed plenty when Addison pulled her legs under her on the chair. She had a blouse on that was unbuttoned down to her cleavage.\n\nMichelle opened her laptop.\n\n\"I have a new friend,\" Addison said with pride.\n\n\"Oh.\"\n\n\"Don't you want to know about him?\"\n\nMichelle looked across the room. \"Him?\"\n\n\"Yep. He's twenty. Goes to the same school I'm going to attend in the fall. Lives near me. He's kind of cool.\"\n\n\"You've gone out?\" Michelle asked.\n\n\"Yep.\"\n\n\"Have you had sex with him?\"\n\nAddison studied the psychiatrist closely. Was that a look of contempt? Concern? \"Of course not.\"\n\n\"Why not?\"\n\n\"Because I have a new lover, too,\" Addison said.\n\nThis time Michelle stared at her carefully. Addison stared back. Neither blinked.\n\n\"Tell me about it,\" Michelle finally had to say.\n\n\"Well, since we can't be friends, due to some oath you took or something, then it seemed only appropriate that I label it what it really is.\"\n\nMichelle tapped away on her laptop. \"Do you think what we did constitutes love?\"\n\n\"No. That was phone sex. Good phone sex, by the way. But the fact is, Michelle, you love me,\" Addison said. \"And I think it's very, very cool.\"\n\nThe gleam in her gorgeous eyes would have pleased her doctor under any other circumstances.\n\n\"Have you ever really loved anyone, Addison?\"\n\n\"I do now.\"\n\n\"You realize, don't you, that love involves a lot of give and take. Sometimes you have to tell the person you love what to do and sometimes that person has to tell you what to do. How do you feel about that?\"\n\nAddison extended one leg out from under her and let it hang over the front of the chair. The sandal on her foot hung precariously from her big toe and she gently swung it back and forth.\n\n\"I feel like you'll need to do a better job telling me what to do. I did all the talking on the phone and you just took orders. I think the next time I'd like you to be in control.\"",
        "Michelle used all the restraint she had to keep from contorting her face. If it wasn't for the fact Addison was giving her so much good insight into her thought processes, she would have been outraged.\n\n\"There's not going to be a next time, Addison.\"\n\n\"You came, didn't you? You came long and hard and loud. You couldn't stop yourself, Michelle. You were thinking about me naked in bed, my hand on my pussy, my finger in my cunt. You were thinking about my tits and my nipples.\"\n\nMichelle took in a deep breath, her heart beginning to race and her pussy beginning to ache. She looked across at Addison, who had her hand in the opening of her shirt. Her fingers were hidden, but they had to be resting on the top of her breast.\n\n\"Did it make you feel good that you did that?\"\n\n\"Yes. I was happy for you. I can't complain about my own orgasm. It was fantastic. But, hearing you practically scream when you started to cum...\"\n\nAddison's other hand slid up the inside of her thigh. She never got to her pussy, but the skirt was now inches from revealing it to Michelle.\n\n\"Could you have done the same thing with a man?\"\n\n\"Sure. No problem.\"\n\n\"But a man would more likely want to give the orders.\"\n\n\"That's fine.\"\n\n\"Addison, it's important that you understand the significance of your willingness to do that. It's a huge step in the right direction.\"\n\nThe teenager grinned. \"You've helped me a lot, Michelle. And I brought a gift to show how much I appreciate it.\"\n\nShe reached down for her bag and pulled it up to her lap.\n\n\"Addison, it's not appropriate for you to bring me gifts,\" Michelle said.\n\nWhen Addison withdrew her hand from the bag, she was holding a rectangular box nearly a foot long, wrapped in colorful paper. She rose from the chair and walked across to Michelle, proudly stretching out her arm to present the gift.\n\nMichelle looked up at the beautiful girl, her eyes pleading with Addison not to make her take it. At first glance, Michelle imagined that the box contained a watch or necklace or some other jewelry. It was wrong, whatever it was.\n\n\"Please,\" Addison begged.\n\nMichelle took the gift. It was heavier than she expected. She looked at it; she looked at Addison; and then she looked at the box again. She began to open it.\n\nWith the paper removed, the plain box gave no indication of the contents. Michelle grudgingly lifted the lid.\n\nAddison had surprised her many times during their sessions. Certainly, the phone call and subsequent events surprised Michelle. She was always expecting the unexpected from Addison. Still, the shock on her face when she opened the gift was unmistakable.\n\nAddison looked down nervously at Michelle. The psychiatrist's mouth was open, but nothing came out. She put the lid back on.\n\n\"Take it out, Michelle. Please.\"\n\nMichelle didn't dare look up at her. The haunting eyes would have made her take it out. But even with that self-discipline, Michelle found herself lifting the lid once more. She reached inside the box.\n\nThe vibrator Michelle held was the most realistic-looking fake erection she'd ever seen. It put her husband to shame and every man she'd ever had before him. It was ridged, with veins, and a tantalizing curve. Michelle could never imagine the entire thing fitting inside her body.\n\nFinally, she looked up at Addison.\n\n\"Pretty impressive, isn't it?\" the girl said gleefully.\n\n\"Why did you do it, Addison?\"\n\n\"Because I wanted to thank you.\"\n\n\"There were so many other ways you could have thanked me. Why this?\"\n\n\"I want to make you happy.\"\n\nHidden under all the anger, Michelle thought she was beginning to see a 'normal' young woman. It would take many more sessions to pinpoint trouble spots. But for now, Michelle faced a more immediate challenge.\n\n\"It's good to make people happy, Addison. Thank you,\" Michelle said.\n\n\"I'd like you to try it, Michelle.\"\n\nShe looked up at Addison. \"Maybe later. Right now I think we...\"\n\nAddison unbuttoned the top of her blouse. The already plunging neckline showed even more skin. And then another button was undone. It became obvious to Michelle that Addison did not have a bra on. The insides of her breasts were visible and nothing but flesh could be seen.\n\n\"I think we need to try it,\" Addison said as she worked her hands down her shirt until the last button was open. Then she reached down and took the box out of Michelle's lap. As she bent over, Michelle had a nearly-full view of the generous breasts inside the shirt.\n\nAddison's eyes inspected the knit top Michelle wore, and the solid blue dress pants below that. Sometimes the psychiatrist's conservative office attire disappointed her.\n\n\"Not here. Not now,\" Michelle said.\n\nAddison moved forward until her legs were straddling Michelle's. The girl's loose skirt allowed plenty of movement and Addison sat on Michelle's knees, directly facing her. Slowly, she slid up the top of Michelle's legs until her chest was just inches from Michelle's face.\n\n\"Yes. Now,\" Addison said.\n\nShe put her hands on the opened sections of her blouse and pulled them apart so her nipples were exposed, but not the entirety of her breasts. Michelle stared; her heart pounded.\n\n\"Have you ever dreamed of these tits, Michelle? Were you thinking about them when you came on the couch?\"\n\nShe did not answer.\n\n\"Were you?\" Addison demanded.\n\nMichelle nodded.\n\n\"Lick them.\"\n\nMichelle shook her head.\n\nAddison pulled the shirt completely open. With the tits fully exposed, she leaned forward and placed a nipple on Michelle's lips.\n\n\"Lick it.\"\n\nMichelle's tongue slithered out and wiped across the nipple. And then again.\n\n\"Suck on it, Michelle.\"\n\nThe lips opened and the nipple was enveloped by the soft skin. Michelle ran her tongue over it.\n\n\"My whole tit. Suck on my tit, Michelle.\"\n\nAddison leaned forward a little more and practically forced the breast inside her psychiatrist's mouth. Michelle accepted it and licked and sucked on it as instructed. Both women felt the reaction between their legs.\n\nAfter a few seconds, Addison reached down and pulled up Michelle's top. Michelle had to back away from the breast in order to let Addison complete her task. Once the top was tossed aside, Addison calmly removed her own blouse.\n\nThe splendor of the teenager's chest, close-up, finally hit Michelle. The tits were perfectly shaped, with an alluring upward turn that Michelle found irresistible. She gripped the vibrator just a little bit tighter.\n\nAddison reached behind Michelle to unclip her bra. Addison's bare breast rubbed the side of Michelle's face as the girl unhooked, and then slid off, the bra. When finished, Addison sat upright on Michelle's legs and stared at the woman's breasts. They were more than adequate.\n\n\"They're just like I imagined them over the phone,\" Addison said softly. She looked Michelle in the eyes. \"Turn on the vibrator, Michelle.\"\n\n\"I don't believe this is the time or place,\" Michelle said firmly.\n\n\"It wasn't the time or place for you to suck on my tits either. But you did. Now turn it on.\"\n\nA flick of the plastic base of the vibrator started a dim humming sound.\n\n\"Put it between your tits, just like your husband does with his cock.\"\n\nMichelle turned the vibrator so it curved upwards like a real penis and slid it in her cleavage. The strength of the tremors on her skin was greater than she anticipated. After a few seconds, Addison put her hand on top of Michelle's and guided the vibrator up over the top of Michelle's breast. Her entire breast quivered.\n\nThen Addison was aiming it for the nipple. Michelle offered resistance. Addison kept up the pressure and the vibrator finally made contact with the erect nub.\n\nMichelle gasped out loud. Addison smiled and held the toy in place, pushing it harder against Michelle's skin. She moved the toy back and forth across the nipple, using less and less force each time until Michelle was essentially controlling the vibrator on her own.\n\nAddison heard Michelle's quickened breathing.\n\n\"Just think how wonderful that would feel against your clit. Then imagine it deep inside your pussy, pleasing you like no man ever could,\" Addison murmured.\n\nShe moved Michelle's hand to the opposite nipple and let the psychiatrist move the vibrator across it.\n\n\"We're going to try something different today, Michelle,\" Addison said softly. \"We're going to see how well I take orders. You say a man would give me orders and you don't think I'd like that. Well, lets find out. You're going to give me orders and we'll see if I can follow them.\"\n\nMichelle found Addison's voice to be uncharacteristically lacking in sarcasm or antagonism. She sounded like she did over the phone.\n\n\"Now, back to your new toy, Michelle. Wouldn't that feel wonderful between your legs?\"\n\nMichelle didn't reply.\n\n\"Tell me that you want me to watch you put the vibrator on your pussy.\"\n\nWhen Michelle didn't respond, Addison took the vibrator from her hand and held it firmly against Michelle's most erect nipple. She pushed down and scraped it across the nipple. Waves of excitement surged through Michelle's body and she moaned.\n\n\"Tell me,\" Addison said\n\n\"OK.\"\n\n\"OK, what?\"\n\n\"I want you to watch,\" Michelle sighed with her eyes tightly closed.\n\n\"Watch what?\"\n\n\"I want you to watch me masturbate, Addison.\"\n\nAddison smiled and handed the vibrator back to Michelle. The teenager stood up and moved inside Michelle's legs. She kneeled down and opened the top of her pants. The zipper slid down and Addison began to pull the pants off.\n\nMichelle slouched in the chair and lifted her ass enough for Addison to remove the pants and toss them aside. The buzz of the vibrator maintained its steady pace.\n\n\"What next?\" Addison asked.\n\n\"Take off my panties, Addison.\"\n\nThe girl could already smell Michelle's lust and saw the spot on the front of the panties as she pulled them down. Addison gazed at Michelle's precision shaved pussy the entire time, anxious for what would come next.\n\n\"See. I can follow orders perfectly fine. Nobody got hurt.\"\n\nAddison leaned back and took a good look up and down Michelle's naked body. She was a truly beautiful woman in her own right, if not the prospective Playboy model that Addison was.\n\n\"You're very pretty, Michelle.\"\n\nThe words surprised the psychiatrist. They were tender and apparently heartfelt.\n\nAddison said, \"Time for me to be in charge again.\"\n\nShe moved up and lightly licked one of Michelle's nipples. A few seconds later she had the end of the tit in her mouth and she was sucking on it with much vigor. Michelle moaned loudly, the same moan Addison heard over the phone. Addison bit the nipple gently and got a louder response.\n\nAddison shifted positions until her face was next to Michelle's ear.\n\n\"I want you to cum for me, Michelle. Right here. Right now.\"\n\nThere was no reply.\n\n\"Put the vibrator between your legs,\" Addison whispered.\n\nMichelle's hand moved between their bodies and settled into place.\n\n\"Touch your clit with it.\"\n\nMichelle maneuvered the best she could and finally made contact. Addison heard the sudden intake of air and felt Michelle's body twitch.\n\n\"You used to think about me naked,\" Addison whispered. \"You used to play with your clit while you thought about me. Now it's going to be even better, Michelle. You have a new toy that will make it better...and you have me. You're going to cum for me and I'm going to watch. OK?\"\n\nMichelle nodded.\n\nAddison leaned back and let Michelle spread her legs farther apart. The vibrator was sliding up and down, pressed hard against the stiff clit. Her nipples looked like they were going to explode. Strands of Michelle's fine hair clung to her moist forehead. \n\nAddison stood up. She and Michelle made eye contact. Addison unbuttoned her skirt and let it fall to the floor. Michelle's eyes followed it, but then rose back up to a pair of light blue thong panties that Addison wore. Addison kicked the skirt aside and ran her hand up and down the front of the thong, each time pressing a little harder on the thin fabric.\n\nThe vibrator whirred away as Michelle held it firmly against her clit.\n\n\"Tell me what you want, Michelle.\"\n\n\"Take off your panties.\"\n\nIt wasn't exactly an order, but Addison wasn't going to push it. She playfully slid her hand inside the panties, rubbed her pussy once or twice, and then pulled down the thong only enough to expose part of her pussy. She very slowly began to turn, showing Michelle her hip, and then her ass.\n\nAddison pushed the thong lower, until the string came out from between her tight cheeks. With a slight bend at the waist, Addison let the thong fall to her feet. She stepped out of it and turned once again to face Michelle.\n\n\"Is this what you were imagining, Michelle?\"\n\nShe stood like a statue in front of her psychiatrist, placing her hands on her waist and widening her stance just a bit. Michelle was far too involved in staring at the goddess and rubbing her clit with the vibrator to answer.\n\n\"That's such a huge cock. What do you think it would feel like inside your cunt?\" Addison asked, moving one hand to her pussy. \"I bet the ridges would feel wonderful as they slid in and out, the big head rubbing against your g-spot.\"\n\nAddison had her middle finger inside her wet hole, moving her wrist up and down slowly. Michelle watched every move she made, waiting anxiously for Addison's next command.\n\n\"Do it for me, Michelle. Put it inside you while I watch.\"\n\nIt was just what she wanted to hear. Michelle slid the vibrator lower and let it hover over the entrance to her cunt. She inserted the thick head, spreading herself apart before trying to put in any more. She closed her eyes and felt the vibrations travel up her vagina and into her stomach.\n\nMichelle's mouth opened involuntarily and she whined with pleasure as another inch or two of the vibrator disappeared. Her eyes were clamped shut as she took in all the physical delight of the toy sliding inside her.\n\nAddison rubbed her clit. Her own breathing was now heavy and deep. The moisture that existed between her legs turned into a collection of juices and she spread it over her pussy before it dripped down her leg.\n\nMichelle commenced a short, steady series of strokes that eventually led to half of the vibrator entering her each time.\n\n\"Ooooooh my God,\" she moaned out loud.\n\nMichelle at last opened her eyes and watched her young patient masturbate in front of her. Addison still had one hand on her pussy, but the other was playing with her tit. A look of total joy was on the girl's face as they glanced at each other.\n\nMichelle plunged the vibrator in as far as she thought she could; she squeezed a nipple between her fingers; and, she felt the orgasm get closer. If it was possible, she believed she might cum harder than during the phone sex.\n\n\"I want to hear you cum, Michelle. Don't hold back.\"\n\nThat was the last thing Michelle was worried about. She knew her secretary would be gone for the day and the two were alone in the office. Michelle doubted she could remain silent anyway.\n\n\"Ahhhhhhh. Addison. Addison!\"\n\nThe girl saw that Michelle's eyes were closed again and she wondered what the woman was thinking about.\n\n\"Look at me, Michelle.\"\n\nThe eyes opened and Michelle felt her pussy respond to the incredible sight.\n\n\"Oh fuck. Fuck! I'm cumming, Addison. I'm cumming!\"\n\nShe thrust the vibrator inside her almost up to the base and rubbed her clit with the other hand. The quivering toy sent her over the edge and she arched her back.\n\n\"God! Yessss!\"\n\nMichelle held the vibrator in place and fucked it wildly.\n\n\"Yes! Yes! Yesssssss!\" she screamed.\n\nAddison watched the woman's hips rise and fall. The girl masturbated just as hard and soon she was ready to cum.\n\nA few more seconds of watching and listening to Michelle's multiple orgasms caused Addison to start. Their mutual groans continued until Michelle was done and she had the opportunity to watch Addison stand in place and struggle to maintain her balance while cumming over and over.\n\nFinally, they were both done and the scent of their sex filled the office.\n\nAddison uneasily stepped closer to Michelle.\n\n\"Lick it, Michelle. Taste how sweet your juices are.\"\n\nWith one last ounce of energy, Michelle withdrew the vibrator from her cunt and slid it between her lips. She licked the tip and tasted the fruits of her labor.\n\nShe looked at the lovely Addison. Addison. What was she going to do about Addison? "
    ],
    "authorname": "eroslit",
    "tags": [
        "18 year old",
        "psychiatrist",
        "doctor patient sex",
        "doctor sex",
        "female masturbation",
        "older man younger woman sex",
        "nymphomaniac"
    ],
    "category": "Toys & Masturbation",
    "url": "https://www.literotica.com/s/addisons-new-friend"
}