{
    "title": "Office Submission Ch. 01",
    "pages": [
        "Friday\n\nJack looked through the mountain of work on his desk, wondering how much of it would wait until next week now. \"Thank goodness it's Friday,\" he said to himself.\n\nThen he heard her. \n\nHe could always hear her before seeing her. Those heels clicking along the floor towards his office. It was a confident, sexy walk - almost a strut along the corridor. She knocked on his door and waited.\n\n\"Come in,\" he shouted.\n\nAnna entered the room. She was average height with a figure that made women jealous. Hard work in the gym enabled her to turn heads wherever she went. She had dark hair - always tied up so her neck was on show. She had a pretty face with big brown eyes that were always looking, mischievous even if you cared to look for long enough. \n\nJack did. \n\nHe always watched Anna. In team briefings, in the canteen and whenever they passed each other in the corridors. He always thought: she knows I'm watching. \n\nHer face was just so beautiful and so was her figure. She worked hard at the gym. She had slim toned arms and her waist curved round for her most perfect, pert arse. She always wore just the right clothes to compliment her arse. Her tight trousers clung onto each cheek in order for the material to creep up to each of her arse cheeks, creating a peachy, pert shape. \n\nHer breasts always looked pert too. They weren't huge just a perfect size in Jack's opinion. After scarce glances down her shirt and seeing her in tight fitting jumpers, he reckoned they were around a 34C.\n\n\"Jack, here is the Tindall report you requested,\" Anna's tone was as tired as he felt but it was friendly still.\n\n\"Thanks. Did you manage to find everything for it?\" Jack remained seated and asked whilst staring a little too long into those beautifully sexy eyes.\n\n\"Yeah, it took a little longer but I finally managed to get the things together,\" She looked down at the mountain of paperwork on his desk and Jack managed to look down at her breasts imagining what they look like in the bra she was wearing. He looked up just as quick. \n\n\"You thinking about sleeping over in order to complete all that?!\" She sniggered.\n\nJack joined in the little joke with a small laugh, \"no, I'd be too lonely here. I'm dashing off in a minute. I've got friends visiting for the weekend and I need to get some food in\". Those mischievous eyes, flashing again at the 'lonely' comment. \n\nJack yearned to know what she was saying inside.\n\n\"Sounds nice.\"\n\n\"Have you got anything nice planned for the weekend? Partying? Dancing? Gym?!\" he asked.\n\n\"Just the gym, a nice long, hot shower afterwards and an early night. I'm a good girl. I don't party all the time!\" she laughed at that whilst flicking a strand of hair from her eye.\n\n\"Well, I'm jealous,\" Jack looked longingly at her.\n\n\"What? Of my gym?\" she looked back at him and questioned.\n\n\"No, of your shower!\" he replied. As soon as he said it, he blushed realising how it had come out.\n\n\"Why Jack? Fancy watching me?\" she cheekily questioned: her smile lighting that spark in her eyes as they widened.\n\nJack was surprised with that question. 'Fuck yeah' he thought privately. His eyes glanced down her gorgeous body for just a fraction of a second. It was long enough for her to see him check her out. \n\n\"You bet I would,\" Jack said with a smiling confidence, \"but I've got friends down. Although I could sneak out. What time does that show start?!\" he laughed out loud to ensure it came across as a (half) joke. He was relieved to see she joined in the laughing. \n\n\"Well, it's not much of a show,\" she replied, \"but I'll let you know when it starts next time! I'll see you next week. Have a good weekend Jack.\"\n\nAnna turned slowly and spoke to him whilst turning, \"I hope your friends have a good time.\" she then stepped out towards the door and moved into the corridor. \n\nHe watched her fine arse in that pencil skirt move out the door. He heard her move away from his office and down the corridor. Jack looked down at his tight trousers. His erection was obvious from this close distance and he hoped she hadn't noticed from where she had stood. \n\nHe adjusted it into a more comfortable position facing upwards and he gave the head a short stroke over his trousers. He would masturbate later over her again. Whispering her name as he would cum. He would stroke his cock to build up the speed and then he would slow down to almost a stop as he would start cumming. \n\nHe longed to see her with less clothes on. He ached to see her naked. \n\nHe then saw his desk and glanced at the clock on it. He was going to be late. This work could wait until next week now. He stood up and adjusted his erection again. He pulled his jacket on and hurried out of the office.\n\nMonday\n\nThe rain was lashing down and Jack stared out of the window in the canteen. \"It always seems to be raining at the moment,\" Jack said to himself. The coffee was much needed. With another two hours before he could get home, this last caffeine boost would take him over the finish line. He was thinking about whether his umbrella was in the car. It was. \n\nThen he heard her. \n\nAnna strode in. \"Hey Jack, weather's awful isn't it?\" she was wearing a shorter skirt today. It was above the knee but she had on dark nylon tights (maybe suspenders - Jack wished) with bright red high heels. Her hair was in a pony tail, pulled back and her shirt was a tight fitted cream colour and she had the top two buttons undone. \n\n\"Supposed to be raining until tomorrow now,\" Jack replied.\n\n\"I hope it stops because I haven't got my coat today or my bloody umbrella!\" she joined him at the window and looked out at the rain.\n\n\"Well if it's still raining later Anna, I could drop you home rather than wait in the rain for the bus,\" Jack offered.\n\n\"Oh Jack, that's really kind. Are you sure you don't mind?\"\n\n\"No, it's fine. Couldn't have you wearing that shirt out in public whilst wet now, could we?\" Jack laughed.\n\nShe laughed with him, \"no, I suppose not. Just the private show for you then?\" Anna reached out to touch his arm. \n\n\"Of course!\" he joked, \"See you later then.\"\n\nJack turned to watch her leave. That arse! Her legs were so sexy in heels too. Jack looked back at the rain and smiled. \"Thank goodness it's raining,\" he said to himself.\n\nJack turned in his chair because he heard her again. It was just after five. He had packed up and felt better because his desk was looking clearer today. \n\n\"You ready Jack?\" she leant against the door frame, half her body in the room and half out in the corridor.\n\n\"Yes, my coat is on the door if you want it.\"\n\n\"Thanks,\" she answered. She pulled the coat off the hook and tucked it under her arm. They left and walked down the corridor towards the door. \n\n\"You'll have to direct me,\" Jack said as they walked.\n\n\"Oh I will,\" she replied in that cheeky tone they used around each other.\n\nThey stepped out into the rain and rushed towards the other end of the car park. Anna pulled the coat above her head like an umbrella. They both rushed to the car laughing as the splashed through the rain. Jack pressed the fob on his car keys and Anna ran round to the passenger door and flung herself inside. \n\nJack jumped in and looked across at her. Her shirt had got wet and he could see she was wearing a white bra. The top of her shoulders had somehow got wet. Her eyes flashed as she looked him up and down. \n\nJack started the car and the two of them put their seat belts on. The belt went across the centre of her chest and accentuated her breasts. Jack tried not to look. Being in the car with her and knowing she was wet, Jack could feel his erection stirring again.\n\nAnna directed him to her home and, as they were pulling into her street, she asked whether he would like to come in for a coffee and a dry off, \"I just feel so guilty because your soaked,\" she said, \"you could shower too, if you wanted.\"\n\nJack pulled onto her drive and turned off the engine, \"thanks Anna, that'd be great. No peeking though.\"\n\nShe looked at him and pouted, \"but I thought you wanted to see that show...aw, that's a shame. Come on, let's go.\" Suddenly, she jumped out of the car, forgetting his coat. She ran through the rain to her front door and fumbled with her keys. She was getting soaked in the rain. Jack jumped out of the car and locked the doors with the keyless fob. \n\nBy the time he had made it round to the door, Anna had opened it and was waiting in the kitchen for him\n\n\"Anna, this weather is awful\" Jack shouted as he closed the door and moved into the kitchen. \n\nHe stopped. \n\nHe looked at the vision in front of him. Anna was leaning against the kitchen worktop facing him. She was looking directly into his eyes. There was a mischievous atmosphere in the room. She was soaked and her shirt was totally see-through. Jack could see the material gripping her skin. He stared at her bra. The detail was clearly visible. He could clearly make out the lines of her body. \n\n\"Jack!\" she shouted. \n\n\"Sorry Anna,\" he replied sheepishly. She was looking at him. He was aware he must have looked the same. His white shirt was also see-through, \"I shouldn't have been staring, I'm so sorry.\" \n\nAnna giggled. \"It's ok. Look, I'm going up for a shower. If you want to come and watch, then you need to come with me now,\" Anna walked out of the kitchen staring into Jack's eyes.\n\nJack stood alone in the kitchen. He was wet. His erection was pulsing against his wet trousers. He looked up at the stairs he had just watched Anna climb and made a decision. He moved through the kitchen and started the stairs. \n\nWhen Jack moved to the top of the stairs, he could hear the shower running and made his way to the room. He saw Anna's bedroom and she was in the shower which was opposite her bed. \n\nThe en-suite door was open. \n\nHe looked through and Anna was standing under the shower with her eyes closed as gloriously naked as could be. The water was running down her body. Her breasts stood up, alert and her nipples were poking out, erect. His eyes moved down her body and he could see she was shaved except for a thin pubic line. \n\n\"How's the show?\" she looked directly at him through the glass door.\n\n\"It's unbelievable!\" Jack murmured.\n\n\"Well, it's not fair only one of us is naked. Take off those wet clothes...all of them,\" she smiled in a sultry way.\n\nJack didn't hesitate. He started undressing whilst keeping his eyes on the naked frame of the goddess in front of him. Anna's eyes stared at his naked body as the last of his clothes came off.\n\n\"Someone's REALLY enjoying the show,\" Anna said whilst staring at Jack's full erection. His cock was rock hard pointing directly at her.\n\n\"Sorry Anna. But what do you expect? You're so sexy,\" Jack mumbled.\n\nShe giggled. \"Do you like watching me Jack? What do you like Jack?\" she asked in a sultry way.\n\n\"I love your body Anna...your arse...your breasts.\"\n\nAs he said each part of her toned, tanned body, she turned towards him and thrust parts of her body at the glass, whilst looking directly at him. Anna turned towards the shower and switched it off. She then slowly slid the glass door open for Jack to see her body completely unobstructed. She grabbed her towel and started to dry herself, whilst looking directly into Jack's eyes. \n\nNo words were spoken. \n\nThen, breaking the tension and silence, Anna spoke in a calm, sexy voice, \"sit down in the floor by the bed Jack. Sit looking this way with your back against the bed.\" \n\nJack did as was instructed. He was desperate to touch his cock. It was as hard as steel now, pulsating with his every movement. He looked up at Anna as she moved out of the en-suite into the bedroom where Jack sat. She looked down at his cock, \"Jack, that cock looks very hard and looks in need of some attention. Is that right Jack? Do you want to touch it?\" \n\nBreathlessly, Jack whispered, \"yes please.\"\n\nAnna began to dry her back whilst facing Jack in her full nude state, \"circle the head of your cock with your finger Jack, lightly\" Anna instructed. She did the circular action with her finger. \n\nJack immediately obliged. He gently circled the head of his cock with his finger. It instantly pulsed from his touch. He was desperate to grab his cock. \n\nHe looked up at Anna's breasts whilst circling his cock and it reacted to his touch. She moved away from him and said, \"stop now Jack.\" She never looked back to check. She knew that he would. \n\nAnna moved over to a draw and pulled out a skimpy g-string. She moved back over to Jack and rested one foot on the foot of the bed next to his head. He could see all along the outside of her thigh now. He was desperate to see her pussy close up. Anna watched him look at her leg and knew what he wanted. \n\n\"Grab your cock Jack and stroke it until I say stop.\"\n\nJack watched her pull the delicate material over the leg nearest to him. He grabbed his hard cock and started to stroke down and then back up. Anna watched, fascinated at how big Jack's cock had grown. The head was pulsing and Anna could see the start of some pre-cum forming. \n\nShe moved her leg and turned around so Jack now was looking at her arse. During the turn, she had slid the g-string up her other leg and now pulled it up. She bent over just enough for him to see the outside of her pussy lips and she smiled back at him saying, \"stop Jack. Stop stroking.\" \n\nJack stopped. \n\nHis cock was aching, he hadn't stroked too fast because he knew he would cum. He could feel the ache down to his balls. He was desperate to touch it again. \n\n\"Looks like you're having all the fun Jack. I may join you,\" she turned around to show her g-string. It was black with an almost sheer front. Jack could just make out the line of smartly trimmed pubic hair above her pussy. \n\nShe moved towards his head and slowly pushed a hand down the front of her g-string. Jack watched in awe as he saw - close up - her knuckles push against the soft material and down to her pussy. She started to move her fingers, \"oh, that's nice. Oh. Jack. Look at me Jack.\" \n\nJack could barely tear his eyes from Anna's hand stroking her pussy. He did in the end. She looked into his eyes. Jack saw that she was enjoying touching herself, she was biting her lip and her eyes were struggling to stay open. \n\n\"Jack do you want to watch me cum?\" Jack nodded and grabbed his cock, desperate to join Anna.\n\n\"No touching yet Jack. Mmm. Fuck, I'm so wet.\"\n\nJack instantly stopped, not wanting to break the spell. He could see her hand moving in long strokes at the moment.\n\n\"Oh god Jack. Mmm, fuck this feels so good. Do you want to see my pussy Jack? Mmm. Do you want to watch me put a finger inside? Hold your cock Jack and join me with long, slow strokes.\"\n\nJack instantly grabbed his cock. Anna continued, \"fuck Jack, watching you grip it makes me so fucking horny. Long strokes Jack, like this: all the way down and stop. Now all the way back up and stop. Keep that speed.\" \n\nJack obliged. He could see she was beginning to speed up. He was aching to move his hand faster. \n\n\"Ohh, Jack. I have to put a finger inside. I need it inside.\" He saw her hand move position in her g-string, \"Just one finger to start, I'm so wet it should easily...ohh fuck me...that's so good.\" Her hips started to move back and forwards as she started to slide the finger inside deeper. Jack was still stroking very slowly and the view of Anna's hips rubbing alongside her finger was bringing him really close to coming. \n\n\"I'm going to cum,\" Jack managed to mumble.\n\n\"Stop Jack, stop stroking!\" Anna demanded. He did, instantly, \"good Jack. I want to show you properly. I want you to watch me slide it inside for real now,\" she stepped back and slid her g-string down her legs and flicked it off. She assumed the same position. \n\nJack stared at her open pussy lips. They were glistening wet. Anna used her left hand to slowly stroke her clit again and then she used her right hand to slide a finger deep inside. \n\nJack was so close to her pussy. He thought if he stuck his tongue out now he would be able to lick it. \n\n\"Ohh, Jack. Do you want to taste me Jack? Look at how close you are,\" Anna leaned her pussy even closer to Jack's mouth, \"ohh god that's so sexy,\" Anna whispered. \"Fucking hell Jack I'm so close. Ohh my god! Mmm.\" \n\nJack could see she was close. Her pussy was so close to his face, he could see it starting to shake. He could feel the pre-cum starting dribble down his cock now. He wondered if he could cum without being touched. \"Jack. Stand up\". Anna had suddenly stopped and was now just standing up. Jack stood instantly, hoping to be touched by her. But she sat down where he had been. \n\n\"Now, stand next to my face,\" Anna sat back against the bed and looked up at Jack. He stared down into those big brown eyes. She opened her mouth to speak. His cock was extremely close to her mouth. \n\n\"What Jack? Want to place it inside my mouth? Do you want me to suck it? I can see the pre-cum Jack. I know exactly how close you are to cumming.\" she placed her hand back down to her pussy and started to rub her clit. Faster and faster this time. She started to move her hips again. She was grinding her pussy into her hand, \"start stroking Jack. I want to see close up how you stroke that fine cock of yours\". \n\nJack was desperate to stroke his cock and instantly started stroking. He moved his hand up and down his shaft slowly and steadily. He inched his cock nearer to her mouth. She sensed it there whilst looking up at him. They never broke eye contact. \n\n\"Jack, look how close you are to my mouth...ohh god. I'll open my mouth and I want you to slide the head of that...hmmmm...cock in...mmmm fuck me...I'm not sucking but you can imagine me sucking.\" \n\nAnna opened her mouth and looked directly into Jack's eyes. He stopped stroking as she opened her mouth wide. He moved it inside. Anna never closed her mouth around his head or sucked or even licked. He placed it into her mouth and he could feel her breath on his cock. He was trying hard to not touch her mouth, he never wanted to break this magical spell she was casting. He pulled his foreskin back and it edged over the head of his cock he then let it stroke all the way back up. \n\nShe kept looking at him and frantically stroked her pussy. She was murmuring but not closing her mouth. Jack saw her eyes start to move up and he knew she was close. He moved his cock out of her mouth and gripped his shaft tighter. \n\nShe kept looking up at him, \"ohhh Jack, I'm going to cum so hard. I want to see you cum...mmm...oh fuck...cum over me Jack. Cum with me...nnnnggg!\" her breathing became really short and shallow and he knew she was there. \n\nHe gripped his cock tighter and slowed down his strokes. He felt his balls tighten up and he knew he was going to cum. He looked down at her and she mouthed silently 'cum on me!' \n\n\"Nnnnng! Jack, oh yeah, fuck me, yes, YES! Ohhh...\" Jack started cumming over her face, it dripped down her chin, over her beautiful mouth and down onto her perfect breasts. He felt like he was cumming for minutes. The pleasure was incredible for him. \n\n\"Oh fuck Jack. I've never cum that hard. I'm soaked down here. That's a lot of cum. It's all on my breasts,\" she started to rub it into her nipples and around her breasts whilst not looking away from him. \n\nHe noticed she still hadn't moved her hand away from her pussy and he could catch the faint movement of her finger down there still. Jack couldn't even speak. His orgasm was still pulsing through his head.\n\n\"I need more Jack. Do you?\" Anna asked."
    ],
    "authorname": "EnglishTongue",
    "tags": [
        "masturbation",
        "submission",
        "no touching",
        "cum on me",
        "instructions",
        "dirty talk",
        "g string",
        "shower",
        "mutual masturbation"
    ],
    "category": "Toys & Masturbation",
    "url": "https://www.literotica.com/s/office-submission-ch-01-1"
}