{
    "title": "Butterfly Dinner",
    "pages": [
        "For Cecilia\n\n* * * * *\n\nI arrive promptly at 6 to pick you up for a nice evening dining out and attending your office Christmas party.  You greet me at the door and I am in awe of the sexuality and beauty you radiate.  We embrace and kiss passionately at the door, your hands traveling down my back and grasping my buttocks and drawing our sexes together. \n\nAs my hands travel up to cup your large breasts, I realize that you are not wearing a bra tonight, as your nipples harden and press into my palms I tweak them playfully as you pull away, turning and heading to continue getting ready for our evening. \n\nAs I watch your cute ass sway down the hall, my cock hardens thinking about the toy I have brought you for our evening's activities.  I have a new improved butterfly vibrator for you.  This new one follows the same specifications as the original, it is shaped like a butterfly with its wings spread, and the body is a tiny, powerful, SILENT vibrator.  I had the control electronics replaced with a state of the art wireless variable speed control that is very small.  No wire, even the powerful battery is contained in the small unit. \n\nI come up behind you and place my arms around you and begin caressing you nipples again as you finish your makeup.  Pressing my hard cock between the cheeks of your beautiful ass as I nibble on your earlobe and tell you I have something for you. \n\nYou reply \"I can feel that\" and giggle as you press back into me, I then show you your new toy, you exclaim that you already have one, but this one looks broken, it has no wire or battery attached.  Reaching down and raising your skirt, I take the butterfly and place it in the front of your panties and snuggle it tight against your clitoris.  \n\nDropping your skirt, and backing away, you turn to face me, with a tilt of your luscious hips, you exclaim \"well, it's not working\" I reach into my pocket and press the control to start the unit, almost immediately your beautiful hazel eyes glaze over and you gasp and exclaim \"Oh god, that is so... so.. OHHHH\" as I switch the unit off, you exhale, already breathing hard after just 30 seconds of stimulation.  \n\nRushing forward and hugging me tightly, you ask me what I had done to your toy.  I explain that I had special modifications made to the electronics for the sole purpose of bring you more pleasure. \n\nWhat I have not told you is that not only does it give me remote speed control over the butterfly, it allows me to select several modes like \"Roller Coaster,\" \"Gran Prix,\" \"Traffic,\" \"Serenity\" and my favorite \"Ecstasy\".  The speed and intensity randomly change, using different methods so you never know what the unit is going to do, I figure that \"Ecstasy\" will become your favorite over time. \n\nHugging me tightly, you ask if we can try it later after the party.  I reply with a stern \"NO. \"\n\nPouting and batting those beautiful hazel eyes at me you ask why?\n\n\"Because you are going to wear this all night my darling,\" A gasp escapes your lips, and you start to protest, but you know it would be a futile gesture on your part, so you agree and excuse yourself to go to the bathroom for a moment. \n\nI briefly wonder if you will disobey me, knowing that I would never bring harm you and that I only have your pleasure in mind for the evening.  As you return, I switch on the butterfly and you stumble slightly and gasp.  I turn the unit off and smile at you, and ask if you are ready?\n\nYou reply that you are ready for the evening, and as soon as I adjust the butterfly we can leave.  Raising your skirt and dropping your panties for me, I see that you had attached the elastic straps to the Butterfly to properly hold it in place.  I adjust the unit to snugly fit against your clitoris, but not before giving it several swipes with my tongue, Mmmmm Sweet.  When I finish I also noticed that you had added a MAXI to your panties, you see me looking at that and shyly tell me \"I didn't want to leak Cum on my dress hon, knowing you even this may not be enough\" \n\nI laugh in agreement, and rise to kiss you, you eagerly take my tongue to taste yourself, moaning lightly into my mouth.  I take your hand and lead you out for our evening. \n\nWe drive to a local restaurant that I have chosen especially for this evening, a nice intimate Italian place that has gotten VERY popular lately.  We arrive and I escort you in and we are told we have to wait at the bar for a short period of time. \n\nWe enter the bar area and order our drinks, white wine for you and a cocktail for myself.  We sit there talking and I just cannot help my self, I draw you to me, kissing your lips and then nuzzling the side of your neck kissing lightly and nibbling my way up to your earlobe where I take your earring into my mouth and tug on it lightly as I exhale into your ear.  A slow purr starts deep in your throat, and I pull away and look deeply into your hazel eyes, and start the butterfly on its lowest setting. \n\nYour eyes open wide and your purr turns into a small squeal, causing several others to look your way.  You quickly compose yourself, crossing your legs, and turning to attend to your drink.  Even at the butterfly's slowest steady setting, you are in your own world, I can see that your eyes are slightly glazed over, and you are starting to breathe deeper and appear to be in deep thought.  The only outward appearance that is noticeable is the fact that your nipples have become rock hard and are prominent against the front of your dress. \n\nAfter a few minutes you turn to me, smile and try and act as if everything is normal, I take your hand and draw your lips to mine, kissing you again.  I take your face in both hands and look deeply into your eyes, and wonder to myself how such a beautiful, intelligent woman, one that is so sensual and at ease with her sexuality that she is eager to explore just about anything, could love me so much. \n\nI reach into my pocket and press the button to select \"Traffic\" mode from the butterfly, now this mode lets you select the speed and then it \"Starts and Stops\" at random times.  The butterfly stops on its own just as the call us for out table, as we are walking to our table arm in arm it starts again, you emit a quiet little yelp, and seeing that my hands are both in plain sight give me one of your inquisitive looks wondering just how I managed that.  Smiling to myself I pull out your chair for you, and then sit across from you and open my menu. \n\nAs I am browsing my menu I hear a sigh of relief from you and assume the butterfly just shut off, I look over the menu and ask you what looks good on the menu tonight.  You reply that for some strange reason you cannot concentrate very well, so why don't I order for both of us.  As the waiter arrives and begins taking our order from me, you emit what sounds like a hiccup, both the waiter and I look over and you begin to blush lightly (yep butterfly is back on). \n\nAs the waiter turns to leave with our order, I look across the table at you and notice that you are staring directly at me, with both hands holding on to the table.  I can see that you are now struggling very hard to maintain your composure, your brow is creased in concentration and you are biting lightly on you lower lip.  You ask how? I smile and ask if you are ok, but I can tell that the butterfly turning on and off has you right on the edge of cumming and already you are loosing your composure.  \n\nI decide to take some of the pressure off of you and reaching into my pocket I turn the butterfly UP to a medium high speed, your eyes open wider and you begin to blush, the blush starts at your rock hard nipples and runs up your neck to your face, you are breathing very deeply and making very little sound as you crash over into the first of many orgasms you will have tonight, twitching slightly every once in a while as you cum for me.  \n\nI let you cum for about 30 seconds and then shut the butterfly off, as your breathing slows, you give me a look of smugness, thinking that I had done my best already (but having no clue whatsoever about what is in store for you) to make you embarrass yourself, although that is not my goal, it might possibly happen especially if you try and challenge me. \n\nWe sit there quietly smiling at each other, I smile because I know what is to be, and you smile because you think you have won this round by cumming so quietly.  I ask how you are doing just as our dinner arrives, you smirk and say just fine, seeing that you still think you have the upper hand I start the Butterfly again on this time choosing \"Roller Coaster\" with a medium setting. \n\nThe \"Roller Coaster\" setting automatically starts out at a low setting, and SLOWLY increases speed, then it charges ahead, does a couple of loop the loops, screams over the top again and then starts the whole sequence over again at the next higher speed setting. \n\nThe butterfly kicks in and starts strumming its heart out against your clitoris just as our meal is being delivered, the waiter is loading our table with our dinner as your eyes glass over, I can see that he has noticed your nipples pushing against the front of your dress as he serves you. \n\nAs the vibrator starts increasing its speed, you bow you head, and try to maintain control, the flush has returned to your neck and chest, and I can see you are about to go over the top of the roller coaster and start your journey.  Your breathing is very rapid now and a slight moan escapes you lips as you bring your napkin to your mouth to cover your mouth as the vibrator takes you to the edge and then YOU START CUMMING AGAIN, you are trembling and twitching slightly as a LOUD \"OOOOOHHHHH\" escapes you.  \n\nAs the waiter and several patrons look at you, I innocently ask \"Hon are you ok\" and you nod in agreement as you have another orgasm while everyone is watching you.  You somehow manage to keep quiet and do a great job making it appear that you are sneezing, but I know.  As the butterfly routine ends and resets, you seem to briefly regain your senses, and quietly ask me to stop, pleading at me with your eyes, I see that you are sorry for being defiant earlier and know you will make it up to me later so I take pity briefly and stop the butterfly.  \n\nExhaling slowly, as you regain your composure, I see you breathe a sigh of relief and then you start giggling softly as we begin to consume our meal.  I ask what is funny and you reply, \"I'm sorry Hon, I should have know I couldn't win, but it is so much fun loosing sometimes. \" I laugh and wink at you, and we continue to eat our wonderful meal and chat about the party we are headed to.  \n\nAs we near the end of our meal I turn the butterfly on a low steady setting, just to get you warmed up again, as the unit activated in the middle of you talking you stuttered slightly but continued our conversation, but now you are struggling to concentrate again against the feather light stimulation that is happening to your clitoris and vaginal lips. \n\nWe finish our meal, pay the check and as we rise to leave and I place my arm around you and select the \"Gran Prix\" mode.  Now this is my second favorite mode, it is balls to the wall high-speed stimulation that changes modes many times a minute, speeding up slowing down decelerating, accelerating the works (almost).  Almost immediately you head comes to my shoulder and you weigh heavy in my arm as the program proceeds.  I can feel you beginning to tremble as you fight the urge to cum, a low groan escapes you as I stop and leisurely get some after dinner mints from the dish at the reception desk. \n\nI lean in and ask if you would like some, and you jerkily shake your head no and groan softly, gritting you teeth against the stimulation.  I nod in agreement and we head for the car.  As we exit the restaurant, you loose control and start squealing and convulsing as you continue to cum and I almost have to carry you to the car. \n\nAs I open the car door and help you into you seat, I kiss you lightly and ask if you are having fun, and get a very snippy reply \"close the door now so I can CUM HARDER!. \" Well ok if that's what you really want sweety, I close the car door and quickly enter the drivers side just as you start SCREAMING OHHHHHHH... AIIEEEEEEEEE... OH MY GOD, OH GOD, OH GOD IM CUUUUUUUMMMMMING.  You lean over and grab me, still screaming and moaning loudly as your orgasms start to blend together into one long continuous cum.  \n\nI bring your lips to mine and kiss you as I slide the control past 50% and take her up to 75 % of full power, your start emitting a long continuous wail as I reach down and begin twisting both of your nipples between my thumb and forefinger. \n\nAs your wail continues you are convulsing at an astounding rate, your orgasms must be coming several times a second now and then I see your eyes roll back into your head and you fall silent as you pass out from the intense stimulation. \n\nI turn the butterfly off and hold you gently and kiss your forehead while you rest, the smell of your pussy has filled the car and you are breathing slowly and deeply. \n\nAs your eyes flutter open and focus, you see me smiling down at you and you grab me and mash your lips to mine, uttering a stream of gratitude to me about your new toy.  \"Oh god, that was incredible! I thought cumming in the restaurant was the most incredible orgasm I have ever had, but then, oh wow, Oh baby I CAM so hard and long\" laughing, I tell you to slow down, we have all the time you need to calm down before we head on to the party. \n\n\"The PARTY!\" You exclaim, \"I forgot\" are we late? I reply no, but we should get moving if we want to be on time.  As we get underway I hear that cute little giggle from you and look over to see what is going on, your eyes twinkle, and you are blushing again.  Again I ask what wrong and you reach over and grab my cock that is tenting the front of my trousers, giggling again you ask \"did I do this?\"\n\nI look down and realize I am rock hard from watching you cum, and I reply \"Yes you did, you know how much it turns me on to see you cum. \" You reply \"aww poor baby, we cant let you go to a party looking like this\"\n\nAs I drive along I feel you massaging my cock, and then you unzip my slacks, reach inside and fish out my hard member into the cool air, your warm hand running up and down the shaft as you purr in contentment at having your favorite toy to play with.  As you lean forward and I feel your hot lips slide over the head of my cock and start to engulf me I moan in pleasure.  You immediately plunge to the root of my cock, taking me into you throat and then rising again as you apply suction.  \n\nI know that I cannot last very long at all against your expert oral ministrations, being on the edge from seeing you cum so hard for me has the cum boiling in my balls already, so in hopes of distracting you, I activate the butterfly again.  The effect is amazing, I can feel you squeal and begin moaning as you continue to take me into your throat, fellating me as no one else could ever do. \n\nSuddenly you begin to cum again, I can see you grab a breast and begin convulsing as you continue to administer to me, the moaning around my cock is amazing, and the vibrations are tingling and taking me higher and higher toward the plateau of orgasm.  And then you do the most amazing thing, as you begin to cum hard again, I feel you moan deeply around my cock and then you plunge to the bottom, taking me deep into your throat and as you are cumming you BEGIN TO SWALLOW! The effect is truly mind blowing, the heat, suction and your throat muscles rhythmically milking my cock takes me over the edge and I blast my hot semen down your suctioning throat as you milk my balls dry. \n\nAs I finish you come up for air, releasing my cock and SCREAMING out another orgasm as your nuzzle my cock with your cheek, snapping out of it I turn off the vibrator which elicits a brief groan from you before you begin giggling and kissing my cock again.  You clean me up, tuck me back in and rising to kiss me and nibble on my ear as you tell me how good that was and ask if I liked my present you gave me. \n\nI can only say that it was the most amazing feeling I have ever felt in my life, and you reply only with another giggle, telling me that there is more to come, and that so far you are having the hottest and best orgasms that you have ever experienced, and hope that you have enough strength to continue to for the rest of the evening. \n\nWe continue to drive to your Christmas party, where we will continue our evening. \n\nAs we arrive and park at the party house, we take a moment to freshen up and prepare to attend the party, when we both are satisfied that the other is suitably presentable we exit the car and make our way to the entrance arm in arm, your head resting on my shoulder as you continue to purr in contentment. \n\nThe beauty of the hall we have entered captivates us both, the place is drop dead gorgeous, and I wonder just how much your company is shelling out for this little party.  As we move into the main dining area I see that this is going to be one large event, there are tables setup for over 1000 people and the live band is tuning up over by the large dance floor, this is going to be one fun night. \n\nWe are seated at the last 2 open seats at a table for 12, and spend the next few minutes getting introductions and drink orders out of the way.  As I listen to you talk to your co-workers about work I am again reminded what an intelligent beautiful woman you are, and how lucky I am to have you love me. \n\nAs the room fills up and everyone is seated, the company officials start to make announcements and the room quiets down as everyone listens.  They are talking about the state of the company, individual employee achievements and so on, and I decide you and I need something more exciting. \n\nSo what is a man to do, yep play with a stunning, multi-orgasmic woman and his handy dandy remote controlled, multiple mode ACME brand butterfly vibrator.  (Life is good sometimes, horny women and power toys, can it get any better? We will see... )\n\nAs they start to hand out awards by calling up employees to the podium I start up the Butterfly on my favorite mode \"Ecstasy,\" and set the unit to a maximum setting of low.  Now the Ecstasy mode is my own design, it follows a random pattern while it varies the speed AND intensity of the vibrations, I know you will love this one because it is the mode I introduced you to the butterfly with at home and it had you glassy eyed in 30 seconds on the medium setting!\n\nAs the butterfly starts you emit a short \"hiccup\" like yelp and blush profusely, I lean closer and moving aside you hair, whisper in your ear, enjoy yourself sweetie, this will make all the rest feel like a toy vibrator. \n\nYou gasp softly as I nibble on your ear lightly, and you turn to kiss me, as your lips press to mine I can already smell the chemical change in your breath that happens when you are truly fully excited.  One of the other girls at the table asks if you are ok, you reply yes and make some excuse about not sleeping well and working too much lately.  \n\nThe blank stare is beginning to form in your eyes, I can see that you are starting to breath deeper and those fantastic nipples of yours have become two bullets protruding out the front of your dress.  A steady stream of people have been working their way past us toward the podium to accept there awards as the company works there way toward the top awards.  This seems to go on for almost an hour as I concentrate on watching you. \n\nThe next thing I know, the others at our table are all looking at you and applauding, you snap out of it briefly and are told you have been called to the podium, as you rise and walk to the front of the room on slightly unsteady legs to take you place at the podium. \n\nIt is then that they announce that you are the newest vice president in charge of marketing for a fortune 500 company! You gasp and are speechless, and as you move to the podium I slide the control up to medium, your eyes immediately shoot daggers my way for a brief moment, but then the butterfly has you in its grasp totally, you are trying to make you acceptance speech, your voice quivers, you seem unsure as you fight back the urge to CUM on the stage with everyone watching.  ",
        "As your speech continues you appear wracked with emotion, your voice cracking, your movements unsteady and jerky, and then as you utter \" I want to thank... Everyone... Um... Oh... for all there... ahh hard work\" your hands fly to your face and you appear to hunch forward as if your are crying, but I know you just CAME and it was massive orgasm! I rise and rush to your side, placing my arm around you to support you, I kiss you, slide the control to medium high and announce that she thanks you all and will see you later, for now she is mine and I hear the dance floor calling!\n\nYour sobs are real, and I am almost fully supporting your entire weight with one are as I steer you through the applauding crowd to the dance floor.  As the music starts I take you in my arms and rest your head on my shoulder and begin dancing slowly across the floor as you babble in my ear softly, OH GOD, SO GOOD, OH BABY, oh... oh.. OH NOT AGAIN>>>OHHHHHHHHHHHHHHHH... Oh hon... so hot... so good... Oh OH OH OH OH OH OH AH AH.. mmmmmmMMMMMM.  Honey please stop I can't take anymore, Im leaking cum OH OH oooOOOOOOOOOHHHHHHHH so good. \n\nYou are convulsing in my arms as I slide the switch to off, a muted sob and your body relaxes as we continue to slowly dance.  I can smell you're cum rising from your overheated pussy, and as your strength returns slightly you ask me to walk you back to the ladies room. \n\nAs I drop you off at the ladies room, I wait patiently for what seems like hours and you emerge freshened and you take my arm and whisper to me \" I had to wring out the maxi it was so full of my cum, and I need to get you home and fuck you proper, so lets leave now\"\n\nI laugh and say sure, lets get out of here, we collect out coats and head for the car, once inside, I drive toward home as you rest your head on my shoulder and tell me about your evening so far. \n\n\"Honey you have no idea what this little gem was doing to my pussy while I was up there, it was so hard to not drop to the floor and SCREAM out my cum right there and then, and when you rescued me, I was so relieved, and then you turned the butterfly up faster and harder, I came again immediately, I have never been so turned on in my life!\"\n\nAs I drive along listening to you tell me about the evening, you have been idly stroking my cock through my pants.  As we arrive back at your place, we rush inside and immediately fall into each other's arms.  As my hands grasp the perfectly rounded globs of you ass and squeeze, you hands are rubbing up my chest.  We quickly remove each others clothing on our way to the bedroom, leaving a trail like a string of breadcrumbs to find our way back if needed. \n\nAs we enter the bedroom, I turn you to me and begin to kiss you lightly on the neck, moving over to your chin I continue, moving up to kiss your lips and feed you my tongue.  I take both of your breasts into my hands I squeeze them together, feeling the fullness and heft and admiring their beauty.  Your nipples stand hard and proud, and are begging to be administered to.  I place my lips on the side of one breast and lightly tongue the smooth skin as you moan softly.  \n\nAs I work my way over to the other beauty, I pay careful attention not to get too close to the nipple itself, instead allowing my tongue to trace around the areola as I pass by.  Your hands have grabbed my head, and your fingers are intertwined into my hair trying to guide me back to one of your neglected nipples, and I do resist briefly.  As I hover over your nipple, I exhale my hot breath over the hard nub briefly before inhaling the tasty morsel.  As my lips close over your nipple and my tongue swirls over the top and starts drawing circles you groan out \"YES\" and pull my head harder to your breast.  \n\nAs I pull away I exhale sharply to cool the nipple and move over to the other and start the process all over again.  I them move lower, down to where the butterfly still is pulled tightly to your pussy by the elastic straps.  You rise and begin removing my clothes completely, and pull me down to the bed where you begin nuzzling my cock against your cheek.  \n\nAs your dainty tongue reaches out to lick the sensitive underside of my cock, you begin fondling my balls before plunging my cock down your searing hot throat again as I writhe and moan in pleasure.  As you withdraw and more of my cock emerges from your mouth, your tongue is swirling all around my cock and then you plunge back down to the base again and start that swallowing again.  I grit my teeth against the powerful suction and milking action your throat is causing, the feeling is UNBELIVABLE and I am very close to loosing another load down your talented throat.  As my hands grasp the sides of you head, your hands leave my balls and remove my hands from you head and hold them to the bed as you increase the suction and your throat squeezes tighter on my shaft as I feel a giggle radiate through my cock. \n\nAlmost immediately I feel the cum start to boil in my balls, and lifting my ass off the bed I CUM, AND CUM HARD, blasting my seed down your hungry throat as you continue swallowing and occasionally rising to the tip to get some air before plunging to the base again.  I am amazed that your technique has allowed me to keep my erection and it seems harder than it was before. \n\nDeciding to put this to good use, I retrieve the butterfly control again and turn the unit on med-high to distract you.  As the moan begins deep from within you I reluctantly remove my hard member from your mouth and draw your mouth to mine and kiss you passionately.  You are now moaning almost constantly from the vibration against your clitoris, and each second your volume is getting louder and more vocal as you do not have the fight the unit and keep quiet now. \n\nSliding out from under you and moving behind, I grasp your hips and raise your hips from the bed as I view your perfectly shaped ass and your shaved sopping wet pussy peeking out just above the butterfly.  As I run the head of my cock over the outer lips of your pussy, I switch the butterfly into \"Roller Coaster\" mode and slide my cock into your pussy until I bottom out, all the while listening to you \" AAAIIIIIEEEEEEEE... OH GOD... IM CUMMING OH OH OH OHHHHHHHhhhhhhhhh... \n\nAs I hit bottom I can feel the vibrations of the butterfly being transmitted to my cock through your pussy as the little wonder ramps from low to high speed against your clitoris.  As I grab your hips and start slamming my cock in and out of your overheated pussy, you start screaming at the top of your lungs \" Oh Yessssss!! FUCK ME NOW... FUCK ME HARD... DO IT HARDER... OOOOOHHHHHHH YESSSSSSS BABY IM CUMMINGGGGGGGG... \n\nThe heat between us, the friction of my cock pounding in and out of your pussy, and the vibration of the butterfly have brought me to the brink of cumming again, then I feel you reach under us and cup my swinging balls in your hand and start fondling them gently.  \n\nThis pushes me over the edge and I slide the butterfly control over to the last reserved setting I have saved just for you the \"Who Needs A Man\" setting, the butterfly instantly goes to 120% speed and FULL motion against your pussy, which causes a long loud wailing scream to come from you as I slam into you one more time and erupt my steaming semen deep into your pussy. \n\nAs I wind down a little you continue to scream out what seems to be one LONG continuous orgasm, you pussy is still milking my cock and you are twitching and humping my cock in and out of your pussy as it softens.  I turn off the butterfly as my softening cock slips from your pussy, you almost collapse forward on the bed groaning in exhaustion.  \n\nI slide in next to you and cuddle you into my arms, stroking your hair and kissing you gently, your groan turns into a weak little giggle and you eagerly grab me and kiss me wildly exclaiming that you absolutely loved your evening and are going to sleep fully contented, a little sore and even more in love with me than you thought was even possible. \n\nI hold you tightly, and we drift off to sleep together, as I finally start to nod off I come up with another great scenario for you, my butterfly and your endless ability to cum for hours on end. \n\nOf course you will never look at dinner out quite the same anymore... \n\nHope you enjoyed my story, more to come if there seems to be interest. "
    ],
    "authorname": "Seeker196",
    "tags": [
        "slide control",
        "control start",
        "takes edge",
        "kiss slide",
        "cock plunge",
        "long continuous",
        "turn butterfly",
        "beautiful hazel",
        "butterfly control",
        "elastic straps"
    ],
    "category": "Toys & Masturbation",
    "url": "https://www.literotica.com/s/butterfly-dinner"
}