{
    "title": "A Boy's Last Summer Pt. 02",
    "pages": [
        "Since this was a contest story I didn’t originally plan to write more, but response was so overwhelmingly positive I decided to add more content after all. I think this next chapter came out very well, and I hope everyone enjoys more of David and Roxy’s story. Thank you for the all the great comments on my last installment!\n\n*\n\nIf there was one thing that Roxy Doyle would have wanted to see improved in her current residence; a bigger bathroom would have been right near the top of the list. The existing cramped space tended to fill with steam when she showered, and despite her best efforts to organize it, there still wasn’t enough cabinet space for all her beauty supplies.\n\nShe stood in front of the mirror using one hand to wipe away the fog with a towel, revealing her face in the glass.\n\nIt was an attractive face, or so many men had told her throughout her life. Roxy herself was rather indifferent to it by this point having accrued quite a few years staring at her own visage. At least she had been, recent events had made her more aware of her looks. She squinted at her reflection, thinking that she could see more wrinkles around her eyes than had been there the previous week. The fact that she was about to celebrate her thirtieth birthday probably had something to do with her newfound insecurity, but an even more significant reason was her boyfriend.\n\nTen weeks earlier, Roxy had met David, a young man just out of high school who had come to work for her as a summer hire. The last thing she had ever imagined was that she would fall for him. The very idea had seemed ridiculous at first. He was eleven years her junior, inexperienced and a little bumbling right out of the gate. She had initially felt exasperation at his sarcasm and seeming lack of focus on his work, but over time she had discovered there was much more to this kid than she had first thought. He learned quickly, never made the same mistake twice, and proved to be a conscientious worker with excellent attention to detail. \n\nThe more time she spent around him, the more she found to like about him. He was kind and thoughtful, brave, and selfless. There was a maturity in him that mixed with his youthful innocence and dry wit attracted her in a way that no man had in a long time. She tried to resist her feelings. A task made much more difficult by the fact that David was also a very handsome young man with a body that was far more mature than its owners face. Given their age difference, and her relationship baggage that included a seven-year-old daughter, it seemed far more sensible to be his boss and keep a discreet distance.\n\nWhen she had failed at that, she had tried to settle on being his friend.\n\nIn the end, she had failed at that as well.\n\nDavid broke through the thick walls of indifference she had built up by doing no more than being himself, and that was both exciting and frightening to her. It forced Roxy to open herself to the kind of pain she had turned her back on, and to admit that she didn’t have to be alone. For a woman that had forged her personality around fierce independence, this kind of vulnerability made her nervous. Add to this the fact that their May/December relationship was unconventional, to say the least, and you had a recipe for some sleepless nights.\n\nThen there were the wrinkles.\n\nA banging on her bathroom door jerked Roxy away from the minute inspection of her face.\n\n“What?” she snapped, opening the door enough to reveal the kindly old face of her neighbor, Mrs. Foster.\n\n“I just wanted to let you know that David will be here soon. What’s taking so long?”\n\n“I know what time it is, Mrs. Foster. I was just counting my wrinkles.”\n\n“Wrinkles? You’re about to turn thirty, Roxy, not seventy. You want to see wrinkles? Take a look at my face, Sweetie.”\n\n“It’s not your face that David has to look at all the time.”\n\n“Feeling a little insecure today, are we?”\n\n“No...Yes...Shit! I don’t know!” said Roxy loudly as she struggled to put on her makeup, “this is what I get for dating a younger guy.”\n\n“You wouldn’t give him up for the world, though, would you? I’ve never seen you so happy as you’ve been since David came into your life.”\n\nRoxy made a face in the mirror, she hated to give her nosey neighbor the satisfaction by admitting it, but she was right. David had swept into her orderly life and turned it all upside down but in a good way. He was proving to be a something she hadn’t believed existed, a man she could count on. \n\nIf he had just been a little older...\n\n“David is a great guy. There. I said it out loud. Happy?”\n\n“Just so long as you know it that’s all that matters, Dear. He is a peach. Why, if I was forty years younger, I might be trying to steal him from you!”\n\n“Mrs. Foster! You’re going to make me blush, and I’m trying to get the color right on my face.”\n\n“Don’t think I don’t know what goes on over here after lights out. These walls ain’t that thick...” said Mrs. Foster with a knowing grin.\n\nThis time Roxy did blush, for all his lack of practical experience, David seemed to have a natural ability in the bedroom. In their short time together, he had given her some truly epic orgasms that more than once had left her legs shaking.\n\n“Why don’t you go back to watching soap operas and leave me in peace?”\n\n“Fine, Dear,” said Mrs. Foster with a laugh.\n\nRoxy finished getting herself ready and went to her bedroom to change into her clothes for their outing. \n\n“I can’t believe I agreed to this trip. Two days of camping with a bunch of teenagers,” said Roxy returning to the living room where she stuffed her wallet into the backpack that sat on the floor.\n\n“They’re his friends,” pointed out Mrs. Foster.\n\n“They hate me. I’ve heard them call me ‘Grandma’ behind my back when they think I’m not listening.”\n\n“Heather was the only one that called you a grandma. The others like you just fine.”\n\n“Yeah, that’s another thing. You know she’s coming this weekend? Me and his ex-girlfriend on a camping trip! What could go wrong?”\n\n“She is still his friend. They’ve known each other for years.”\n\n“Little bitch wants him back too. She tries to pretend she’s accepted things, but I’ve seen the way she looks at him,” said Roxy hotly, crossing her arms.\n\n“Are you seriously threatened by the wiles of a teenage girl?”\n\n“What? No...Of course, not...I...I’m just saying it’s...it’s...rude!” replied Roxy flailing for the right word to describe her complicated feelings toward her boyfriends ex-flame.\n\n“I wouldn’t worry. I’ve seen the way David looks at you. There is nothing Heather could ever do that would change that look in his eyes.”\n\nRoxy nearly started blushing again, and she was glad when a knock at the door interrupted this conversation before it got worse.\n\nMrs. Foster was closer, and she opened the door to reveal David standing on the other side his usual care-free smile plastered prominently across his face. \n\n“David! Come on in. We were just talking about you.”\n\n“All good things I hope?” \n\n“Of course!”\n\nDavid stepped through the door, and instantly Roxy felt like a school girl all over again basking in the attention of her biggest crush. It was a disconcerting feeling for a grown woman, and one she had never gotten used too. \n\n“Ready to go?” he asked his dark eyes falling on her and making her wish they were alone. She wouldn’t have minded leaving a bit late and dragging him to the bedroom first.\n\n“I left Emily’s pediatricians number on the fridge. Don’t hesitate to call if there is any trouble, but I don’t know if we’ll have cell phone service.”\n\nMrs. Foster smiled indulgently, “I raised three kids of my own. I think I can handle yours for the weekend. You two go and have a good time.”\n\nDavid picked up Roxy’s pack for her slinging it over one shoulder. \n\n“Off we go! The great wilderness awaits.”\n\nRoxy sighed and with a look of resignation followed him out the door.\n\nAn hour later, they were well outside the city. The freeway in front of them climbed steadily upward into the vast pine forest of the Sequoia National Park. The temperature had dropped as they ascended, leaving the scorching heat of the low desert behind. \n\n“You’re awfully quiet,” observed David glancing over. \n\nRoxy had been trying to read a magazine but had tossed it aside a few miles back and now sat staring out the window at the trees as they whizzed by in blurry flashes of green and brown. \n\n“Summers is coming to an end,” she replied not directly addressing his statement.\n\n“Yep...that’s why we are on this trip. My friends and I always do something to commemorate the end of another summer, and this year it was suggested that camping would be a cool idea. It’s an even bigger deal since quite a few of them will be going away to school soon.”\n\n“Who suggested it?”\n\n“Heather, actually,” admitted David unhappily. He knew that the two of them weren’t exactly each other’s biggest fans.\n\n“Heather...” mumbled Roxy.\n\n“Look. I know the two of you don’t particularly like being around each other.”\n\n“She calls me ‘Grandma’.”\n\n“She called you that once and it was just a joke,” said David, trying not to laugh.\n\n“Joke my ass! I’ve heard her say it when she thinks I’m not listening,” said Roxy indignantly.\n\n“In two weeks, Heather will be going away to school, and you won’t have to see her again. Why don’t we try to get through this weekend and have a good time? Please?”\n\nRoxy’s expression softened at the sad look in David’s eyes, “God! I hate that you can do that...”\n\n“Do what?”\n\n“You get that damn sad puppy look in your eyes, and I freaking can’t argue with you.”\n\nThis time David did laugh, taking one hand off the wheel and resting it on her thigh.\n\n“I promise I will make it up to you if you don’t enjoy yourself.”\n\n“Don’t worry about it. I can tolerate your Ex for one weekend,” she said, smiling at last and taking his hand in hers.\n\nDavid switched on the radio and the sounds of the opening track to Bob Seger’s album “Night Moves” flowed through the car.\n\n“When did you get this?” asked Roxy happily. She had admitted on their second date that she was a huge Seger fan, and David who had only minimal exposure to the Detroit legend had worked to remedy that by downloading as much of his music as he could cram onto his MP3 player.\n\n“I burned a couple of CDs just for this trip. Isn’t this one of your favorite albums?”\n\n“It is. I’m impressed you remembered.”\n\n“I remember everything you tell me.”\n\nIn another man, it might have sounded like a boast, but she knew with David it was simply true.\n\n“I never asked you where your interest in Bob Seger came from?”\n\n“My dad. I’m not from here originally. I was raised in a little town in central Michigan called Saline. It’s just outside of Ann Arbor. My dad was from Detroit, and he grew up listening to Seger’s music, so I guess it rubbed off on me.”\n\n“I didn’t realize you were a northern girl.”\n\n“I don’t remember living there very well. We moved west when I was Emily’s age. I recall that it was cold in the winter.”\n\n“Cold up north in the winter. Good to know.”\n\n“Smartass...”\n\nThey began to sing along together, and though neither of them had a voice that could be called pleasant, they managed to harmonize in a way that wasn’t bad at all. The first album finished, and they almost made it through the first half of “Stranger in this Town,” appropriately enough singing “Till it Shines,” as the turn off for the park came into sight. \n\nDavid cut off the radio and rolled down his window as they approached a pay booth. He purchased a two-day pass and pulled through following the road around while looking at the numbers of the various campsites that were posted on signs. It turned out he didn’t need to though because he recognized his friends camp in the distance and drove right up to them parking in the last available spot. \n\n“Hey! David and Foxy Roxy!” laughed Chris as he came up to the pair slapping his old buddy on the back.\n\nDavid winced at the nickname Chris had bestowed on his girlfriend, but Roxy had learned to take Chris’s sense of humor in stride by this point.\n\n“Did everyone make it out o.k.?”\n\n“Yeah, everyone’s here, but wait until you see Heather.”\n\nAs if Chris’s words had powers of conjuration, Heather suddenly came bounding out of a tent right nearby running up to where the three of them stood.\n\n“Wow...Heather...What did you do to your hair?” asked David almost not recognizing his old girlfriend. All the time he had known her, she had sported the same medium length, curly blond hair, but it was gone now. In its place, she had cut her hair short and dyed it a dark brunette. It worked quite well for her making her light blue eyes stand out even more and adding contrast to her fair skin. Heather had also changed her makeup going for a more dramatic look instead of the girl next door cuteness that had been her trademark. \n\n“Do you like it? I was nervous about the change, but my stylist convinced me to give it a go!”\n\n“You look gorgeous! I mean it’s very flattering...” replied David, curbing his enthusiasm when he saw the frown on Roxy’s face.\n\n“Thanks! I have some even more exciting news.”\n\n“Really?”\n\n“Yeah.I’m not going away to school this fall after all. I decided to wait a year and get my prerequisites out of the way at city college first. It will be cheaper in the long run. So you and I will be in school together again! Isn’t that awesome?”\n\n“Uh...Yeah...That is awesome,” said David, with far less enthusiasm.\n\n“Hey, Heather! Are you going to help me set up this tent or what?” called Stacie from the next campsite over.\n\n“Oops! Have to go! I’m glad you guys made it out! This is going to be such a fun weekend.”\n\nDavid watched his ex-girlfriend walking away before turning back to Roxy whose expression had clouded over considerably in the last two minutes.\n\n“Well...How about that, Huh?”\n\n“Yeah, this weekend is going to be a real hoot,” said Roxy before she pivoted on her heel and went to start unloading their gear.\n\nChris put his arm around his friend’s shoulder, “If I were you, Pal. I think I would go ahead and drown myself in Sequoia River.”\n\n“It’s not the worst idea,” admitted David as he shrugged off Chris’s arm and went to help Roxy.\n\n FIRESIDE CHAT -\n\nThe group had bought out four spaces with Stacie and Heather camped in one, Pete and Chris in the next one over followed by George and Roger, and Roxy and David at the end. In the middle, there was a fire ring, and George had brought plenty of firewood to put together a campfire that would have done any Boy Scout troop in America proud. They gathered around the blaze after dinner to roast marshmallows.\n\n“Doesn’t this remind you guys of Camp McCloud?” asked Pete as he stuffed a marshmallow in his mouth.\n\n“It sure does, but the marshmallows are better when you don’t have to share with a bunch of other kids,” remarked George as he downed one himself.\n\n“I hardly remember that camp now,” said Heather.\n\n“I call bullshit! I know you remember it because you spent half the summer in the bushes with David!” teased Roger, his voice trailing off when he remembered that Roxy was sitting next to him.\n\n“Sorry...” he mumbled sheepishly.\n\n“It’s o.k., Roger. It’s nice to reminisce,” said Roxy.\n\n“Did you ever go to summer camp, Roxy?” asked Stacie, trying to defuse the tension.\n\n“Sure, back in the day, I spent a couple of summers at Camp Warner.”\n\n“Camp Warner? I think I heard they shut that camp down about four years ago,” said Heather.\n\n“Well...I can barely recall it anyway. You know at my age the first thing that goes is your memory,” joked Roxy, but there was a definite edge to her voice.\n\n“Hey, Heather, I thought Alex was coming this weekend?” commented George.\n\n“We broke up. I guess he decided he wanted to spend his weekend somewhere else.”\n\nHeather seemed to have her eyes on David when she said this, and he coughed uncomfortably.\n\n“Hey Stacie, are you going to give us a glimpse into our futures?” \n\nThe question from Chris brought a smile to her face, and she nodded in the affirmative, “I can do it over at the picnic table if anyone is interested.”\n\nRoxy gave David a questioning look, and he leaned closer.\n\n“Stacie is kind of into Tarot reading. Occasionally, we let her get out her cards and tell our fortunes. It’s all in good fun.”\n\nRoxy rolled her eyes but did not comment.\n\nChris brought over a lantern, and while Roger and George continued shot-gunning marshmallows, the rest of the group gathered around Stacie as she laid out her Tarot cards on a silk cloth.\n\n“Cut the cards,” she said to Chris.\n\nHe did as she asked and then she took them back dealing out several in front of her.\n\n“Chris gets ‘The Fool’ that’s appropriate,” laughed Pete.\n\n“The cards don’t have a literal meaning, Pete. They are subject to interpretation,” advised Stacie.\n\n“So what’s in store for me, Stacie. Am I going on to riches and fame?”\n\n“Hmmm...Well, I can see that possibility, lots of pentacle cards here that would indicate something to do with wealth in business, or creativity if you’re an artist.”\n\n“I doubt it’s art. Chris can’t even draw a decent stick figure,” said David getting a laugh from the assembled friends.\n\n“But!” said Stacie, holding up a finger dramatically to get everyone’s attention, “The Fool is reversed, so that may mean you will have to take a great risk or a reckless chance to achieve your goals.”\n\n“That would be appropriate then, Chris always leaps in with both feet, and no regard for what he’s about to land in.”\n\n“When have I ever behaved recklessly?” said Chris trying to sound innocent.\n\n“Mindy Webster!” said everyone at once while Roxy raised an eyebrow.\n\n“How was I supposed to know her parents would come home early?”\n\n“You could have at least gotten your pants on before you jumped out her window,” said Pete.\n\n“There was no time, and her Dad is huge. I had to move like the wind.”\n\n“Yeah, and how far did you get before the cops picked you up running naked down Bird Street?” \n\n“Two blocks, I think...It wasn’t my finest hour,” admitted Chris.\n\nAnother round of laughter followed while Stacie set her sights on Roxy.\n\n“How about it, Roxy? Want to know what the fates have in store for you?”\n\n“Sure...Why not...” said Roxy deciding to play along.\n\n“Cut the cards.”\n\nRoxy split the deck following Stacie’s fast shuffle watching the table as the cards that Stacie drew landed one after another.\n\n“The Empress...Hmmm...” mumbled Stacie in thought.\n\n“The fates got that one right,” said Chris elbowing David in the side.\n\n“Well, one way to look at these wands in conjunction with the ‘The Empress’ would be nurturing the seeds of life, something to do with fertility maybe...”\n\n“I hope you’re using protection,” whispered Pete into David’s ear.\n\n“It could also refer to nurturing a relationship and letting it grow by making sure to focus your primal energy.”\n\n“I like the sound of that,” joked David rubbing Roxy’s shoulders from behind. The move drew a look of disapproval from Heather.\n\n“This card here and reversed would indicate the danger of mistrust, that you have to believe in the relationship completely for it to work.”\n\nRoxy stirred uncomfortably in her seat. Whether all this stuff was malarkey or not, Stacie was hitting too close to home.\n\n“Does it say anything about me winning the lottery?” \n\n“I’m afraid not.”\n\n“It doesn’t matter. I already did anyway,” replied Roxy reaching up to squeeze David’s hand.\n\n“Ahhhhhh...” said Pete and Chris in stereo wringing another laugh from the table.\n\n“Do me, Stacie,” said Heather, taking a seat while keeping one eye on Roxy.\n\nStacie shuffled, and once again the cards were cut and dealt out onto the table.\n\n“It looks like you’re going to meet someone in the near future, someone who will have a great impact on your life.”",
        "“A tall, dark, handsome stranger!” intoned Pete in a fake scary voice.\n\n“No...This card would lead me to believe it’s someone you’ve met before, a figure from your past.”\n\n“Really? Can you tell who?”\n\n“This isn’t an exact science, Heather, I can’t tell you his or her name and address.”\n\n“I’m pretty sure this isn’t science at all,” said Roxy under her breath, but fortunately Stacie didn’t hear her.\n\n“What sort of impact will this person have, positive or negative?”\n\n“Here. Draw one more card and drop it in the middle,” instructed Stacie.\n\nHeather pulled the top card from the deck with a flourish and let it fall. Everyone leaned closer to see what she had chosen.\n\n“The Lovers...”\n\n“Whoa!...Somebodies going to get some!” said Chris smiling.\n\nStacie went on to explain the nuances of the card, but Heather appeared to be hardly listening; instead, she was looking from the card to David and smiling a very wicked looking smile.\n\n“How about you, David?” \n\nDavid shook his head, backing away from the table.\n\n“I think I’ll just take my chances with not knowing.”\n\nRoxy rose to join him while Pete sat down to take a turn. David took her hand, and they went for a walk listening to Stacie’s voice fade behind them.\n\n“If I didn’t know better I would think Heather rigged those cards,” said Roxy.\n\n“Heather is a lot of things, but duplicitous isn’t one of them. None of that crap means anything anyway, Stacie’s been reading our cards since middle school, and her predictions have never amounted to squat.”\n\n“I’m glad you think so I saw your look when Stacie mentioned fertility.”\n\nDavid laughed, “I’m not against having children. They can turn out pretty cool. Look at Emily.”\n\n“She’s special, and she worships the ground you walk on, but I imagine you see having children of your own as a far off possibility.”\n\n“I’m sure I’ll get to that point one day. I’m not in a rush.”\n\n“No...but by the time you are ready I may be too old,” thought Roxy.\n\nThey followed the road around circling back to their campsite just enjoying the relatively cool night air, so different from the baking heat of the desert. \n\n“If you don’t believe in Stacie’s cards then what do you believe in?”\n\n“Are you asking me if I believe in fate?”\n\nRoxy shrugged.\n\n“I think life is what you make it. I don’t think there are some celestial beings out there throwing dice and deciding what’s going to happen to us next. I will say that sometimes, events do conspire to make things come out in ways we never expected or planned. You can call that fate if you want, or just quantum fluctuations if science is more your thing. Take this summer, I certainly never planned to meet you, or for things to go the way they have between us, but I’m glad they did.”\n\nRoxy stopped just short of camp and David stayed with her.\n\n“Are you?”\n\n“Of course. Have I ever made you believe otherwise?”\n\n“No...and I’m glad too. I don’t think I tell you that enough, but I’m glad I met you, David. I’m happy that I’m here with you.”\n\nDavid reached up to cup her face, and they shared a soft kiss while the laughter of his friends broke the stillness. \n\n“Are they going to be this loud all night?”\n\n“Wait. Chris hasn’t even worked himself up to mooning the other campers yet.”\n\n“Oh. I can’t wait,” sighed Roxy.\n\nThings did eventually settle down, and thankfully they managed to convince Chris to keep his pants on. The moon had risen well up into the sky when people finally started to drift off to bed. David brushed his teeth with water from his canteen while watching George and Roger argue over which side of the tent they were going to sleep on like an old married couple. He finished what he was doing and unzipped his tent finding Roxy already inside lying on top of her sleeping bag in a flannel shirt and shorts.\n\nHe dropped down on his sleeping bag next to her, removing his t-shirt.\n\n“I hope this air pad I bought stays inflated. I hate waking up in the middle of the night and finding myself sleeping on the ground.”\n\n“Oh...You thought you were going to sleep?”\n\nDavid smiled, “I take it you have other plans?”\n\nRoxy’s answer was to move over to his sleeping bag straddling his legs and to begin unbuttoning her shirt slowly.\n\n“Oh...Man...” breathed David, as he watched her work her way down. The two halves of cloth separated just enough to reveal the valley of her large breasts and a hint of the massive peaks that lay to either side.\n\n“You have to be quiet. We don’t want to disturb the neighbors,” whispered Roxy, though privately she wouldn’t have minded if Heather got an earful of David moaning his enjoyment of their tryst. \n\n“I can keep it down,” said David in a lower voice.\n\n“Mrs. Foster says otherwise.”\n\nDavid frowned at that comment, but he quickly forgot about it when Roxy took one of his hands and started to kiss his fingers, sucking one into her mouth before slipping the same hand into her shirt. He could feel the warm, round shape of her breast as she guided his wet fingers to the silky center. She bit her lip when David began to rub her saliva onto the hard nipple he found there teasing it until it was fully erect against his fingertips then pinching it between them.\n\n“Um...Fuck...” moaned Roxy softly.\n\nDavid rose up, pulling her shirt aside. Her perfect breast lay there like a firm melon the areola darkening into a rosy red field beckoning him to explore. He let his tongue slide across the bumpy skin, running up on her hard nip and catching it between his teeth while she squirmed atop his legs.\n\n“Damn...David...You know what happens when you tease my nipples?”\n\n“Yep...and I’m counting on it.”\n\nRoxy pulled him from her aroused tit and buried her tongue in his mouth, swirling it around, kissing him deep and hard with a low groan in her throat. Her sweet, full lips engulfed his in their moist embrace rubbing sensually all over, and sending a shower of gentle tingles down his spine. The hungry kiss spurred David on, and he returned it with equal excitement, Frenching his girlfriend roughly even as he pulled her down on top of him and pushed her shirt off. Roxy’s fat tits were pressed to his hairy chest, her stiff nipples tracing lines in the curls. Their frantic kissing continued, slick, steamy touches that served to raise the urgency of their desire for one another to another level. \n\nDavid slipped his hands into her loose-fitting cotton shorts squeezing her tight ass cheeks, making her groan into his mouth. \n\n“Fuck, I’m so wet...” she whispered.\n\nHe rolled her onto her back, and she raised her legs high so he could slide off her shorts.\n\nRoxy hadn’t been kidding. Her pussy was wetter than he had ever seen it before, her thighs shining with the nectar that was pouring from her vaginal slit. David scooted up right next to her, kissing her again with slow flicks of his tongue while he used his fingers to gently stroke her labia. She moaned as quietly as she could, but it was so hard to hold in her feelings. David seemed to have a sixth sense about just how to touch her body to make her want him, and he was hitting all her buttons. \n\nHe nibbled on her ear, teasing her in a soft voice.\n\n“You want me so bad right now, don’t you?”\n\n“Yes...Ah! God! Yes...David...I want you, Baby!”\n\n“I can tell. Your pussy is soaking.”\n\n“Please, David...Don’t tease me...I need you inside me...”\n\n“Right here?” he asked, shoving two fingers into her dripping slit.\n\n“OH! FUCK! Yes!” cried Roxy arching her back and barely muffling her words.\n\nHe fingered her tight hole, taunting her clitoris with his thumb, making her quiver on the sleeping bag.\n\n“Do you want me to fuck you, Roxy? Want my thick...hard...cock...in this wet pussy?”\n\n“God! David! I’m begging you...fuck me now...Please...I can’t take it anymore...You’re making me crazy! Please, David!”\n\n“Play with your tits. I love to watch you play.”\n\n“If...I do that...while you’re touching my pussy like this...I might cum...,” she whimpered.\n\n“Please, Roxy...”\n\nShe did as he asked, lifting her massive breasts in her hands and squeezing them, pulling at her nipples and making them turn even darker. Her breath was coming in hard gasps with each movement.\n\n“Do you like to touch them?”\n\n“Yes...I love to play with my tits...but I like it better when you play with them...suck them...bite my nipples...”\n\nRoxy’s hands gripped her love mounds even more roughly in response to her own words the memories of nights spent with David’s mouth teasing her chest driving her mad.\n\n“David...Please...Please...I can’t...I’m going to cum...going to cum so fucking HARD!”\n\nHe finally took pity on his desperate girlfriend, crawling on top of her, pushing his shorts down and placing the head of his cock right up against her trembling pussy lips.\n\n“Hurry!” she begged.\n\nThey both struggled to keep from screaming when David let his weight fall forward, and his thick cock fairly lept into Roxy’s pussy her sugar walls so slick they offered no resistance to his passage. Barely contained grunts and cries threatened to escape the canvas walls of their tent as the two lovers moved together. Roxy dug her nails into his back, pressing her heels to his muscular buttocks, meeting his thrusts with wild upward pushes of her hips, impaling herself even deeper onto his shaft. \n\n“Oh...God...So good! It feels so good! Ah! David! I’m going to cream your fucking cock! Uhhhhh...Daviddddd!”\n\nHis fingers had brought her too close to the edge, and she couldn’t hang on. Violent ripples cascaded from her clitoris out through her body, and it took all her self-control to keep from yelling David’s name loud enough to be heard by every camper in a ten-mile radius. He joined her just a few thrusts later filling her still shaking love hole with long ropes of his semen. Their bodies drew together, and they kissed softly both struggling to regain their equilibrium in the wake of their titanic orgasms.\n\n“It’s always so amazing with you,” she said, touching his cheek.\n\n“I thought for a second there you were going to be the one to wake the neighbors.”\n\n“That’s what you get for teasing me that way. If I had screamed the tent down, it would have been your fault!”\n\n“I can’t help myself. I live for driving you crazy.”\n\nRoxy left shortly afterward to run to the nearby restroom and clean up before coming back to bed where she and David zipped their sleeping bags together and snuggled down for the night.\n\n THREES A CROWD BUT FOUR IS WORSE -\n\nThe following morning dawned bright and sunny. David cocked one eye open, slowly sitting up and yawning. He stretched his arms up toward the top of the tent listening to the quiet pops as the joints in his back loosened up. Roxy was nowhere to be seen, but he could hear voices outside, and the sounds of a crackling fire. \n\n“Hey, Sleepy Head. Finally decided to join the world?” teased Roxy as he climbed out of the tent into the crisp mountain air.\n\n“I guess I was more worn out last night than I thought,” replied David with a knowing smile that made Roxy blush.\n\nStacie had coffee going on a camping stove, and she brought him a steaming cup along with a muffin from a box on the picnic table.\n\n“Thanks,” he said, sipping at the hot liquid.\n\n“Sure. Everyone is getting ready to hike up to Sequoia River, so pull yourself together!”\n\n“Yes, Mommy.”\n\nStacie bounced away like a woodland sprite her feet barely touching the ground.\n\n“She’s always been a mother hen to the rest of us,” explained David.\n\n“I can see that.”\n\nRoxy watched as the petite girl moved around camp getting everyone organized and moving forward. They grumbled a bit, but no one dared to challenge Stacie, and in a short time the entire group was fed and walking single file down a marked trail not far from their encampment.\n\n“Take a left at the next fork,” called David from the middle of the pack to Chris who had taken point.\n\nChris responded with an affirmative wave.\n\n“This will put us on Harlow Trail. It runs right up to the river near ‘Look Out Point.’”\n\n“You’ve been up here before?” asked Roxy.\n\n“A few times with both my parents, and the guys.”\n\nThe trail was narrow, forcing them to stay single file for the moment. Roxy noted that Heather had made sure to put herself right in front of David. The younger woman had dressed in a very tight pair of shorts that revealed a good bit of her ass. It seemed like she was also taking every opportunity to bend over.\n\n“The way she likes to shake her ass in men’s faces she should work in a strip club,” grumbled Roxy.\n\n“What was that?” asked David over his shoulder.\n\n“Nothing, Sweetie.”\n\nOnce they passed the fork, the trail widened considerably, and the group was able to spread out. Roxy moved up next to David, taking his hand in hers, making sure to make eye contact with Heather.\n\n“It sure is beautiful,” remarked Stacie glancing around.\n\n“Be careful, Stacie! I thought I saw a hawk up above the trees a minute ago. He might think you’re a mouse and scoop you up for lunch,” teased Chris.\n\nStacie stuck out her tongue at him then ran ahead to walk with Heather.\n\nThe day was warming up quickly, and water bottles made an appearance as the group marched on.\n\nGeorge had brought along a blue tooth speaker and started playing some upbeat music.\n\nThe trail gradually sloped downward, and about a half-hour later they heard the sound of running water before the trees parted, and they found themselves on a rocky shelf that overlooked the fast-moving river below. They could see from where they stood that this shelf was one of many such points that stuck out over the river like platforms where someone could bask in the sun, or dive into the cold water if they were so inclined. \n\nEveryone spread out to lay down their packs, and slip off their shorts and t-shirts revealing the swimsuits they wore underneath. \n\nRoxy was wearing a bikini similar to the one David had first seen her in at the water park earlier in the summer except this one was an emerald green. The suit looked very nice with her fair skin and strawberry-blond hair. He took note that the other guys were trying very hard not to stare and failing miserably. All the attention didn’t seem to bother Roxy who was used to it.\n\nThe real surprise came seconds later when Heather finished removing her outerwear. In all the years David had known her, Heather had always stuck mostly to conservative one-piece suits, but today she stripped off her clothing to reveal a tiny, jet black bikini that clung tight to her perky tits, and barely managed to conceal her backside from wandering eyes. \n\n“Jesus, Heather. Are you going diving in that?” asked Chris, his eyes almost bugging out of his head.\n\n“I don’t think I’ll be doing that today. It might just come off and then where would I be?” she said with a flirty smile in David’s direction.\n\nHe swallowed and pretended not to notice.\n\n“Come on! Time to separate the professionals from the amateurs!” yelled Pete.\n\nAs they started to move out together toward the edge of one of the rocky shelves, Roxy came over to David with a concerned look in her eyes.\n\n“You’re going to dive off these rocks?”\n\n“It’s fine. We’ve done it before. It’s plenty deep here, and there are no rocks under the water.”\n\nShe stepped a bit closer to one edge. It was probably a good twenty or thirty feet down to the water.\n\n“You’re out of your mind.”\n\nDavid laughed and pulled her into a quick hug.\n\n“Thanks for worrying, but I got this covered. You going to be o.k. up here?”\n\n“I’m not the one about to leap off the side of a mountain, so I’ll be fine. I’m just going to layout and work on looking less like ‘Casper the Friendly Ghost.’”\n\n“I like your skin just as it is...” he said, tipping her jaw up for a kiss.\n\nRoxy watched him go shaking her head. She noticed that Stacie was lounging in her swimsuit a short distance away while Heather had moved out onto a jutting rock from where she could watch the guys, or be watched herself which Roxy suspected was her real intention. \n\n“You aren’t diving?” asked Roxy as she took a seat next to the diminutive brunette. \n\n“God, no! I’m not the brave one in this group.”\n\nThe two women looked on as Pete worked himself up with a lot of deep breaths and then took off at a run launching himself into the air with a wild yell before vanishing with a splash into the water below. He popped up seconds later, shaking the water from his eyes and raising an arm in triumph before the current carried him down the river. \n\n“There’s a sand bar around the bend. They get out there and walk back for another go,” explained Stacie. \n\nChris was lining up to go next.\n\n“Go, headfirst, it’s your least vulnerable spot!” yelled Stacie.\n\nChris laughed and took off vanishing over the edge.\n\n“He’s such a nut.”\n\n“But you like him anyway, don’t you?” asked Roxy.\n\nStacie looked bashfully at the ground, “He doesn’t know...I’m not his type anyway. He is into girls that...Well, honestly, girls that look like you. You know, pretty and voluptuous, which I am not.”\n\nRoxy thought Stacie was selling herself short. Indeed she was a tiny girl with smallish breasts and rather skinny legs, but she was very pretty in the face and had a wonderfully outgoing personality.\n\n“I think he would be lucky to have you. Maybe you should tell him how you feel?”\n\n“I’ve thought about it, but we’ve been friends for so long I don’t think he could see me any other way. If I did that, and he didn’t want to go in that direction I’m afraid it would make things awkward between us.”\n\n“It’s a risk, but if you don’t try, you’ll never know.”\n\n“Maybe...I wish I were braver when it came to these things like you and Heather.”\n\nAt the mention of Heather, Roxy glanced over to where the other woman lounged some distance away. David was getting ready to make his run, and Heather’s eyes were on him with the stare of a predatory bird.\n\n“She doesn’t hate you,” opined Stacie.\n\n“From the looks she gives me it’s hard to tell.”\n\n“I think she is more angry with herself for losing David. They were the Ken and Barbie of Randolph High for years. The couple every couple wanted to be, and it eats at her that she screwed it up.”\n\n“She needs to get over that, and stop throwing herself at him.”\n\n“You should go talk to her. Maybe you two could come to a truce over the whole thing?”\n\n“You can’t be serious?”\n\n“I can tell you this much, David and Heather have known each other for a long time, and even if they never become lovers again, she is always going to be his friend. Wouldn’t you rather find a way to co-exist with her that doesn’t make you both crazy?”\n\n“I could just go toss her off the cliff.”\n\n“Ha! You could, but it wouldn’t help. Heather was lead on our girl’s diving team, and she swims just as well as David.”\n\nRoxy took a breath and stood up, “I can’t believe I’m doing this. It’s like I’m back in high school having to kiss up to the head cheerleader.”\n\n“You might want to try for a more positive attitude,” advised Stacie.\n\n*\n\nThe rocky shelf where Heather was lying was just wide enough for the two of them, and Roxy took a seat next to her leaning back on her hands.\n\n“Nice day.”\n\n“Did Stacie send you over here? It would be just like her. She’s always been the peacemaker in the group. Whenever someone disagreed with someone else, it’s always Stacie that tries to make them see reason. She should be an ambassador when she grows up.”\n\n“I just thought we could talk,” offered Roxy trying to keep the anger and sarcasm out of her tone.\n\n“What would you like to talk about?”\n\n“I think you know.”\n\n“Do I?”\n\n“Don’t be coy, Heather. The way you’ve been flirting with David. It’s disrespectful to me, and him.”\n\n“He hasn’t complained to me about any flirting.”\n\n“David wouldn’t complain if he had a steel bar sticking out of his ribcage. He’s far too nice for his own good. I, on the other hand...”",
        "Heather looked over at Roxy for the first time since she had sat down, “Yeah, you have no problem saying what’s on your mind.”\n\n“No I don’t, but I’m trying hard to be friendly about this and not do something we’re both going to regret. I know David well enough to say he would...”\n\n“You know David!” snapped Heather raising her voice for the first time and catching Roxy by surprise.\n\n“Exactly how well do you know, David, Roxy? You think you know David because you’ve been dating him for a whole seven weeks! David was mine for three years, and you want to tell me what David would want!”\n\nShe was on a roll now, and wouldn’t let Roxy cut her off.\n\n“Did you know his favorite color is green? Did you know that his favorite food is fried chicken, but only the dark meat because the white is too dry. Did you know that his favorite T.V. show of all time is ‘The Twilight Zone,’ and he still watches the marathon every New Years? That he likes to drink warm milk at night when he can’t sleep and loves the Hallmark movies at Christmas but would never tell his friends because they would tease him. I know David, and I understand him better than you ever could. I was there when his Grandma died, and I held him while he sobbed his heart out. I was there when he won his first swim trophy and felt like he was on top of the world, and I was there when he lost his virginity because we lost ours together.”\n\n“So...,” said Heather, finally pausing to catch her breath, “do you still want to tell me how well you know David?”\n\n“That was quite a speech, truly and Oscar-worthy performance. It doesn’t change the fact David is with me now, and I need you to accept it.”\n\nHeather smiled, but the expression held no warmth, “David’s with you? And just what do you bring to this relationship? I can see what you’re getting from David. He’s kind, loving, loyal to a fault and protects the people he cares about. So what does David get from you aside from the obvious? Does he get to enjoy the responsibilities of fatherhood long before he’s ready too? Does he get to deal with the insecurities of a divorced woman with an alcoholic ex-husband who’s spent years building up her resentment toward men? Maybe he gets the joy of dating a woman born a decade out of step with him? You tell me, Roxy, what are you bringing to the table exactly?”\n\nRoxy had to give Heather credit. She had hit the head on every nail that had been bothering Roxy for weeks. Caught off guard by the sudden attack, Roxy found herself in a rare position for her, at a loss for words.\n\n“I just came over here to see if we could find some way to get past the animosity and maybe be friends. I can see I made a mistake.”\n\nShe pulled herself back to her feet and beat a hasty retreat fighting back the tears that threatened to come.\n\n“Thanks for the chat,” called Heather as she turned her back to Roxy’s retreating form.\n\n“Is everything o.k.?” asked Stacie as Roxy hastily pulled her clothes back on and reached for her pack.\n\n“It’s fine...I just...Uh...felt a headache coming on, and I need to go back to my tent and lie down. Tell David when he comes back o.k.?”\n\n“Yeah...Sure,” said Stacie with concern as Roxy fled up the trail.\n\nStacie stomped over to where Heather was still resting in the sunshine pulling herself up to her full five-foot-one-inch height.\n\n“Heather Elizabeth Andrews! Just what did you do?”\n\nThankfully for Roxy, the trail was easy enough to follow, but she did stop half-way back to camp to lean against a tree and collect herself. \n\n“This is ridiculous! Why am I letting some eighteen-year-old kid get in my head! You’re better than this, Roxy Doyle!” she said harshly under her breath as she fought to calm down wiping tears from her eyes. \n\nThe fact remained though that Heather wasn’t wrong. Everything she had said was right and underlined her doubts about this relationship. The nagging feeling that David deserved better, that he deserved to be with someone who wasn’t weighed down by her past, someone who was at the same place in life he was ready to build something fresh and new. \n\nWhat did she bring to this relationship? She didn’t know, and that unknown frightened her both because it meant she could lose him, and because it also said that maybe it would be better for him if she did.\n\nThe sounds of a far off bird calling snapped her out of her dark thoughts, and Roxy got started up the trail again slowly regaining her composure. As she drew closer to camp, she heard a distant rumbling noise that sounded familiar, but in her current mental state, she was having a hard time placing it. Emerging from the woods, Roxy was greeted by a massed group of rough-looking men riding by on all manner of different models of motorcycle. There must have been about thirty or so altogether, but it was the last one in the long pack that caught her attention.\n\n“You’ve got to be fucking kidding...” mumbled Roxy.\n\nThe last man in line pulled away from the rest stopping in front of her and pushing his sunglasses up.\n\n“Well, I’ll be damned! Roxy! Fancy seeing you up here,” said Todd with a grin.\n\n“What are you and your band of morons doing here, Todd?”\n\n“It’s our semi-annual club getaway. You know we do a couple of retreats every year.”\n\n“Don’t you usually do those in Vegas?”\n\n“Yeah...Well, the last one got a little bit out of hand, and we decided maybe we should give Vegas a wide berth for now. Someone suggested a nice, quiet trip to the mountains might be a better idea. What are you doing?”\n\n“I was having a quiet weekend before you wanna-be Hell’s Angels showed up.”\n\n“Ah! We aren’t here to cause trouble. Heck! You won’t even notice us.”\n\n“I’m already noticing the smell.”\n\n“Be nice. I just bathed yesterday. Anyway, I’m going to make camp. Maybe I’ll see you around?”\n\n“Don’t hold your breath.”\n\nShe watched him roar off in a stinky cloud of exhaust. This was all she needed, first the attack of the emotionally jilted cheerleader, and now her ex-husband shows up. This weekend was sinking into an abyss very quickly. By now, Roxy did have a headache coming on, and she went to lie down in the tent. The sleeping bag still smelled of David’s cologne, and she curled up on it drinking in the scent. It made her feel safe somehow, and she started to drift in and out.\n\nRoxy’s thoughts became a disjointed mess. She never quite dozed off completely but instead floated on the edge of sleep. Time passed more quickly than she realized, and when voices came from outside the tent, she was drawn back to the land of the living to discover that several hours had gone by while she had been inside. The zipper in the front of the tent slid down, and David ducked inside, looking worriedly at her.\n\n“Hi, there! Stacie said you weren’t feeling well?”\n\n“I’m o.k. now. It was just a headache.”\n\n“I’m glad you’re feeling better. We were going to walk down to the camp pavilion for lunch. They serve a pretty good burger there if you want to come?”\n\n“Sure...Just give me a second to pull my shoes back on.”\n\nWhen she emerged from the tent, the first person she saw was Heather, but the younger woman refused to meet her eyes turning away and walking up the road following the broad backs of Roger and George. Roxy fell in next to David, who was still watching her with concern perhaps sensing her sudden unease.\n\n“Are you sure everything is o.k?”\n\n“I said I was fine!” snapped Roxy more harshly than she intended, and David flinched as if he had been slapped.\n\nInstantly feeling bad for her outburst, Roxy took her boyfriend’s hand.\n\n“I’m sorry. I’m not angry with you. Todd is here.”\n\n“What!? Where?” said David looking around.\n\n“He’s here with his motorcycle club. They’ve camped up the road from here.”\n\n“It’s funny I never really pictured you as the bikers old lady,” joked David.\n\n“I wasn’t. Todd started the whole motorcycle thing after we divorced. I guess he was trying to find a new identity or something.”\n\n“I guess he accomplished that. What was he like before?”\n\n“Don’t laugh, but he was a delivery driver for U.P.S. He used to have short hair, and wore very yuppie clothes when he wasn’t in a brown uniform.”\n\nDavid tried to reconcile that image with the long-haired, tattoo sporting man he knew and couldn’t.\n\nThey arrived at the pavilion which had been built back in the nineteen-sixties as an entertainment venue for the park. It had plenty of outdoor seating to serve the walk-up window to a kitchen that made your typical picnic food like burgers and hot dogs, but it also had a camp store next door and through a pair of large wooden doors a massive open room that was often used for dances and concerts. \n\n“I’ll have two of everything!” said Chris running up to the window.\n\n“You will not Christopher! You’ll make yourself sick!” cautioned Stacie from behind him.\n\n“Come on, Stacie! I’m starving, and a growing boy needs his calories.”\n\n“Then at least get a vegetable to go with all that fat.”\n\n“Fine, Mom!”\n\nStacie frowned at being seen once again in the mom role, it didn’t bother her so much with the others, but she didn’t want Chris to see her that way.\n\nOne by one, everyone got their food, and they found a picnic table long enough for all of them to sit. David hadn’t been kidding about the quality of the burgers, and Roxy found herself enjoying every bite.\n\n“Anyone else see what I see?” said George whipping mustard from his face.\n\nThey followed his gaze to the sand volleyball court that was not far from the pavilion where a group of young adults not much older than themselves were engaged in a spirited game.\n\n“We should show those guys how it’s done,” said Chris.\n\n“We used to play a lot of volleyball at Wave World,” explained David to Roxy, “these guys kind of think of themselves as the local champs.”\n\n“Did we ever lose a game there?” cut in Pete.\n\n“No...but the competition bar wasn’t exactly set very high either.”\n\n“As our team captain, you should have more confidence in us,” threw in Roger.\n\n“You were team captain?”\n\nDavid smirked back at Roxy between bites, “There wasn’t a ton of people vying for the job.”\n\n“Come on, David, this may be our last chance to defend our title!”\n\n“There was no title! We just pretended there was, but I see your point.”\n\nAfter they finished their meal, David led them over to the court, and they politely challenged the group playing to a match. Roxy stripped off her top deciding that at the very least her assets might be a distraction to the other team. \n\n“You’re not playing?” she asked Stacie who stayed put as the others moved off.\n\n“I was more like the designated mascot. It’s o.k. I’m too short to be effective, but I don’t mind cheering.”\n\nRoxy joined the rest of them on the court.\n\nDespite David’s self-deprecating assessment of his abilities as well as those if his friends, they turned out to be a solid team. They took the match two games to one with David scoring the winning point on a wicked looking spike set up by Chris. High fives were exchanged all around, but it turned out their performance had an audience.\n\n“What do you say we get the winner?” said a familiar voice.\n\nTodd strolled out into the clearing followed by half-a-dozen of his brother bikers. They were an intimidating looking group, and David pulled his friends aside to discuss things.\n\n“This feels like the guards vs. the prisoners in that old Adam Sandler movie,” remarked Chris.\n\n“‘The Longest Yard,’” said Pete.\n\n“It was a Burt Reynolds movie,” corrected David.\n\n“Nah, he was in it, but it was definitely an Adam Sandler movie.”\n\n“I’m talking about the movie from 1974.”\n\n“Adam Sandler would have been like five he couldn’t have been in that,” said Chris confused.\n\n“He wasn’t. I was talking about the original movie, not the piece of shit remake!”\n\n“There was an original movie?” asked George.\n\n“Yeah! In 1974. It was the one with Burt Reynolds.”\n\n“Burt Reynolds wasn’t in the Adam Sandler one? Cause I could have sworn...” started Chris.\n\n“No, he was in it, but he didn’t play the same part. He was like a coach.”\n\n“I thought Adam Sandler was the coach?” \n\n“He was, but like a player/coach. Just like Burt Reynolds.”\n\n“Wait...Burt Reynolds was the coach? Was that in the first one or the other one?”\n\n“Technically both, you see...”\n\n“Oh! For fuck’s sake! Are you movie historians going to debate this shit all day or play volleyball?” said an exasperated Roxy.\n\n“Right...I guess we should play,” said David uncertainly.\n\nGeorge looked over to where the bikers were stripping off their shirts revealing lots of very detailed, and in some cases very intimidating ink.\n\n“Are we sure about this? If we win, are they going to take it well, or like, want to rumble?”\n\n“Rumble? What the fuck, George? Your mom still making you watch ‘West Side Story,’ with her when she’s bored?” questioned Chris.\n\n“Those were street gangs, not bikers,” put in Roger.\n\n“Well, thank you, Mr. Hollywood. I had no idea...”\n\n“Give me the damn ball!” snapped Roxy.\n\n“We’ll play,” she said, walking back toward the court.\n\n“I guess we’re playing guys,” said David to his friends falling in behind Roxy sheepishly.\n\nThe two sides turned out to be surprisingly evenly matched, and the advantage see-sawed back and forth. When it came to the game point in the final match, David found himself lined up right across from Todd. The shorter man’s muscular body ran with sweat making it appear like the skull tattooed on his chest was crying. Heather served, and the men on the other side returned it easily touching off a series of volleys that had both teams straining to make the return shot. Chris finally managed to get into position to set up an opportunity for David to spike the ball, but Todd leapt at the same time going for the block. The two almost met at the top of the net, but David’s greater height and athleticism gave him the advantage, and he managed to slam the ball through Todd’s out-stretched arms.\n\n“Game!” shouted Heather, touching off a small celebration on their side of the net.\n\nDavid ducked under and offered his hand to Todd who grudgingly took it letting the younger man pull him back to his feet.\n\n“Good shot, Kid.”\n\n“Thanks...You guys played well,” offered David seeing the unhappy faces all around him.\n\n“Maybe you’ll give us a rematch sometime?”\n\nBefore he could answer, Todd walked off with his friends in tow. Roxy joined David putting her arms around his sweaty waist.\n\n“Nice job, Babe, and I’m not just saying that because you put my ex-husband on his ass!”\n\nThe kiss he received for that effort wasn’t something David was going to complain about, although the look Todd tossed his way was not a happy one.\n\nStacie joined the group as they walked back toward the pavilion.\n\n“Check this out, guys! I found out they’re having a live band at the main hall tonight. We should come back, don’t you think?”\n\n“Fine, but I need a shower and a nap first,” whined Chris, stripping off his shirt much to Stacie’s discomfort as she tried not to stare.\n\n“I think you should ask Chris to dance tonight if the opportunity presents itself,” advised Roxy on their way back to camp.\n\n“I don’t know, Roxy. He’s so intimidating sometimes, like a surfer boy sex God,” she said, referring to Chris’s longish blond hair and sun-tanned body.\n\n“Did you just seriously call him a ‘surfer boy sex God,’” said Roxy with a giggle.\n\nStacie looked embarrassed but joined in.\n\n“What’s so funny?” inquired Chris, which just made the two girls laugh even more.\n\n“Chicks? Am I right?” said Chris to David as he walked by rolling his eyes.\n\n A HOT TIME IN THE OLD FOREST -\n\nIt turned out everyone needed a nap after the rigorous game, and by the time the evening rolled around the campsite looked like a day care room after lunch with everybody snoring almost in unison. As usual, it was Stacie who woke up first and got the others on their feet and cleaned up to eat dinner before returning to the pavilion. The evening air had cooled the outside temperature sufficiently that several of the group opted to wear jackets. Stacie was in her tent, sorting through her clothes to pick a shirt when Roxy ducked her head through the tent flap.\n\n“Hey, General. The troops are mustered out here.”\n\n“Thanks, I was just trying to decide what to put on under my jacket.”\n\nRoxy took a look at the two shirts she was holding and then stepped further into the tent shutting the flap behind her.\n\n“Don’t you have anything a little more flashy?”\n\n“I’m not sure what you mean by flashy?”\n\n“Something a bit more revealing.”\n\n“Roxy, I don’t exactly have a lot to reveal.”\n\n“You have more than you think, besides it’s not how big it’s how obvious.”\n\nThe two women quickly went through Stacie’s bag with Roxy holding up a dark blue shirt with a plunging neckline.\n\n“This is the ticket. Try it on.”\n\n“Are you sure? That was a gift from Heather. She made me bring it, but it’s not the kind of thing I would usually wear...” said Stacie doubtfully.\n\n“Let’s just see what it looks like on you, O.K.?”\n\nStacie donned the skimpier shirt, surprised at how well it fit. Though she was not big up top, she was quite perky, and what she did have was shown off nicely in the low cut top.\n\n“I feel so...slutty...,” she said with a giggle.\n\n“You look super cute, and I dare Chris not to notice. Come on.”\n\nThey could hear the music before they ever saw the pavilion, and when they arrived, it appeared that the whole park had turned out for the event. The band was taking up one small corner of the vast hall that had a massive stone fireplace at the far end, and people were dancing and clapping along with the music. A series of tables had been set up just inside the main doors where they sold lemonade and punch by the cup. \n\nEveryone seemed to be having a good time. \n\n“May I have this dance?” \n\nRoxy smiled and took David’s hand as they joined the gyrating crowd on the dance floor. \n\nThe band played both rock and country music, so everyone had something to listen too. \n\nThe next hour passed in a blur of dancing and pauses to get refreshments when things got overheated. Roxy noticed that Stacie was staying well back from the dance floor just watching the others most of the time.\n\n“Give me your jacket,” she said, going over to the smaller woman.\n\nReluctantly, Stacie shed the outer covering.\n\nA slow song had started playing, and Chris was by the punch table laughing with Roger and George.\n\n“This is your time. Go ask him!”\n\n“I don’t know, Roxy...”\n\n“There will never be a better moment. What’s the worst that could happen?”\n\n“I could throw up on is feet which given how nervous my stomach feels is a possibility.”\n\n“You’re going to be fine.”\n\nNudged along, Stacie took a deep breath and walked over to where Chris stood.\n\n“Hey.”\n\nHe looked down and grinned at his old friend.\n\n“Hey there, Short Stuff. What’s up?”\n\nStacie took another deep breath and let the words out like throwing a shot putt, all in one violent heave.\n\n“I think you should dance with me, lets go,” she blurted, grabbing his arm.\n\n“What? I...Uh...O.K.,” was all Chris managed to get out as she tugged him onto the floor.\n\nIt took him a second to realize it was a slow song playing, and he looked down at her not quite sure how to proceed, but finally, he put his arms around her slender upper body while she placed hers on his hips. They swayed slowly, awkwardly at first, but gaining confidence as they went.\n\n“Is that a new shirt? I haven’t seen you wear that before.”\n\n“This? Yeah...Heather gave it to me.”\n\n“It looks nice on you. Kind of sexy if you don’t mind me saying so...”\n\n“Seriously? You like it?”\n\n“Sure. I mean it’s different for you, but I like it.”\n\nStacie beamed up at the taller boy, and he returned her smile with his own.\n\n“How are you enjoying the campout?” she asked.",
        "“Loving every minute of it. It’s going to be a shame in a couple of weeks when Roger, Pete, and George go off to school.”\n\n“I’ll still be around, and so will David and Heather.”\n\n“I’m glad not all my friends are abandoning me,” he said, laughing.\n\n“Yeah...friends,” echoed Stacie unhappily.\n\n“How about you? Is this trip everything you were hoping it would be?”\n\n“Oh...It’s been great...really...exciting...” said Stacie distractedly.\n\n“Is everything alright with you? You seem a little...I don’t know...off?”\n\n“I’m fine...It’s just...”\n\n“Just what? Did I do something wrong? Too many short jokes?”\n\n“I don’t mind the jokes, Chris. It’s just...Do you ever...I mean have you ever...thought of me as anything more than just a friend?”\n\nChris wrinkled his brow, “I...Uh...Well...I never thought...”\n\n“Never thought what?” she pressed as he struggled with his words.\n\n“I guess I never thought you would be interested in me that way. I mean you’re so smart and sweet, and I’m just a big, dumb jock.”\n\n“I don’t think you’re dumb. I think you’re brilliant and kind and funny.”\n\n“Really? I didn’t know you held me in such high regard.”\n\n“Well, now you do you big dumb jock.”\n\nHe laughed, making her smile even bigger.\n\n“I just noticed something.” \n\n“What’s that?” asked Stacie, trying not to shake nervously in Chris’s arms.\n\n“I just noticed that you have gorgeous eyes.” \n\n“You like my eyes?” she said in a quiet voice, feeling a burst of warmth spread through her stomach.\n\n“I don’t suppose when we get back to the city you would like to go out sometime? Like get some dinner and hang out?”\n\n“Are you asking me on a date?”\n\n“Yeah...Yeah. I’m asking you out. What do you think?”\n\n“I think I would really like that, Chris.”\n\nThey turned slowly with the rhythm of the music, and Chris drew Stacie in tighter to him, letting her rest her head on his muscular chest. She caught sight of Roxy and David on the edge of the dance floor and gave Roxy a thumbs up.\n\n“I think I’m going to cry,” said Roxy.\n\n“Look at you playing Cupid. It’s about time, those two have been dodging each other since middle school,” observed David.\n\n“Romance is in the air,” said Roxy.\n\nDavid looked into his girlfriend’s beautiful eyes and began to lean in to taste her soft lips when a hand suddenly descended onto his shoulder.\n\n“David, we got a problem!” said George.\n\n“What’s wrong?”\n\n“It’s Pete. You better come on.”\n\nRoxy and David followed George back through the crowd, and he led them along the far wall of the room to a door they hadn’t noticed before. It opened into what turned out to be a game room with pool tables in the middle and pinball machines down one side. Pete was standing near one of the pool tables surrounded by a group of angry-looking bikers with Todd front and center.\n\n“What’s going on?” asked David.\n\n“What’s going on is your buddy here just lost and owes me a hundred bucks but doesn’t want to pay up!” said Todd in a low, angry voice.\n\n“Is that right, Pete?”\n\n“I think this is all a big misunderstanding. I thought we were playing a dollar a game.”\n\n“It was a dollar a ball, Kid.”\n\n“Yeah, that was the part I might have missed.”\n\nDavid pulled Pete aside with Roxy joining them.\n\n“I swear I don’t know what happened. I was up two games, and that Todd guy couldn’t play for shit, and then all of a sudden he turns into a can’t miss machine.”\n\n“Pete...Jesus. I wish I had known you were back here. I could have warned you. Todd hustles pool all the time. It’s one of the few things he’s still good at besides drinking. It’s the way he makes beer money when he hasn’t got a job,” said Roxy.\n\n“Shit! Well, still, I promise they didn’t say anything about it being a dollar a ball. At least I don’t think they did, that Todd talks really fast.”\n\n“Is this a private conversation or can anyone jump in?” said Todd joining the group.\n\n“Dammit, Todd! What are you doing hustling some kid? Isn’t this low even for you?”\n\n“Hey, now! No one held a gun to his head! He danced, and now he’s got to pay the piper.”\n\n“See the thing is I don’t actually have a hundred bucks...”\n\n“Well...Now, that is a problem,” said Todd with a hint of menace in his voice.\n\n“Oh! For God’s sake, Todd. Let the kid off.”\n\n“Honestly, I would for you, Roxy, but the thing is I can’t be seen to back down in front of my crew if you catch my drift.”\n\nThe rather dangerous-looking men still standing by the pool table made for an intimidating sight.\n\n“If I had the money I would give it to you I swear!”\n\nTodd was just about to say something, but Roxy cut him off.\n\n“I’ll pay for him.”\n\n“What?”\n\n“You heard me. I’ll get you the money.”\n\n“Fine. But the kid stays here until you bring it back.”\n\nRoxy headed for the door, but David caught her before she got there.\n\n“Where are you going?”\n\n“I left my wallet in the tent,” she explained.\n\nDavid looked nervously back at the bikers and then at Roxy.\n\n“I’ll go get it. I think it would be better if you stay here with Pete. You have a better chance of keeping him safe from Todd until I get back.”\n\nRoxy pursed her lips in thought but realized that David was probably right.\n\n“It’s in my pack in the tent in a pocket on the right side. Hurry back...”\n\n“I will. George can stay with you too.”\n\n“Great...I might get that rumble yet,” said George with a distinct lack of enthusiasm.\n\n“Just don’t take too long, and we should be fine,” said Roxy.\n\n*\n\nDavid moved as swiftly as he dared through the darkened woods holding his flashlight in front of him. The trail was easy to follow, but the ground could be uneven, and he didn’t want to fall on his face. The campground was practically deserted with just about everyone up at the pavilion, and he was thrilled when he finally spotted the familiar tents. Just as Roxy had said, her wallet was in her pack, and he stuffed it into his jacket pocket zipping up the tent as he backed out.\n\n“Fancy meeting you here,” said Heather from behind, startling him into dropping his flashlight.\n\nShe turned up the light on the lantern that Chris had left on the picnic table just enough to illuminate the clearing.\n\n“Crap! Heather, you scared me! Where did you come from?”\n\n“I saw you were leaving the hall, and I followed you. I’ve been hoping to get you alone all weekend so we could talk.”\n\n“Look, this isn’t a good time, Pete sort of got himself into a mess.”\n\n“Do you remember when we went on that hayride at the Halloween Fair the fall after we hooked up for the first time?” she asked, ignoring what he had been saying.\n\n“Halloween Fair? Yeah...I remember. What about it?”\n\n“It was a cool night outside, and you told me the best way to warm up on a cool night was with a kiss.”\n\n“Did I say that? Man, that was pretty lame. What can I say I was just a kid at the time. Anyway, I need too...”\n\n“I’ve been thinking a lot about us lately, David. I figured if I gave you some time with Roxy, you would start to see.”\n\n“Start to see what?”\n\n“That she wasn’t right for you. I mean I get it, she’s hot as heck. I can see why you would get sucked in by that, but at the end of the day, you will never have with her what you and I had. What we could still have...”\n\n“Heather, we’ve had this conversation once already.”\n\n“I remember, and you said that we both had a lot to learn. Well...I’ve learned, David. I can see what you want now, and I can be that for you. You never wanted the girl next door, did you? No...You wanted something more.”\n\nHeather rose from the table and started walking toward David, closing the distance.\n\n“Heather...What are you doing?” \n\n“It’s o.k. I’m not angry. You just got tired. I can understand that having to look at the same boring girl day after day. I didn’t keep things interesting enough for you, but I think we can both see that I’ve fixed that problem.”\n\nDavid froze not quite believing what he was seeing as Heather reached up and pulled the zipper down on her jacket. Apparently, she had taken the time to remove her shirt and bra, because when the zipper hit bottom, and the two halves fluttered open it was nothing but bare skin underneath.\n\nHe squinted in the low light.\n\n“Um...When did you get your...Uh...you know?” he said, waving at her naked chest.\n\n“My nipples pierced? Do you like them?”\n\nShe reached up to lift her firm young tits in her hands the skin of her dark pink nipples bisected by shiny gold. \n\n“It’s...um...Wow...different...” said David struggling for words.\n\n“It excites you, doesn’t it? I know you still want me, David. I’ve seen the way you’ve been reacting to my new look all weekend, and I’m glad because I did it for you. I wanted to be the sexy woman you deserve.”\n\n“Heather...It wasn’t...I mean you look great....but honestly...”\n\n“My stylist picked this lipstick for me. She said it would make my lips look luscious with this hair color. What do you think?”\n\n“I think she did her job,” admitted David.\n\nHeather moved right up to him seeming to melt out of the semi-darkness, her bright blue eyes flashing in the light of the lantern.\n\n“It’s o.k for you to feel them. I know you want too...” she said, suddenly grabbing his hand and pulling it to her chest. \n\n“Holy shit,” whispered David, so caught by surprise, he couldn’t stop what was happening. Her breast did feel wonderful, all warm and silky soft, but with a hint of cold hardness where the metal of her piercing rubbed on his palm.\n\n“I want you so bad right now, David. I swear I’ve never been this wet in my whole life, and I did what you always wanted me to do. I shaved it bare just for you...” she said, leaning close enough to whisper those last words in his ear.\n\n“Jesus...Heather...” said David, his voice cracking badly.\n\nHer head moved down, and he felt her kiss his neck, her slick lips rubbing on his pulsing jugular. A hand was suddenly between his legs, and she squeezed his cock through his pants.\n\n“Damn...You’re so hard...I knew you wanted me. Take me right now...Fuck me, David...Fuck me hard and deep...Make me yours again,” she begged.\n\nIt would be so easy. Three moves, less if he didn’t care about ripping her panties, and he would be inside her again. His whole body was screaming at him to do it. Once again, to feel Heather’s legs wrapped around him, that now slick, bare pussy squeezing his throbbing cock. She was so beautiful, so sexy, so ready for him. There was only one problem...she wasn’t Roxy.\n\nHis hands dropped downward toward Heather’s pants, and she tensed ready for him to unbutton them, rip them off her, carry her to the table. \n\nOnly his hands didn’t stop at her pants. They continued down to grasp the two halves of her unzipped jacket, fitting them back to each other and carefully zipping it shut again.\n\n“This isn’t going to happen, Heather. I’m sorry. You will always be in my heart, always be my friend, but I don’t want you...not like this...”\n\nHe turned abruptly and brushed past her heading off up the trail.\n\n“David! Wait!” called Heather, who took off after him.\n\nThe tension in the room was almost palatable, and Roxy had taken to standing between Pete and the assembled bikers in case any of them got any ideas. She glanced down at her watch, wondering what was keeping David.\n\nHe should have been back by now. \n\nThe door to the room opened, and David appeared with Heather right by his side.\n\nRoxy grabbed the wallet out of David’s hand and turned back to Todd, opening it and counting out the money.\n\n“There! Are we square?”\n\nTodd looked at the cash in his hands and back up at his ex-wife.\n\n“Sure...You win, Roxy. Just like always.”\n\nHe left the room with the rest of his crew following behind.\n\n“Come on, Pete. I think you’ve had enough billiards for tonight. How about a lemonade?” offered George, pulling his friend by the arm.\n\nRoxy turned back to her boyfriend, “What took so long? I was starting to worry.”\n\n“I ran into a little trouble...” David started to say, but Roxy was wrinkling her forehead as she came closer to him. She reached up and wiped her fingers on his neck, looking at the shiny color that came off his skin.\n\nA color that matched the lipstick Heather was wearing.\n\n“I think I can see the trouble you ran into...Son of a bitch!” snapped Roxy pushing past David and heading out of the room.\n\n“Roxy! Wait! Please...” called David following in her wake.\n\nHis girlfriend was like a bull in a china shop, pushing past people in an effort to make the door with David trying desperately to close the distance.\n\nHe reached her just as she hit the wooden walkway out front of the pavilion managing to pull her to a halt.\n\n“Roxy, if you would listen to me! I swear to you nothing happened. I mean clearly something happened, but I stopped it before it went anywhere.”\n\n“How did you stop it exactly? Did you hold her face to your neck until she surrendered?”\n\n“It wasn’t like that...”\n\n“I thought I could trust you, David! After all you know about me and what I’ve been through how could you...How could you do this to me!?”\n\n“I didn’t do anything. I promise you, Roxy. Let’s go back to camp and talk.”\n\n“You know how much you sound like Todd right now? How many excuses I’ve had to listen to in my life? I swore I’d never put myself through that kind of shit again!”\n\n“I’m not Todd. That’s not fair of you to put me in the same category as him. I’ve never given you one reason to doubt my feelings for you.”\n\n“Until tonight!” she shouted, trying to turn away, but David held tight to her arm.\n\n“No! Not even tonight! Yes, Heather came on to me back at camp, and she tried to get me to sleep with her, but I pushed her away. I didn’t want her, Roxy. You’re the only woman I want.”\n\n“Why?”\n\n“What?”\n\n“Why do you want to be with me? What about me makes you want to stay because I don’t see it? I’m quick to judge and filled with all this distrust and anger. Hell! Maybe you are telling the truth right now! I don’t know, and a part of me doesn’t care. This is the kind of crap I was staying away from...you open yourself up, and you leave your heart bare to getting broken all over again.”\n\nTears were flowing freely down her face now, and David let her arm drop free.\n\n“This isn’t about me, is it?”\n\n“I should go...I want to go home, David. You deserve to be with someone who has something more to offer you than a nice body. Someone you can start fresh with without all the crap that would weigh us down,” she said in a quiet, defeated voice.\n\n“You think you have nothing to offer? Roxy, that’s the biggest load of horse shit I’ve ever heard!”\n\nShe looked up shocked at the anger in his tone, an anger she had never heard from him before in the time they had been together.\n\n“You don’t see yourself the way I do. Do you know what I see when I look at you? I see the woman who watched out for me at the plant and protected me from the other guys. I see the woman that was willing to face her fear to help me mend my broken heart and ended up being the cure for it. I see a woman that has never let her problems keep her down. Who put herself through school so she could give her daughter a good life, and worked her way up to managing her department when she was only twenty-nine. A woman that was willing to open her life up to me when she had no reason to believe I was more than a kid with a crush and gave me a chance to prove her wrong. You’re brave, selfless, intelligent, and kind. I can’t imagine a woman I would rather be with than you, but maybe you’re right, maybe you can’t see that and never will.”\n\nDavid reached into his pocket, jerking his car keys out and tossing them at Roxy’s feet.\n\n“There! Go! I can get a ride back with Chris, but you remember this much, I wasn’t the one who quit on us!”\n\nHe turned abruptly and headed up the walkway, making a sharp left and passing a sign that read “Harlow Trail,” his feet picking up speed as he went.\n\nRoxy watched him go with a blank expression, bending down to pick up the keys at her feet.\n\n“David!” she shouted, starting after him.\n\n“I would let him go if I were you,” said Heather.\n\nRoxy rounded on the smaller woman, “How long have you been standing there?”\n\n“Long enough. I would let him go. David doesn’t lose his temper often, but it’s better to let him cool off when he does. He’ll be ready to talk when he gets back.”\n\nHeather didn’t wait for an answer, but turned and went inside the pavilion leaving Roxy alone in the dark.\n\n“Dammit...” said Roxy.\n\n*\n\nThe trail wasn’t hard to follow now that the moon was out, and David only had to use his flashlight intermittently. He practically knew this one by heart anyway, and his feet seemed to find their footing on their own without much conscious intervention. It wound around the edge of the river and eventually brought him back to the place where he and his friends had been diving that very morning. The trail continued past, and he walked on moving upward now toward a patch of high rocky ground that folks had nicknamed, “Lookout Point,” it was as good a place as any to do some thinking and clear his head. He had fully expected to have the place to himself with most everyone down at the pavilion, so he was surprised when he rounded the bend to find a man standing at the edge smoking a cigarette.\n\n“Sorry...I didn’t think anyone else would be up here,” said David to the shadowy figure.\n\n“Huh? Would you look at that! I guess great minds think alike,” said Todd turning around.\n\n“Fuck me...” thought David to himself, “What did I do to deserve this day?”\n\nThe two men regarded each other across the distance. \n\n“I was looking for some privacy,” said David simply, not wanting to have a drawn-out conversation with Todd. \n\nHe started to turn around.\n\n“What’s a matter? You get into it with Roxy?”\n\nDavid’s step faltered, and he looked back at Todd thrown by his accurate analysis of the situation.\n\nThe other man caught the look on David’s face and smiled.\n\n“I could have guessed. I used to try and put some distance between her and me when she was pissed, spent a fair bit of time looking for a quiet place myself.”\n\n“It wasn’t like that exactly. We had a disagreement, but I think I was the angry one,” admitted David, not sure why he was bothering to explain things.\n\nTodd nodded, took another drag on his cigarette, and looked out at the view of the forest below.\n\n“So you came up here to clear your head? This would be a good place to do it. A man can stand here and get lost in this view. I wish the apartment Roxy and I used to live in had sported a view like this one.”\n\nWhen David didn’t respond, Todd reached inside his jacket and pulled out a flask offering it to him first. David shook his head, but Todd didn’t seem offended by the gesture just pausing to take a drink himself shaking a little as the alcohol burned its way down his throat.\n\n“Shit! That’s got some kick! You’re probably smart to decline.”\n\n“I don’t drink,” said David.\n\n“Good...It’s best not to start. It can get you by the throat and never let go.”\n\n“Is this where I’m supposed to start feeling sorry for you?”\n\n“Ouch! You got a little Roxy in you, don’t you? Ha! That’s o.k. it almost makes me nostalgic to hear your sarcasm.”\n\nDavid didn’t know what to say to that and pushed his hands into his pockets, taking a few steps closer to the edge to get a better view of the valley.\n\n“I’m not looking for your pity, Kid. I’ll offer you this much though, whatever her faults Roxy was the best thing that ever happened to me, and I fucked it up plain and simple.”\n\n“I honestly don’t care about your sob story right now, Todd, no offense, but I’ve got my own troubles.”\n\nTodd took another drink from his flask eying the younger man.\n\n“I’ll just bet you do. What’s wrong? Roxy forget to put milk in your cereal?”\n\n“If that was supposed to be a crack about our age difference, you should try harder.”\n\n“Can’t be easy though you just a kid and all, and her a grown woman with all her responsibilities.”",
        "“You’re one to talk about responsibilities, Todd. When was the last time you came by to see Emily?”\n\nTodd’s eyes narrowed into an angry stare, “I don’t need some snot-nosed kid trying to give me parenting advice!”\n\n“Somebody should because you’re doing a shitty job!”\n\n“Why you little cocksucker! What do you know about being a dad?”\n\n“You don’t have to be a father to tell a bad one when you lay eyes on them. If you loved Emily as much as what’s in that flask you’d toss it off this cliff and start acting like the father she deserves.”\n\nTodd grabbed David by one arm. \n\n“You think I don’t know that? If it were that easy, I would have done it a long time ago! I’d still be with Roxy instead of watching her look at you the way she used to look at me.”\n\nThe two of them faced each other, Todd panting and trying to control his temper.\n\n“What now, Todd? Are you looking for a fight? The way things are going for me tonight I just might give you one!” said David defiantly.\n\nTodd snorted and took a step back starting to laugh, “Ah Hell! I just bet you would! Roxy sure knows how to pick her men. You got some fire to go with those brains, Kid.”\n\nDavid had raised his fists in expectation, but now he lowered them not sure what to make of Todd’s mood swings.\n\n“You’re a strange guy, Todd.”\n\n“Funny thing is there was a time when I wasn’t much different than you.”\n\n“That’s hard to imagine,” admitted David.\n\n“I know. I can hardly remember those days myself. Why I recall...What?” asked Todd seeing David make a strange face.\n\n“Do you smell that?”\n\n“Smell what? I swear I just bathed this morning!”\n\n“Not you...It smells like...smoke.”\n\nBoth men turned at the same time to see a cloud of white smoke rising from far down the trail behind them, and a dull glow that was brightening and spreading rapidly in their direction.\n\n“Uh...Oh...” said Todd.\n\n“We could be in some serious trouble,” agreed David.\n\n*\n\n In the pavilion the band played on, but where fun and joy had characterized events earlier things had taken a dark turn. Roxy stood leaning against one wall running her thumb across David’s car keys while Stacy and Chris had come over to her trying their best to be consoling. Heather was standing off by herself near the refreshment tables looking back at Roxy with an expression that seemed a mix of disappointment and anger.\n\n“Heather’s right about one thing. David does tend to want space when he’s upset. I’m sure he’ll be back and ready to talk in no time,” suggested Stacie.\n\n“I’m not sure what to say to him,” said Roxy forlornly, still looking down at the keys in her hand.\n\nMaybe it would be easier to do what she had threatened to and go? \n\n“I’m sure we can think of something brilliant if we put our heads together.”\n\nRoxy gave her young friend a fleeting smile that was all too quickly replaced by a mask of sadness.\n\n“You’re sweet to try and help, but I don’t know if things even should be fixed whether they can be or not.”\n\n“Don’t say that! You and David are so perfect for each other!”\n\n“You have the heart of a poet, Stacie, but that this isn’t a romance novel. Things between David and I are a lot more complicated than a Harlequin book plot.”\n\nRoxy said these words looking over at Heather, and the object of her scrutiny was not lost on Stacie and Chris.\n\n“Heather? Heck, Roxy, he probably got tired of hitting that long ago. I mean, he was tapping her for so long why would he want to go back to the well?”\n\n“Chris, you’re not helping,” said Stacie with a grimace.\n\n“Right...Uh...I think I’ll go check up on Pete,” said Chris making a hasty exit.\n\nStacie put a hand on Roxy’s shoulder desperately searching for the words to make things better, but at a loss as to how to proceed. Her thoughts on the subject were interrupted when the band suddenly stopped playing, and the sounds of feedback from one of the microphones being adjusted caught everyone in the rooms attention.\n\n“Excuse me, folks! I’m sorry to interrupt the festivities, but I have some important information, and I need you all to listen to me carefully.”\n\nThe hall went silent, and all eyes were now on the man behind the microphone who wore the uniform of a park ranger.\n\n“We’ve had reports of fire between here and the head of Harlow Trail. It’s relatively small at the moment, and we have contacted emergency fire services to try to get ahead of it, but in the interest of everyone’s safety, we are ordering the park to be evacuated. The good news is that the prevailing winds are blowing away from the main section of the park including the pavilion, so there is no immediate danger, but we would ask that everyone return to your campsites and pack up. Rangers will be moving from section to section clearing them and making sure that all our guests are accounted for as you leave. Thank you for your cooperation.”\n\n“Did he say ‘Harlow Trail,’?” questioned Roxy, “That’s where I saw David going.”\n\nA look of horror replaced the sadness that had covered her face, and she raced across the floor to corner the park official.\n\n“Sir! SIR! I need to talk with you!” she shouted to make herself heard over the din of the crowd.\n\nThe ranger paused with a walkie-talkie in hand telling the man he had been speaking with to stand by.\n\n“I’m sorry, Miss, I’m swamped...If you could just.”\n\n“My boyfriend went up Harlow trail a little while ago!” she blurted out.\n\n“Oh...I see. Well, we have search units out, and we will be calling in helicopters to lift out anyone that might be trapped on the other side of the fire.”\n\n“How long?”\n\n“It might be another hour before the choppers arrive,” he admitted.\n\n“I’m going to look for him,” declared Roxy, but the ranger shook his head.\n\n“The fire has already cut off the trail from the rest of the park. If he’s on the other side, you’d have no way to get to him. Our best course of action is to wait for the choppers to arrive.”\n\n“We can’t leave without our friend!” said Stacie from behind Roxy’s broad back.\n\n“I sympathize, but at the moment you should be concerned with your safety and leave your friend to us. I advise that you return to your campsite.”\n\n“Stacie’s right...We’re not leaving without David,” said Roxy with a tone of finality in her voice.\n\n“Look, I don’t have time to argue with you. You can remain at the pavilion for the moment, but you’re not to venture out on your own. If the wind changes direction, things could get dangerous quickly.”\n\nThe ranger moved off as the rest of the group arrived crowding around Stacie and Roxy, only Heather kept her distance.\n\n“What did he say?” asked Chris.\n\n“We told him about David, but there’s not much they can do until the search and rescue helicopters get here,” explained Roxy.\n\n“We should go find him ourselves,” said George, and Pete and Roger seconded him.\n\n“No one is going out there! The ranger is right. It’s too dangerous to go stumbling around in the dark with a forest fire burning nearby. I’m not leaving, but I think the rest of you should go strike camp and get ready to evacuate.”\n\n“If we’re not leaving David, we’re sure as Hell not leaving you!” said Stacie defiantly.\n\nThe others echoed the sentiment, and Roxy couldn’t help but be touched by their loyalty to their friend, and to her, a woman they had known only a short time.\n\n“O.K., We’ll stay together for now, but if things turn for the worse, you guys are all going.”\n\n“What next?” asked Roger.\n\n“Next...we wait,” said Roxy, knowing that it would be a lot harder than it sounded.\n\nDavid and Todd worked their way back down the trail together hoping to find a way around the fire, but it quickly became evident that the flames had already cut the main path back to the lower park. They tried a handful of side trails but were driven back at every turn by the smoke and heat. \n\n“This sucks,” griped Todd summing up their situation very succinctly.\n\nHe stopped by the side of the trail to take another drink.\n\n“That isn’t helping,” said David.\n\n“It can’t hurt.”\n\n“We’re cut off...” admitted David.\n\n“No shit, Sherlock! Unless we both figure out how to sprout wings, we are seriously fucked.”\n\n“You know, Todd, you’re a fountain of optimism. Why don’t you help me think of a way out instead of drinking yourself into a stupor!”\n\n“We’ve tried every trail! The best we can do is backtrack to the lookout and hope that a rescue party shows up before we roast.”\n\nDavid stood upright and promptly started to cough. The smoke was blowing thicker now in their direction. All to their front flames were beginning to shoot up lighting the night with a macabre glow. David imagined it was going to take a Hell of a lot of water to put this fire out, and wondered if there was any chance of rain.\n\n“I have an idea,” blurted David.\n\n“What?”\n\n“Just follow me and try to stay low.”\n\nThey moved off again this time running parallel to the fire, sometimes bulling through the underbrush when the trail didn’t go where David wanted it to or working their way around clumps of burning trees. They were both wheezing and had picked up more than a few scrapes and scratches by the time David called a halt to their march. The fire was bright enough to light their path now, and David put his flashlight away. The trees had parted in front of them, and the two men gazed on the rocky stretch where David had been diving just a short time ago.\n\n“This is a ‘dead end’! Why did you bring us here? We would have been better off on the high ground. Helicopters can’t get down through these trees!” groused Todd.\n\n“We aren’t waiting for rescue,” said David, who began removing his hiking boots and stripping off his jacket.\n\n“What the Hell are you doing?”\n\n“I have a plan, Todd, but you’re not going to like it.”\n\n*\n\nThe sirens from emergency vehicles arriving began adding to the controlled chaos of the evacuation. Roxy had felt the need to get away from everyone else and had gone to stand out on the back porch of the pavilion. From her vantage point, she could see the river as it followed its course past the lodge and down toward the park entrance where it eventually turned to empty into Sequoia Lake a few miles away. A group of emergency personnel were setting up a command tent near the boat dock, and she watched them at their work, wondering if they were doing anything about her missing boyfriend. \n\n“George says you can see the smoke billowing up in the woods from the front of the pavilion now.”\n\nRoxy didn’t bother to turn at the sound of Heather’s voice from behind her.\n\n“We’ll be alright as long as the wind is blowing away from us,” said Roxy.\n\n“I wasn’t thinking about us, and I’m sure you’re not either.”\n\nRoxy looked down at the keys in her hand. She hadn’t been able to bring herself to shove them in a pocket. Instead, she kept squeezing and rubbing them like worry beads thinking that in some way they brought her closer to David. It ate at her that their last words to each other had been angry ones.\n\n“I wish we hadn’t been fighting when he walked off. I hate to think our last words to each other would be those,” admitted Roxy out loud.\n\n“I’ve never known David to hold a grudge. He was probably over it by the time he hit the head of the trail,” said Heather as she stepped closer.\n\n“Are you trying to make me feel better?”\n\nHeather laughed, “Strange coming from me, right?”\n\n“How is everyone else doing?”\n\n“Oh, Stacie has them organized and helping the rangers pass out water bottles to the firemen. That girl is going to make a great Red Cross worker one day.”\n\n“At least it gives them something to do to take their minds off things.”\n\n“You mean off, David.”\n\nRoxy looked out at the woods at the mention of his name, and tears began to form at the corners of her eyes. Heather looked at her for several heartbeats, a slow look of sympathy coming into her eyes. \n\n“You love him.”\n\nShe didn’t answer, but given the stricken look on her face, she didn’t need too.\n\n“Have you told him?”\n\n“We only just met, and our relationship has a lot of obstacles to it. I guess I just wasn’t sure it was the right time. Hell, I’m not sure how strongly David feels about me.”\n\n“Based on what he said to you in front of the pavilion, I think it’s safe to say he feels pretty strongly.”\n\n“Maybe so...” she said, her voice drifting off as she caught sight of the fires glow now becoming visible even from where she stood.\n\n“You should tell him, Roxy. When you see him again, you should tell him. Remember what Stacie said when she read your cards, ‘You have to believe in the relationship for it to work.’”\n\n“That Tarot stuff is a lot of nonsense.”\n\n“Are you dismissing it because you think it’s a load of crap, or because it might be true and that makes you even more uncomfortable?”\n\nRoxy struggled to answer, but Heather continued anyway.\n\n“Don’t wait to tell him how you feel. You don’t want that regret. I may be a kid to you, but I’ve experienced plenty of that kind of pain lately, and I know how bad it sucks.”\n\n“Since when are you the big champion of my relationship with David?” \n\nHeather looked away, guilt painting itself on her features.\n\n“I haven’t been before this, but you should know that David was telling you the truth earlier. What happened at the campsite was all me. I threw myself at him, practically stripped naked in front of him and begged him to take me back, but he pushed me away. David doesn’t want me anymore. He wants you...The way he used to look at me...The way I miss so much...that’s how he looks at you. I can get as jealous as I want, but that will never change. I see that now.”\n\n“Thanks for being honest with me,” said Roxy as tears now streaked Heather’s face as well.\n\nThe sounds of more vehicles arriving momentarily drowned out further attempts at conversation, but the noise soon faded.\n\n“David is going to be alright. He’s going to make it back to us,” said Heather, her voice suddenly steady and resolute.\n\n“How can you be so sure?”\n\nTo Roxy’s surprise, the younger woman reached over and took her hand, squeezing it tight in a comforting gesture.\n\n“Because I can’t imagine living in a world without David Cross in it, and I wouldn’t want too.”\n\nThey turned back together facing the rising glow, both praying for the safe return of the man they loved.\n\n*\n\n“You want me to what?” shouted Todd.\n\n“Jump! We’re going to get a good running start and jump to the river. I’ve done this plenty of times, and it’s relatively safe. Once we’re in the water, the current will carry us downstream right to the main camp area. The fire can’t get to us on the water, so we should be fine.”\n\nTodd stepped closer to the edge, but couldn’t see much below.\n\n“You ever do this in the dark?”\n\n“No,” conceded David, “but it shouldn’t make much difference.”\n\n“I don’t know, Kid. I think we should take our chances waiting for that rescue.”\n\n“A rescue we don’t even know for sure is coming? I’d rather make my own fate, thank you very much. Come on. You’re the macho biker. What’s a little jump of twenty-five or so feet to a guy that rides a Harley?” said David, throwing in the last part in an attempt at levity.\n\n“Right...” said Todd still not sounding convinced.\n\n“I’ll go first if it makes you feel better,” offered David.\n\nTodd didn’t answer but stopped to pull out his flask instead. David angrily knocked it from his hand, and the two squared off again just as they had at the lookout.\n\n“What the Hell is wrong with you? If we stay here much longer we’re going to die anyway!”\n\nTodd mumbled something that David couldn’t hear.\n\n“What?”\n\nAgain Todd mumbled, though slightly louder, but over the crackling of the fire, David missed his words.\n\n“You’re going to have to speak up!”\n\n“I said I can’t fucking swim! O.K. Hotshot! I can’t fucking swim, and if I jump off that cliff I’ll be just as screwed!”\n\n“You and Roxy both? What’s the deal with you guys? I know we live in a desert, but come on!”\n\nTodd kicked the ground in disgust, “I figured I’d get around to it eventually...”\n\n“Look...We’re not going to quit and sit here, and I’m not going to leave you. You can do this, Todd. The current is going to carry you down around the next bend, and you’ll hit a sand bar there. I’ll go first and pull you out of the water. Once we’re on the other side, I can help you stay afloat as we go downriver. I’m a great swimmer, and lifeguard trained.”\n\n“Ah...Shit! O.K., but if I drowned it’s on you!”\n\nDavid nodded, thinking Todd drowning might not be that much of a loss, but then felt bad for wishing such a fate on Emily’s father.\n\n“You ready?”\n\nTodd kicked off his boots, lamenting the loss, and picked up his flask from the ground shoving it into his back pocket.\n\n“Well?”\n\n“Yeah, yeah. I’m ready God Dammit! Feel like fucking Butch and Sundance...”\n\n“I go first. You count to twenty and follow.”\n\nTodd nodded, looking sick, but David quickly tuned him out, focusing on what he needed to do. \n\nHe took off, legs pumping, the dark edge of the cliffside intermittently lit by the flickering light from the flames behind him. Then he was airborne, arms pin-wheeling as he plunged downward toward the barely visible surface of the water below. The impact was jarring and cold, almost stealing his breath away. He broke the surface, the current sweeping him forward precisely as he had said it would. In the dark, it was challenging to tell distance, but the water shallowed up before the sand bar, so he knew he was getting close when he felt his toes dragging. Soon, the depth had dropped even more, and he was able to stand and walk up onto the sandy obstruction that blocked two-thirds of the river at this point. Here, away from the cliffs, the fire was raging on both sides of the river, and he could feel the heat all over his body. Smoke drifted across the water, and he stayed low fighting back the need to cough as his eyes searched the blackness from back the way he had come looking for Todd. \n\nIt didn’t take long to locate him. The sounds of the fire were almost lost in the cacophony of loud curses that were coming out of Todd’s mouth as the older man fought to pull himself upright. \n\n“Son of a bitch! I am never fucking doing that again!” wailed Todd.\n\n“Are you o.k.?” asked David.\n\n“I think so, but I lost my flask!”\n\n“I honestly don’t see that as a loss.”\n\n“It’s hotter than Hell down here!”\n\n“I know. We need to keep moving. It gets deep past this point, but I’m going to help you stay afloat. Let me do the work, and stay limp in my hold.”\n\n“You’re the boss,” conceded Todd eying the water unhappily.\n\nDavid stepped into the current first, holding himself long enough to pull Todd in with him, and then they were swept swiftly along. Almost immediately, Todd began to flail around making things difficult on David.\n\n“I told you to hold still, dammit! I’ve got you!” yelled David into Todd’s ear.\n\nThankfully, Todd’s struggles ceased for the most part, and he was able to keep one arm around his girlfriend’s Ex while using the other to pull them along a bit faster. The current was getting stronger, picking up speed and that helped because the further they went, the harder it was on David to keep them both up in the water. His muscles began to tire, and he longed to swim to the bank for a break, but this was hardly an option with the woods on both sides in flames. \n\n“Come on...” thought David, looking for the point where they would be past the fire, but so far it still stretched out before them, a liquid road lit by flaming trees.\n\n“Are we there yet?” moaned Todd who was facing backward in David’s grip and couldn’t see.\n\n“Why, you gotta pee? Feel free...”\n\n“Very funny, Smartass! I can see you why you and Roxy get along she loves that kind of humor.”\n\nDavid started to retort when he saw that the flames were getting smaller and less pronounced among the trees, and in the distance, only darkness prevailed.",
        "“I think we’re coming to the end of it! We should be able to start angling toward the shore.”\n\n“Thank God!” shouted Todd.\n\nThe old pine tree had probably stood next to that river bank for the better part of two hundred years. It towered over its brethren like a saintly old grandfather watching over his kin. The flames that lit it from roots to boughs lent the trees final moments the aspect of a Viking funeral. The old trunk gave way, and the tree began to tip over, falling inexorably toward the river below. \n\n“We’re almost home free, Todd,” cried David before the snapping sound of wood breaking drew his gaze to the far bank, and the sight of a blazing tree falling right into the path where the current was pushing he and Todd. \n\nThere was no time to angle for shore, or even shout a warning to the man under his arm before it was upon them.\n\n*\n\n“Anyone wish we had brought the marshmallows with us?” \n\n“Jesus! Pete!” \n\n“Sorry, when I get nervous I like to joke.”\n\n“I don’t think this is a time to be joking, Pete,” said Chris beside him.\n\n“When Chris Michaels becomes the voice of reason we are fucked,” said George from where he sat on the steps at the back of the pavilion.\n\n“Thanks,” said Chris wryly.\n\n“Don’t mention it.”\n\nThe whole group was lounging trying to stay out of the way of the emergency personnel while awaiting news of their friend. The helicopters had finally arrived and were sweeping the forest with searchlights, but so far there had been nothing to report.\n\n“Here comes Roxy,” said Heather standing up.\n\n“Anything?” asked Stacie as soon as she was in earshot.\n\nRoxy shook her head, and the group seemed to deflate.\n\n“He’ll be fine. David is meant for greater things than to die in some stupid fire,” said Roger.\n\nThere was general agreement all-around at this, but Roxy could only shake her head again. She had been around long enough to know that great destinies or goodness had nothing to do with death when it came calling, and even the finest among us could be struck down by the whims of fate. \n\n“Shouldn’t someone call his parents?” suggested Pete.\n\n“Yes...but not just yet. Let’s give them a little more time,” said Roxy, looking back the way she had come at the bustling command tent.\n\nHeather came over and put a hand on her shoulder. \n\n“They don’t know about you and David do they?”\n\n“No...We were keeping things quiet until the summer was over.”\n\n“I can call them for you if you want?”\n\n“Thanks, Heather, but let’s hope we won’t need to call them at all. I’m sure that...”\n\nWhatever Roxy was about to say was cut off by the sounds of shouting from men gathered around the dock near the command tent.\n\n“We got a guy in the water over here!” yelled a ranger.\n\nThe entire group broke into a run toward the cry but were brought up short by another ranger standing at the edge of the dock.\n\n“Hold on there folks! Let the emergency crew do its job!”\n\nRoxy was barely able to hold herself in check standing just behind the rangers outstretched arms with the rest of David’s friends gathered around her like a mother duck with her brood.\n\nFrom out of the darkness, two men came escorting a third man between them. The man with them was wet, his hair singed and clothing ripped and torn. He was walking with a pronounced limp leaning on the other men, but when he spotted Roxy, he moved toward her shaking them off. The lights from the command tent illuminated his face.\n\n“Todd...” breathed Roxy.\n\nThe face of her ex-husband was bruised, and blood was smeared across his forehead where a small cut had opened. He came closer, stopping just a few feet away.\n\n“What happened to you?”\n\n“I was...out walking...taking in the view. The fire kind of spoiled it.”\n\n“Are you o.k.? How did you end up in the river?”\n\n“That’s the crazy thing. Your boyfriend showed up, and he and I were having a chat when the fire came...”\n\n“David! You saw David!” shouted Roxy lurching forward and shoving the ranger aside, “Where is he, Todd?”\n\nTodd was clearly uncomfortable, not able to meet Roxy’s face as he spoke to the ground.\n\n“That’s the thing...David came up with the idea to use the river to get past the fire. I can’t swim as you know, but he kept me up in the water. We were almost out of it...and then...there was this tree. It toppled right down on us...it...it all happened so fast. I’m sorry, Roxy.”\n\nHe finally lifted his face the pain of his story written in his eyes.\n\n“No...NO! Don’t lie to me, Todd. That’s all you ever do...lie...LIE...LIE! WHERE IS DAVID?” she screamed, starting to pound on his arms before the paramedics rushed forward to push her away.\n\n“I’m sorry, Roxy. I wish it had been me...It should have been me...He saved my life, but it should have been me...” cried Todd.\n\nRoxy staggered back the enormity of it finally landing on her.\n\nDavid was gone. She had lost him.\n\nThe tears she had been holding back came like a flood with more than enough water to have quenched a dozen raging fires. She wanted to yell or hit something, but nothing presented itself. Before she could come up with an alternative, she was surrounded by David’s friends all of them trying to hug her at the same time while they vented their own fury at the loss of their friend. Stacie was closest, sobbing into Roxy’s chest, and Roxy clung to the small woman running a hand through her tangled hair.\n\n“I’m so sorry, Roxy,” wailed Stacie.\n\n“It’s going to be o.k.,” said Roxy trying to make herself believe it and failing.\n\n“God Damn! Fucking Fire!” sobbed Chris standing a little apart from the others and looking back at the flames licking the sky in the distance.\n\nHeather pulled away and went to comfort Chris, wrapping him in a hug. \n\n“I don’t want him to be gone...” whispered Chris to her and she pulled him tighter, crying too hard to answer.\n\n“I’m sorry folks, but I have to ask you to clear this area, please...” said one of the rangers softly, clearly feeling for them but required to do his job.\n\nSlowly, they turned away from the dock and began to trudge back the way they had come.\n\n“Someone get a light over here! I think we got another one in the water!” came a loud voice from the dock.\n\nEveryone froze in place, and time seemed to come to a standstill as men rushed past the small group of friends and out onto the dock. A powerful light was switched on, and in the glare they could barely make out men moving at the end of the long wooden structure. It seemed like an eternity, and then a small knot of people was walking back toward them, leading someone in their midst. When the rescue workers reached the shoreline the glare fell away, and David’s smiling face emerged.\n\n“Oh! My! GOD!” shouted Chris, running full tilt back toward the dock, and scooping his friend up in a hug, “I thought you were fucking dead, you asshole!”\n\n“I’m not dead, Pal, but I would feel a lot better if you put me down,” replied David.\n\nHis friends gathered around, reaching out to touch him one at a time as if refusing to believe he was real until all their senses had confirmed it. \n\n“Hey! You tried to drown me!” shouted Todd from where he sat in a folding chair, being taken care of by a paramedic.\n\n“If I hadn’t dived down you and I would both be dead. I tried to tell you to hold your breath, but there wasn’t time,” shouted David back.\n\nTodd shook his head but looked relieved that his savior had survived after all.\n\nStacie managed to worm her way to the front and squeezed David so tight he thought he would bust.\n\n“Easy there, Mighty Mite! If you crack me open, you’re not going to find candy inside!” said David patting her on the head.\n\n“You scared the crap out of us!” she admonished him, still refusing to let him go.\n\nDavid was finally able to peel Stacie off him just in time to have Heather take her place. If her hug was slightly less fierce, it was only because she took pity on him and didn’t want to finish what Stacie had started. She reached up to touch his face and then chanced a quick kiss on his lips, pulling back with a smile.\n\n“Thank you for not dying. I don’t think I would have handled that very well.”\n\n“I’m kind of glad I didn’t die myself.”\n\nThere were more hugs and pats on the back, so much so that David felt like he was back at graduation until the group cleared off at last, and he was left with just his girlfriend who had waited patiently for the fervor to die down. \n\nRoxy came forward very slowly, taking measured steps the whole way until she was looking David in the face, close enough to feel his breath on her cheeks. The night wasn’t particularly cold with the fire and all, but she began to shake almost like she was caught in an Arctic wind. \n\n“I thought I lost you...” she said quietly.\n\n“No chance of that, Roxy. I was always going to come back to you.”\n\n“Are you hurt?”\n\n“A scratch or two, some bruises, mostly from Todd smacking me when we were underwater.”\n\nThey stood still, staring at each other, and Roxy began to cry anew with tears flowing down her cheeks.\n\n“You can hug me if you want,” said David trying to break the tension.\n\n“I’m afraid to.”\n\n“Why?” \n\n“I’m afraid if I start I’ll never let go,” she whispered.\n\nHe slipped his arms around her waist and pulled her to him. The minute her head reached his shoulder, she began to sob so hard it almost scared him, and he squeezed her tighter trying to calm her shaking body.\n\n“Hey, everything is fine. I’m right here...” he soothed, stroking her hair.\n\n“Don’t you ever do that to me again! My heart couldn’t take it.”\n\n“Never almost burn up in a forest fire? I think I can manage not to do that.”\n\nShe leaned back and smacked him on the chest playfully, finally finding a small laugh amid her relief.\n\nThey looked at each other again, her face red and shining with the tracks of her tears.\n\nRoxy looped her arms around his neck and pulled his lips to hers. The kiss lingered as she drank in the warmth of him, the firmness and strength she had come to admire so much in the past months. When they parted, she held him close still, so that their mouths hovered near to each other, so close that when she spoke her words seemed to vibrate against his lips. \n\n“I love you, David.”\n\nHe brushed his lips back against hers. A brief, soul felt kiss.\n\n“I love you, too, Roxy.”\n\n MAKE A WISH -\n\nThe venue might not have been Roxy’s first choice, but Emily had insisted that it was the only decent place to have a birthday party which is how Roxy found herself celebrating her thirtieth at “Mr. Smiley’s Fun Time Pizzeria.”\n\nThe guest of honor was sitting at the head of a long table watching her daughter standing next to Chris and Stacie. The former was holding a basketball in his hands facing a machine that gave out tickets for every shot you made.\n\n“Ten more and that giraffe is in the bag!” shouted Emily raising her fists.\n\nChris laughed, bouncing the ball off the ground a couple of times while sighting his target.\n\n“You got this right, Babe?” asked Stacie.\n\n“Do you doubt my basketball prowess?” questioned Chris with a raised eyebrow.\n\n“I have all the faith in the world in you,” she said, trying to sound serious but falling into a giggle.\n\n“Perhaps I could use some inspiration,” said Chris, and before she could ask him what form that might take, he had leaned over and planted a kiss on her sweet, red lips.\n\nStacie blushed but didn’t turn away, throwing her arms around the neck of her much taller boyfriend and returning his affection.\n\n“Ewwww...Why would you want a boy kissing you?” asked Emily making a face.\n\n“There may come a day when you don’t think that is such a bad thing, Sweetie,” replied Stacie.\n\n“I’d rather kiss a toad,” said Emily.\n\nThis got all three of them laughing before Chris finally turned and buried ten shots in a row guaranteeing his young friend her choice of prizes.\n\n“How goes the quest for low quality imported stuffed animals?” asked David as he returned from the restroom, and plopped down in the chair next to his girlfriend.\n\n“Sadly, they won. Which means I have to find room in my apartment for more junk.”\n\n“At least Emily is happy.”\n\n“I suppose that is the important part,” admitted Roxy.\n\nDavid reached over and placed a small, ornately wrapped box in front of her.\n\n“What’s this?”\n\n“What does it look like? It’s a birthday present! The last time I checked, you were the birthday girl.”\n\n“I told you that you needed to be saving your money for college not pissing it away on me.”\n\n“I’ve been putting most of my salary this summer away to help cover my school expenses, but I did manage to put aside some for this special occasion. Open it.”\n\nRoxy tried to look stern but ended up tearing into the gift like a kid on Christmas morning tossing the paper negligently aside before pushing open the lid. Inside the box, nestled in its velvet-lined interior rested a beautiful gold bracelet, plain and simple, but very elegant.\n\n“I figured you weren’t the flashy type,” said David.\n\nHe had worried after buying it that he should have gotten one encrusted with some jewels, or adorned with gold and silver flowers, but ultimately he had settled on this straightforward piece as more befitting his girlfriend. \n\nDavid could tell by her face he had guessed right.\n\n“It’s gorgeous, David. Thank you.”\n\nShe held out her wrist so that he could put in on her. When she raised her arm, the gold caught the light in the room perfectly, shining like a miniature sun.\n\n“This is the nicest thing anyone ever gave me. I love it.”\n\nThey traded a quick kiss, so as not to embarrass all the family’s sitting in the party area around them.\n\n“Does this mean we’re going steady?” laughed Roxy.\n\nDavid took her hand and laughed as well, but his words had an underlying seriousness.\n\n“I don’t think we’re quite at the ring on the finger stage, but I hope you would see this as a step forward.”\n\nHer face softened into an almost bashful look that wouldn’t have been out of place on a girl at her first prom.\n\n“Are you trying to get serious on me, David?”\n\n“I’m just trying to say that I’m not planning on seeing anyone else while we’re together.”\n\n“So we’re exclusive now, Huh? Does that mean I get to beat up any cute college girls that try to flirt with my boyfriend?”\n\n“Why don’t you leave that to me? I can keep an eye on David for you,” said Heather taking a seat across from the smiling couple.\n\nThis would have been more of a threat than a promise of help at one time, but the two women had reached an understanding since the fire. \n\nHeather was well aware of where she stood in David’s life, and she had come to accept her role.\n\n“See. I have eyes everywhere!” teased Roxy.\n\nDavid looked up as if pleading to the Heaven’s for help, but quickly joined his friends in their laughter.\n\n“Hey! We got a giraffe! Who wants to try Skee-Ball for that stuffed donkey?” asked Chris, loudly returning to the table with Stacie and Emily by his side.\n\n“What a great idea!” yelled Emily.\n\nIt was Roxy’s turn to look to the Heavens.\n\n*\n\nAs silly as the venue might have been, Roxy had to admit it had been the most fun she had enjoyed at a birthday party since she was a kid. David and his friends had been very sweet to both her and Emily, making sure that her young daughter had a good time that more than matched her mothers. The girl in question was sleeping soundly now, worn down and crashed out among a small jungle of stuffed animals.\n\n“Is the little princess sleeping?” asked David when she returned to the room.\n\n“She is indeed, and now I have one last birthday present I want to open.”\n\n“Oh? Did your family send you something?” asked David puzzled.\n\n“No...It’s kind of a present I got for myself. You stay here, and I’ll bring it.”\n\nRoxy vanished from the room, and David sat patiently on the couch, awaiting her return. He was leafing through a magazine when the living room light went out, leaving him in the semi-darkness with just the hallway light for illumination.\n\n“Hey! I was trying to read,” he said, looking up.\n\n“Wouldn’t you rather pay attention to my present?”\n\nRoxy was standing at the edge of the light in the skimpiest babydoll nightie David had ever seen. The sheer fabric barely covered her breasts, and it seemed useless in that regard anyway since you could see right through it. The top split just above her belly leaving her flat stomach bare down to her lower half which was largely exposed behind a very thin, lacy, black thong.\n\n“Honestly, Sweetie. That looks like more of a present for me than you,” said David thickly, not able to tear his eyes from Roxy’s sexy body.\n\n“I think of it as a gift that both of us can enjoy.”\n\nShe waggled a finger at him, and David swallowed and stood up from the couch, making his way over to his girlfriend, finding it harder and harder to walk as his cock rapidly swelled in his shorts.\n\nAs soon as he reached her, Roxy didn’t hesitate to pull him to her and cover his mouth in a hot, hungry, French kiss swishing her tongue in quick circles around and around. They both began to groan and breath more sharply falling back against the wall. David reveled in the feel of Roxy’s creamy, full lips sliding slickly with a fresh coat of lipstick all over his making him shiver with anticipation. He slid his hands down to cup her magnificent, tight ass giving it a good squeeze while she groaned into his mouth. \n\n“I think we need to take this to the bedroom,” she panted, grabbing David’s hands and yanking him in that direction.\n\nThey crashed into the bedroom door that swung back loudly, and only a diving save by David kept it from making a noise that might have awoken Emily. \n\nRoxy backed toward the bed, a wicked smile on her face, and David followed shutting the door behind them.\n\n“The birthday girl wants another gift,” she said in a sultry whisper.\n\n“What would that be?” asked David.\n\n“Your tongue in my pussy.”\n\n“I think that could be arranged.”\n\nRoxy lay back on the bed spreading her legs. David stripped off his t-shirt and quickly removed his shorts, leaving them on the floor. His boxers were stretched in front by the enormous erection he was sporting while he moved down between his girlfriend’s legs, slipping her thong to the side. The pink lips of her labia were already swollen and pulling back from the entrance to her vagina where the glistening flesh inside her seemed to beckon David’s tongue. He moved forward, gently kissing the top of her hairy Venus mound before letting his tongue trace a line across her wet slit. Roxy arched her back slightly moaning into the dark.\n\n“Oh! David! That’s what I need...Give my pussy a nice, deep, French kiss...”\n\nDavid gave a soft chuckle before he did as she asked and slipped his tongue inside her. \n\nRoxy gasped and grabbed at the bed covers.\n\n“Ah! God! Baby! You have no idea how bad I want you right now!” \n\n“I think I have a pretty good idea,” thought David.\n\nHe had never seen his girlfriend so wet, her vagina soaking with juice that quickly covered his face and seemed to pour out even more as he licked her pussy all over. In no time, Roxy was squirming all over the bed, unable to hold still while he ran his tongue around her clit and sucked her pussy lips into his mouth to nibble on. \n\n“Ah, fuck...FUCK! FUCK! David! God Damn! You have such a magic tongue! FUCK! You eat my pussy so good! Ah! Shit! I need to suck your cock! Please let me suck your cock, David!”\n\nDavid wasn’t one to leave a woman wanting, and he quickly divested himself of his underwear joining Roxy on the bed in a “69” position. She swiftly guided his cock into her mouth, and he groaned himself, nearly matching her enthusiasm. Her hands were on his hips pulling at him, making him push his cock into her mouth while he kept performing his oral gymnastics on her cunt. The sensation of fucking her warm, wet mouth while sucking on her clit was a huge turn on, and it took all his willpower not to cum right down her throat.",
        "“Ummmmm...David...I can’t suck cock like this while you eat my pussy! It’s going to make me cum!”\n\nHe couldn’t bring himself to stop despite her warning and he plunged back into her with his tongue licking even more frantically, while he shoved his cock deeper. Roxy lasted another few thrusts, and then her pussy erupted into one hard spasm after another covering David’s face in her cream. Her cries were stifled by his thick, hairy man’s cock shoved down her throat, but he could feel her screams vibrating through it. \n\nWhen she finally released him, she was fighting to catch her breath.\n\n“Sweet...Jesus...David...You always make me cum like a wildcat.”\n\nHe had rolled off of her, and was laying on his back now, his fat prick standing up off his virile young body like an ivory tower. Roxy slipped her nightie off over her head and straddled her boyfriend, letting his cock rub on her thong while she leaned over to dangle her huge tits in his face. David took the hint, and took hold of her love mounds kissing the sweet, bumpy skin of her areolas, feeling them grow tight forcing her nipples outward for him to suck on. \n\n“Damn...Roxy, I love to suck your tits,” he moaned.\n\n“Yeah, Baby? Do you like my big tits in your face? Um...I love how hungry you are for them...How hungry you are for me.”\n\nRoxy bit her lower lip as David nibbled on her sensitive nipples. \n\nDavid grasped at Roxy’s shoulder tipping her over onto her back again, and coming up between her legs. Staring down at her, so perfect and beautiful in the veiled light coming in through the window, his heart felt as if it would burst with all the emotions that flooded into him. \n\n“My God, Roxy. You’re so beautiful. The most beautiful thing I’ve ever seen.”\n\nHe reached out to push a loose strand of hair back away from her face, momentarily reminded of how he had done that very same thing outside Wave World not so long ago. \n\nRoxy covered his hand, holding it to her cheek. \n\n“I’ve never wanted a man the way I want you right now, David. I love you...I love you so very much. Please...I need to feel you inside me. Make love to me...”\n\nCarefully, David slipped her thong off and moved between her legs never losing eye contact, so that when he pushed himself inside, he got to watch the ecstasy filling her gaze.\n\n“Oh! DAVID!” she cried her eyes tearing brightly, tears of joy at feeling her young lover take her and own her body. Her hands roamed across his hairy chest, feeling the outlines of his tight muscles while he thrust forward making the bed shake.\n\n“Roxy! It feels so good inside you! I love you too, Baby! Ah! God! ROXY!”\n\nHe wanted to make it last as long as possible, but Roxy wasn’t making that easy as she pressed up with her hips to meet him, increasing the friction between their bodies. The surging in his balls grew unbearable. The need to release like a distant itch he had to scratch. \n\nDavid’s face took on a look of quiet desperation, sweat beading his brow, and running off his chest.\n\n“Roxy!”\n\n“I know! Me too! I’m ready, David!”\n\nTheir movements became more frantic, bodies slapping together in a frenzied melding of flesh until they both cried out in unison.\n\n“David! AHHHH! I’m cumming! CUMMING FOR YOU!”\n\n“ROXY! YES! YESSSSS! I feel you! I’m cumming! God! I love you!”\n\nThey drew back together, sliding into one another’s arms with Roxy’s head cradled on David’s shoulder. She brushed her fingertips across the damp hairs on his chest, twirling the strands around.\n\n“When I thought I had lost you in that fire, I felt something break inside me.”\n\n“We don’t have to talk about it,” said David stroking her hair.\n\nThe subject of what had happened in the forest hadn’t come up since their return, as if by silent, mutual consent they had decided to put it behind them. This had been fine with David, he hadn’t wanted to make Roxy relive that painful moment. Besides, he was alive, so what more was there to talk about anyway?\n\n“I want to talk about it. I need to say something to you.”\n\nRoxy shifted up onto her elbow so that she could look David in the face. He looked so handsome laying there, his hair all askew, smiling up at her. With one hand, she reached out to touch his face.\n\n“I’m sorry I doubted us, that I doubted what we have together. I promise you, David, I will never do that again.”\n\n“I’ll never give you a reason too.”\n\n“I know you won’t. You’re a good man, David. You’ve made my life, and Emily’s, a happier place. Whatever happens to us in the future, you will always be in my heart.”\n\n“The cards said our relationship would only grow stronger as long as we focus our primal energy.”\n\n“Do you have some primal energy you need to focus?” laughed Roxy.\n\n“I think you already know the answer,” said David with a grin.\n\nTheir bodies were quickly joined a second time, and in the faint light, Roxy caught a flash from the gold bracelet on her arm.\n\nThe gift that she knew would always remind her of the man that came into her life, and made her believe in love again. \n\n \n"
    ],
    "authorname": "darkoverlord6",
    "tags": [
        "mature",
        "mature romance",
        "older woman",
        "younger man",
        "sex outdoors",
        "student lover",
        "young lover",
        "public"
    ],
    "category": "Mature",
    "url": "https://www.literotica.com/s/a-boys-last-summer-pt-02"
}