{
    "title": "Dance with the Deacon",
    "pages": [
        "My job on that cattle drive had been simple. I was the hired gun. Oh it wasn't as obvious as the times I had been hired on to kill specific people. Nonetheless it was my position. The scout was an Indian and damned good at his job. My job was to ride along with him and make sure nobody killed him. I was also expected to hunt down rustlers. It would be nice if i returned the cattle in addition to the bodies of the rustlers. I am not sure how many other drives had a man like me on the payroll but Big Ed Williford believed in preventing trouble by having he fastest gun on his payroll. If he couldn't prevent trouble, he wanted to have the winning hand. Since there were few real gun hands on a cattle drive or rustling cattle he had the best man for the job.\n\nGun hands were cheap that shortly after the war of Yankee aggression. Like a lot of other men when I returned from the war I found the family farm sold to carpet baggers. I drifted west along with many other former soldiers. \n\nUnlike most of them I had been a sharpshooter during the war. I didn't fire my gun into the woods hoping to hit a target. I knew exactly when I had killed a man and there were many. My first year in the west I found that being willing to kill for money was about the only marketable skill I had.\n\n\"Pete, you and the Indian go on up ahead and try to find us some water. These cows are going to need water real bad soon.\" Big Ed gave the order over our morning oatmeal.\n\n\"Okay boss, you seen the Indian this morning?\" \n\n\"He is over with the horses. He seems to prefer them to us.\" Big Ed was smiling.\n\n\"Can't say that I blame him. Most of the time we act worse.\" I didn't think Ed cared much for the remark. I had been traveling with the Indian for three weeks. During that time I had seen him insulted ten times or more. It had not come down to guns yet thank god. I knew it was only a matter of time though.\n\nI walked to the rope line tied between two wagons. The Indian was working on a horse tied to the line. The horse appeared to have a hoof problem. The Indian was holding the hoof between his legs while he worked on it with a large pocket knife.\n\n\"Two, you about ready to go looking for water?\" I asked it knowing he was still busy. I wanted to hurry him along. As usual he looked up to acknowledge my presence but did not speak. He simply returned to the hoof trimming.\n\nI climbed down from my own horse. I wasn't sure how long Two was gonna be so I loosened the saddle cinch. With the horse about as comfortable as he was gonna be for a while, I made myself comfortable sitting on the ground leaned against the wagon's wheel. Whenever I had the opportunity I sat on the ground. I had always hated horses. Horses are stupid clumsy animals at best. \n\nI knew there was no sense trying to hurry the Indian. He did things at his own pace. He and I worked out our differences the first day we met. I knew instantly it was useless to try to impose my will on him. He had absolutely no fear of me. Once that was established it was kill him or just go along with his ways. The drive needed him so no one was willing to pay me to kill him. That made going along the easiest thing to do. Over the weeks we had forged a kind of friendship. Not the kind where you talk about things because the Indian almost never spoke. Rather the kind that allowed us to ride for hours together without trying to kill each other.\n\nThe Indian finished his horse then took a look at my horses hooves. He made a single cut after checking all four. When he finished he walked to the chuck wagon for his grub. The cook put his meager rations into an empty flour sack. The Indian tied the sack securely with a single rawhide strip. He then tied the bag around his waist. He walked to his pony then looked over at me. I knew then, and only then, were we ready to go.\n\nThe Indian rode a small painted pony. It hardly seemed possible but the small pony was able to go longer than the old chestnut mare I rode. The mare was faster but the pony had more endurance. The Indian had signed onto the drive with two of the little beasts. The other was mixed in with the small heard of horses which followed along behind the cattle. Since horses were harder to control, the herd had it's own drover. Twenty men could not ride five hundred miles on twenty horses. Each man had at least two favorite horses he used. All the men except me. I hated all the ugly, stupid, smelly beast equally. I rode whatever horse was available. I didn't like one any better than another. \n\nThe Indian and I rode north all day. We rode at a pace about three times as fast as the slow moving cattle. With the Indian I had learned to eat in the saddle. If I stopped to take care of necessities, I had to ride harder to catch up with him. When he stopped which was seldom I waited. I did so since I had no idea where to go. If I had left him then went in the wrong direction, I might never see him again. The Indian would not come to find me. He was as stubborn as the horse I rode.\n\nIt was well after dark when we stopped for the night. There was no reason to start a fire. The food we carried would not be improved by heating it. Which is why we carried no cooking utensils at all. We went to sleep that night in a cold camp. There were so few people on the trail that it was not really for security reasons.\n\nIt took a second to realize what had woke me. It was the sound of a horse snorting. Hell horses do it all the time but sometimes it is for a reason. I looked over to find the Indian's blanket empty. I listened carefully to the sounds of the night. Even as I listened my hand moved closer to the Colt handgun. If it was to be close combat, the Colt was the weapon of choice. I could not imagine a situation in the dark calling for the long gun.\n\nI spent several minutes trying to place the sound. I couldn't pull a similar sound from my memory. I knew it was buried somewhere in there but I had lost the key. The sound was far enough away so that I felt comfortable moving about in the dark. I found the Indian standing by our horses. From that vantage point I still could not see a thing, but the sounds seemed closer. The Indian made a walking motion with his fingers. I nodded my agreement that the sounds were close enough to walk toward. \n\nThe Indian and I tried to slip up on the sound. The sound was definitely man made. That being the case the only question was why the sound moved toward us so slowly. The other question was what the devil made the squeaking sound. There was a moon that night so we were able to make out the shape of a small one horse wagon from far away. I was about to suggest we return to camp and forget it. Obviously the Indian knew something I didn't. He didn't seem all that interested in the wagon. Still he moved forward.\n\nAfter what seemed like a long time we drew near the wagon. The horse ambled along without any direction. On the carriage type seat, complete with springs, rested what at first appeared to be a bundle of rags. I didn't really need the closer examination to tell me it was a man. The man might have been sleeping in the awkward position. The Indian and I both knew better. I climbed onto the small step then pulled him over by his black suit jacket. He hadn't been dead long enough to stink but long enough to pass through the stiff as a board stage. I had seen enough death during the war to know how it went. After a few hours the body got stiff. After a few more it went limp again. The body was cold as a mountain stream so obviously he had passed through that stage. \n\n\"Tell you what Two, lets bury him then check his wagon out.\" He wasn't going to be needing anything in the wagon. If we ran across a family member's address we would have to consult our conscience. \n\nFortunately he had a shovel in the wagon. It was just about the only tool. Frankly I was a little surprised until I thought about the condition of the trails in that part of the country. A traveler in a wagon might well be called upon to dig his wheel free.\n\nI stripped off his suit before I rolled him into the shallow grave. Having been raised as a good little Baptist child I knew a few words to say over the stranger. However, since he was a stranger they were few. After a couple of minutes the Indian and I began searching the wagon. The man carried little. Not only were his belonging spartan his pouch and wallet were almost empty. There was a box of letters but the moon was not bright enough to read. I didn't much like having a fire in a strange place so I decided to wait until morning to read the letters. The Indian and I split his cash. My share was less then two dollars. The money was hardly worth digging his grave.\n\nThe man had hardly carried enough food for a week. The distance between where he left and where he was going must have been small. In stark contrast he carried to water bladders. The Indian held them up for me to see. His point was the two bladders were full to the top. I took another look at the horse. The gelding did not look to be in great need of water. It appeared the preacher, as I begun to think of him because of the black suit and the small wagon, had filled up his water bladders recently. The Indian and I silently agreed to back track the wagon until we found water.\n\nWe unhooked the horse from its traces. The Indian examined the horse while I finished going through the wagon. The wagon was small enough so that going through it took only minutes. After we finished our tasks I took a good look at the color of the sky and position of the moon. It appeared we had a couple of more hours until sun up. Without a word the Indian and I returned to our blankets.\n\nFirst light found me still in the blankets. The sky had lightened considerably before I awoke. The Indian had made some sort of noise. It surely had been to awaken me since he moved with the silence of death. That is unless he wanted to be heard. The dried beef and hard biscuits we had for breakfast were the same as the ones we had for dinner the night before. If we had lunch that day it to would be the same. After a couple of days of jerked beef and biscuits the beans or stew of the camp would be a welcome addition.\n\nThe Indian lingered in camp after the sparse breakfast. I sensed he was curious about our stranger. I found the small wooden box. It still bore the carvings of the cigar company whose products had once been packed inside it. Either the man or someone else had put a finish of some kind on the box to seal the wood. The wood fairly glowed in the early morning light.\n\nI found the first letter to have been addressed to Deacon Burke. It was an approval for Deacon Burke to do missionary work in the west. The Indian did not seem to approve. Missionaries usually went among his people. The letter went on to instruct Deacon Burke to begin churches in the towns he passed through on his way to California. The Church in St. Louis did not care how long it took him to make his way to California. They even compared his trip to Moses' search for the promised land.\n\nThe other documents were just his letters of reference from different church elders. The religion was foreign to me. A good little Southern Baptist boy knew nothing of the smaller sects. The one thing that did interest me was the fact that Deacon Burke was from Virginia the same as me. There seemed to be a lot of us transplanted rebels around the fringes of the west.\n\nI packed the small wooden box along with his suit into a carpet bag he had in the rear of the wagon. The few other belongings that might be of any value the Indian and I loaded onto the horse. The make shift pack arrangement would not be comfortable for the animal but it was a short distance before we would remove them. The wagon itself was the most valuable thing the Deacon owned. It was also the one thing we could not carry with us. On a cattle drive nothing could be taken along unless there was a specific use for it. The small wagon was of no use. It was even likely to be a problem for the camp crew. So it had to be left behind for some other traveler to find.\n\nThere was no way to tell how long the horse had wandered but it seemed a good bet that water was close. The Indian did not give his pony water that morning. He knew the horse could smell the water if he was thirsty. We back tracked the wagon even though it went in almost a circle. The Indian's pony began resisting his moves ever so slightly. The Indian gave the animal its head. Not fifteen minutes later we came to a river. At that place the river had high, steep banks. We traveled down it toward the herd looking for a place to water the thirsty animals. A few minutes later we came upon a fence which seemed to go on forever. At one point behind the fence we could see a wide shallow part of the river. It stood to reason it had been fenced off by the locals because it was the only watering spot around. I had no idea why but it appeared someone was trying to deny the water to outsiders.\n\nI had no idea what Big Ed would do. I hardly knew the man at all. I knew what I would do though. I also expected it would be Ed's decision. We were just about to leave the fence to allow Ed to decide on the next move when they rode up. The three of them must have been watching us ride the fence for some time.\n\n\"Howdy stranger,\" a thin red headed man greeted me. He obviously planned to ignore the Indian.\n\n\"You own this land?\" I asked it not being friendly at all. I didn't want to make friends with a man I might have to kill.\n\n\"No, but I work for him.\" His reply came in a rather thick voice. He sounded like a man with a hangover.\n\nI nodded. \"Could you tell me what the deal with the fence is?\" I asked it trying to appear concerned. I really wasn't. It wasn't my herd.\n\n\"Sure, Mr. Evans put up that fence to keep the cattle drives from messin' up his water.\"\n\n\"I see then the water belongs to him. Is that how he sees it?\" I was trying to find out what was going on not start a fight.\n\nThe man's eyes got hard. \"Ain't no seeing to it. Mr. Evans has been on this land for thirty years and the water is his.\"\n\n\"I see. Guess me and my friend will be heading back to the drive.\" I said that as I watched his eyes.\n\n\"You do that friend. Tell your boss the water is not for sale or for the taking. We will fight to protect what is ours.\"\n\n\"I will tell him.\" I said it nice and friendly. \"Nobody had paid me to kill him. In addition, if I did the war would start too soon. If Big Ed wanted to fight for the water fine. It was his decision to make not mine.\n\nWe arrived in camp after dark. The chuck wagon was still open. The stew pot would be on all night for those riding nighthawk. I hadn't been worried about the food. \n\n\"Cookie, I got a bag here I need to store, could you shove it in the wagon for me.\" Without a doubt at the beginning of the drive the answer would have been no. By the time I asked a lot of the items we had brought with us had been used up.\n\n\"Pete, I will if you don't mind it being tied on the side,\" It was his way of showing he had no fear of me. He was right not to fear me. He was a good cook. Even a gun hand would get strung up for killing a cattle drive cook. Hell, if I wanted to make friends protecting Cookie would be the way to do it. \n\n\"Pete did you find water?\" The impatient voice behind me belonged to Big Ed.\n\n\"Yep, but we gonna have a problem getting it.\" I looked him in the eye daring him to comment on my delay in reporting to him.\n\n\"How so?\" he asked.\n\n\"Water is in a small river. It is slow and deep with steep banks.\" I took a drink from the coffee cup Cookie handed me. Big Ed waited rather than ask any more questions. \"Me and the Indian rode the river south till we came to some wire. Somebody fenced in the only shallow area. Couple of his riders said the water was not for sale or takin'.\"\n\n\"You mean they expect to keep us from God's own water?\" His face had suddenly turned red. I had seen it do that a couple of times before. Big Ed did not hide his feelings well. \"How many are there?\"\n\n\"We only saw three but you can bet this time of the year there are more.\" I said that as I took a metal plate from the stack on the pull down shelf on the side of the chuck wagon. \n\n\"How far is the water?\" Big Ed asked.\n\n\"For riders half a day northeast. For the herd a day and a half maybe two.\" I was in the middle of filling my plate with stew when he replied.\n\n\"Well, finish the grub then you and the Indian go back and find out how many we are going to have to fight for that water.\" He turned to walk away.\n\n\"Ed,\" When he turned back I began, \"I signed on to fight these cowboys didn't. You gonna get some of them kilt.\"\n\n\"It will be their choice. Any man don't want to fight I will pay off and send on his way. On a cattle drive Pete you fight for the cattle.\"\n\n\"Sorry Ed, guess I ain't never gonna be a cowboy. I fight cause I am gettin' paid to fight. I sure wouldn't fight for no smelly cow. By the way Ed, me and the Indian brought a horse back. We would appreciate it if you took a look and see if you can buy him from us.\"\n\n\"Where is the owner?\" Ed asked it with a very solemn expression on his face.\n\n\"Dead, we just took the horse so it wouldn't starve.\" I looked Ed in the eye. I figured he was smart enough to ask the Indian if he wanted to know how the man had died. I sure as hell didn't plan to tell him.\n\nI had been saddle weary even before the ride back to the fence. The Indian said one of his very few words when we were about a hundred yards from the watering hole. \"Wait,\" he said as he slipped down from his horse. \n\nI could have insisted on going along. That most likely would have gotten us both killed. The Indian could slip into the camp count heads and get back safely. He would never be able to do it with me along. I would make enough noise to get us strung up as spies. I was perfectly happy to sit on the ground with my rifle in the moon light. The rifle would be totally useless since it was dark as hell. It just made me feel better.\n\nThe rifle was an army cavalry issue piece. It was their marksman rifle, a pretty good weapon in its own right. I had the piece redone for me by a gun smith in Saint Louis. He had re-chambered it by hand. The improved rifle would fire either the.44 caliber revolver round or the larger more powerful .44 rifle cartridge. The rifle had been milled to accept two different sights. The open sight standard to most any weapon and a special German made peep sight. That one I carried in a small wooden box in my saddlebag. It was used only when a long accurate shot was needed. That night accuracy was not going to be a factor. There was not enough light for the peep sight. \n\nThe single shot rolling block rifle had lost favor with soldiers because it was slow. Soldiers wanted rapid fire so the repeating rifle was all the craze. The new repeaters were still scarce so the rolling block had been issued to the troops in large numbers. They were also available and in use all over the west. Hell, even the indians were equipped with them. Those old Springfields passed through a lot of hands before they were finally broken or scraped.\n\nThat thought and a lot more ran through my mind before the Indian returned. When he did I saw his shadow moving along the ground only seconds before he was beside me. The Indian like all his people moved like the animals of the plains, graceful when in their stealth mode.\n\n\"How many,\" I whispered.\n\nThe Indian gestured thirteen.\n\n\"Damn,\" I said. I thought a lot more than a simple damn. Thirteen of them and only twenty of us. Some of our twenty would be left with the cattle. I could probably figure on a slight numerical superiority. It would be quickly lost to the enemy since they would be in fortified positions. If we attacked them we were going to be massacred.\n\nThe Indian and I pushed hard to get back to the herd. During that ride I fought hard to find a way to win while staying alive. Going to the gun had always been my stock and trade but this would be suicide. I had a feeling Ed was not going to sit back while his cattle died from lack of water.",
        "\"It is real bad Ed.\" I said those words when we were standing by the fire. I had a plate of stew in my hand. I knew even as I had dipped the stew that Ed wanted the word but I didn't much care I was hungry. If he didn't go along with my plan then we were going to die. I wanted to at least die with a full belly. \n\n\"They got thirteen men staying in the bunk house and they know we are coming. My guess is they are going to be on the ground in fighting positions. If we ride into them they will cut us to pieces. Man on a horse is a lousy shot.\" I thought I had made my case pretty well.\n\n\"The cattle have to have water and they have to have it today or tomorrow at the latest. We are going to have to water them, that is all there is to it.\" Ed was as adamant as I had expected he would be.\n\n\"I got an idea. It might work. If nothing else it will get them on the horses and us on the ground.\" I smiled when I said it. I spent the next ten minutes explaining it to him.\n\n\"That ain't got no chance of working, but then again you are right. We go in there guns blazing and a lot of my cowboys are gonna die. Take ten men and all the shovels we got. Make it look good.\"\n\nI noted with a great deal of satisfaction Big Ed did not want to join us. It was why he paid me. It was clear he was a rancher not a warrior. It was the middle of the day when we arrived at the spot a half mile above the wire. \n\n\"I want a trench dug over here. Make it as deep as you need to so that you can feel safe if we start shooting these people. You might want to go ahead and dig it deep enough for a grave in case we don't talk them into giving us water.\" Everybody knew it was going to be water or lead. Those were the only possible outcomes. While they dug the trench I set the first charge off at the river bank. I had no idea what I was doing but it didn't matter. I just wanted to make some noise while I collapsed part of the river's bank.\n\nI had set off three charges before they arrived. I had also made a pretty good sized little cove. Not enough to water almost a thousand head of cattle but enough to look like it might be possible given a day or two. I would have needed another couple of cases of dynamite at least to do the job.\n\n\"Hey, what the hell you doing to my river,\" the older man asked. I didn't recognize him but I did recognize the two with him. They had been two of the ones I had spoken with the day before. The man was thin in the way old men got on a ranch in those days. If Big Ed live to be the old man's age, he would lose most of his bulk. The man was small but by no means frail. He was small like dried rawhide, tough and stringy.\n\n\"Well Sir, I am making a watering spot for our cattle. I figure it will be done by tomorrow.\" I noted with satisfaction that he counted guns while I spoke. The man was no dummy.\n\n\"What do you plan to do make a shallow cove here for the cattle?\" he asked it with real concern in his voice.\n\n\"Either that or divert the river over to that gully a couple of hundred yards away. Just depends on what I get done with four cases of dynamite.\" He didn't know or need to know that I was all but out of dynamite.\n\n\"You know I can't let you do that. It will take the water from my cattle.\" He looked nervous.\n\n\"Dead man, don't have to worry about cattle. Nothing else far as that goes. Best we can figure you got thirteen or so men. You come back with them and we gonna be in those holes. We are gonna kill ever damn one of them. Then I personally am gonna kill you. Sorry but that is the way it plays.\" I gave him my best evil look. I had just done as much as was possible to end the standoff without a fight.\n\n\"If I let you water at the shallows this stops?\" He didn't look happy at all.\n\n\"It stops.\"\n\n\"Bring the cattle on down. We will take down the wire ourselves.\" He looked like he might have something in mind.\n\n\"Good, the Indian and I will make sure there are none of your men around. If there are we come back to this place. I will personally blow hell out of this river bank. So you best keep them away.\"\n\n\"You don't trust me?\" He looked at me with a smile.\n\n\"Not a bit,\" I said with a grin.\n\n\"If you need a job after this, come see me.\" He turned his horse. The three of them rode away.\n\nEverything else about watering the cattle was anticlimactic. Big Ed took the whole next day to make sure all the cattle got enough water to drink. He lost a few head because the watering was so chaotic. I sat in my saddle worrying what treachery the old man had in mind. It was a futile exercise. The old man stayed away. Moving the cattle in and out of the shallows was a miserable job. I was even pressed into service to help with it. The Indian stood guard over us.\n\nOnce the watering was complete we pushed north. A few miles up the trail the river turned east so we parted company with it. It had been a dry spring but enough rain had fallen on the plains so that the grass grew regardless of the drought. The search for water kept the Indian busy most of the time. I rode with him just to keep him out of trouble. Big Ed needed him alive and I liked the man. Still there were those who didn't. Some with good reason to hate all indians and some with no reason at all. Either way I tried to stay close.\n\nAfter the water incident something gnawed at me. Big Ed avoiding the fight really effected me. I realized Ed was no coward. It had to do with his being able to hire men like me to go out and die for him. He could pay for men like me to defend his property. Like I said before, I had hired out my gun previously. I had just never realized that the money was the key. If you had it no matter its source you had to defend it. The man with the most money hired the most guns to defend what was his or to take what wasn't. That knowledge led me on in my planning for after the drive.\n\nWhile the thoughts ran through my head the Indian alerted me to the rider coming up on our rear. We watched him change from a cloud of dust to a rider on horseback. Then finally to someone from the cattle drive. He was riding purposefully toward us. I figured it meant trouble for me. I couldn't think of any reason that the Indian would be needed badly enough to send a rider for him. I sensed the Indian knew it too.\n\nWhen the rider got close I noted his red hair. He would obviously be called red or some variation of it. When he got close enough to speak the horse had been slowed then reined to a stop.\n\n\"So Red, what's got you all in a lather?\" I asked it even though I could have just remained quiet like the Indian. Red was going to tell me regardless.\n\n\"Big Ed sent me to fetch you. He is all in a rage.\"\n\n\"Now what had got him all upset?\" I asked it knowing whatever it was had to do with me and my gun.\n\n\"Rawhiders cut out ten head and rode west with them. Ed wants them back.\"\n\n\"How long ago?\" I asked.\n\n\"Well I been riding all day so it was yesterday.\"\n\nI turned my attention to the Indian. \"You comin?\"\n\nHe shook his head. Killing wasn't his job and I knew it. The Indian might kill to defend his own life but the cattle meant nothing to him. I headed southwest hoping to cut their trail. The redheaded cowboy rode along. I didn't bother to ask him why. He was obviously under orders from Ed.\n\nI was moving too slowly for the cowboy. \"We never gonna catch them at this rate.\"\n\n\"We are never going to catch them if we ride these horses to death. Yours is already spent. You should head back to the herd for a fresh mount.\"\n\n\"She will be fine,\" the cowboy said. Hell he was a drover and should know his horse's limits so I shut up. When night fell we hadn't cut their trail so I pulled up under the only tree I had seen in over an hour. He acted as though he wanted to build a fire. He didn't say anything just moved around like he was getting the makings ready.\n\n\"Forget the fire Red. We run a cold camp.\" I said it as I began rubbing down my horse. Red I noted began work on his animal even though his heart wasn't in it. I had a feeling his mind was on coffee.\n\n\"You don't mind if I roll one do you?\" He asked it with the pouch of tobacco in his hand. I could have stopped him but I decided not to bother.\n\n\"Nope, they are not looking for us. We are looking for them.' I could tell he didn't understand. It didn't matter much.\n\nThe next morning before noon we cut their trail headed west. Red and I turned to follow. We had gotten lucky. If we had gone farther west we would have missed them all together. They pulled up not more than two hours after we cut the trail.\n\nI wasn't the Indian but I knew there were three loaded down horses pushing ten or so head of cattle. It stood to reason that all three of them were hold up in the tiny shack. The shack was built by a wandering stream. It would have been ideal had there been a small rise with a stand of trees overlooking the cabin. No such luck, there was only the flat plains surrounding it. I was well within range of my rifle when I removed it from the scabbard. I also removed the peep sight from the saddlebag. Opening the wooden box without dropping it all was a trick on the slightly moving horse.\n\n\"What are you doing?\" Red asked.\n\n\"Getting ready to take back the cattle,\" I replied.\n\n\"Well we are going to get closer aren't we?\"\n\n\"Why, do you want to get shot at. There is a high probability you will get killed in a gun fight. Is that what you want Red. Do you want to die?\"\n\n\"Hell no, but I ain't gonna be no good to you this far away.\"\n\n\"Don't worry Red. You don't have to be.\" By that time I had the rifle together. It took a couple of more minutes but the men in the cabin came outside. I was too far away to tell much but it was pretty clear they were armed to the teeth. Whether they were or not made no difference. I took aim at the one on my right side of the ragged line they formed. The horse stood perfectly still. I was sure it would be the last time he would do that so I took careful aim. When I pulled the trigger there was the blast of a controlled explosion from the shell. A second later the man fell. It took another second for the other two to react. Their reaction was first to fire several rounds at us. None of them came even close to where we sat.\n\nSince my horse was fidgeting I climbed down. I dropped his reins since he was well enough trained not to run off on me. The men ran into the cabin when I climbed down. The were smart enough to know that the death of their friend had not been a lucky shot. \n\nI wasted a shot into the cabin's walls just to get them returning the fire. I knew one was standing inside the door and the other by the left hole in the wall. Those holes were what they used for ventilation. There was no glass in them so you couldn't really call them windows.\n\nI aimed the rifle at the spot where I thought the one in the door would be standing. I gently squeezed the trigger to send death over the hundred or so yards. The scream barely audible on the wind told me I had at least wounded him. Smoke poured from the window. Three clumps of dust rose in front of us. The Rawhiders were down to one shooter. I was about to put a couple of rounds through the window when he came out with his hands up. \n\nI drew a careful bead on him. I was just about to pull the trigger when I was stopped by the voice of Red.\n\n\"You aren't going to shoot him with his hands in the air are you?\"\n\n\"I was, but if you want to carry him back to Ed it makes no difference to me.\" I said that looking Red in the eye.\n\n\"Well I sure don't want to kill him in cold blood like you did the first one.\"\n\n\"Okay then you ride down there and bring him back here. After that we can go down and get the cattle.\" I said it looking at the cabin.\n\n\"Why ain't you comin with me?\" he asked.\n\n\"Because Red odds are fifty fifty that man inside the cabin ain't dead. He is probably laying in there with his rifle. He could be just waitin' for us to ride down there so he can shoot us. Now you feel free to go on down there, if you want to take the chance. Me, I will just wait right here for you to come back or to kill them after you are dead. Don't make no difference to me.\"\n\nI could see his mind working. \"Hell, they are rawhiders.\" \n\n\"Good point, so I assume I have your permission to shoot the one in the yard?\"\n\n\"Yeah,\" he said. I noted he looked away when I shot the man standing beside his dead friend. His body fell almost on top of the first one.\n\n\"Well we still got to go down there?\" Red made it a question.\n\n\"Yep, but not right now. If he is hurt the longer we wait the better. Blood loss will get him soon enough. If he is dead don't make no difference how long we wait, he is still gonna be dead. The only bad thing about the three hour wait was that there was no shade. It was hot as blazes.\n\nWhen we finally went down I chose to circle around. We came on him from a direction he could not see from the door. He could watch from some of the other holes in the shack but not the doorway. It might not help to come up from a different angel but it couldn't hurt either.\n\nThe two in the yard were very dead by the time we finally reached them. The one in the house was almost dead. Red was still outside when I shot him in the head. I walked outside to find the cowboy leaning against the shack. He looked as though his jerky and cold biscuit might just reappear.\n\n\"You all right?\" I asked it from a few feet away.\n\n\"Yeah, I just never killed anybody before.\"\n\n\"You still ain't kid. I killed them.\" I watched him for a second. He needed something to do I decided. \"Red, lets go saddle up their horses.\"\n\n\"What for?\" he asked.\n\n\"We are going to take these three back to the drive to bury. I want Ed to see his rawhiders.\"\n\nThe return trip didn't take all that long. It was just one night on the trail. When it began getting dark I asked, \"So Red you tired enough to sleep with the dead or do you want to push on?\"\n\n\"If it is all the same to you Pete, I think I would just as soon keep moving.\" Red looked about to fall from his saddle. Even falling from his horse must have seemed preferable to sharing a cold camp with three stinking corpses. \n\n\"Suits me just fine,\" I said as I turned back to the trail. Just before dawn we cut the trail left by the cattle. We followed it till we found the wagon tracks then followed those. A short while after sun up we were within sight of the wagon.\n\n\"Red you want to ride ahead and find the boss, or do you want to stay with this lot?\" I asked it raising the horse's reins.\n\n\"Just as soon ride ahead,\" he replied. I would have bet on that. After what seemed like a inordinately long time Big Ed returned with the kid.\n\n\"What the hell did you bring those bodies back here for?\" Bid Ed asked.\n\n\"You paid for 'em, thought you might want to see em''.\" I looked him hard in the eye.\n\n\"If you had told me they were dead that would have been enough.\"\n\n\"If that had been enough you wouldn't have sent the pup with me,\" I was still looking hard at Ed. Since the water incident things had changed. Ed felt I no longer trusted him so I guess he felt he could no longer trust me.\n\nEd looked a bit uncomfortable when he spoke. \"Well get them in the ground. Turn the horses into the herd they ain't worth much but we will settle up when we reach the railhead. I got no use for the guns though.\"\n\nHe had seen the rifles tied to the horse with the thinnest man draped over the saddle. The pistols were tied on the side away from where he sat. He could not have seen them.\n\n\"They ain't worth much but I will find someone who wants them.\" I watched as he turned away.\n\n\"Red,\" I said to the retreating cowboy. \"Get us a couple of shovels and lets get these guys in the ground.\"\n\n\"You killed 'em', you bury 'em',\" he said it as he rode away. \n\n\"Seems like your stomach has returned pup,\" I said it quietly. I looked around to see what was handy. I found a stand of trees about a hundred yards away. I rode slowly to it. When I arrived I found a low spot in the ground. I cut the ropes holding the bodies to the horses. When all three were in the depression I mounted my horse and rode away. \n\n\"Sorry guys you was worthless but you should have got a hole anyway. I just ain't up to the diggin' of it.\"\n\nI rejoined the Indian as I was tired of the company of my fellow white men. From Big Ed to the cowboys every one of them made me want to kill somebody. We were almost at the rail head when one of the cowboys caught up with me and the Indian.\n\n\"Big Ed wants you killer.\" He said it with a smirk. I knew then that the pup Red had been talking.\n\n\"Tell you what cowboy. If you are ready to die, you talk to me like that one more damn time.\" I put my eyes on him as if he were already dead. I waited to see if he would break the gaze or go for a gun. Either way he was going to come off second best.\n\nHe spun his horse then rode away. I watched his back as he rode quickly toward the herd. \"Smart ass is gonna get himself killed one day.\" I was talking to myself but he Indian heard. He didn't say a word just nodded.\n\nFor some reason the Indian knew something. He rode back with me to the herd something he had never done before. When we arrived Big Ed met us.\n\n\"Lost about ten head last night. The trail is over that way.\" With those words he turned then walked back to the chuck wagon. If there had ever been any regard between us it ended right there. If he had been anyone else, I might have killed him. I didn't only because there were twenty men he owed money. They would surely have killed me.\n\nThe Indian rode with me to find the trail. I am not a great scout but I can follow ten head of cattle without a tracker. I said nothing because the Indian always had a reason for anything he did. We found the spot where the stolen cows left the herd. It wasn't more than a few hundred yards before the Indian got down from his horse then walked about.\n\n\"Three men on horses with no iron on feet,\" he said it as he looked up at me.\n\n\"Indians?\" It was a question which wasted my breath.\n\n\"Hunting party,\" was his answer.\n\n\"Why would they want beef. I thought indians hated the taste of beef?\"\n\n\"Not as much as they hate to see their little ones starve.\" It was a speech of epic proportions for the Indian. And it was a different man who spoke.\n\n\"I never heard you speak so much. You sound awfully white.\" I was smiling.\n\n\"Missionary school,\" he replied.\n\n\"You sure we gonna find starving Indians when we find the cattle?\" I asked it knowing better than to waste my breath. I trusted him completely.\n\n\"I am sure,\" he replied.\n\nI gave it a lot of thought before I answered. \"Well then I guess my cattle drive days are over.\" I didn't know what I would have done two months before, but I knew I couldn't kill a bunch of starving Indians over somebody else's cattle. I must be developing a conscience. That thought brought a smile to my lips. The Indian couldn't read the smile so he looked worried.\n\n\"You better get on back out ahead of the drive. I will go talk to Big Ed.\" \n\nThe Indian nodded. He had a gut level understanding of how it was going to end. After we parted I turned my horse to the herd. I found Big Ed at the front of the herd. Somehow he didn't seem all that big to me anymore.\n\nI reined up beside him before I spoke. \"Ed, did you know that it was Indians that cut the herd?\"\n\n\"Saw the tracks.\" Ed had become a man of few words.\n\n\"Well I am sorry but I am not going to go shoot up a camp of starving Indians. If they bothered to steal beef they are hungry.\"\n\n\"Why they did it don't matter none I want my cattle back.\" He was looking at me with a really strange look. He looked like a man with what he thought was a winning hand. I realized then that Ed had grown uncomfortable with me around. He wanted to get rid of me and it was his way. Force me to quit rather than risk firing me. The only reason he needed justification was so that I wouldn't kill him just for the hell of it. He obviously thought I might. That knowledge robbed him of his aces.",
        "\"Well Ed, you should rethink that one. If I go down there and shoot up that camp, the whole damn tribe might come after your herd. You would lose not only your cattle but your hair as well. Of course if that is what you want, I can go down and bring back the cattle or the hides. I am pretty sure that is probably all that is left.\" I had just shown him the logic although it was all lies.\n\n\"Let me think on this a while,\" Ed suggested. I knew right then I had heard the last of it. The idea that Ed might lose everything over ten head of cows was logic enough for him to let it go. I was beginning to like the idea of talking rather than killing.\n\nEd and I managed to stay away from each other till we reached the rail head. He changed his mind about the horses. I left camp that morning with $62 in coin and all the gear of the three men I shot. I also carried the carpet bag containing the deacon's suit. \n\nFortunately there were small towns all along the railroad tracks. I rode into Hastings Kansas around noon on the second day. The town's livery man bought the horses and saddles from me. Including the horse I rode and the saddle I had my ass in. I got a hundred dollars in paper for all of the animals and saddles. I could have done better selling them one at a time, but I was in a hurry to get on a train. I had a plan in the back of my mind.\n\nHalf hour before the east bound train arrived I sold all the extra guns to the towns general store. The guns were old and poorly cared for. I bought a can of light oil from him first. I used it and a rag he had in the back to clean them up before I sold them to him. Even with the cleaning I received only $28 in coin and a small light weight .36 caliber five shot revolver. He did toss in a box of twenty cartridges for the English made piece. I was happy with the little pistol, The English made finely crafted firearms. They couldn't mass produce them, but what they did turn out were excellent pieces.\n\nThe short hop to Saint Louis was only a long days travel on the train. When I arrived I took a room in a hotel on a side street close to the rail station. I spent three days in that room doing my homework. The event itself was anticlimactic. \n\nI sat in the alley behind the Cattleman's Association Bank. I made sure the deputy patrolling passed a few minutes before I pulled on the rain coat. Only after both did I kick in the back door of the bank. I found two of the four employees in the bank a half hour before it opened. I chose that bank because the owner's picture hung on the wall. He was quite handsome in his blue uniform. Beside the picture was a list of the battles he had supposedly been in during the war of Yankee aggression. Seemed only fair that a Yankee colonel paid for my war time.\n\n\"Gentlemen, I realize the money belongs to someone, but it ain't you so it ain't worth you dyeing over. Just fill up this here gunny sack.\" I waited while they did. I was surprised neither resisted nor said a word. I stayed long enough to be absolutely sure I had it all. As far as I could tell I did not leave a penny. \n\nI tied and gagged them before I left the bank through the rear door. I had about fifteen minutes before they could raise and alarm. In that time I dumped the red bandanna and the cowboy hat I had worn with my hair pushed up under it. I also found the empty carpet bag I had left behind a trash can. The can sat at the rear of a ladies ready to wear store. I filled it with the money then walked into the lobby of the small hotel where I stayed. I checked my pocket watch. I found I had just a couple of minutes to change into the black suit of the Deacon. \n\nI had checked into the hotel as Pete Sims. I left it as Deacon Burke. Deacon Burke had a letter from the church elders in Saint Louis. The letter directed him to travel west setting up churches as he went. I also had his school documents and his personal references. I left with Pete's ill gotten gains. Also I left with the Deacon's spotless reputation. That was my plan at least.\n\nI walked into the train station in a black suit and unarmed to anyone who might have been checking. The colt was almost the only thing in the carpet bag, save the stolen money and a spare shirt. The Morris .36 cal was inside the specially made shoulder holster quickly assembled by a harness maker in Saint Louis.\n\nI walked from the hotel a block to the train station with my carpet bag and rifle in hand. I had to risk the rifle. I wasn't about to leave it behind. When I bought the ticket it was to the end of the line. Actually to a small town I never heard of at the end of the line. My plan was simple. Hide out until the robbery was forgotten then slip back home to Virginia. Once I was home with the money I had made mining silver in west, I could buy back my Dad's farm. It was a nice long range plan. The short range plan was to just hide out for a while without using too much of the money. Going on a spending spree was how most of the bad guys got caught. They left a trail of greenbacks a mile wide. I was determined to get away with the robbery then go straight.\n\nThe town's sheriff's deputies came to the platform all in a huff. They went up and down looking over the waiting passengers. They gave me only a glance as they continued on their search. I looked at my watch after they had gone. It showed one hour and ten minutes since I walked out the rear door of the bank. The employees hadn't given much of a description I was sure. They probably got the gun right and that would be about all. The Colt was carried by half the men in the the west. At that moment it was not carried by me. The yellow rain slicker was in a trash can less than a block from the bank. It had been bought in a different town on the way to Saint Louis. If there was anything to tie me to the robbery it was the time of my departure. Nobody had noticed me leave the hotel through the fire door at the rear. As far as they knew I left as the cowboy who had entered. Pete Sims might be wanted for questioning but he had disappeared. He might resurface in a year or so. If so it would most likely be in Virginia.\n\nI found my way to an empty coach seat. Even though it was padded to some degree, I knew it was going to be a long ride west. I waited along with the other passengers while another train filled with cattle passed. It suddenly occurred to me how large a job it must be to keep east and west bound trains from colliding. Especially since both used the same set of tracks. I actually remember hoping the little men who ran the stations stayed awake until I got where I was headed. The thought of finally being rich then to die in a train crash was more than I could stand. It would be the ultimate irony. My lying by the side of the tracks with my ill gotten gain floating in the air.\n\nI shook my head to clear it of the black thought. After all I was a Deacon off to do God's work. Surely he would protect me. The train began to move. \n\nMy thoughts turned to where I would go from the town at the end of the line. The papers carried by Deacon Burke had mentioned a town called Sadie's Gulch Nevada. According to the letter it was suggested that he stop there to open a church. There was the veiled warning about something the bishop has discussed with him before he left Saint Louis. I had no idea what the something was but the idea appealed to me. It would definitely help make the Deacon more believable if he were found to be in the place he should be. Within an hour of starting the trip I had decided my next move. I did realize it would be two very long days before I could do anything.\n\nThe first afternoon there were no meal stops planned. The train would be stopping for a half hour to allow the tracks ahead to clear, but it would not be until six P.M. I had been told by the station master in Saint Louis that there would be somewhere to eat during the long stops. I had not eaten breakfast since I was nervous about the bank job. I was beginning to feel the empty feeling in my belly. If I had been on horseback it would have been possible to ignore. However sitting on the train left me nothing else to do but feel the hunger. \n\nWe stopped to take on mail and a few freight boxes in a small town somewhere or other. On the platform there were children hawking fried meat pies. I bought two for ten cent well over twice what they were worth. Still I had plenty of money and I was starving. My only regret was that I had to wash them down with tepid water from the crock at the end of the car. The pies themselves were very good. They were spicy enough so their cool temperature was palatable. The boy was more than likely the son of the boarding house owner. I was told the food usually came from such a kitchen on the short stops. She had to be making a killing with the over priced food flying from his little wooden box.\n\nAfter the lunch I managed to drift off into sleep. I was awakened by a woman shaking me gently. \"Reverend, I am sorry to wake you but the seat beside you is empty and I would like to sit there.\"\n\nIt took me a moment to realize she was speaking to me. \"Of course madam,\" I replied moving to make room for her. \"I am sorry that I have taken so much room. Would you like to sit by the window?\"\n\n\"No thank you sir. Far too much dust for me.\" She was smiling as she spoke.\n\nI looked about. The train was moving quite fast. It didn't appear that it had made a stop while I slept. \"Excuse me Miss?\" I made it a question.\n\n\"Wilson Reverend, Edith Wilson,\" She replied.\n\n\"Miss Wilson I am not a preacher. I am but a humble deacon.\" I had learned a few things in my childhood church attending days. I could see by her curious look that she didn't understand the collar. I changed the subject to get her mind off it. \"Did you just come aboard\"\n\n\"No Deacon, I can call you deacon?\" She seemed to be a bit disturbed by the name thing.\n\n\"Yes I am called Deacon by most folks. My last name is Burke. Now if you did not come aboard recently where have you been sitting. Also why did you find it necessary to move not that I object to the company mind you?\" Actually I did mind the company. The more people I talked to the more likely I was to make a mistake. If she stayed she was likely to hear me snore a lot more than I would have alone.\n\n\"I was seated alone in the next car back. A rather loud and rude cowboy sat next to me at the last stop. I am a married woman Deacon. I am meeting my husband at the end of the line. I did not want the cowboy to get the wrong idea. I do hope you don't mind the company.\"\n\n\"Not at all, would you like for me to have a word with the young man?\" I asked not sure what I would do if she said yes.\n\n\"Oh no please, if you would just allow me to sit here.\" There was some emotion in her eye but I couldn't place it.\n\n\"Very well,\" I replied formally. \n\nFifteen minutes later I had begun to regret my decision. Edith Wilson was a chatterer. She was filling me with stories of her Ohio home and family even though she should have known it bored me to tears. It was so boring I fell asleep often. I am not sure whether she stopped talking while I slept or not. She might have continued to ramble for all I know. I do know that whenever I awoke she would begin again or maybe just continue.\n\nI dozed off and on until the train pulled onto a siding for the east bound train to pass. The conductor advised us we would be on the siding for a minimum of thirty five minutes. That being the case there was a wagon outside to take those who wanted to the boarding house for real food. For the others there were again children with boxes of biscuits and beef. I decided to take the wagon since it would be only natural for a deacon to have a little money. Besides which I was hungry. It did leave me with a bit of a problem. Carrying my bag would draw attention to it. Leaving it unattended was a gamble. \"Are you going to the house for dinner?\" I asked the man sitting behind us. He wore a suit. He also spoke like a businessman. I asked it because he looked as though he were not going to rouse long enough to go anywhere.\n\n\"No, I think I will get a biscuit and just go back to sleep.\"\n\n\"My name is Deacon Burke,\" I extended my hand to him. \"I have a rather expensive dear rifle up in the luggage rack. I wonder if you might deep an eye on it for me. I would hate to see it wonder off while I eat dinner.\"\n\n\"I expect I would awaken if anyone came near. Hell, everything else wakes me up today. \"Sorry Preacher,\" he smiled a smile like a kid caught with his fingers in the cookie jar.\n\n\"I'm just a deacon sir. I too have been known to succumb to the urge to express myself colorfully.\" I wondered where the fancy words were coming from. It took only a second to remember the tutors who came to the house during he summer months when I was a child. Dad had been a believer in education. Then too there was his status to consider. Dad owned the largest farm in the county. His only son had to at least sound educated. \n\nTh war of Yankee aggression changed all that. Three years in the army surrounded by less educated 'young gentlemen' lowered my language skills. Then there was the pure hell of killing men from a hundred yards away. Somehow I had slipped into Colonel Boyd's raiders. We were mostly used to ambush the blue bellies. We delayed their advance for the last year of the war. Always staying a few miles in front of them playing hell with their advanced scouts.\n\nWhat I did was not really in the heat of battle killing. It was cold blooded murder in the name of patriotism. It bothered me less at the time than it did when the war ended. I was lucky they didn't hang me. When word came down of the surrender Colonel Boyd himself came by to give us the word. He also told us to dump the uniforms and drift west. His best advice was don't go home. The yanks are going to be looking for us all. My guess is that they will hang us on site.\n\nI didn't listen. I doubt anyone else did either. I rode home on the horse I had ridden into battle. If you chose to call how I fought the war battles. When I saw what was left of the place my heart broke. I knew my mother and father had been killed in Richmond while there on business. I supposed he was trying to find a way to save the farm. I found out it was going to be sold for taxes. All of the south was since no one had paid any taxes to the Yanks. There sure as hell wasn't any money to pay them now. It looked as though the Yankees who had profited from the war would be coming down to buy up the cheap land. \n\nWith no family and no inheritance the move west was easy to make. I hated leaving the place but then there was nothing but ashes left for me in Virginia. As a final act of revenge I burned the house to the ground. It looked as though the memories were the only thing left to me by my parents. They were sweet and gentile but not of much use to me. The memories of Colonel Boyd were much more valuable.\n\nAll that seemed to flash by in a half second. I nodded my thanks to the man then stood to stretch before following Edith into the aisle. She had decided to join me for dinner without being asked. It was a common practice for a woman traveling alone to find a suitable protector. I found it amusing that men seemed to be willing to die for a strange woman. I never quite figured that one out. To die for a woman you were married to, or at least in love with was one thing. To die for an almost total stranger was something else again. Those thoughts ran through my mind because of her encounter with the cowboy earlier. I had a feeling there might be more trouble from him. I would be expected to protect her. I would never have even considered it in my former life. I supposed in the life of Deacon Burke it would be expected of me. For the first time I realized the plan might have a down side. I had to act like a deacon.\n\nI allowed her to lead the way to the end of the car. There I stepped ahead of her to help her down the steps. When she was safely on the platform I looked around. I saw a wagon with three seats parked by the high platform. It was possible to step almost directly into the wagon. The bed of the wagon was only slightly higher than the platform. It was possible for eight passengers to ride to the boarding house. Nine if one of them drove, leaving the young man to walk along beside. I rode in the wagon only because Edith accompanied me. The ride was no more than a few hundred yards. Still Edith would most likely have been uncomfortable walking it in the early fall afternoon. What with all the clothes a woman wore in those days. I found the suit coat I wore almost uncomfortable. I could have taken the coat off. She on the other hand could not remove the heavy traveling dress she wore.\n\nThe old lady who ran the boarding house must have been doing well with the train business. The place had a new coat of paint on the walls and a few new boards in the porch. Inside the house the long hallway led to two dining rooms. One had probably been the parlor before the conversion to a boarding house. It had probably lasted until the train had reached the small town. I figured if she were smart the old lady. she knew it wasn't going to last. If the stop became permanent there would soon be a restaurant nearer the station. \n\nThe food was simple. There was a stew heavy with gravy and vegetables. It was probably the most economical of dishes. It suited me fine. Stew was filling and quick to get onto the plate. It was almost as quick to get into the belly. The old lady or one of her kids made much better biscuits than I ever got living on the move. My own mother made better ones of course but that had been before the war with the blue bellies. The coffee was hot and only slightly on the weak side of perfect. For desert there was a sort of dry apple cobbler. \n\nThe meal was expensive. Probably because it was the only game in town. It could have been worse. I paid my two bits while looking for Edith. I saw her still at the table with her money purse open looking thoughtfully into it. I could tell from her expression she was regretting the expense of the large meal. I should have known better but I paid for the meal. I made a point of telling the old lady who the second two bits was for.\n\nAs I waited for Edith and the others to join me for the wagon ride back to the station I noticed that the men were all dressed in suits. It seemed the cowboys didn't care to part with the money for a real meal. I expected like I had previously done they satisfied themselves with the meat pies from the children on the platform.\n\nThe wagon left soon after I finished my meal. Edith didn't mention my having paid for her meal so I did. I didn't want the thanks but I also didn't want the old woman to collect twice for the food.\n\n\"Edith, that old lady didn't try to collect for dinner from you did she?\" I asked.\n\n\"No Deacon she didn't. Thank you,\" she replied.\n\n\"It was my pleasure. I asked only to be sure she didn't try to take advantage of you. Please think nothing of it.\"\n\n\"Oh but I do. It was a kind and generous gesture. When I reach my destination I will tell my husband what a wonderful companion you have been.\"\n\n\"I really wouldn't do that were I you,\" I replied.\n\n\"Oh why not?\" she asked with a look that told me she knew full well why not.\n\n\"He might get the wrong idea.\"\n\n\"But you are a man of the cloth?\" It was a question.\n\n\"Yes but I am not a preacher. I am but a deacon and not above sins of the flesh.\"\n\n\"Then I suppose I will leave that part out.\" She was wearing a broad smile. It was the most attractive thing about her up until that point.\n\nA couple of hours after dinner it began getting dark. If I had been traveling as myself I would have joined one of the many card games in progress up and down the aisles. Since I was not myself I slipped into sleep. Edith was not the chatty type when tired thank god, so I was able to nap off and on without interruption. I awoke sometime in the night to find her head on my shoulder as she slept beside me. It was most disconcerting even for a deacon. I had that thought as I laughed inwardly. I am afraid I had some most un-deacon like thoughts about the young lady beside me. For a moment I regretted the pretense. Then I remembered the money. It also came to me that if she hadn't thought I was safe, she would never have been beside me at all. It was the left handedness of it all that made it so amusing. Not amusing enough for me to forget the warm feeling Edith gave me. Even though I had the desire I had the good sense not to act on it. I intended to stay in character no matter what. I also knew Edith was a married woman and not interested in an encounter even with a well meaning Deacon.",
        "Edith pretty much slept all over me. Well as much as one can be on another while slumped in a hard chair. The ride was hard even on a man used to spending long hours in a hard saddle. If must have been truly miserable for a woman. The slightly padded seats of the train soon became unbelievably hard and uncomfortable. After a few hours everyone tended to wiggle their butts trying to find a spot less painful. I awoke often that night. Whenever I did I found Edith in motion trying to get comfortable. It was probably the thing that woke me.\n\nThe sun was up before I finally gave up on sleep. I walked to the end of the car where I filled my mouth with water from the dipper attached to the earthenware jug. I stepped into the space between the cars to spit the water into the cool morning air. I stood for a long while enjoying the cool air. I knew the cool wouldn't last long. The air had the feel of a morning just waiting for the sun to rise so that it could become a blistering day.\n\nWhen I returned to my seat I found that Edith had managed to lie down. To accomplish it she had taken up both seats. Instead of waking her I looked for an empty seat. It seemed that if the seats weren't taken by a passenger they were taken by sleeping men or women. I had no choice if I wished to stay near my possessions I had to move Edith.\n\nI lifted her head and shoulders as it seemed to be the easiest part to move. When I did she wrapped her arms around me. She even tried to pull me against her body. Edith it seemed was a very loving woman. When I didn't respond she made a noise in her throat then pulled away seemingly still asleep.\n\nI leaned against the window. I could look out at the landscape covered in a kind of blue haze. The mornings in that part of the country seemed to begin in a monochrome then as the sunlight began to lighten the sky one color at a time was added until natures full pallet was visible. Yes it was true of every part of the country and I suppose every part of the world. That morning I really noticed it for the first time.\n\nI turned my attention to the woman sleeping on my shoulder. I both noticed and remembered her appearance. I supposed it was part of my reaction to the coloring landscape. I supposed even than that I was adding her to my memories of the trip.\n\nEdith Wilson was tall for a woman. I remembered her from the trip to the boarding house. She was at least five nine no more than and inch shorter than me. That height was unusual for a woman. Unusual enough that she got stares when she stood on the platform and again as she walked into the boarding house for dinner. \n\nEdith was also thin. Not sickly thin like some of the women in Saint Louis had been, but just plain overworked thin. No doubt Edith had helped work a farm somewhere. She had talked about everything under the sun to me. Everything but about her husband and her life. I would have expected it to be foremost on her mind. Either she had a very private side or she wasn't as excited as she should have been at the prospect of returning home. The dress Edith wore was plain cut to minimize a woman's figure. In Edith's case it worked exactly as it was intended. It appeared that edith was almost completely without breasts. The small rise in the fabric might have been a wrinkle. Nonetheless she was an attractive woman. Men for some reason seemed to notice her before the more voluptuous women. It could be that women of Edith's dimensions were less threatening. Whatever the reason men often stared at her. She didn't mention it nor did she need to do so. I had noticed the looks again as she walked down the aisle to the bathroom. Also over dinner the night before. It must have been something she gave off . I would hardly have noticed her I told myself. Still I was sitting in the half light storing her in my mind so as to never forget her.\n\nThe end of the line was due that day. After more than thirty hours on the move the train would come to a final stop. At least final for me and those few passengers who were left aboard. The end of the line would actually be farther down the tracks but we would be leaving the train at the last town before arriving at the work camps. The arrival was supposed to be in the late afternoon but could be anytime after the scheduled arrival. It appeared that we were an hour or more behind schedule. In a time when more than one train traveled the single set of rails that could be disastrous. At that time there should have been no train coming from the other direction. We were past all the rail intersections. The train on which we all rode was the only one on the isolated track or so I thought.\n\nI was nodding in and out of sleep when the incident began. I heard the voice through my sleep. The voice belonged to a man. He was demanding that the passengers get their valuables together. I was awake only enough to know I had to do something. I didn't want to cause a fuss but I also didn't intend to give up my wallet. I especially did not intend to give up my carpet bag.\n\n\"Come on folks we don't have long now get your things together.\" The voice was harsh and demanding. It seemed our bandit was a bit nervous. That was not a good sign. I slipped the small pistol from my shoulder holster. I had it on my lap as I pretended to still be asleep. I felt Edith tense beside me. The Bandit was apparently very close. I resisted the urge to take a look. I felt the pistol barrel prod me.\n\nHe expected me to wake with a start so I did of course. I pushed the pistol barrel slightly to the side as I shot him in the face. The cloud of burnt powder hung over our seats. Edith like any good woman of the time fainted. If not she pretended to faint which I think was the case most of the time. Of course if she had fainted I wouldn't have blamed her, the very dead bandit fell into her lap. I pushed him into the aisle as quickly as I could. Not soon enough to save her dress. Her lap was covered with blood and other liquids. Not to mention the solid matter from the not so good gun hand.\n\nWhen he fell the gunman dropped his weapon on the floor at her feet. I reached down to find it under the long skirt. She must have really been out I thought. She didn't move even a little as I moved my hands around her feet. I also had my arms and body over her legs. She would have been beating on me if she had been awake. I did manage to recover the Colt from the floor. It was not in very good shape. I noted that instantly. Strange the things that stick in your mind.\n\nI stepped into the aisle and over the body of the bandit. I didn't really recognize him. I moved cautiously toward the next car. It was entirely possible that he was not working alone. It was in fact likely that he had accomplices. He would not want anyone from another car coming up behind him. \n\nIf that were indeed the case either of two possibilities might occur. The others might rush the car to secure it. More likely they would just fortify their position and wait for a fool to enter the car in which they were holed up. Most of the train cars were pretty much empty. As the train went on it's way passengers left the train but few if any got on. The distance left to go got smaller all the time. As the cars emptied the conductor closed them to cut down on the amount of walking for him I supposed.\n\nOf the five passenger cars only three were occupied that morning. I was in the car closest to the end of the train. I was forced to work my way forward. I didn't bother with the long gun. The two pistols I held in my hands would have to do. It I wasn't bushwhacked they would do just fine. Since no one from the other cars had come to investigate the shooting I had to assume someone was holding them prisoner. At that point I realized it had only been a few seconds. \n\nI turned back to the passengers in the coach. \"Folks it is likely a man with a gun is going to come checking on his friend in a second. I suggest you all get your weapons. If a man comes in with a gun shoot first then we will ask who he is.\" I moved to stand in the aisle at the end of the car. It was the end which let to the engine. It didn't seem likely that anyone would be coming from there.\n\nI hoped it wouldn't be a good guy coming to investigate the shooting. If it were I hoped he would be smart enough to announce himself. Then again accidents happened. The door opened at the far end of the car. The man didn't appear to have a gun as he stepped into the car. I was about to think he was just a passenger when the gun appeared in his hand. \n\nI fired two quick shots. I have no idea if I hit him or not. The coach quickly filled with the sound of several guns. The cloud of burnt powder filled the air around me. The smell of mostly burned black powder would make some of the ladies ill i knew. Hell, it almost made me ill. It had the familiar smell of death about it. Remembrances of the war of evil Yankee aggression would have filled my mind if I hadn't stayed focused on the man at the end of the car. It was a waste of time to pay any attention to him. He was pretty much cut to pieces.\n\nI heard screams from the next coach. I rushed over the body of the man I killed then over the body of the man everyone in the coach had killed at least once. In the next car up I found a woman slumped forward in her seat. Somehow someone's shot had penetrated both walls of the train car then struck her in the shoulder from behind.\n\n\"Is there a doctor in here?\" I asked quickly. I didn't bother looking at the wound since there was almost nothing I could do for the woman. \n\n\"You,\" I demanded of the man seated across the aisle. \"Go into the rear car and ask. You,\" I said to a second man. \"Go forward this woman needs help.\"\n\nI had no idea what to do so I tried to hold the wound shut with my hand. I am sure I ruined the suit I was wearing but hell people everywhere wore stained clothes in those days. I was trying to hold her together when I felt someone push me out of the way. I looked to make sure it wasn't someone wanting to look at the wound out of curiosity.\n\n\"Deacon move and let me try to help her.\" I recognized both the voice and the face of Edith Wilson. I didn't understand at first but then I did. Edith knew something to do for the woman. Something I didn't know.\n\nI stood close to watch as Edith ripped the blouse of the unconscious woman. She took a look at the wound then pushed the woman back to make sure there was no exit wound. She turned to me with a request for help in her eyes. I helped her move the woman so that her wound would be easier to reach. While I was moving her the crowd gathered around us.\n\n\"I am going to have to get that bullet out. We need to stop the train.\" She said it to me. How I got to be the leader of our little band was a pure D mystery but here I was. That little piece of white at my collar was proving to be a bit of a bother. I found the conductor more or less hiding in the caboose. I forced him to go forward with me to stop the train. He didn't much like the idea but then I knew he was a coward. I was about to threaten him when he came to his senses on his own.\n\nAs we passed through I found the woman awake. Edith had her drinking what at first appeared to be whiskey. On closer inspection I found it to be Laudanum. Edith had been only mildly lucky to find anyone on board with the drug. It wasn't totally luck as there were many people who took the drug for various pains. I had taken the mixture of opium and whiskey myself for a while. Even after the pain from the horse who kicked me was gone I still wanted the Laudanum. Daddy locked me in my room for three days until the urge subsided some. Even after so many years the sight of the bottle brought a craving. Once I recognized it I passed quickly on my trek to the engineers small work place. \n\nThe conductor explained all the events to the engineer. He shook his head. \"Sam you know better. If I stop this train it is gonna play hell with the whole damn schedule. The woman will just have to take her chances.\"\n\n\"Stop the damn train,\" I replied to his argument for the conductor.\n\n\"Mister listen to me. You ain't even supposed to be here. If I stop this train there is an east bound one coming this way. I got to make it to a siding to get out of his way.\"\n\n\"How long to the siding?\" I asked.\n\n\"Half an hour,\" he replied.\n\n\"How long we gonna be there?\" I asked. \n\n\"Till the east bound passes us. Could be ten minutes could be an hour. If he is on time we will be there about twenty minutes.\"\n\n\"But we could stay there longer?\" I asked.\n\n\"Yes,\" the little man looked nervous. \"We could stay there for a couple of hours if we wanted. There will be no more east bounds until I turn around and head east.\" We could send a telegram from the next town to explain and redo the schedule.\"\n\n\"Okay then pour on the coal. We got a woman needs some cutting back there,\" I demanded. The little man did something because I felt the train pick up speed.\n\nAs I walked back through the car where Edith and I had slept I was assaulted with questions. I left the conductor to explain as I went in to tell Edith the news.\n\n\"Deacon, that is not going to be good for this woman. She may die.\" Edith looked more than a little concerned. \n\n\"Edith it is the best I can do. If we stop here all these people may die. I saw two trains run into each other in Georgia. Believe me it is not something you walk away from. The engineer is pouring on the coals. We might be able to reach the siding in less than half an hour. It is the best I can do.\" I wanted her to know I had tried. I also wanted her to know that it was the best decision all around. I could tell she wasn't buying it. Fortunately she didn't argue in front of the woman.\n\nI wanted to ask where the white bandage she held against the wound had come from but i didn't. I had seen women during the war ripping up petticoats to make bandages. Mostly though it was old bed sheets.\n\n\"Well if you wont get this train stopped for me then sit here and hold the bandage.\" Edith almost smiled. She and I alternated holding the bandage on the weakening woman. She was filled with the opium whiskey mix when the train finally pulled onto the siding. \n\nEdith listened to her heart. \"She is getting weaker Deacon. I am going to do what I can for her. Why don't you go pray for us all.\"\n\n\"I might be more use helping out. I have seen plenty of gunshot wounds.\" I smiled at her. I realized again that she was almost as tall as me. Strange that I should think of that at such a moment. My mind worked as it wished with no regard to the things going on around it. It was the only conclusion I could reach.\n\nEdith began to work on the woman immediately after the car came to a stop. She first enlarged the opening then found the bullet. she worked it out with what looked like long shiny pliers. The enlarged wound bled only slightly more than the original opening. When Edith finished the removal of the bullet she seemed to fit all the internal things together like a puzzle. She then used a large needle threaded onto a piece of cotton sewing thread to close the skin. I wasn't surprised to see the blood stop. I had seen it all before. Edith was a very competent surgeon. I had no idea what she was really but she had done all the right things for the woman.\n\n\"Is it gonna fester?\" I asked.\n\n\"Well Deacon, you might want to pray for her now. It is likely that she will have some fever. If our delay in operating didn't make her body too weak she has a good chance. There is no doctor between here and the end of the line. She can go back on the train to see one east of here if she wants.\"\n\n\"You need to talk to her,\" I replied. \"She isn't going to think she needs anything as long as she is on that Laudanum.\"\n\n\"I know but how do you know?\" she asked.\n\n\"Long story about a older teenager kicked by a horse. I loved that stuff better than life at the time.\"\n\n\"It is truly the devil's brew but for a person in pain it is a miracle. It is also the best thing for a person who is dying. One day there will be better things but for now it is the best thing we have.\"\n\n\"Are you a doctor?\" I asked it with a great deal of respect for her no matter what she was.\n\n\"Horse doctor,\" she replied with a smile. You might not want to tell her that without a little preparation. I expect it might come as a shock to her.\"\n\n\"I don't suppose you would like to come back to your seat to rest?\" I asked it knowing she would want to stay with the woman.\n\n\"No but thank you for thinking of me.\" She flashed me a very nice but non committal smile as I walked through the door on my way to my seat. I suppose it was a combination of the restless night and the loss of adrenaline that caused me to crash. Whatever the reason I awoke only when we reached the last town before the end of the line.\n\nWhen I awoke I realized someone had moved the bodies. Who and where I had no idea but they were no longer in the floor. Since they hadn't past me while I held the injured woman's bandage in place I assumed they were in the coal car or maybe tied on top of the coach. I honestly didn't give it much thought. The fate of dead bodies had a very low priority with me.\n\nIt was easy to tell the man walking down the empty aisle toward me was a lawdog. He didn't even need the badge he wore. The badge was a simple star with the word Sheriff stamped into it.\n\n\"You the deacon,\" he asked.\n\n\"Yes,\" I said it standing. \"Would you mind stepping aside so I can get some water?\"\n\nHe looked as though he wasn't sure what to do. I helped him make up his mind as I move toward him. He had to speak, move or try to stop me. He chose to step aside. He also followed along behind me as I walked down the narrow aisle. I took the dipper rinsed my mouth then took a long drink of tepid water.\n\n\"So exactly what happened this morning?\" I was not sure what he wanted. I was pretty sure he had interviewed the dozen or so people who knew.\n\n\"Couple of guys tried to rob the train and got killed for their efforts.\" I was still half asleep when I answered.\n\n\"Is there some reason you didn't just give them your money?\" He was on the right track but didn't know it.\n\n\"Sure, I didn't give it to them because it isn't my money.\" I was pretty sure he would have gotten a telegram to be on the look out for a cowboy with a lot of money. Every lawdog along the rails would have gotten a similar message.\n\n\"And whose money is it?\" He asked the question while tensing. I am not sure a small town lawdog wanted to go up against such a big time killer as me, At first I laughed inward at the thought of me being a big time killer. Then I realized sadly that it was true.\n\n\"Why Sheriff I would have thought you could figure that out. It is the Lord's money. I don't think the folks who donated it would want a common thief to have it. It is money designated for the opening of churches in towns were there are none. It is to bring the Lords words to those crying out in the wilderness,\" It was crap all right, but he didn't know it.\n\n\"Would you mind if I take a look at your pistol?\" he asked it just to have the last word I knew. \n\nIf he had asked to look in my bag, I would have killed him. Since in those days men respected other men's privacy he did not want to look without cause. I had given him none. He accepted the pistol which I handed him butt first. I still did not wish to cause any problems.\n\n\"You in the war?\" He asked it pretty much knowing the answer.\n\n\"I was Sheriff.\"\n\n\"Tell me the difference between a deacon and a preacher?\" He demanded it but softly.\n\n\"It is simple Sheriff. After the war I was called to do the Lord God's work. I was not called to preach the Gospel. I was called to do other things the church needed done. Things that no preacher could do.\" I was amazed at how easy the words came to my lips. \n\n\"Where you headed? I mean we got a church here in town.\" The Sheriff seemed more curious than suspicious.",
        "\"I have been called to open a church in Sadie's Gulch.\" I did not elaborate. I had pretty much figured out the less I said to the man the better.\n\n\"Holy shit, sorry preacher but Sadie's Gulch is the wrong place for a church.\"\n\n\"You mean they don't need a church there? I think you will agree. Every town needs a church.\" I was just playing on the documents which I had found in the dead deacon's box.\n\n\"Well Deacon it will be a sight worth seeing. At least they had the good sense not to send another soft preacher type. You are the third preacher to try to open that church.\"\n\n\"Like I said, I am not a preacher.\" After a moment's reflection I asked, \"So what happened to the others?\"\n\n\"They mostly got scared off. None of them actually got killed. Least not none I know of.\"\n\n\"Well that is comforting. It doesn't make any difference but it is comforting to know.\"\n\n\"There might be a reward for those two. If there is, do you want me to send it on to you. To help with the Lords work?\" If I said no he got to keep it. I was sure it was his hope.\n\n\"Why don't you donate it to that local church of yours?\" I asked it, but I knew the money would never show up in the local collection plate.\n\n\"Fair enough, Deacon you did the right thing on these boys. They would have kept it up until they killed somebody. If not yesterday then today or tomorrow.\"\n\n\"Sheriff, I knew they were wicked. It was not I, but the hand of the Lord who chastised the men.\" I tried to sound at least a little fanatical. I must have done pretty well since the sheriff would not meet my eyes again. He simply nodded then walked from the car kind of shaking his head. It was a bit of a mystery to me how everyone could have left the car without waking me. Nonetheless I was the only person left in the car.\n\nI removed my rifle and carpet bag from the overhead rack. As I walked from the car I gave some thought to finding Edith to say goodbye. I was so sleep addled that I almost forgot she would be leaving the train with me. It was after all the last stop before the end of the line. The workers were laying track ten miles farther down the line.\n\nA wooden platform separated the train tracks from the station. A dirt wagon path separated the station from the town. The town occupied only the south side of the tracks. On the north side cattle grazed inside a barbed wire surround pasture. I would have loved a drink of whiskey and a bed for the night. I would have done both had the sheriff not already have made my acquaintance. Instead I walked to the small general store. Since the town was too small for a livery stable the general store might know where I could fill my needs.\n\nI took no notice of the other shoppers. I went directly to the counter where a man stood watching everyone closely. I had a feeling my stay in the town though short was going to be very unpleasant.\n\n\"Good afternoon brother,\" I said trying to stay in character until I left the small town.\n\n\"Good afternoon parson, what can I do for you?\" The man's face seemed to be set in an unbreakable scowl.\n\n\"I am in need of transportation to a town named Sadie's Gulch. Could you tell me if there is a coach to that wicked place?\" I didn't smile at him, instead I tried to look fierce.\n\n\"Not even to a town closer than here. Sadie's Gulch is a mining town and not many people go there except to work. Those go by horseback or they walk. There are freight wagons but they do not carry passengers. They also do not run on any particular schedule. I am sorry the best I can suggest is that you buy a horse.\" He seemed almost amused at the thought. I suppose in the black suit and clerical collar I did not look like a horseman.\n\n\"Very well where might I purchase a horse?\" I looked him hard in the eye. It just did not have the desired effect on him. Again I thought it must be the clothes. He didn't seem as respectful as he should.\n\n\"Best thing you can do, unless you want to walk about five miles, is to walk over to the saloon. You can ask around in there somebody probably has a horse they want to sell.\" He was still watching the few people milling about the store. I didn't watch them I watched him watching them.\n\n\"Tell me brother.........\" I waited forcing him to answer with this name before I continued.\n\n\"Edwards, parson,\" he finally replied.\n\n\"Ah Brother Edwards, why is it that you watch the customers so intently?\"\n\n\"I have to parson. Otherwise these people would steal from me.\"\n\n\"You do know that this is all trash in the making my friend.\" I smiled. I noted with great satisfaction that he did not seem to understand. I walked from the store without making any purchase. He and I both knew I would be forced to return since he had the only store in town. Probably the only one before I reached Sadie's Gulch.\n\nThe store did not even have a porch. It was out the door and down two wooden steps to the dirt wagon track. I turned toward the small one story structure with the sign reading 'Sleeping Dog Saloon'.\n\n\"Deacon,\" I heard the sound of the woman's voice from behind me. I turned to see Edith walking toward me.\n\n\"Ah Edith, how is the patient?\" I asked it curiously as well as to start the conversation.\n\n\"She is going to be fine. I explained to her what I had done. I even suggested that if she had any concerns because of who I am, she might want to find a doctor to take a look.\"\n\n\"And who are you?\" I smiled when I asked it.\n\n\"Deacon, I am an animal doctor. At least I am of sorts.\" She saw my curious look. \"It is a long story. If you go along with my plan, we will have plenty of time for me to explain.\"\n\n\"What is it you have in mind Edith?\" I really had no idea what she could mean.\n\n\"I heard you in the store asking about going to Sadie's Gulch.\" She had a bold look on her face something most women did not have at anytime. With the possible exception, if the were forced to defend their children.\n\n\"I am bound there to open a church.\" I explained it hoping she would accept it without question. I wasn't sure I could defend the plan.\n\n\"Well they certainly need one. That is not my concern at the moment. I need to get to a horse ranch about five miles this side of Sadie's Gulch. So I suggest we travel together.\"\n\n\"You mean the two of us alone on the road. I hardly think that is fitting Edith.\" I said it with what I hoped was a serious look. At that moment I wished I was my former self. Even though Edith was not a raving beauty she was a striking woman.\n\n\"Deacon let me explain something. If you are worried about your reputation, don't be I will leave you before we reach the Gulch. No one there need ever know about our having traveled together. If you are worried about what my husband might think, don't be. He has left me here to fend for myself. You are the best and probably the only companion I could find.\"\n\n\"Edith, I would be happy to accompany you, if you are sure it will not cause a problem in your marriage?\" I wasn't thinking that at all. I was thinking more carnal thoughts.\n\n\"Not to worry Deacon, there will be no problem in my marriage. None that is not there already.\" She seemed more resigned to her situation than sad. I did not understand nor did I care to understand. \n\n\"Well it might not matter none anyway. I got to find a way out of here. We are both going to be stuck here till I do.\" I was racking my brain to come up with something besides taking a couple of days to find a horse. Even the saloon didn't seem to offer much hope. There were only two horses tied up at the hitching rail beside the building. One day there would be a livery stable in the town since the railroad ran through it. I expected that the train was so new lots of businesses hadn't had time to catch up to it.\n\n\"Did you notice the wagon pulled up behind the store?\" Edith asked it in a very serious all business voice.\n\n\"No I didn't. Do you know whose it was?\" I thought maybe she could help me out.\n\n\"No, but it said The Hennessey Horse Company. Hennessey is a horse breeder like my husband. His man must be in town picking up supplies. We should be able to get a ride with him back to the ranch. He will definitely have horses for sale. You can afford a horse?\" She seemed worried about it.\n\n\"Yes I can, but can you?\" I asked it seriously.\n\n\"No, but if you buy me one, my husband will buy it back when we arrive in Sadie's Gulch. Truth is though for some reason I thought you would want a buckboard or something like it.\"\n\nAt that point I remembered the real deacon's wagon. \"That would be best for visiting and the like, but I would just have to sell it when the church was up and running. That is why I had decided on a saddle horse. However a small wagon would do as well.\"\n\n\"It makes no difference to me. I am at home on horseback. Standing here in the street is not especially good for either of our reputations. Why don't you go in and find Hennessey's man.\" \n\nIt was never a question. I went into the saloon since I hadn't noticed anyone who looked like a ranch hand in the store. I went to the bar first thing. \"Whiskey and beer,\" I demanded. The bartender was quick with it even though he looked a little skeptical. I put the silver dollar on the bar before I drank. \n\nWhen he returned with my change I asked, \"Is there a man from Nate Hennessey's place here.\n\n\"Don't want no trouble preacher,\" he said in reply.\n\n\"I need a horse so that I might get out of here. I was told his boss had horses for sale.\" I turned my back to the bartender so I could look over the room. The two men who sat at a table talking were definitely not ranch hands. They had to be drummers of some kind.\n\n\"Jarve is in the back. He should be finished anytime now.\" It was the bartender authoritative answer. He obviously knew the habits of either Jarve or the whore with him. I was torn between waiting inside or going out to stand with Edith. I waited at the bar. I even had one more drink.\n\nWhen the cowboy came through the curtains used to cover the hallway entrance I cornered him. \"Jarve, my name is Deacon Burke. I am in need of a horse. I understand your boss has horses for sale.\"\n\nThe man took a couple of seconds too long to process the information. \"Sure, what you want to do?\" He asked it not exactly understanding my request.\n\n\"When are you going back to the ranch?\" I asked it wanting to shake him he was so slow.\n\n\"Soon as I have me a drink.\" He was definite about the drink.\n\n\"Tell you what, I need to buy some things at the store. I will just toss them on your wagon and catch a ride out there with you. That way I wont have to come back to town.\"\n\n\"I guess that will be okay,\" he replied.\n\nInstead of saying anything else that would have been useless, I turned to walk out the door. I didn't see Edith at first. She was inside the doorway of the store. I could just imagine the scene in there. The overly suspicious clerk must be going crazy. I walked across the street toward the store. Edith came out to meet me.\n\n\"So?\" she asked.\n\n\"He is having a drink,\" I replied.\n\n\"Deacon go get him,\" she demanded.\n\n\"I have to buy some things in the store. If he is not out here shortly after, I will.\" She looked as though she didn't believe me. Well more like she was impatient with me. She seemed to be in a hurry to get home.\n\nI bought two blankets from the store. I also bought camp cooking items, and a little food for the three day trip. My only other purchase was a canvas tarp. I could have used my pocket knife to cut the tarp into a ground sheet for each of us. Instead I rolled it in one full sheet. I knew she would have no use for a ground sheet when she got home. I would have wasted a perfectly good tarp for nothing. If she wanted a ground cloth she would be forced to sleep beside me. If not, then she could spread her blanket on the ground. All my purchases fit into a large wooden box which I added to the Hennessey wagon.\n\nI wasn't too worried about the space the items would take up on horseback since there would be two of us to carry them. There was also the slight chance Hennessey would have a small wagon I could buy. The wagon would add only a few more hours to the trip. The journey would be made over wagon roads anyway.\n\nEdith looked at me with real disapproval as I sat down to await the driver. I could tell she wanted me to go pull him out of the saloon. Edith had never been a man after a long hard month's work on a ranch. The cowboy just wanted a few minutes to relax. Of course the ugly old and fat whore would help. I hadn't actually seen her but whores in a town as small as the one where I parked my butt usually were all of those things. Their one saving grace was that they were willing. Edith on the other hand was attractive, young and thin. She however, was not going to be willing. Still I could only hope that I was wrong.\n\nJarve showed up a few minutes after I parked my butt. He walked to the wagon without a word to either of us. He saw my box. He stared at it as though trying to decide whether or not to chuck it over the side. He decided against it without even looking at me. His decision was made for other reasons than the look in my eye. I had to work on hiding that look since I didn't think it suitable for a deacon. Then again I wasn't a parson so I might get away with a fierce look now and again.\n\nThe ride to the ranch took well over an hour. The ride was almost totally in silence with the exception of Jarve's telling me how long the ride would be. Hennessey was at the house. Judging from his appearance and the glasses perched atop his head he was working on his books. I placed my box on his porch realizing I had made a mistake by bringing it. He pretty much knew we had no choice but to buy a horse from him. He would have known it anyway. We had no other way to get back into town box or no box.\n\n\"Mr. Hennessey,\" I greeted him with a handshake. My name is Deacon Burke. The lady and I are headed to Sadie's Gulch. I need to purchase some form of transportation.\"\n\nHennessey looked me over carefully. I expected he was judging my ability to pay. I am sure he was taking that into consideration before he began showing me horses. I didn't mind. I figured I might as well start playing the part.\n\n\"Well Deacon if you are going to Sadies Gulch you need more than a horse and prayer. You need a good sized iron rod.\"\n\nI had a pretty good idea, but I asked anyway. \"Why would I need an iron rod?\"\n\n\"Sadie's Gulch is about the roughest town in Nevada. They don't exactly need religion as much as they need killin' over there.\"\n\n\"Well Mr. Hennessey the Lord has called on me to start a church there. He did not however give me exact instructions on how to do it.\" I gave him the fierce look I had been trying to hide. Hell it just slipped out.\n\n\"Religion at the point of a gun. It is an interesting concept.\" He turned his attention to Edith for the first time. Mrs. Burke why don't you go in the house. Emma will be in the kitchen fixing supper. Just follow the smell. I expect she can find you a glass of lemonade.\"\n\n\"Mr. Hennessey I am not Mrs. Burke. If you have no objection I would like to stay.\" She had a look that somehow said she was the one making the decisions. I supposed even in those days women could rule their men. The problem seemed to be that I was not her man. She did know more about horses than me. Not that I didn't know about them. I just never made a study of the filthy beasts.\n\nHennessey made a noise like a man clearing his throat. It was to show his dissatisfaction with a woman at a business discussion. I had no real opinion so I just followed along behind him with Edith bringing up the rear. \"So Deacon, what did you have in mind.\"\n\n\"I don't suppose you have a buckboard or small wagon around here you would part with?\"\n\n\"Deacon, being a horse trader means I have to take a lot of junk in. When a man goes under around here he brings me his horses and rolling stock. I buy it all. The horses I resell. The rolling stock most likely sits in the shed over there for years. If you can find anything you want over there, I will make you a good deal.\" \n\nHennessey stood by his corral watching his horses for a second. It was obvious he wasn't going to bother walking with us. Edith and I made the short walk over to the large shed. Under the shed lay several wagons. They were both large and small types. The one thing they had in common was the way they were stored. They were piled about in total disarray. Large wagons hosted smaller ones inside their beds.\n\nEdith and I weeded through them until we saw a couple we liked. She stood back as I checked their condition. One was very small with hardly more than a seat with a three foot square area behind. The other was slightly larger but not much. Of the two the smaller one was in the best shape. I could not find any cracks in the wooden spokes. It seemed to be in almost new condition. I decided to get a price on both. The larger wagon was in better than average shape but not nearly as perfect as the smaller one.\n\n\"Okay Mr. Hennessey, I found a couple I could live with.\"\n\n\"Good, let's go take a look.\" he allowed me to show him the ones I had found. Both were atop other wagons. \"Well the small one is in good shape but I don't expect nobody else will ever want it. How about twenty dollars?\"\n\nIn spite of his nonchalant manner twenty bucks was a lot of money. I shook my head trying to find a place to begin negotiating with him. From out of nowhere Edith spoke.\n\n\"How about we see the horse that goes with the wagon,\" she suggested.\n\n\"Miss, at that price there is no horse included.\" Hennessey looked offended. Edith looked amazed. I looked lost. It was quite a scene I am sure.\n\n\"You do have horses broke to the trace?\" Edith asked.\n\n\"Sure I do,\" Hennessey replied. \"I already send Jarve out to get the ones that I have for sale.\"\n\n\"Let's go see how he is doing.\" Hennessey looked like a man with something more going on than he was telling.\n\nEdith was beside me during the walk. She was out of Hennessey's hearing when she whispered. \"Am I embarrassing you?\"\n\n\"Not at all are you trying to embarrass me?\" I smiled to soften the words. She was smart enough to see through it.\n\n\"No, but most men would be livid by now. I mean a mere woman with an opinion. Hennessey will be soon.\" She seemed to look forward to it.\n\n\"Then he will be. What he does we don't have no control over.\" She looked at me then smiled broadly. Hennessey was waiting for us by the corral so she didn't speak again as we walked up.\n\n\"Only one Jarve found so far is the gray. You can take a look at her if you want.\" I looked from outside the fence. About all I could tell was that she was a nag. I could examine her closer and still it would be all I could determine.\n\n\"Is that the only one you want to sell us?\" Edith asked the question with a hint of humor in her voice.\n\n\"I have three others. Jarve is out looking for them.\" Hennessey was more than a little on the defensive.\n\n\"I know, but is this the one you want us to buy?\" Edith was looking hard at him as she spoke.\n\n\"So you allow your woman to talk to menfolk that way?\" Hennessey asked it almost angrily.\n\n\"Well she ain't my woman, but yeah I pretty much allow all people to have their say.\" I was looking away at that time. The gray horse seemed almost listless.\n\n\"Well you menfolk talk all you want, I am going to go take a look at the nag.\" Edith said that as she carefully climbed over the fence. She moved gracefully in spite of the heavy skirt she wore.\n\nHennessey and I watched as she approached the horse. The gray never moved a muscle. I was beginning to wonder if the horse was really alive. It might have died. I supposed it could be waiting for someone to tip it over. The thought brought a smile to my lips.\n\nHennessey watched Edith closely as she examined the horses teeth. It is a misconception that horse people look at the teeth. They actually look at the gums to determine a horses age. When edith finished with her inspection of the horse's mouth she lifted each hoof. She checked the horse for hoof damage I supposed. After that she did the one thing that probably impressed Hennessey. It sure as hell impressed me. She pressed her ear against the horse's chest. She listened the old nag's heart for several minutes. When she had finished her inspection she walked about fifteen feet back to us then turned. She stood just watching the Gray for a few seconds which seemed much longer.",
        "When she returned I waited until I had helped her down from the fence. To save her from further embarrassment I asked. \"So what's the word?\"\n\n\"She is old Deacon, but you knew that. I would guess she had one more trip in her yet.\" The light in her eye told me the horse was old but sound.\n\n\"So okay Hennessey how much for the horse and the little wagon?\" I asked it waiting for the inevitable haggling to begin.\n\n\"Well forty dollars seems about right to me,\" he declared.\n\nI was preparing to speak when Edith chimed in. \"God how can you say that. He is going to take a wagon off your hands. One that is too small for any other human on the face of the earth. Plus he is going to save you the trouble of burying the gray.\"\n\n\"Deacon, I don't think I wish to continue with this until you have that woman under control.\" \n\nHennessey turned to walk away. I took hold of his arm to turn him back. He tried to pull free. I held him in a grip as strong as I could. I know it must have hurt but he didn't show it. In every part of his being he was a man.\n\n\"Deacon, I know you are a man of god. I give you fair warning sir, if you don't let me go there is going to be one hell of a fight.\"\n\n\"Then you will lose Hennessey. You might even die.\"\n\n\"Are you threatening me?\" he asked it angrily at first. Then he seemed to come to an understanding as my look finally sank in.\n\n\"Mr. Hennessey you have a responsibility. You have horses for sale. We have to have one to get to our destination. I am not going to die, nor am I going to allow the lady to die just because we can not come to terms.\"\n\n\"Edith tell me the top dollar. How much is the wagon and the gray worth?\" I asked it calmly with Hennessey standing defiantly.\n\n\"Twenty five is top dollar,\" she replied.\n\n\"Now Mr. Hennessey keeping in mind you are dealing with a man of god. Will you take the twenty five?\" I asked it in a calm voice while looking him in the eye. I did nothing else to change his mind.\n\n\"Jarve will be along to find the tack. I want you to load up and leave here.\" With those words Hennessey walked away. I was a little surprised when Jarve showed up a few minutes later with the tack. He and I wrestled the wagon free from it's host wagon. Like a giant tic it finally broke loose from the larger freight wagon.\n\nI both watched and helped Jarve prepare the wagon for my trip. He and I removed the wheels then he greased the axles. It sounds like a larger job than it actually was. I also watched closely as he attached the harness leather to the wagon. The leather along with the two long poles where the attachments which held the old gray to the wagon. When we finished loading the wagon the day was almost gone. I had considered asking Hennessey for a room but he never returned to the yard. In the end I paid Jarve.\n\nEdith and I headed off into the failing light with an untested horse and tiny wagon. Both our meager possessions could not fill even the tiny wagon's bed. Once we left the gates of the ranch I looked back at the comfortable house with a certain amount of envy. It would have been nice to have a home cooked meal and clean bed for a change. It seemed that even talking hard to a man like Hennessey was enough to get us pushed out into the night. A lesson I would have to remember. It seemed that cold logic and warnings of doom did not make me any friends.\n\n\"Well we seem to have tested his hospitality and he failed,\" Edith said it as she noticed my reaction to leaving the ranch. I was taken aback since she seemed to be reading my mind.\n\n\"Yes it appears that Mr. Hennessey is a bit of a sore loser,\" I replied.\n\n\"Deacon, you were a bit hard on him,\" she suggested.\n\n\"Might I remind you Edith, you were the one he wanted to put in her place.\"\n\n\"Mr. Burke, I have no place.\" Her remark was sad not defiant.\n\nThen why is it I am taking you home, if that is not your place.\" I didn't have any idea why I asked or even what the question was supposed to mean. It had seemed the right thing at the time but then it suddenly seemed wrong.\n\n\"What faith are you Deacon?\" Edith seemed curious but also somehow prying.\n\nI quickly reverted to the faith of my childhood. \"Why I am Baptist Edith. I thought you knew.\" I knew better. I suddenly realized that I should have made it known earlier.\n\nEdith looked away into the gathering gloom. She didn't answer me. It was an irritating habit she had. The old gray plodded on toward town. We rode in silence for most of the way.\n\n\"Edith there is no hotel in town,\" I suggested.\n\n\"I know that. Why do you mention that now?\" Edith was not the most pleasant of traveling companions. Since I was a man forced to live an exemplary life for a while, I could only dream that Edith was a saloon girl. I was about to slip into a day dream. One in which I was taking the three day trip with not one but two saloon girls.\n\n\"I asked why you mention that,\" Edith reminded me. Edith had harshly pulled me back to the reality of my situation.\n\n\"Because we are going to be sleeping on the ground tonight. This wagon is not even large enough for one of us to sleep in.\"\n\n\"Deacon, you are again stating the obvious.\" Edith was a hard woman.\n\n\"Tell you what Edith. Why don't I just drop you in town. I think we are not going to be such good traveling companions.\"\n\n\"Why do you say that. Is it because I asked you why you mentioned there was no hotel in town. By the way, if there is no hotel what will I do this late at night. No deacon, you and I are going to travel together because a man of god would not desert a woman in distress.\"\n\n\"What distress would that be Edith. Having to find a family who will take you in for a few days until your husband can get to town.\" I thought it sounded trivial.\n\n\"There is no family to take me in. Our people are a ways to the north. Everyone around here knows who I am.\" After she made the mysterious comments she thought she was going to just dummy up.\n\n\"Who are you? What people are you talking about?\" I asked it because I was totally lost.\n\n\"Two very good question. On second thought I am not sure who I am. The people to the north probably wouldn't help after all.\" She was again looking off into the approaching night.\n\nI suffered her silence for several minutes then it slipped from my mind. I had decided after the war that I had little desire to become involved in anyone else's problems. I couldn't fix their lives when my own was such a wreck. I did not pursue her openings also because it was a long trip to Sadie's Gulch. It would all somehow come out. Of that I had little doubt.\n\nThe sun was completely down when we arrived in the town at the end of the rails. Sadie's Gulch was south of the tracks, while the work gangs were west of it. I made a choice to move due south for a while to put some distance between us and the workers. A large group of men could mean trouble at any time. Alone I would have been a poor parson traveling west hardly worth any interest at all. However with Edith I was a parson with a pretty young wife. With women being in such short supply even a parson's wife could well incite the passions in a man. While traveling it was going to be inevitable that she was thought to be my wife. Since it would be safer for us both I doubted I would be the one to set anyone's record straight.\n\nAll that passed through my mind as I took the road south out of town. Another hour passed without any conversation. I was at the point of deciding just to keep traveling all night when she spoke.\n\n\"Deacon, this horse wont be worth a tinkers dam tonight if you don't stop soon.\" She didn't seem to mind sharing her opinion even though I hadn't asked for it.\n\n\"Well that pretty much makes up my mind. We are only a few miles from town but we can stop at the next tree we see.\" I wasn't at all upset. She seemed to think otherwise.\n\n\"Would you rather I not give my opinion?\" She wasn't asking to be helpful. She was looking for a fight. I ordinarily would have given her the fight. That night I was tired enough to remember I was a Deacon.\n\n\"Give your opinion anytime you wish Edith. It will just take a while to find a place to stop for the night.\"\n\n\"You don't have to wait for the ideal place you know. Any place with a little shelter will do.\"\n\n\"Perhaps you would be happier picking the spot?\" I suppose in retrospect, I was a bit snappish.\n\n\"Of course I will, if you wish. I imagine I have more experience than you.\" I couldn't tell whether she expected me to argue or not. She was certainly baiting me, or at the very least prying for information.\n\n\"You probably do Edith. Why don't you just pick a spot.\" I tried to keep my voice neutral. After all it would only be two or three days travel with her at most.\n\nNothing more was said until we happened upon a small clump of trees just off the road. The trees were barely visible in the moonlight.\n\n\"Could we stop over there?\" As she spoke she was pointing to the trees.\n\n\"Of course,\" I replied. \"It looks to be as good a spot as any.\" I turned the horse and wagon over the rough ground. Not being able to see the ground was a bit of an inconvenience. We had waited too long to stop. I allowed the horse to find her own way to the trees. Once we were stopped I climbed down stiffly from the wagon seat. I might have helped Edith down had she not have already been on the ground.\n\nI went to the rear of the wagon. Inside the bed I found the large wooden box with the camping gear. When it was on the ground I turned to Edith who had stood watching for the few minutes it had taken.\n\n\"Well why don't you cook while I take care of the horse?\" I thought it was a sensible plan.\n\n\"I would rather take care of the horse while you cook,\" she suggested. I analyzed her voice but couldn't find anything particularly in it.\n\n\"Well if you would rather, that is fine with me.\" It was too dark to read her face so I began unpacking the camp gear. The new six inch deep cast iron frying pan was the easiest thing to recognize in the dark. The cloth bag with the food, mostly bacon, came from the box next. I also found one of the new tin cans of beans easily enough to include it on the menu.\n\nI found the kerosene lantern inside the corner of the box. The shop keeper had packed the items rather poorly. It the kerosene had spilled it would have ruined the bacon. I got the lantern lit after a short search in the box for matches. In the out of doors the lantern didn't provide much light but it was better than nothing. \n\nI sat the lantern on the bed of the wagon while I began working on supper. Thick sliced bacon and beans was the simple menu. There was some bread that didn't appear to be more than a day or two old. It would be a little stale but I had a taste for stale bread.\n\nThe coffee was another thing all together. I made strong coffee a lot of it had to do with the length of time it sat on the fire. It seemed as thick as molasses some days. The coffee pot got filled with water and the coffee grinds dumped into it. After that it was just boil the hell out of it while the bacon fried up. I had supper pretty much finished when Edith finished with the horse.\n\n\"That poor old horse is in better shape than I thought. She just isn't up to any really long trips.\" She said it as she seated herself on the wooden box on which I had replaced the lid.\n\n\"That's good to hear.\" I said that just to acknowledge that I had heard her. \"Supper is ready.\" As I spoke to her I spooned beans onto the metal plate along with three thick strips of bacon.\n\nShe sat the plate beside her on the box while she accepted the cup of coffee. She took one sip of the coffee then made a face at me. She stood, lifted the coffee pot from the edge of the fire. She poured the coffee from her cup back into the pot.\n\n\"Too strong?\" I asked it rather enjoying her look.\n\n\"Too many grounds,\" she replied. She moved to the wagon where she opened her carpet bag. From it she removed a smaller cloth bag with draw strings. From the bag she removed a small piece of fabric. She then returned to the box where she had sat. She fitted the cloth inside the metal coffee cup.\n\n\"Now would you pour me a cup of coffee please?\" While all that had happened I had stood watching. I hadn't even fixed myself a plate. I poured her a cup of coffee fascinated to see what she would do with the cloth.\n\nWith the cup almost full she carefully raised the cloth effectively removing the coffee grinds from the cup. \"Well Miss Edith, you do have some strange ways,\" I said smiling.\n\n\"Is it strange to you that I would prefer my coffee without the grinds?\" She asked it knowing I had meant something else.\n\n\"No ma'am it is strange that you would go to all that trouble over a cup of coffee.\" I was a little surprised when she continued on the subject.\n\n\"Deacon, during the next couple of days you are going to learn a lot about me. One thing I am sure you are going to learn is that I am peculiar. I like things to be a certain way. I do not however insist that you change. I simply adapt to what others do. However in the end the results tend to go my way.\"\n\n\"And how do you react when they don't?\" I asked it without realizing how personal it sounded.\n\n\"If that ever happens, I will let you know.\" She sounded very confident. Something women didn't usually do. I wasn't sure at the time how I felt about it.\n\nI ended the conversation with a nod. I dumped the remaining thick sliced bacon into the heavy iron frying pan. I used the serving spoon to eat my supper from the pan. I hadn't bothered to buy more than the one plate. Even it had been a concession to Edith. If it had just been me I would have foregone the plate to save money, weight, and space in the pack.\n\nI did have to agree with Edith about one thing, even though I would never have admitted it. The coffee was pretty bad with the grounds floating around in it. Even so I would not ask her to strain mine. The thought of that scene caused a small chuckle. Edith glanced at me. I simply shook my head. \n\nLife on the trail was quite boring in spite of all the glamorous things written about it. After supper Edith did clean the frying pan and plate for me. I used the time to smoke my one cigarette. I seldom smoked. The reason was simple. I never mastered the art of rolling the damned things. I was tempted to switch to a pipe or maybe cigars. I always ended up with the loose tobacco and rice paper. I was very careful not to waste the tobacco even in my sloppy cigarettes.\n\nI sat on the ground while leaning against the wagon wheel. The misshaped cigarette hung from my lips as I looked into the heavens. The sky was filled with stars at night. Showers of shooting stars were so common no one bothered to mention them.\n\nEdith finished, then poured herself another cup of coffee. I watched as she laboriously filtered it. \"You know I am going to miss coffee.\"\n\n\"Why are you going to miss coffee,\" I asked.\n\n\"Coffee is one of the many things that is not allowed on our ranch.\" I thought she said it rather sadly.\n\n\"Edith, if you don't mind me saying so. I wouldn't think you would allow anything to stand in the way of what you wanted.\"\n\n\"Deacon, do you ever get the urge to do something your religion prohibits?\" I took a good look at her in the lantern light. She was deadly serious and not a bit flirtatious.\n\n\"Of course,\" I replied.\n\n\"Do you do it anyway?\" She was dead serious.\n\nI was forced to do a lot of thinking on that one. \"Are you telling me your religion does not allow coffee?\" The surprise was evident in my voice.\n\n\"That and a lot of other things,\" she replied.\n\n\"I see.\" I didn't know what else to say. I had no idea if a deacon would know about a religion that forbad the drinking of coffee. I racked my brain but could not decide if I were walking into quick sand.\n\n\"I'm not surprised you have never heard of it. Unless you are a Mormon or live near one of us there is no way for you to know. Of course we do have missionaries out spreading the word.\"\n\n\"The word not to drink coffee?\" I was trying to appear deaconly even though I had no real idea how a deacon would react.\n\n\"No Deacon, would you mind if we didn't discuss religion, at least not in depth. I am not on a mission, and right now I am not sure where I fit.\"\n\n\"Okay, I promise not to attempt to make you a Baptist. In return I expect you not to try to convert me to a non coffee drinker.\"\n\n\"You got a deal.\" She said it with what I hoped was a smile.\n\nWe spent a few more minutes looking into the night sky. I glanced over at Edith when I finished the cigarette. She appeared to be nodding off to sleep. \n\n\"Well, I guess it is bedtime.\" I said it as I stood. Removing the large canvass and two blankets from the box left it empty. My possessions were few it seemed. When I unrolled the heavy canvass I found it to be as I had expected. It was a long and somewhat narrow piece of cloth. I could have cut it into two strips six feet by six feet. If I had done that it could never be used as a shelter. I could lay it out in a twelve foot by six foot strip and we could sleep end to end which is what I decided to do.\n\nI had the heavy canvas spread when Edith spoke. \"Deacon, I do not mean to question you again, but do you have any idea how cold the nights get here?\"\n\n\"No I don't Edith. How cold do they get?\" I asked it quite simply.\n\n\"Very cold,\" she informed me. \"It would be better if we spread the blankets side by side to share our body heat. Also it would be good to lay that ground sheet by the fire.\"\n\n\"You make it sound like it is going to be very cold.\" I was a bit embarrassed by her comment as I didn't know how to take it.\n\n\"I assure you Deacon, I will not attack you.\" She seemed amused by the very thought.\n\n\"That is good Edith. I assure you of the same.\" The statement was a lot more positive than I really felt.\n\n\"If I had thought otherwise I would not be here,\" she informed me.\n\nEdith did not bat an eye when I removed my coat revealing the English .36 small framed revolver I wore in a shoulder holster. She seemed to accept that a deacon would carry a weapon. I supposed that it was not unusual since one never knew what he might encounter while traveling. I could not help but remember that the real deacon had trusted in his god to take care of him. Evidently his god did pretty good against everything except the deacon's own heart.\n\nI was a bit surprised to find how easy it was to fall asleep with Edith so close. I told myself it was the lack of sleep from the train ride. Whatever the reason I drifted off to sleep easily even with the attractive woman beside me.\n\nI awoke in the early morning. The sky was barely past the dead of night stage. I awoke only because Edith had rolled over and was holding me. I was also cold on the side away from her. The fire had died in the night.\n\nNeither the cold nor the weight of Edith had awaken me. It was pure and simple. I had an uncomfortable erection. It was caused a little by my need to urinate but mostly by the woman pressed against me. I had only to move her arm since we were each rolled in our own blanket. After she undraped herself from me I slipped from the blanket. I made my way to a tree. While standing beside the tree I noticed a slight glow from what I thought was the direction of the town. It seemed to me that there was a light of some kind far off. I decided it must have been some kind of large kerosene light from the town.\n\nI debated relighting the fire before I returned to my blanket. As Edith had promised it was cold, but not so cold that I could not return instantly to sleep. I was tempted to pull Edith to me. For warmth I told myself. I fought back the urge. I decided the Deacon disguise was not such a good idea after all. Then again she would not have been with me, if I had been anyone else.\n\nBreakfast the next morning was more of the bacon with the stale bread heated in the frying pan. The food was heavy in fat and starch but it had to be since it was the only thing available to us. That and the fact that we had a full day's travel ahead. I had been hopeful that along the way we might pass an even smaller settlement where we might purchase or beg a real meal. After all I looked like a parson. I was told anyone would feed a traveling parson. It sounded even to me at the time that food occupied a lot of my thinking. It did because going without it was uncomfortable and dangerous. Being on the trail was not like being in a town or even on a farm. In those places one might go hungry. On the trail it wasn't could go hungry, you were sure to go hungry at least some of the time."
    ],
    "authorname": "MysteryWriter",
    "tags": [],
    "category": "Non-Erotic",
    "url": "https://www.literotica.com/s/dance-with-the-deacon"
}