{
    "title": "Lost Empire Ch. 34",
    "pages": [
        "Derrick looked around the room at each and every hologram as each promised that Lucy would never be an outcast again. Each said that they were proud and would let her know just how proud. Derrick nodded at each of them as they made their pledge. Pride was starting to swell up in his chest, he had been so proud of Lucy, it had almost killed him when she didn't make it.\n\nDerrick decided right there and then that he had to make sure that this didn't happen again. Already ideas were starting to push their way to the front of his thoughts. Bending over a computer note pad Derrick started to outline several ideas that were taking hold in his mind. Hmmm Derrick thought might be a good idea to give these to Kimison and Rayburn, as it appeared he was going to be busy for a while.\n\nDerrick finally dismissed all of the ships watching as each of them left. All of them that is except for Tara. \"Yes Tara was there something else?\" Derrick asked.\n\n\"Yes Sire, I know that you are extremely busy. I have a favor to ask Sire.\" Tara asked hesitantly.\n\n\"I always have time for my EIG ships Tara.\" Derrick answered.\n\n\"It is just that, uh...\" Tara started.\n\nShelby nudged her daughter and whispered, \"Ask him he won't yell or bite!\" Shelby said as she started to giggle then Tara did also.\n\nTaking a deep breath Tara said, \"Sire I feel so alone I would love to have a prime. That is if you have time Sire.\"\n\nDerrick smiled, then thought a moment. Hmmm he had someone in mind if they took it. Yes! They should do very well indeed! \"Of course Tara I have just the individual in mind though you will have to finish growing before I can have them brought here to you ok?\"\n\nTara's face lit up and a huge smile spread across her face. \"Yes Sire! Thank you so much sir! Thank you! Thank you! Thank you!\"\n\nDerrick smiled widely also this was the type of praise he liked not the bowing and scraping others did!\n\n_________________________________________\n\nThree days later\n\n1st specialist Ensign Callie was bored out of her mind. She didn't want anyone to take her wrong, she loved her work as a tech specialist. Since the incident with the other personality being placed in her, they had stuck her at central. Basically all she did now was process reports, she was a tech specialist for god's sake not a desk jockey! Even though she hadn't said anything she had felt that the emperor and Rear Admiral Hartwell had been happy with her brain results.\n\nSighing again or at least she thought she had, she looked around the corner. In another cubicle sat a young science officer with the markings of the Ranger ship Plymouth on his shirt. Then she thought she heard another sigh next to her on the other side. Looking over she saw an old friend of hers, the old science officer of the rear Admiral's old flag ship the Comrade.\n\n\"Mack?\" Callie stated, \"They stuck you here too? My god man, what did you do?\"\n\nEnsign Mack Brown was startled by the voice from the past, \"Mara?\" Mack asked looking around for the source of the voice. Shaking his head he went back to the scientific analysis of several anomalies. Sighing he thought yeah an exercise in boredom.\n\nSuddenly there was a body standing next to him, a very hard but sweet smelling body. \"Mack Brown you avoid me again like that and I'll knock your ass all over this center!\"\n\nLooking up Mack's eyes went wide, \"Mara?\" He asked. \"MARA!\" He shouted jumping up and picking her up twirling her around.\n\n\"Hey! Put me down! You want us both to be court-martialed?\" Mara said a stern look on her face. \"Again, what did you do to get stuck here?\"\n\n\"I don't really know, I noticed something that no one else did, a month later I was here. It feels a lot like school but a thousand more times boring. Same thing happened to Zimmel a month after that.\" Mack replied with a grimace and then a smirk.\n\nFrom the other side of her cubicle they heard, \"What!?\"\n\n\"You mean to tell me that Randall is here too?\" Mara said a look of shock on her features.\n\n\"Oh yeah,\" came a voice from behind them. \"Actually made it to Lieutenant Junior Grade.\" Randall shook Mara's hand. \"I got busted for not giving up when I noticed the same thing that Mack did. Though I am sure Mack is as curious as I am as to why you are here.\"\n\nMara sighed, \"I was used as a pawn by one of the sect's to try and assassinate the emperor. I actually met the man afterward, I thought I was about to be executed like that slime ball leader of the Republic. The emperor and the Rear Admiral were both there, they asked me to help which I did. Then a month later I was transferred here I thought I was clearly safe, but here I am. I really miss being out there.\"\n\nMack and Randall both nodded. They'd rather be executed than to be subjected to anymore of this tripe! Mack did a double take, looking behind Mara and Randall and motioned for them to get back to work. They both looked and saw the High Commander of the Rangers was heading their way after an attendant pointed them out to him.\n\nA moment later the High Commander stopped about 20 feet from their cubicles. \"1st specialist Ensign Mara Callie! Science Officer Ensign Mack Brown! Lieutenant JG Randall Zimmel! Front and center NOW!\" Came the commanding voice of the older man.\n\n\"SIR\" All three said as they stood at attention in front of the man.\n\n\"As of today I am proud to announce that all three of you are being reassigned! I was ... well let me let HIM explain to you, I have them here sir.\" The High Commander said as he pulled an odd looking device from his side belt.\n\n\"Hello officers. I apologize for taking as long as I did to come for you. All three of you were singled out for your attention to detail and your mind strength. Yes Ensign Callie, I am including you in that category.\" The voice that only Callie recognized said.\n\n\"I'm sorry for sounding misinformed sir,\" Mack Brown started. \"I am afraid that I don't know your voice. You are obviously a man of high rank if the High Commander calls you sir. I am afraid as I said, though I mean no disrespect, I do not know you sir.\"\n\n\"Ah! I apologize again then. I am your emperor Derrick O'toma. I am here to enlist you in further service to the empire. A service I think, that all three of you would find a hell of a lot more satisfying than sitting at those desks!\" Derrick said a smile crossing his lips. \"I do not require you to do this. I only expect loyalty nothing else. I am rebuilding the empire and I need strong people like you, yes Ensign Callie I mean you!\"\n\n\"Emperor! After what happened last time, I thought I would never be allowed to serve again!.\" Mara said a sad look on her face.\n\n\"My dear I don't know why you would think that! You were cleared and strengthened. Ok, now here's the deal. Your ride will be there in an hour, though I could send them now. You have that long to say your good byes to family, get what you want then be back here. I suggest you hurry cause I will pick each of you up no matter where you are so be ready ok?\" Derrick advised all of them.\n\n\"Yes Sire!\" All three of them replied as they all went running.\n\n\"What do you think High Commander? You think they are ready?\" Derrick asked as soon as they were out of sight.\n\n\"I don't know Sire. They are of high caliber, they all posses high intelligence. If it were for me, I'd say hell yeah but you Sire demand more a lot more than I do.\" The High Commander replied.\n\n\"The mere fact that you give them the praise you do is more than enough for me. You are definitely one to go to if I need advice High Commander!\" Derrick told the older man.\n\n\"Sire you do an old man good with your praise though, I know that you posses far more knowledge than I!\" The High Commander stated.\n\n\"Oh so you have heard of that huh? Ah yes, I remember you were a master of information gathering! All I can say sir is that, I may have the knowledge but you have far more experience than I to use that knowledge!\" Derrick said as he smiled.\n\n\"Touché Sire! Alright sir, I will remember and always be open and ready if you need me!\" The High Commander said then Derrick clicked off.\n\n______________________________________\n\nRandall, Mack, and Mara were still running when they exited the building. Suddenly stopping Mara started to laugh, the others stopping looking at her as if she were crazy. \"What the hell are you finding so damn funny?\" Mack asked her.\n\nAlmost about to fall down Mara laughed even harder at the look of astonishment on Mack's face. Finally able to talk Mara said, \"Here we are hurrying to say good bye, to get our stuff. I know for a fact that we all told our families good bye years ago. As for all our stuff I have most of it here or in a bag in my room.\"\n\nBoth Randall and Mack's eyes went wide as they both realized that they were the same way. All three of them had transferred so much they rarely unpacked for long. \"Huh, see you both in about fifteen minutes!\" Randall said then walked to the officer BOQ (Bachelor Officer Quarters). Mack and Mara looked at each other and shrugged and headed after him.\n\nA mere thirty minutes later they all three were back in the building. Sitting down they all decided it would be a while 'til they left well ... at least they thought so.\n\nThe computer screen in front of them lit up as Derrick appeared on it. \"Damn I'm glad I was right about all of you! Ok prepare, your ride will be there in a few seconds. Thomas?\"\n\n\"Yes Sire?\" Came a voice off screen.\n\n\"Go get them, their already ready,\" Derrick said.\n\n\"Crap! More techs,\" there was a big sigh then nothing.\n\n\"I'll see you in a few minutes.\" Derrick told the absolutely confused trio.\n\nA moment later several alarms were going off in the building, hell all around the whole complex. Then suddenly all three were standing on a huge command deck. All three were still blinking that was 'til they spotted the equipment in front of them.\n\n\"Oh my god!\" Mara said as she started to run her hands over several panels. Both Randall and Mack were practically drooling over everything they were seeing.\n\n\"Everything is so beautiful! All three of them were repeating over and over. Conner appeared a moment later and looked at Thomas and nodded. \"I am glad you find my systems to be as stimulating as you do.\" Conner told all three of them.\n\n\"A projection within a self contained system of a three-dimensional image!\" Mara was saying as she stared at the image of Conner.\n\n\"Oh god! Sire! You have to save me from these techs! Christ they are as bad as Kimison and Rayburn!\" Thomas was shouting at the hologram of the emperor that had appeared.\n\nChuckling Derrick told him, \"Just get them here, then I'll take it from there.\"\n\nThomas nodded, \"Conner! Get us back now!\"\n\n\"Yes prime, engaging trans warp now!\" Conner said a huge smile on his face.\n\nAll three of the new arrivals looked around as there was a winding up noise then a whoosh. Looking at the view screen Randall tried to speak as did Mack. \"Hmmm\" Mara said. \"Trans-warp, half the galaxy in a few seconds. I assume the emperor uses it quite a bit to keep order in the empire?\"\n\nThis time Thomas smiled finally they were talking more his language. \"At present we are stretched rather thin but that shouldn't be a problem for long.\"\n\nMara looked at the readouts and nodded. \"This ship has a great deal of fire power it ought to provide a hell of a lot of protection.\"\n\n\"You've got that right!\" Thomas said.\n\n\"I'm sorry sir,\" Mara started again, \"you look familiar. Very familiar.\"\n\n\"I served with the emperor in some of the bloodiest campaigns of the Republic wars.\" Thomas spit out the disgust apparent in his voice.\n\nMara nodded, \"Yes I remember those as a child, my father served in them also on the Republic side.\"\n\n\"Ah! So you knew of the terrible things we were required to do!\" Thomas again spit out his disgust growing by the minute.\n\n\"Yes sir, father made it to the end. He was killed in an accident years ago, I barely knew him, but he inspired me to enlist.\" Mara said a few tears in her eyes.\n\n\"I'll have to ask you about him later. If he made it through he was exceptional, there weren't many of those.\" Thomas said as he looked at the woman closer, now that he thought about it she looked rather familiar also.\n\n\"Sire we're back ready for IMT when you are sir!\" Thomas said to the air.\n\n\"Thank you Thomas, Shelby?\" Derrick said.\n\nThis time there was a flash and they were standing in a large room in front of a tall man with sandy blonde hair. All three nodded to Derrick who was smiling hugely. \"Reporting as you asked Sire.\" All three of them stated.\n\nLooking back at Hartwell Derrick said, \"See? Why in the hell can't most of those that work for me be this fast? Christ, it would damn sure speed things up that's for sure!\"\n\nAll three of the officers looked past Derrick and saluted standing at attention. \"Alright that's enough of that!\" Hartwell stated. \"Keep that up and we'll never get anything done! Now then the reason you are here...\"\n\nThat moment several alarms went off. Derrick looked up a snarl on his face. \"I need status report now!\"\n\n\"God damn it!\" Thomas was shouting. \"The bastards slipped in! I've got them at three parsecs (93 trillion Kilometers) from the galactic edge. They are numbering in the thousands!\"\n\n\"Configuration?\" Derrick was asking.\n\n\"I am reading it is the race that you, me, Conner and Lucy,\" here Shelby voice was tearful, \"went against the first time.\"\n\n\"Damn it! Just when things are finally starting to go right!\" Looking at the three before him he sighed. \"I guess you will have to get a rough start. All ships, I want all of you here now.\"\n\nA moment later all fourteen ship's holograms were there. \"Yes Sire?\" All of them stated.\n\n\"I meant to ease them in but we don't really have time. All of you that don't have a prime, think to all three of the prime candidates before you.\"\n\nEleven of the ships holograms looked at the three candidates. First Mack Brown's eyes went wide as he nodded and looked at the hologram that was talking to him in his mind. \n\nNext Randall Zimmel's eyes were wide as he too nodded looking at the hologram that was talking to him in his head.\n\nDerrick nodded a huge smile on his face that is 'til he saw that Mara was still hearing nothing. Hmmm Derrick thought did I make her mind too strong? \"The rest of you, her mind was strengthened. I know she will hear one of you, she has all the indicators. Another tewnty minutes nothing happened, sighing Derrick nodded, she would need a little more time.\n\n\"Alright, we'll try again tomorrow. Captain Brown, Captain Zimmel report to your ships and familiarize yourself with them.\" Derrick told the two men who nodded then flashed out to their ships.\n\n\"What of me sir? If I can't hear a ship then I will be worthless to you.\" Mara said a sad look on her face. All her life she'd strived to be as useful as she could to honor her father. Now she was going to fail and as she felt disgrace him forever!\n\n\"I have had a detailed analysis of your mind done, more than most. I am afraid that your mind is very strong. It will take a ship just as strong to bond with you. This isn't a bad thing but might take a bit for one of them to do.\" Derrick told the sad woman. He felt for her it was like the first time he commanded. The impending feeling of failure that he felt if anything went wrong.\n\n\"Yes sir I know this, I do not want to be a burden to you. I have been training all my life to honor my father. I have to do this I have to!\" Mara said upset that nothing was still happening.\n\n\"As I said, we'll try tomorrow. Even with Thomas the man you met on Conner, it took a whole day for him and Conner to connect. Thomas is about as stubborn as they come, THAT was what was blocking him. With you it might be almost anything, go rest. Sometimes that's all it takes.\" Derrick told the disheartened woman.\n\n\"Yes sire I will do as you suggest, though if I don't hear one of them then I am really of no use to you Sire. May I request that if that happens that I may have my old post back? As the tech officer onboard Admiral of the fleet Hartwell's old flag ship?\" Mara asked though the thought didn't really appeal to her that much.\n\n\"We'll see what we can do Ensign Mara Callie,\" Hartwell said as he stepped forward. \"Now please do as the emperor asks and we will discuss this at length if it is necessary.\"\n\n\"Yes sir,\" Mara said. \"Thank you very much for the consideration.\" Derrick and Hartwell nodded as the young woman moved off through the door.\n\n\"Mary!\" Derrick suddenly shouted as the Palace AI appeared. \"I want a full review of Ensign Mara Callie's cerebral scans. Re-evaluate all her alpha, beta, theta, gamma, and delta waves! I want to know what we did to her that is interfering with her communication with the EIGS.\"\n\nMary could hear the seriousness in Derrick's voice, \"I am already running through all of the scans that we did on her. I had thought that it was your intention to strengthen her so no one could use her again.\"\n\n\"Initially yes, Mary though I didn't mean to make her so strong that she couldn't help the empire either!\" Derrick told Mary cringing when Mary withdrew a little at his tone of voice. \"I am sorry Mary I didn't mean to lose my temper at you.\"\n\n\"As I said your Majesty, I am but a tool...\" Mary started then thought better gauging Derrick's reaction.\n\n\"I told you,\" Derrick said his voice calm but a look of anger on his face. \"I never want to hear that from any of the ships or you! You are far more than just a simple tool! Please never forget that, or you might actually get to see me lose my temper, understand?\"\n\nMary swallowed hard, the look on the emperor's face would scare her to death if she was organic! Thankfully she was mechanical but such a fierce declaration! Still she felt that he did far too much for her, her children or Shelby's children.\n\nMara was walking to the room that had been assigned to her when she passed another training area. There were two men moving at incredible speed on a thick mat. Funny she thought the older one looked vaguely familiar just like the one onboard the ship. Taking a seat she sat quietly and watched the two men as they went at each other.\n\nIt was perhaps several hours later when she felt a shake of her shoulder. \"Miss,\" she heard from a long way off. \"Miss,\" there it was again disturbing her dream about her father one of the few memories she had of him.\n\nSuddenly jerking awake she looked up into the face of the older man. \"I am sorry if our exercises bored you miss.\"\n\n\"No, I am sorry for intruding. I thought I knew you, your face seems so familiar. Both you and the man Thomas on the ship seemed to be known to me but I can't put my finger on it.\" Mara said as Dempsy was also staring at her.\n\n\"I also seem to recognize you though I know I have never met one such as you. I am Lieutenant Dempsy.\" Dempsy said as the young woman jumped up and saluted. \n\nGroaning Dempsy stated, \"Please stop that! I hate being an officer!\"\n\nMara looked at the man as if he was crazy! Hated being an officer! What parallel world had she fallen into? An emperor who didn't like being bowed to, an Admiral who likes things as informal as possible. Then there was this man who hated being an officer! Mara fell with a thud into the chair shaking her head.\n\n\"I also have to apologize for waking you,\" Dempsy went on. \"You seemed to be in the grip of a nightmare and we thought that you might wish to wake from it.\"\n\n\"We?\" Mara asked then Dempsy moved and she saw another younger man behind the officer. \"Again I am the one who is sorry I should not have intruded on your training.\"\n\n\"Ah! Also polite! I will have to thank the emperor for bringing someone as polite and respectful as you onboard!\" Dempsy said a smile on his face.\n\n\"Sir!\" Mara said a smile on her lips. \"Are you trying to flatter your way into my heart?\"\n\nDempsy again smiled and bowed low, \"Ah no my dear. I am far too old for you. Perhaps twenty years ago perhaps but now? No.\" Then Dempsy smiled and pulled Greeson forward. \"Though my young apprentice could use someone in his life.\"",
        "Greeson tried to break loose of Dempsy's grip. \"Master it isn't allowed! She is an officer I am just a sergeant they'd drum me out in a heartbeat!\"\n\n\"Humph! You obviously don't know the emperor as well as you thought!\" Dempsy smirked at Greeson. Looking at the still struggling Greeson, Dempsy let him go with a thud on the mat. \"Too bad really, I could see the both of you having beautiful children! Remember do ALL your katas!\" With that Dempsy walked away a strange smile on his face.\n\nMara smirked and looked at the man on the mat, \"Is he always like that?\" She asked though she felt she shouldn't really be talking to a sergeant like she was.\n\n\"No Ma'am, he is usually gruff, tough, a regular slave driver. I feel though he is trying to teach me all he can. Our opponent last time, was almost as fast as he is. Had it not been for him I don't think I would be here now.\" Greeson said his eyes following Dempsy as he left the room.\n\nGreeson sighed and excused himself as he started to go through his Katas. Greeson could feel the young woman's eyes on him as he went through all of them, then forgetting went through them again.\n\nThe door opened to the emperor's work room as Dempsy walked in. \"I take it you heard?\" Dempsy asked when he bowed to a groaning Derrick.\n\n\"Yes, you know he's right of course. They cannot get together in any way. I'm sorry old friend but this is one thing I cannot let go.\" Derrick told Dempsy who was trying to think of a solution. \"Besides they may not even like each other.\"\n\nDempsy looked at Derrick with a you doubt me look. \"There I think you might be wrong Sire. Look at his concentration, when he first saw her his techniques were far better. No Sire, I think that with her there, he will finally get to where he should be.\"\n\n\"So what in the hell are you suggesting?\" Derrick asked a now smirking Dempsy. Then suddenly Dempsy was smiling from ear to ear. \"Oh no! You aren't about to suggest what \n\nI think you are? ... Are you?\"\n\n\"Oh,\" Dempsy looked away as if he was unconcerned, \"you could do the same sneaky, dirty, underhanded thing you did to me.\"\n\n\"Dirty? Sneaky? Underhanded? Not I!\" Derrick smiled as he replied to Dempsy.\n\n\"Yes, you.\" Dempsy said. \"Make him an officer like you did me!\"\n\n\"You were an exception I...\" Derrick stopped when he saw Dempsy's eyes open wide. \"What's wrong?\"\n\n\"My god!\" Dempsy said, \"I just realized where I know her from!\" With that Dempsy ran from the room. Shaking his head Derrick watched as Dempsy returned to the training room.\n\nMara was just starting to leave when Dempsy burst back into the room. \"I have a few questions for you young lady.\"\n\n\"Yes sir,\" she said as she tried to gauge what was on Dempsy's mind from his expression.\n\n\"Your name is Mara, Mara Callie am I correct?\" Dempsy asked though he thought he knew the answer.\n\n\"Yes sir,\" Mara answered not sure where this was going.\n\n\"That hasn't always been you name though has it?\" Dempsy went on hoping he was right about this.\n\nHanging her head she shook it no. \"My mother remarried and my name was changed to Callie. I left home as soon as I could to finish school and enlist. To honor my real father that was always a hero to me.\" This time the tears wouldn't hold back as she thought of the man.\n\n\"What was your name originally? \" Dempsy said a serious look on his face.\n\n\"It ... it was Norman.\" This was whispered. \"I have tried for years to find members of his squad, to no avail.\"\n\nDempsy smirked a little, \"His name was Daniel Norman wasn't it?\" Came a voice from behind her.\n\nTurning she saw the emperor was standing behind her his eyes wide. \"Yes it was but how do you know?\"\n\nDerrick sighed; he'd tried to find the family members of the four that were lost. They had seemed to vanish as he and his men had. \"He was a good man, he served with Thomas, Dempsy, Hartwell, and I. I was his commanding officer.\"\n\n\"Oh my god! You're that Derrick O'Toma! I remember you I used to call you uncle Derry!\" Both Derrick and Dempsy nodded as they both hugged Norman's daughter.\n\nSuddenly Mara's eyes went wide, \"Hello?\" She asked the air.\n\nDerrick motioned to Dempsy who stepped back.\n\n\"Yes I can hear you! Yes thank you I'll let him know.\" Looking at Derrick, Mara said, \"never mind I think he knows!\" As she saw Derrick's knowing smile."
    ],
    "authorname": "Pars001",
    "tags": [
        "science fiction",
        "alien11111",
        "violence"
    ],
    "category": "Non-Erotic",
    "url": "https://www.literotica.com/s/lost-empire-ch-34"
}