{
    "title": "Point Hollow Ch. 05",
    "pages": [
        "The chronological order of my stories is now listed in WifeWatchman's biography.\n\nFeedback and constructive criticism is very much appreciated, and I encourage feedback for ideas.\n\nThis story contains graphic scenes, language and actions that might be extremely offensive to some people. These scenes, words and actions are used only for the literary purposes of this story. The author does not condone murder, racial language, violence, rape or violence against women, and any depictions of any of these in this story should not be construed as acceptance of the above.\n\nThis story is dedicated to the memory of Dame Agatha Christie, and is partially inspired by her Poirot novel 'The Hollow'.\n\nPart 24 - Evil at Point Hollow (Continued) \n\nHe ran at the top of his speed to the copse of trees, shouting \"He's over here! He ran this way!\" Then he stopped short.\n\n\"We've got him! We've got him!\" shouted several heavily armored TCPD Officers. They had Dirty Lennie under arrest, and were bringing him out of the Hollow. Dirty Lennie was wearing a protective vest, and the Officers had him totally surrounded, protecting him from possibly being shot while taking him to waiting TCPD vehicles.\n\nOther Police had sprung out of seemingly nowhere. They were by the River, near the drive to the road, and around the house. And then Captain Cindy Ross came up, wearing double armor, her gun drawn.\n\n\"Agent Sharples!\" she called out imperiously. \"We need your help in the house! Commander Troy has been shot! Let's go, let's go!\" Not really given a choice, Sharples came with the contingent of Officers that suddenly were all but surrounding him.\n\n* * * * * * * * * * * * * * *\n\nAs the SBI vans drove up, NTF Director Dick Ferrell's eyes grew wide when he saw what was in front of them. The driver had to stop.\n\nTCPD cruisers were stacked and staggered three-deep along the road. Barriers were set up on either side. Behind all this were both 8-man squads of the TCPD SWAT Team, as well as twice their number of Officers in heavy armor, and with military-grade rifles. The Town & County Police were not just ready to stop the SBI... they were totally prepared for full combat.\n\nIn the Navy, it's called 'crossing the T'. This was done by Lord Nelson at Trafalgar to win that huge victory, and it was done by the US Navy in the Philippines in World War Two to defeat the Japanese and retake the Philippines. The TCPD had just done the equivalent on land. The TCPD had every tactical advantage. The SBI Agents were dead if the signal was given.\n\nAnd yes, the TCPD had more than one machine gun... a hell of a lot more than one.\n\n\"Pull back.\" said Ferrell, bitterness in his voice. \"Retreat and regroup. If they follow us, we'll have to make a stand, but let's get out of here.\"\n\n\"What about Sharples?\" asked the driver.\n\n\"He's on his own.\" said Ferrell. \"There's nothing we can do for him.\"\n\n* * * * * * * * * * * * * * *\n\nSBI Agent Leonard Sharples was led to the greatroom of the Point Hollow house. There were lamps on, illuminating the room. To his shock, Sharples saw broken glass from the window... and from a shattered mirror. A small chair was in the middle of the room, as were a number of TCPD's Finest.\n\n\"What's going on?\" asked Sharples.\n\nSuddenly, he had two handguns pointed at the sides of his head. Cindy Ross came behind him and quickly and deftly fastened handcuffs to his wrists behind his back.\n\n\"Sit down.\" she said, bringing the chair over and forcing Sharples to sit on it. She then tore open his trenchcoat, then his shirt and pulled them down his arms.\n\n\"That's just in case you have a cyanide capsule on you.\" Ross said as officers searched him. They'd confiscated his SBI service weapon as well as the silenced pistol... and a third gun, a revolver whose small caliber matched the auto-pistol, strapped to his ankle.\n\n\"Concealed third gun.\" said Cindy. \"Illegal for Officers of the Law at the State level to carry those like that. You SBI farts never learn, do you, Fat Boy?\"\n\n\"What the hell is this about?\" asked Sharples.\n\n\"Why, it's about the attempted murder of the Town & County Police Commander.\" said Cindy. All eyes then went to the entrance to the great room. Standing there, dressed in ubiquitous Tilley Hat, trenchcoat, and tapping the red crowbar in his hand... was none other than Your Iron Crowbar.\n\n\"Aw, shit.\" breathed Sharples, seeing that his attempt to assassinate me had utterly failed.\n\n\"Hmmf!\" I uttered as I walked slowly up to him. \"Serrrgeant Sharples... Serrrrrrrrgeant Sharples... how you thought you could succeed with this ridiculous plan, I\"ll never know. But you are busted. For attempted murder, conspiracy to commit murder, and when the Hamilton County Sheriff files the papers, you will be charged with the first degree murder of Scrawny Haskins, a human being, and planting a gun on his dead body.\"\n\nSharples's eyes got wider, and then he began looking around.\n\n\"No, Sharples, your SBI buddies did not show up.\" I said, knowing his thoughts. \"They've abandoned you. They didn't come... they left you to your fate, they left you totally alone. You are well and truly fucked, Sharples.\"\n\nSharples turned away from me, and looked at the mirror shards on the floor. I could see him trying to marshal his thoughts. I poured it on.\n\n\"That's right, they abandoned you, Sharples.\" I said. \"So why don't you tell me who put you up to this... instead of going down alone for it.\"\n\n\"You can take that crowbar and shove it up your ass, Troy.\" snarled Sharples. \"You don't know jack shit. You're as clueless as the day Harlan murdered Pete Feeley because you couldn't figure it out in time. You think you're hot shit, but Pete Feeley is dead, your sister is dead, Perlman is in a wheelchair... because you are not good enough, and never well be.\"\n\n\"Don't rise to the bait, Commander.\" said Cindy Ross, watching me carefully, concern on her ruggedly pretty face.\n\n\"Oh, I won't.\" I said. \"Fat Boy here is not worth it. Captain, read the suspect his considerable rights, and make sure you are videotaped doing so. Then put adhesive tape over his mouth so he can't try to swallow cyanide, and transport him to Police Headquarters.\"\n\n\"Not the County Jail, sir?\" asked Sergeant Rudistan.\n\n\"No.\" I said. \"Police Headquarters. We're going to be up all night with this fat ass, and I want to have my own coffee cup available.\" No, that wasn't the only reason...\n\nEverything was videotaped. Sharples tried not walking to the Police cruiser to be transported. Now my instructions to have a dolly available made sense to my officers... it wasn't to transport drugs, but one fat former police officer to the vehicle. The Officers might have been a wee bit rough with putting Sharples on and off the cart...\n\n* * * * * * * * * * * * * * *\n\nIt was well after dark and getting near midnight as we finished up all of our crime scene work and cleaned up. I had supervised it all, making sure nothing was overlooked, nothing was messed up. This one had to go down smooth and rock-solid.\n\n\"That's it, Commander.\" said J.R. Barnes of the Crime Lab. \"We'll send you all the reports as soon as we process them. We'll be back in the morning for more work in the Hollow, too.\"\n\n\"That's good.\" I said. \"Great work, as always. Y'all have a good night.\"\n\nI was last on the scene. I headed to my Police SUV to follow everyone down the road back to Town. And then I heard it.\n\nAt first, it sounded like a mountain lion beginning to roar, then the sound changed to an eerie wail, as if a woman were calling out from the trees of the Hollow. As I looked that way, I saw nothing at first. Then I heard a woman scream, a chilling scream as if from the depths of Hell itself.\n\nI felt a coldness grip my soul as I gripped my gun and began walking towards the Hollow to investigate. As I started walking, I thought I saw a glowing bluish light in the trees. And then it seemed to move up. I realized I was seeing what looked like a human form. Like a man wearing a suit and tie. His head was featureless.\n\nNo, this has to be a joke by one of my officers, I thought to myself. Slender Man? Really?\n\nAnd then the wind blew, hard. And I heard a deep male voice say \"Leeeeeave heeeerrrre.\" The cold clutched at my soul again.\n\nThen the lights of a vehicle struck me from the right, nearly blinding me. It was Cindy's SUV, coming up to me. \"Come on, Commander! We've got a fat suspect to question!\" She was not going to leave me here alone, I realized. I got into my vehicle and headed down the road, now seeing nothing in the Hollow but pure darkness. Cindy followed me as we drove away from that place...\n\nPart 25 - A Successful Arrest \n\nWednesday May 11th. Sharples was sitting in Interrogation-1, in an orange jumpsuit. His clothes had literally been cut off of him during booking before we would remove the tape from his mouth and unhandcuff him. We found a capsule attached to the collar of his trenchcoat, as well as an upper button being too big. Tests would show that they were indeed cyanide-filled.\n\nEarlier, Sharples had tried to call Dick Ferrell; the call went unanswered. Then he called SBI Headquarters to get a lawyer. They told him bluntly that he would not be getting one from them.\n\n\"Get Mr. Sharples a Court-appointed attorney.\" I finally ordered. It was a beautiful day when the lawyer that showed up was the incompetent Dexter Epstein. We made sure it was documented that he really was the next in line, and not assigned out of turn. When Sharples saw him, he immediately demanded another lawyer, and Cindy took pleasure in telling the Fat Boy that he was correctly represented.\n\n\"Before you take the Fifth,\" I said to Sharples, \"you should consider that the SBI has totally abandoned you; they have left you in the dirt to take the fall yourself. It will go much, much easier on you if you give me Dick Ferrell. He does not deserve your loyalty.\"\n\n\"As if you do?\" snarled Sharples.\n\n\"I tried to give you that child kidnapping and molestation case.\" I said. \"I really did give you a chance. Ferrell.. he's going to walk away while you sit here rotting... until you get to the syringe table at Jacksonville State Prison.\"\n\n\"That's harassing my client.\" said Epstein.\n\n\"I want to talk privately with my lawyer for five minutes.\" said Sharples. \n\nWe all left the room. When we went into the anteroom, I said \"Clear this room. All but Captain Ross.\" Everyone else was puzzled, but left. Cindy realized why I'd given that instruction when I flipped the switch to hear the conversation. She didn't even bat an eyelash.\n\n\"Listen, punk.\" ordered Sharples. \"You call Dick Ferrell. You tell him that if he does not send me a real attorney, and a competent one, I am going to start telling Troy everything I know... and I mean everything.\"\n\n\"I can't do that.\" said Epstein. \"I'm not going to relay a message like that.\"\n\n\"Fine.\" said Sharples. \"I'll just tell the Iron Crowbar there that you're part of a drug gang, and their mole in the Court system. I'll tell them, and swear to it in Court, that you are as dirty as anyone in this State. It doesn't matter if it's true... you'll be suspended as an Officer of the Court while it's investigated, and then you'll be fired and out of a job. All because you're trying to play it righteous and won't make a simple phone call.\"\n\nEpstein was clearly rattled. He got out his cellphone and made the call...\n\n* * * * * * * * * * * * * * *\n\n4:00am. The lawyer from Gresham & Mason was young but determined when he walked into Headquarters and imperiously announced that he was Leonard Sharples's' attorney.\n\nAfter a ten minute conversation with Sharples (which we did not listen to), the lawyer banged on the one-way glass. Cindy and I went in.\n\n\"My client needs sleep.\" said the lawyer. \"Put him into a holding cell, under protection, until I come back later this morning.\n\nI could feel Cindy's eyes on me, and the anger welling up inside her, as well as in myself. \"Come in here.\" I said, pointing to the anteroom door. Cindy was behind him and practically shoved him into the room.\n\nInside the anteroom, I squared up to the guy. He was much shorter than me, and I towered over him. \"Listen, punk, you do not give me orders in my Police Station. You show me some fucking respect, or I'll beat the god-damned shit out of you right here and right now. Now I will give you some orders: if you're Sharples's representation, then get your fucking ass in there and represent him... and you damn well better do it with courtesy and respect to me and my Officers.\"\n\nI turned to Captain Ross. \"Would you like to reinforce what I just said?\" I asked.\n\n\"If you need to take a bathroom break,\" Cindy said, \"I'll keep this guy company for the next few minutes, and get in some practice for the Boxing Matches.\" Maybe it was the blue crowbar Cindy was tapping in her hand, or maybe a premonition that he was about to get hurt, but the legal beagle got the message...\n\n* * * * * * * * * * * * * * *\n\nBack in I-1, the lawyer said \"Okay, how in the world are you going to prove one bit of these fallacious charges against my client?\"\n\n\"Sergeant,\" I said to Rudistan, who was watching near the hallway door, \"what are my favorite four words?\"\n\n\"Uh... 'you are under arrest'?\" Rudistan guessed.\n\n\"Well, yes.\" I said, grinning and conceding the point. \"So what are my next favorite four words, Captain?\"\n\nCindy's face lit up as she said \"Ah... 'Let's watch some TV'.\"\n\n\"Yes, indeed!\" I said jovially. \"Let's do watch some TV.\" I clicked on the TV with the remote and began playing the pre-prepared tape.\n\n\"Okay,\" I said, \"here we have Sharples escorting Dirty Lennie into the Hollow. Oh, what is this? Sharples is tying Dirty Lennie to a tree... has his mouth gagged so he can't call for help. Let's put kidnapping down as a charge, Captain.\"\n\n\"My client was making an arrest of that suspect.\" said the lawyer.\n\n\"Before the assassination attempt? Interesting... we'll see about that.\" I said. \"So now I have film from several angles showing Sharples going to the house... oh, that's a drone up above him, filming the whole thing as well. Very kind of the FBI to loan us that equipment... oh, what do we have here? Why... who is that taking out a gun and shooting through the window? Why, that would be Mr. Sharples, here.\"\n\n\"My client shot a mirror.\" said the lawyer.\n\n\"Point Hollow is not exactly a good place for target practice.\" I said. \"Anyway, here's some film footage of me preparing to stand to the side of the mirror, so that whoever is outside would think I'm standing in the window. I had to make sure it looked right from the outside... guess I did well enough, eh, Sergeant Rudistan?\"\n\n\"You shoulda been in Pictures, sir.\" joked Rudistan with his great joviality.\n\n\"This is entrapment.\" said the lawyer. \"I'm going to roast you on a spit for this.\"\n\n\"Oh yeah, that.\" I said. I reached into my pocket and pulled out a document. \"Ah, here's the warrant for the sting, issued by a Superior Court Judge. No entrapment, and I'll have to ask why an SBI Agent is shooting at what he thinks is a Police Officer in a window.\"\n\n\"Well obviously no one was shot.\" said the lawyer.\n\n\"Yeah, and that's because I prevented Dirty Lennie from being murdered by Sharples.\" I said. \"Here's the footage of my guys untying Lennie, and they wait for Sharples to start running back... then they take Lennie out of there, protecting him from being shot... oh my, Sharples... looks like your plan didn't quite work.\"\n\nSharples had a dull, defeated look on his face, and the lawyer looked totally shocked at the enormity of what he was realizing had happened.\n\nI turned to Sharples. \"You murdered Scrawny Haskins just this way in Hamilton County.\" I said. He drove to that farmhouse, you took him to the back, tied him up, then when everyone else got there, including the SBI, you shot him, then shot a second gun into the air, which you then planted on Haskins. You were going to do the same with Lennie... you intended to run into the Hollow, have a 'shootout' with Lennie, he'd wind up dead, and you'd have seemingly 'caught' the murderer of the Police Commander.\"\n\n\"You'll never prove that.\" said the lawyer.\n\n\"Oh, I dunno.\" I said. \"Juries in Hamilton County are composed of smart Citizens. The Sheriff there has countered the SBI claim that the Haskins killing was a 'good shoot', and they intend to bring up murder charges against you, Sharples. The similarities of that killing to this attempted one will be plenty for a Jury to consider, especially with that illegally concealed gun with no serial number we found strapped to your ankle. I'm certainly willing to let a Jury make that determination, after your fair trial, of course. And you'll still be on trial for the attempt to kill me.\"\n\n\"By the way,\" I said, \"one difference in the cases... why didn't the SBI show up this time, Sharples? Why did they abandon you?\"\n\n\"Are you kidding?\" asked the lawyer. \"Why would they show up at The Hollow? They never even tried to go up there.\"\n\nCindy couldn't wipe the grin off her face in time, and Rudistan was grinning like the Cheshire Cat. The lawyer caught it, and he groaned...\n\n\"Sharples.\" I said. \"You should really reconsider not talking to us. I'm not kidding and this is not a threat... when we're done, you're going to be strapped to the table at Jacksonville State Prison like Lance Priemus was, and you are going to be executed by the State. Save yourself from the death penalty, and don't go down alone...\"\n\n* * * * * * * * * * * * * * *\n\nI told Cindy to call in all MCD and Vice Detectives to be here by 6:50am. It cost me a good deal of money, but I had enough doughnuts delivered to every Precinct and to Police Headquarters for every Officer (on both third and first shifts) to have at least two.\n\nWhen my Detectives came into MCD that morning, the doughnuts were there, the coffee pots were full of well-prepared coffee. I invited Della Harlow and her Administration people, and of course Chief Moynahan and Chief Griswold came in. Everyone in the overcrowded room chatted as they enjoyed the doughnuts, wanting to know what the celebration was about.\n\nAt 6:59am, I said finally spoke, and said \"Let's watch some TV.\". I turned on the monitor with the remote. Only seconds later, the fun began.\n\n\"This is Bettina Wurtzburg, KXTC Channel Two News!\" shouted the lovely redheaded reporterette, her makeup and attire just a bit better than usual as she spoke from outside County Jail. \"Channel Two News has learned that SBI Agent Leonard Sharples has been arrested and charged with the attempted murder of Police Commander Donald Troy...\"\n\nThe room erupted into the loudest cheer I'd heard since the National Championship football game. After a moment of celebration, it got quiet as I turned back the DVR so everyone could hear the whole thing again.\n\n\"Agent Sharples was caught by Police firing a gun into a window where Commander Troy was standing at the Point Hollow farm in the north of the County.\" Bettina said. \"The shot missed Commander Troy, and Sharples was apprehended at the scene. Asked why he was there, Commander Troy said that he and his Officers were following up on the case of the disappearing students. He reserved further comment, referring Channel Two News to the District Attorney's office...\"\n\nKSTD had the story an hour later, but only because they'd watched KXTC. Priya was way behind the power curve in her reporting of the arrest of Sharples. She didn't look all that happy, for sure...\n\nPart 26 - Another Successful Arrest \n\n\"Okay,\" I said at 8:30am to my 'Detective Fiction' Club. \"Let's wrap up this disappearing students case with a neat bow. Lt. Masters, have Detective Parker take some Officers to bring Ron Estes to Interrogation-Alpha. Have Detective Washington lead a team to bring Ben Ellman to Interrogation-Bravo. If either resist, arrest them and bring them in anyway. They are material witnesses.\"",
        "\"In addition,\" I said, \"I am having Paulina Patterson get some warrants for us. Captain Ross, get ready to issue orders to the Precincts in my name to execute those warrants...\"\n\n* * * * * * * * * * * * * * *\n\nAn hour later, I entered Interrogation-A with Teddy Parker and Paulina Patterson. Cindy and the Chief were in the anteroom. Ron Estes was in the room, attended by Sr. Patrolman Morton. \"Why am I here?\" he demanded to know.\n\n\"You are here to answer some questions I have for you, regarding the Danny Cantrell case.\" I said. \"First, I am going to read you your rights.\" I did so from the card, asked if Estes understood his rights, and he said he did, but wanted to know why he was forced to come to the Station.\n\n\"I just have one question for you, Mr. Estes.\" I said, looking hard at him. \"What did you do with the body of Danny Cantrell?\"\n\nSilence in the room was instantaneous. Estes looked at me as if I'd lost my mind. Admittedly, so did everyone else.\n\n\"Say what?\" Estes finally spluttered. \"I didn't do anything with Danny. I don't know where he is, and he could be alive for all I know.\"\n\n\"We'll see. Stay here.\" I said. I got up and went into Interrogation-B, where Theo Washington was waiting, and Patrolman Hicks was attending. Ben Ellman was in the seat. I read him his rights from the card, then asked him the same question. He was more practiced and prepared for me, and said I was out of my tree and he wouldn't dignify me with a response.\n\nIt was then that I got to put into execution one of my favorite ploys. With a pre-planned signal to Cindy, I told Ellman that he was going to go through booking. He was made to stand up, cuffs were put on him, and with a second signal, we opened the door to the hallway and brought him out... at the same moment Cindy brought out Estes. \n\nTheir eyes bulged as they caught sight of each other, but neither said a word. I told Cindy to take Estes through booking first and put him in I-1. Ellman was destined for I-2.\n\n* * * * * * * * * * * * * * *\n\n\"All right.\" I said, going into I-1 thirty minutes later. A Chase, Lynch & Berry attorney had almost magically appeared to represent Ron Estes.\n\n\"More police brutality, more lynch mob tactics against innocent citizens.\" the lawyer snarled. Chase, Lynch & Berry were rabidly anti-Police as well as ambulance chasers.\n\n\"Mr. Estes, your rights have been read to you.\" I said. \"I ask the question again: what did you do with Danny Cantrell's body.\"\n\n\"Don't answer that.\" said the lawyer.\n\n\"Is your client taking the Fifth?\" I asked. \"If not, he's compelled to give an answer.\"\n\n\"That's bullshit.\" said the lawyer.\n\nPaulina Patterson said \"If he doesn't answer, the Court will consider him to have invoked... so if he says anything in the future, he will be willingly giving up his Fifth Amendment right against self-incrimination.\"\n\n\"You people are absolutely ridiculous.\" the lawyer said.\n\n\"Ms. Patterson,\" I said, \"I am getting tired of this lawyer's lies, as well as his slander against the Police Force. I would suggest we go to Court and ask them to assign new counsel to this defendant, just to protect his rights. I will then arrest this lawyer for slander, for his comments about police brutality in this case, which has not happened.\"\n\n\"Sounds good.\" Paulina said. \"I'll call the judge now.\" She got up to go.\n\n\"All right.\" said the lawyer. \"We'll do it the proper way. Mr. Estes, invoke your Fifth Amendment rights.\"\n\n\"I invoke my right to remain silent.\" said Estes. \"I will answer no questions and will not help the Police in any way.\"\n\n\"Too bad.\" I said as Paulina came and sat down beside me. \"I only have one offer to keep Death off the table. And since you're no longer able to talk, I guess Ben Ellman will get it.\"\n\n\"That's harassment!\" screamed the lawyer. \"That's intimidating my client!\"\n\n\"No it's not.\" I said. \"And you know it. And let me just say this, Ron... my Officers are executing a search warrant of your apartment. Specifically, they are looking for an engagement ring purchased by Danny Cantrell for Sherry Kim. If that ring is found in your apartment, Ron, it is all over for you. All over. I'll be going for the death penalty for you.\"\n\nEstes had turned pale as I'd talked, and I knew I was very close. Still, I got up and left, as did Paulina.\n\n* * * * * * * * * * * * * * *\n\nBen Ellman had none other than Forest Gillis, who'd defended Dora Ellis in the Lance Priemus case, as his legal beagle. That in itself told me volumes.\n\n\"Okay, Ellman,\" I said, \"your rights have been read to you, and you have legal counsel with you at this time. I am not going to waste any time on you. You are going to prison for having sexual relations with girls in your classes in exchange for better grades. I can charge you a number of ways for that alone, including rape if any of the girls testifies that they were coerced by you. In addition, there is one deal on the table for either you or Estes. One of you talks, gets a reduced sentence; the other gets the death penalty.\"\n\n\"Go fuck yourself.\" said Ellman, his eyes boring into me. I could tell he was getting a little unhinged. \"Oh, and by the way... I'm invoking my right to remain silent.\"\n\n* * * * * * * * * * * * * * *\n\n\"If they don't find that ring, or something else,\" said Chief Moynahan in his office, \"then you don't have a case, Mr. Crowbar.\"\n\n\"I think I have a good circumstantial case.\" I said. \"Eventually Sherry Kim is going to come out of her trauma, and she's going to remember. Also, we got warrants to take DNA samples of both Ellis and Estes; I'm going to bet 'all-in' that those DNA tests show a match for Ellis, if not both men, with the rape kit evidence from any or all of the women.\"\n\n\"So where do you think they put Danny's body?\" asked Cindy.\n\n\"This is going to sound very brutal, but remember that these guys are biologists... they dissect things.\" I said.\n\n\"Oh, geez.\" Cindy cried out. \"Like that headless guy in the Crown Chemicals acid drum?\"\n\n\"Worse.\" I said. \"The Biology Department and Vet School do a lot of testing on animals, and they have to destroy the tissues and the bodies, usually by incinerator...\" I could see the others were getting squeamish; human faces are not supposed to be those shades of green...\n\n\"Not much evidence to test for DNA, then.\" said the Chief.\n\n\"And that makes things a little trickier,\" I said, \"but we're still going to have a solid case, if I don't miss my guess.\"\n\n\"And you rarely do.\" said the Chief.\n\n* * * * * * * * * * * * * * *\n\nThe evidence bag was placed on my desk. Inside was a ring box, inside of which was a diamond engagement ring.\n\n\"The Jared Jewelers at the Mall identified it as the one they sold to Danny Cantrell a few weeks ago, and we have a sworn affidavit to that effect.\" said J.R. Barnes of the Crime Lab, who had participated in the evidence collection raid.\n\n\"We've got him, then.\" I said, a smile forming on my features. \"Captain Ross, would you care to join me in a philosophical discussion of ideas with Mr. Estes?\"\n\n\"I wouldn't miss it.\" said Cindy.\n\nPart 27 - The Solution\n\nI put the box in its evidence bag on the table in front of Ron Estes and his lawyer.\n\n\"It's over, Ron.\" I said, as Cindy and I sat down. \"And when the DNA sample we took comes back as a match of the rape victims, you're looking at the death penalty.\"\n\n\"You have no body.\" said the lawyer. \"The students were found in other States. You have no habeas corpus.\"\n\n\"Oh, I think I do, as the crimes started at Point Hollow.\" I said. \"The missing engagement ring was found in this County, as well. And Mr. Estes here is going to tell me what he did with the body, to save his own life.\"\n\nThe lawyer leaned over and whispered something to Estes, who nodded.\n\n\"We're calling your bluff, Commander Troy.\" said the legal beagle. \"We don't think you have a case. And again, I'll be fighting you to the Gates of Hell on jurisdiction.\"\n\n\"Whatever.\" I said. \"I'll be called to testify in any jurisdiction. And my story will have Mr. Estes never seeing personal freedom again, even if he avoids the death penalty. Shall I tell you what happened, Mr. Estes? And you just have your legal beagle correct me if I go astray.\"\n\nAs I settled in, I noticed that Cindy's ice-blue eyes were lighting up. She just loved it when I did this to perps.\n\nI began: \"On Friday, April 21st, you and Ben Ellman delivered the six students and their gear to Point Hollow. You left the Jeep in case of an emergency, and to bring the samples back, and you told them you were going to bring a van back on Sunday to pick them up. You also said you were going to go to the other site, south of the nuclear power plant. But you and Ben never went down there at all. In fact, there never was a second soil collection expedition at all.\"\n\n\"You and Ellman intended to come up to the Point Hollow site, where you and perhaps some of the six students were going to treat Danny Cantrell to a nasty night of humiliation. You see, Ron, I know that you also were in love with Sherry Kim. You were totally smitten with her. She used Danny to reject your advances. She teased you by dating Danny. And when you'd heard he bought her a ring, you just about went berserk.\n\n\"I know that Sherry and a couple of her Asian girlfriends gave Ben Ellman blowjobs in exchange for good grades.\" I said. \"They didn't fuck him, though. And you... you weren't getting jack shit from her. She wouldn't even let you take her out to dinner... Danny was getting that much from her, and you weren't.\"\n\n\"So maybe you were going to make Sherry give you head in front of Danny, maybe your initial plan wasn't to rape her. But as you and Ellman drove up that evening, you were surprised to find someone walking back towards Town from Point Hollow... Danny Cantrell.\"\n\n\"When you stopped to pick him up, he probably told you the story of Big Jake Stone deflowering Sherry in front of everyone, popping her cherry earlier in the day. I'm sure you were enraged by that as well, Ron. Sherry wouldn't even date you or blow you, but big Jake Stone was getting nuts-deep into her.\"\n\nRon Estes's eyes showed his utter hatred... and I could see he knew I was right, so far. I continued: \"So you subdued Danny, tied him up, pounded a few punches and kicks into his belly, then waited until night. Then you and Ellman planned what to do.\"\n\n\"I suspect that you went on up to camp, leaving Danny tied up, and not driving all the way up so as to not leave fresh traces of your vehicle. I'm sure the other students were surprised to see you. Jake and Natalie had finished having sex by then. So Ellman broke out some wine, which was laced with powerful hallucinogens. Everyone but you and he drank the wine. The hallucinogens would take time to take effect, but it explains why they all were affected at the same time.\"\n\n\"So the next morning, you and he gave them more drugs, then got Sherry and Annemarie into a van. You took them up to that shelter, maybe met up with some of Ellman's friends, and you beat the living hell out of Danny and forced him to watch Sherry being repeatedly raped and sodomized by yourself and the other men.\"\n\n\"Is this for real?\" the lawyer sneered.\n\n\"It will be when the DNA tests come back.\" I said. \"Unfortunately for you, or maybe intentionally, Danny Cantrell was vomiting and coughing up blood. He was dying as a result of the beatings you gave him. So you left the women at the shelter, and drove back to Point Hollow. You took the Wrangler back to Campus, got the other van, went and got Danny's body and disposed of it, cleaned out the van, and hid out until Sunday. You'd taken the engagement ring off Danny's body, maybe to pawn it later, and left it at your apartment.\"\n\n\"So maybe that's not exactly what happened,\" I said, \"but it's the gist of it. If Ellis cuts a deal, he'll fill in the blanks. So, Mr. Estes, this will be our last meeting until I testify against you in Court. Sure you don't want to talk?\" Estes said nothing, but the gears were turning behind his eyes.\n\nI got up to go, and made it halfway to the door when he called out \"Wait!...\"\n\n* * * * * * * * * * * * * * *\n\nI went into I-2 with Paulina and Cindy, over an hour later. Ben Ellman was staring daggers at me... no, it was Paulina he was looking at that way.\n\n\"It's over, Ellman.\" I said. \"Ron Estes confessed. He's given us everything.\"\n\n\"Then why are you in here talking to my client at all?\" asked the lawyer.\n\n\"Oh, he knows.\" I said. \"Death for him can come off the table... provided he comes correct with what he knows about 'White Roots'.\"\n\n\"I'm not giving this nigger a damn thing.\" Ellman hissed, jerking his thumb at Paulina.\n\n\"Good enough.\" I said. \"What I am going to do... is give you to the FBI.\" I turned to the one-way glass and waved. The door next to the glass opened, and in walked the Deputy Director of the FBI, followed by Jack Muscone and Eduardo Escobar.\n\n\"Bad day for you, Dr. Ellman.\" I said. \"Those drugs you gave those students are of great interest to our National Security friends. And they have some very good methods of... persuasion... in getting you to talk.\"\n\n* * * * * * * * * * * * * * *\n\nFriday, May the 13th. Yes, Friday the 13th, but a good one. This party definitely was worthy of The Steakhouse. Chief Griswold said he paid for it. Jack Colby declined to comment on just how much, or little.\n\nIt was the Chief Emeritus, the current Chief, me, Laura, Cindy, Teresa, Teddy Parker, Theo Washington, Julie Newton, Christopher Purvis, Tim Geiger, Paulina Patterson, Jack Muscone, Sandra Speer, Martin Nash, Lindy Linares, Eduardo Escobar, his gorgeous wife Rosalyn, my mom Phyllis, Molly Evans, and of course all the kids. Others had been invited, including the Wellmans, the Seth and Joanne Warners, and Dr. Mickelson, but they all had been unable to attend for various reasons.\n\nAfter an exceptionally delicious steak dinner, we settled down for some discussions of the events after Cindy rang the glass with her spoon.\n\n\"First, Don,\" she said, \"what led you to Estes and Ellman?\"\n\n\"Well, first of all I want to say that Detective Teddy Parker did an outstanding job with this case. He gathered a lot of information, including about the engagement ring and where it was purchased from, and learned a lot about imagination along the way.\" Everyone applauded as Parker blushed a bit.\n\n\"The Rebels will get the Wildcats back next year, sir.\" he said. \"But I don't hold a candle to your case-solving abilities.\"\n\n\"You are well on your way, Parker.\" I said. \"And I mean that. I am very impressed by your work on this case. And speaking of the case... where to start...\"\n\n\"That burning question you always had.\" said Cindy.\n\n\"Oh yes, that.\" I said, smiling. \"What I kept asking was, 'What were the plans to pick the students up again?' and variations of it. But first, let me say this: my attention was first drawn to Estes when he was one of two persons who went to Dr. Mickelson about the students... but he had the keys to the vans and the jeep. Why could he not have just gone out there himself and checked on them? I could not make much sense of that, and I was not convinced by his answers.\"\n\n\"And the reason my first question was important... because all indications and stories told to us were that the students were left at Point Hollow. In fact, the Jeep was left there with them, and they were going to drive the samples back, then get the jeep or other cars and get the rest of the group. I surmised that after I realized the non-answers on the plans to come home were something of a cover up. Some were guilty, and others were confused or didn't want to become involved by saying anything.\"\n\n\"So,\" I continued, \"let's now talk about this concept of the two soil-gathering trips. I noticed that the group going to Point Hollow didn't seem to care a whole lot about the samples. They took only a few, and were more interested in making Annemarie's very steamy sex movies than in sample taking.\"\n\n\"Can't blame them for that!\" said Molly. Everyone broke out into laughter, including me.\n\n\"No, no doubt about that.\" I said. \"But since the Point Hollow trip seemed to be much less than serious, I thought about the other trip... and came to some startling observations.\"\n\n\"First,\" I said, \"some of you might remember our case involving the Nuclear Power Plant ('Eyes Only'). I can't go into detail, but suffice it to say that the Plant and the Facility next to it are very closely guarded. One does not go down there on a whim to collect samples... one would have State and Federal agents and security people swarming like hornets. They'd have to go miles downriver to avoid any problems, and at that point, would any samples taken be worth anything?\n\n\"When I add to it that Dr. Mickelson didn't seem all that interested in the trip south of the plant, I let my imagination flow a little bit, and concluded that there was no second trip. From that point on, things that had not seemed possible, now started to be possible.\"\n\n\"So everything Estes had said about the second trip was a lie.\" I continued. \"But he did show one thing very clearly: his hatred of Danny Cantrell. And it wasn't too much of a reach to consider that the reason for his hatred was Sherry Kim. You see, guys, Sherry was a virgin until Jake deflowered her... but she was not as sweet and demure as she pretended to be. She was a tease, and she liked to use weak men to her advantage.\"\n\nI continued: \"Sherry Kim was using Danny against Ron, used Jake against Danny, and so on. So Ron had some hatreds building up, though misdirected. I'm not sure who first came up with the plan, but one thing was clear... some of those kids at Point Hollow were part of a plan to torment Danny Cantrell. They did so at the camp, then he left to walk home, and the others got hold of him.\"\n\n\"So, son,\" my mother said, \"why was Danny's cellphone found at the Point Hollow site? Would he not have taken it with him?\"\n\n\"He may have forgotten it in his haste to get out of there.\" I said. \"Or he took it, and Ron Estes planted it back in the tent. And that brings up something else I observed at the scene. Sherry had rejected Danny, so why would she share a tent with him? Answer... she didn't. There had to be another tent. And that is what I think Estes carried Danny's body in when he took it back to Campus.\"\n\n\"Another thing that held us back,\" I said, \"was that neither Ron Estes nor Ben Ellman had DNA on record. Ron is young, and had never been in trouble with the law, so that's not too hard to understand. Ben Ellman, on the other hand, had to work to avoid having his DNA on record somewhere. And that led me to new discoveries with him.\"\n\n\"Speaking of that, who were the friends of Ben Ellman?\" asked Theo Washington. I looked over at Jack Muscone, who nodded that I could continue.\n\n\"He's part of a white supremacy group, and so were they.\" I said. \"That was his real reason for going to Tennessee. A couple of his friends from that group came up this way to visit, probably to create some mischief somewhere...\"\n\n\"Ohhhhhhhh,\" said Teresa, \"the gunrunning.\"\n\n\"Somebody promote this woman to Vice Lieutenant!\" I exclaimed with a grin. Everyone laughed, then I said \"Yes, that might have been some of it, though I don't know and have no established links. Anyway, I think we'll leave that in the FBI's hands. As it is, this whole case has jurisdictional issues that will keep the Courts busy for a while.\"\n\n\"Okay, what about Sharples?\" asked FBI Special Agent Martin Nash. There was a loud acclaim followed by clapping and cheering. I could not help but smile widely.\n\n\"There are two important points here, ladies and gentlemen.\" I said. \"First, even if the FBI and I had some 'philosophical differences' in these cases, I never felt like I was being betrayed. But the people that Sharples was running around with, and placed his trust in... would not and did not hesitate to betray him with a ferocity that makes Brutus and Iscariot look like angels in comparison. I trust good people like you all, and our FBI friends here. Sharples trusted people who sliced him to ribbons with knives in the back.\"",
        "The second point,\" I said to the quietened room, \"is that I get really, really irritated when people treat me like I am some kind of stupid idiot. I may not be the sharpest tool in the shed, but I am not the dumbest rock in the box, either. And the SBI clearly thinks I am as dumb as a Betta fish. Did they really expect for me to see that Hamilton County crime scene and not see the comparisons to Point Hollow? Did they think I would not see the SBI's little tricks already in the making?\"\n\n\"They knew of the drug lab at Point Hollow,\" I said, \"even tried to muscle in and take the evidence and take over the investigation. Maybe I should've let them; that would've caused some humorous moments to see.\" I was looking at Jack Muscone as I said that.\n\n\"Anyway, as I examined the Hamilton County scene, I could see that there was some kind of set-up to it. Why would the SBI go in after one loser? They were told it was an eight-man gang, but there was no evidence of that, and no previous evidence of gang activity in that area. Why would the SBI muscle in on Hamilton County? That just made a new enemy. Then at the site, Captain Ross made the same observations that I did... similarity to a certain place on our own turf.\"\n\n\"So...\" I said, \"after I got wind of a plot to eliminate me, I decided to make it easy for the SBI. We put out word of a possible return of drug gang elements to Point Hollow, and painted a scene of only a few people there, me being one of them.\"\n\n\"I suspected Sharples had set up and shot Haskins, and I thought he would try the same thing again at Point Hollow. He chose Haskins's cousin Dirty Lennie, who I'd forewarned and who agreed to work with us, and of course I had as many cameras as I could obtain at the site, filming everything. After that, it was all to easy to reel in that fat fish. Is that not right, Chief Griswold.\"\n\n\"You're a lousy fisherman, Crowbar.\" said Griswold. \"But you're the best damn cop I've ever seen, and a good daddy to this sweet little girl.\" Indeed, Carole had fallen asleep in Griswold's arms.\n\n\"Maybe the SBI meant for you to see that scene.\" said Cindy. \"Literally an in-your-face move. And if you hadn't had the SWAT Team interdict the NTF agents coming up to support Sharples...\"\n\n\"That's true.\" I said. \"I think not all of them are involved in the plot; they were just following orders. Ferrell is the one. He wanted to set a precedence, so that when I was shot and Dirty Lennie was then killed and named the assassin, there would be the Hamilton County case. Flip side of that is that too many of the same things start to look suspicious in themselves.\"\n\n\"They counted on you being dead, and the rest of us being idiots and not seeing it.\" said Teresa. \"But while Sharples was a cunning runt, he wasn't as smart as he thought he was.\"\n\n\"He was, and is, dangerously cunning, though.\" I said. \"He's a lot more dangerous than people give him credit for, including myself. And Agent Reubens of the SBI also found that out... the hard way.\"\n\n\"What about the drug lab at Point Hollow?\" asked my mother. I sensed mischief being created, there.\n\n\"Ah yes, that.\" I said. \"Nice little set up. Great little stage play there.\" I looked over at the FBI Agents. They did not look very comfortable at the moment. \"All I'm going to say about that, is that a lot of what I saw these past few weeks remind me of a book I read that was written by the great Dame Agatha Christie.\n\n\"Curiously, the book was called The Hollow, and while I won't give away the plot, Monsieur Poirot realized that the clues offered to him were designed to lead him away... and astray. I would say that drug lab and several other things were just that... designed to distract me, to lead me away from the truth. To that, I only have one thing to say: this is not an Agency of the Weak Minded, as the great Sherlock Holmes would say. It would be far, far better to respect me and trust me than to try to fool me.\"\n\n\"No doubt about that.\" said Teresa.\n\n\"Strong crowbar beatdown to follow.\" said Cindy. \"And speaking of that, I have Police Boxing Matches tomorrow. Drink heavily, Commander.\"\n\n\"Glad I'm not your opponent tomorrow.\" I said. \"But you're right. It's past my bedtime... and Carole's as well...\"\n\nPart 28 - Epilogue \n\nIt would take weeks for Sherry Kim to come to grips with her ordeal, and that with the help of Dr. Yates, who was a specialist in that area. The good news was that Jason Stone stayed with Sherry the whole way. In time, they would get married and have a lot of hot sex... and make a few babies, as well.\n\nJurisdiction for the murder of Danny Cantrell, whose body was never found, was awarded by a Federal Court to the State north of us. With his confession, Estes got 25-to-life with possibility of parole after 25 years. Ben Ellman was convicted of conspiracy to commit murder, then went into the custody of the FBI, who made his whereabouts unknown. I am glad I was not him.\n\nAnnemarie Reynolds and Natalie Jenkins became lobbyists for the legalization of marijuana. Annemarie was also reported to be making porn films in California, as a producer of them, not an actress. I might possibly have suggested she look up Callie Carrington, and together they would make some extremely hot films that Laura thought were of the best quality, and my wife is the last word on that subject...\n\nJeff Slake never got over his fifteen minutes of fame being over. He went from meaningless job to meaningless job, watched a lot of porn and a lot of strippers, and would die in a bar fight ten years later.\n\n* * * * * * * * * * * * * * *\n\nSaturday, May 14th. After my win over Patrolman McGhillie in the Police Boxing Matches, I watched Cindy take out Janice Holloway of Administration. I had to admire Holloway's courage, and she put up a good fight that would've subdued any perp on the street... but not Cindy, who actually might've taken it easy on her.\n\nThere was a knock on my door as I finished up some paperwork. Christina Cho came in. Her face looked strange, and somber. Cindy came in behind her.\n\n\"Commander,\" said Christina, \"we've processed all the tapes of the Sharples case at Point Hollow. There's one you need to see. I swear to God it wasn't edited.\" She told me the file. I hooked my computer up to the TV screen in my office.\n\nThe tape was showing the last of the work at Point Hollow. The tape showed me giving final instructions, then J.R. Barnes saying goodnight. Then the cameraman moved to the car.\n\n\"Whoaaaa...\" I gasped. \"What was that?\" I backed up the video player on my computer. The cameraman was just leaving, and showed me just turning to my vehicle. Behind me was the Hollow... and that bluish light I'd seen was clearly visible... I advanced a frame, and the image of that Slender Man I thought I'd seen was clearly there!\n\n\"Okay, who was the prankster?\" I asked, a chill rushing through me.\n\n\"Sir...\" said Christina, \"there was no one still out there. You were the last to go.\"\n\nCindy was standing up, staring at the video. \"That's the bastard that was talking when Jenna and Gor-don were in the dungeon!\" she gasped out. \"I'm sure of it... it's the same guy!\"\n\n\"Cindy,\" I said, \"I'm not sure it's anyone at all. I saw it when we were out there, but I thought it was just the trees, and my eyes playing tricks on me.\" No, that isn't what I thought, but I wasn't going to tell Cindy or Christina that...\n\n\"Commander, you're going to have to trust me on this one.\" Cindy said. \"I can sense it, I can feel it... that's a person... and the same person that was in that TV broadcast of Jenna in that basement...\"\n\n\"Well, that makes as much sense as a prankster.\" I said. \"We'll have it checked out. By the way, were there any screams on the video?\"\n\n\"No sir.\" said Christina. \"The audio was turned down because the wind was buffeting the microphone.\"\n\n\"O-kay...\" I said. \"Well, that's very spooky. Whoever's pranking us did a good job.\"\n\n\"Sir... please be careful.\" said Christina Cho. \"The legend of Point Hollow is that whoever hears the screams from the Hollow will be the next to die, and to spend eternity screaming from there.\"\n\n\"I'll keep that in mind.\" I said. I could see the worry on Christina's face; she was not kidding. I could see the anger and determination on Cindy's face. \n\nAnd with the ultimate showdown against the Consultant of Crime to come... would I indeed be the next to die?\n\nFinis."
    ],
    "authorname": "WifeWatchman",
    "tags": [
        "mystery",
        "crime drama",
        "police drama"
    ],
    "category": "Non-Erotic",
    "url": "https://www.literotica.com/s/point-hollow-ch-05"
}