{
    "title": "Lost Empire Ch. 18",
    "pages": [
        "Derrick was enjoying his time to read, the communication station had been going off for almost two hours now. Good he thought let the idiots worry maybe next time they would think and look before they attacked a superior force. \"Derrick,\" Shelby said tentatively not really wanting to disturb him. He'd been in such a good mood since his memory had returned she really didn't want to ruin that. \n\n\"Yes Shelby?\" Derrick answered, \"Is it time already?\" \n\n\"Yes, though I am sure you know that they have been calling almost the whole time. The little I have heard the Duke person has been demanding you stand down and surrender.\" Shelby couldn't conceal the wide smile she had. \"I think the Duke is acting more like a child than a noble.\" She giggled. \n\n\"I believe it is because no one has ever had the position or the power to put him in his place. At this moment I am feeling that he isn't going to like his new place very well.\" Sighing Derrick really wasn't in the mood to listen to the wailing and threatening of this man. \"Alright Zan, Conner restore life support and stabilizers, Shelby let me know when they are ready to negotiate in civilized tones. I'll be in the work room.\" With that Derrick walked out Shelby with a wide smile on her face along with Zan and Conner. \n\nOn board the lead ship the Lysium, larger than the other four, Duke Roger Risen was fuming, how dare that bastard disable the ships and leave them here! A true ruler would have blown them out of existence. What had gone wrong? His grandfather had assured him that the small crafts had enough power to destroy any threats. Hmmm the man thought maybe I should have waited a little longer before I killed the bastard all those years ago. \n\nThe man had been a wealth of information, damn shame he'd been so eager to take the Dukedom that he'd killed most of his family as fast as he had. Still there had to be something he could do to soothe over the ruffled feathers he caused 'til he could plunge a poisoned dagger into the bastard's heart. Ah! The thought brought a smile to his face to kill the emperor that was a feat he was so looking forward to! \n\nAt four and a half hours a strange beam shot out of nowhere and suddenly all five ships had power, and were able to stabilize their position in space. Hmmm so the man wasn't a barbarian after all, damn it! It would have been so much easier to discredit him had he stayed an uncaring, unfeeling ass. So the Duke thought; I am dealing with one with a fairly decent amount of intelligence, possibly even a match to my own. Ok this was going to take far more planning on his part. Smiling evilly, the Duke withdrew to his rooms to plot the downfall of the man who had been named emperor, finally a challenge worthy of my mind he thought as the door sealed shut. \n\nA few hours later, Shelby appeared behind Derrick in the library, \"Derrick? She asked then went on, \"I believe that the Duke wishes to discuss a peaceful solution.\" \n\nDerrick turned to look at Shelby a worried look on her face. \"What's wrong Shelby, you looked worried.\" \n\n\"I have been analyzing all the communications from the Duke. Before now all of his statements rang so true, but now I am detecting nothing but untruths from him. He said he wants to meet you in person, but I do not trust him at all. Please Derrick I fear that this man intends you nothing but trouble and I am afraid he wants to take your life.\" Shelby pleaded with Derrick. \n\nMary appeared adding, \"I am also detecting these untruths sire though in the past the Risen family were true supporters of the empire I feel that this Duke is not. There are far too many rumors of him killing his family to gain power, to discount. I advise against meeting with him, or for that matter revealing who you truly are 'til you are in the palace. Then I will have the full force of the palace to protect you. I have well over two thousand sentries in place with more being built as we speak.\" \n\n\"Thank you both; I have no intention of meeting this man alone ever, or without protection. Mary, have you been able to retrieve the records my mother spoke of?\" Derrick asked her. \n\n\"Yes Sire; I also had the sentry that found them scan them in case they were destroyed before it returned. I have found them to be most enlightening and there are a few concerns that you will have to address Sire.\" Mary advised him. \n\n\"Good I want them up and available here in my work station, if they are too extensive I may have to use the head set, yes I know,\" Derrick said raising his hand to stop Mary and Shelby before they started to object. \"I have already made adjustments to it and believe that the next time will strengthen instead of weaken.\" \n\nBoth Shelby and Mary were nodding though Derrick was expecting this next bit, \"we both will need to see these adjustments before you use it Sire,\" Mary interjected. Derrick could only nod as he pulled up the plans with the new adjustments he'd implemented. It only took moments for both of the holograms to smile. \"It appears that you have not only fixed the problem but have made it possible for your mind to take twice as much more, excellent Sire!\" \n\n\"Well I'm glad that you both agree; I am quite capable you know there are times that you both worry a bit much.\" Derrick replied to both of the A.I.'s. \n\n\"I am sorry Sire but these mandates were enacted for a reason and I cannot go against orders that are almost as old as I am.\" Mary smiled sweetly, making Derrick highly suspicious. \n\n\"Do you have all safeguards in place Mary? I know you told me you had over two thousand sentries ready, but will they be enough with those factions out there with advanced tech?\" Derrick asked Mary. \n\n\"As stated before Sire, this is one of the issues that we need to address. At present they are more than sufficient for almost all of the factions, though there are two that I am afraid whose tech renders the sentries ineffective.\" Mary informed Derrick.  \n\n\"Display for me,\" Derrick said looking over the info that Mary supplied. \"Hmmmm yes, I see what you are saying Mary, here are a few suggestions I have to counter their tech.\" With that Mary and Derrick launched into a long conversation for the next two hours 'til Derrick and Mary were both well satisfied. \"Alright Mary,\" Derrick said with a huge sigh, \"I and my family will be ready for transport soon.\" \n\n\"Yes Sire!\" Mary said a huge smile on her face finally there would be living beings in the palace again! \"All is ready for your and their arrival sire.\" Mary stated as she bowed low an even bigger smile on her face. \n\nDerrick went to his room almost grimacing, he'd heard what his gram had said before about the IMT, and unfortunately it was the only way to get to the Palace at the present time. Sighing before he stepped in, I might as well get this over with, he thought. \n\n\"Hello mother, Gram,\" he started a huge smile on his face. \"We are about to go to the Palace.\" \n\nMilley O'Toma looked up when Derrick stepped in, her eyes narrowing when she saw the wide grin that Derrick was wearing. \"Alright boy, what aren't you telling us?\" She stated. \n\nDerrick had been afraid of this, his Gram had always been sharp and quick to catch on whenever someone was hiding something or lying. Taking a deep breath he was hoping she didn't fight him too much on this, \"We have to use the IMT Grams.\" Derrick told her, \"it's the only way we can get into the palace right now, I know you don't like it but it's safe I have used it myself.\" \n\nMilley and Sherry O'Toma were looking at Derrick with looks of disbelief on their faces. \"Well maybe it's fine for you but I prefer the old fashioned way! Why can't we go down in a ship?\" Milley asked him. \n\n\"I don't mind Derrick though I do have a few fears, staying here it's so sterile, I just can't get used to it.\" Sherry O'Toma said. \n\nShaking her head Milley looked at her daughter-in-law, \"Always like you Sherry, you act timid but you aren't!\" \n\n\"Please Grams,\" Derrick asked, \"as I said it is the only way to the palace right now, I want you both there when I have to reveal who I am to everyone. I'm going to need you both for support, you are the only family I have, please Grams.\" Derrick pleaded. \n\nDrawing a heavy breath Milley nodded her head yes, \"For you Derrick I will do this I won't like it in the least but I'll do it. Just don't ask me to do it that often, not 'til I am used to it, say in about 100 years?\" This last comment drew a laugh from Derrick and a wide eyed stare from Sherry.\n\n\"Thank you Grams, Mother; I am afraid that you both will have to stay in the palace 'til it is safer. From what I have seen of father's research there are at least two factions out there that I am concerned about. It is as you feared Grams they do posses tech that is comparable to ours, though I already have Mary advancing ours as we speak.\" Derrick informed both of them. \"Get what you want to take with you we have to go soon ok?\" \n\n\"Alright Derrick I'll be ready soon,\" Sherry told him. \n\nMilley just shook her head, \"We have to go as soon as possible, she has nothing with her really and yet she's still not ready to go. \"God woman are you that scared?\" \n\n\"It's ok Grams,\" Derrick told the older woman, \"It took me a bit after I first came on board, give her a few minutes ok?\" \n\n\"Oh alright,\" Milley told Derrick as she rolled her eyes. \n\n\"Mother, just follow the corridor to the end when you are ready ok?\" Derrick informed his mother. \n\n\"I'll be along in a bit Derrick,\" Sherry told him as she sat in the nearest chair. \n\nDerrick nodded though he really wasn't that sure about leaving his mother alone, he was soon leading his Grams to the control room. \"I'm glad that you agreed to this Gram,\" he told her. \n\n\"As I said before don't expect me to do this that much, still not too keen on the idea of moving through space as energy, might leave something behind so, not really a fan of it.\" Milley told him bringing a wide smile to his face. \n\nIt was perhaps an hour later when Sherry O'Toma appeared at the doorway leading to the corridor from the control room. \"I guess I am about as ready as I am going to be.\" She told Derrick. \n\n\"Shelby, I want you to keep a link to me, if you have a situation call me. I have worked a few improvements into your system.\" Derrick told Shelby. \n\n\"Yes Derrick I will, please don't be gone long, we have just found each other, now is not the time to get seperated.\" Shelby informed him. \n\n\"Alright Mary we are ready,\" Derrick told the palace guardian. Within seconds they were standing in a huge room with a throne like chair at one end. \n\n\"Welcome home Sire, you are the first to stand in the throne room for over two hundred years. I also wish to welcome the Imperial Mother and Imperial Grandmother.\" Mary said bowing low to all three of them; Milley O'Toma was of course, loving the attention. \n\n\"Mary,\" Milley stated, \"do you have rooms prepared for us?\" \n\n\"But of course your Ladyship, we have a room for both of you, Uh, your Ladyship are you well Ma'am?\" Mary said a concerned look on her face as she looked at a pale Sherry O'Toma. \n\n\"I'm not sure, Sherry replied, \"this is a little over whelming. The mere fact that I am a royal seems strange enough in its self. I think I need to lie down a bit, can you tell me where my room is I'm sure I can find my wa...\" \n\n\"Nonsense ma'am,\" Mary said as a flat transport pulled up next to Sherry. \"This will convey you to your room; do you have need of a doctor? I can call one from the city if you wish.\" \n\n\"No, but thank you Mary, I feel I just need to lie down a bit.\" Sherry told Mary as she sat on the flat surface and it immediately conformed to her shape to make her as comfortable as possible. \n\n\"It is my pleasure Imperial Mother, please rest well, shall I call you at any certain time?\" Mary asked \n\n\"No, if I need anything how do I call you?\" Sherry asked. \n\n\"You just have to call out and I will hear you I am attuned to all three of you now for anything that you will need. As I said just call.\" Mary replied as Sherry nodded then was whisked away to her room. Looking at Milley Mary asked, \"Does the Imperial Grandmother wish to rest also?\" \n\n\"No, but I would like to take a tour of this place, if that wouldn't distract you from your duties,\" Milley told Mary. \n\n\"No not at all, it would be a pleasure to guide you through the palace.\" Mary informed Milley. To which Milley smiled and nodded her head as she started to walk off with the image of Mary. \n\nA moment later another image of Mary appeared. \"All is ready for your inspection Sire,\" Mary said as she bowed low to Derrick. \"I have the crown ready for the coronation later today or tomorrow if you wish Sire. I'm afraid that in order to open the palace defense field, you will have to go through this formality. Plus I am sure that it will convince many of the other nobles that haven't pledged yet to sway more to your side.\" \n\nDerrick was only nodding as he started to look over all the preparations that Mary had done according to the plans that they had discussed earlier. \"I see that you've had to replace a few of the bore worms,\" Derrick commented when he read over that part of the report. \n\n\"Yes Sire, when the planned execution was delayed they had to be replaced, after they are taken out of stasis they can only live a few days before they expire without feeding. It is almost impossible to put them back into stasis when they also haven't fed. Luckily as I stated before we have well over one hundred of them. Sire? I need a decision on your coronation, I know you'd rather put it off but I feel it would prove to be advantageous not only to you but for your position with the nobles.\" Mary touted off. \n\nDerrick nodded as he thought a moment, \"Contact rear Admiral Hartwell, I want him and as many of his men present for it.\" Smiling wide a minute Derrick stated, \"Little Joey wanted a chance to see the palace this ought to be a reasonable excuse for him and as many of the crew as he can send.\" \n\nMary's eyes went wide a minute, \"I will have to go through all of their records before I can allow any of them within the confines of the shield Sire.\" Sighing Derrick nodded. \n\n\"That is everyone except Hartwell and Dempsy correct?\" Derrick asked a moment later. \n\n\"Yes Sire, I had already gone through theirs when they first came aboard Shelby. I have also checked those of your other compatriots Thomas, Rayburn, and Kimison. I have already started the process to have Kimison brought here. Not to worry Sire I have assessed their diagnosis of him or rather their misdiagnosis of him.\" Mary informed Derrick, this last bit snapping Derrick head up suddenly. \n\n\"They said there was nothing they could do for him,\" Derrick whispered the anger apparent on his face. \"I owe that man my life more than a few times, anything we can do for him Mary I want done you understand me?\" \n\nMary's face went serious for a few moments as she replied, \"Yes Sire, his condition is easily curable though I am afraid it will take at least two days, I am sorry that it will take so long.\" \n\n\"Long?\" Derrick said, \"Mary to the people now that in its self is a miracle! Alright, but I want him here as soon as possible. Can Shelby go and bring him back sooner?\" \n\nMary was quiet a moment as she went over all the data that she'd received in the last two hours concerning the man in question. \"I believe it is possible, though I am unsure of how the man will react to no one being there on the ship I am afraid it is part of the paranoia complex that he has.\" \n\n\"I have to go Mary, I was his commander I am one of the few people he might not react to violently. Besides I feel I owe him that much, contact the ship and tell them we'll be there to get him in an hour.\" Derrick told Mary. \n\n\"I am sorry sire but I cannot under the mand...\" Mary started. \n\n\"Mary, input command code, Chi-01, Omega-01, Mu-01, Mu-01, Alpha-01, Nu=01, Delta-01 command transfer confirm.\" Derrick ordered. \n\nMary suddenly froze, \"Chi-01, Omega-01, Mu-01, Mu-01, Alpha-01, Nu=01, Delta-01 command transfer confirmed,\" no one since the very first Emperor had given her the override code, every command she now had was his. Smiling Mary knew that finally there was someone actually worthy of being the Emperor. \"Sire? Shall I go to primary emergency? Given the nature of the next two days?\" \n\nDerrick thought only a moment, \"For now stay at secondary, I may change that after I return. I want you to carry on as if you still have command, inform me when you have finished with the records, and are ready to begin transfers.\" \n\nMary bowed then a thought came to her. \n\n\"Yes Sire I will inform both of them of your departure and when you return.\" Mary told Derrick as he nodded. \n\n\"Shelby, we need to depart as soon as I am onboard.\" Derrick told her through the link at his wrist. \n\n\"I'm ready Derrick, Mary has already given me the coordinates for the pick-up.\" Shelby replied. \n\n\"Shelby transport,\" Derrick said then vanished. \n\nMary was left to stare a moment she was actually at a momentary loss then she went into action, 'til the emperor returned she was in charge. Plus she needed to finish going through the records of all the men on Rear Admiral Hartwell's ship. A moment later she watched as Shelby jumped to trans-warp, ah they shouldn't be long now.\n\nSherry O'Toma had fallen asleep it had been a rough trip for her, not used to a lot of people as she was a solitary person not nearly as outgoing as Milley O'Toma. She awoke with a start the room was strange, the odors were also or rather the absence of them. Looking around she sat up, \"uh ... Mary is it?\" She quietly said. \n\nMary appeared a moment later, \"Yes Imperial Mother how can I serve you?\" \n\n\"Has Milley returned from her tour yet? I was thinking we needed to eat we haven't had any real food since earlier today. Can you ask her?\" Mary said feeling a little strange talking to a see through image it was almost like talking to a 3-d vid except this one actually answered you. \n\n\"Yes Imperial Mother she has returned to her room, I have connected you to her room. Just speak she can hear you.\" Mary happily told her. \n\n\"Milley? Are you hungry? I think I can make us something to eat in the...,\" Sherry started. \n\n\"I am afraid Imperial Mother and Grandmother that we have a chef. I will be retrieving her and her staff momentarily. Please just tell me what it is you would like prepared, and I will inform the chef.\" Mary told both of them with a wide smile, though she could see with Milley that they might have a slight problem. \n\n\"I have been cooking for well over forty years and I'm not about to give that up to a youngster who has learned to cook in a school, no, I trust no one else with my food any way.\" Milley said with a raised voice the anger apparent on her face. \n\nMary had been afraid of this, the woman was more opinionated than the first Imperial mother, shaking her head Mary remembered all that she'd gone through with that one. Sighing she'd have to try something different as she had with the very first Imperial mother. Though she wasn't sure what she'd find a solution to this one, however she always did. \n\nOnboard Shelby, Derrick watched as they entered trans-warp and emerged half way across the galaxy. Not too far ahead of them a small transport was waiting Derrick shook his head this had to stop the ship was in obvious need of repair. He could see that the engines were damaged the astral fins either broken or missing. How in the hell did it manage to maneuver? \"Shelby, open a channel, distortion. To the one commanding this piece of floating space junk, I want Kimison ready to transport in one minute stand him in an open area.\" \n\nDerrick watched as Kimison was moved to an open area then everyone back away. \"Alright Shelby,\" A moment later a man almost as tall as Derrick blinked his eyes and looked around. ",
        "\"Where in the hell am I,\" asked the bewildered man, looking around he saw a human shape in the darkness. \"Who's there?\" Derrick moved forward a slight smirk on his face, \"Commander?\" the man said his mouth hanging open, \"uh... is this yours?\" He asked. \n\n\"Yes it is, Corporal.\" Derrick said trying to hide a smile when the man snapped to attention. \"Relax, I have come to offer you a job, though,\" Derrick paused looking the man up and down hid dirty clothes shabby hair and full beard. \"It will depend upon three conditions.\" \n\n\"Hell! Only three?! Count me in I ... wait a minute what conditions?\" The smiling man stated. \n\n\"Well...,\" Derrick started, \"First off we get you cleaned up and looking more human.\" \n\n\"Ok that's no problem. The second?\" The man said eyeing Derrick closely. \n\n\"You accept the treatment for your PTSD that I can provide.\" Derrick said. Kimison stood there and started to laugh. \n\n\"Not sure if you know this commander but there is no treatment, though one day who knows?\" Kimison said as he continued to laugh 'til he caught sight of Derrick's face. \"Shit! You're serious aren't you? Look I know you think you are...\" \n\n\"Shut up Kimison and give me a yes or no answer. I have a treatment, it works and it's yours that's the deal. So yes or no? Simple.\" Derrick told the man a deadly serious look on his face the whole time. \n\n\"Christ you're really serious! Hell YES! Plus if it gets me out of that hell hole, then I'm in!\" Laughing the man saluted Derrick then did a little dance. Well he was dancing 'til he saw Shelby. Dropping to his knees he could only stare, \"Dear god in heaven, I'm not quite ready to go just yet but thank you for the lovely vision of heaven.\" \n\nShelby's eyes opened wide looking at the man, \"I am not a part of heaven sir.\" she told the man. \n\n\"You sure?\" Kimison said causing Shelby to giggle, \"Cause you look like I would imagine the angels would!\" Causing Shelby to giggle even harder and Derrick to roll his eyes. \n\n\"Derrick we are receiving a message from the transport. The captain seems to be using some very colorful words.\" Shelby reported. \n\n\"Oh yeah that would be old fuzzy face Benson. You remember him don't you commander? We beat his company every time we went against him.\" Kimison spit out. \"He's been a real bastard the whole trip here.\" \n\nGrowling Derrick looked at Shelby, who nodded. \"Hello Captain Benson, I suggest that you take your piece of junk out of here before I use it for target practice!\" Shelby had brought up the onboard video on the other ship. \n\n\"Who the hell is this I can't let you leave with the prisoner 'til...\" Benson started. \n\n\"PRISONER!! Just for that I should blow the shit out of you AND your ship. This man was a war hero you say another word other than that and you'll be limping home. In case you haven't noticed I have well over two thousand weapons trained on your ship. Wanna guess who'd win a fire fight?\" Derrick and Kimison both started to chuckle when they saw the man lose control of his bladder. \"Good boy Benson, by the way this is the new emperor you have been talking to I WILL remember this incident in the future.\" On the screen the man slowly nodded afraid to move from the yellow puddle he was sitting in. \n\n\"Bye Benson!\" Kimison yelled to add insult to injury. \n\n\"Alright Shelby take us back.\" Derrick told her as the transport very slowly moved away. \n\nKimison watched with interest as there was a whining behind them and then the ship was in another place. \"Holy shit!\" He yelled when he realized where they were. \"Half the galaxy in only a few seconds? Christ man where can I get one of these?\" \n\nA smile lit up Derrick's face, \"well...\" \n\n\"You have more than ONE!! Oh my god! Who are you? Where has the man I knew gone? You're not really him are you? I know! I'm still in that damn hospital bed! NO! Get away you bastards I'll kill you all!\" Kimison shouted huddling in a corner looking every which way. \n\nSighing Derrick walked to him and yelled, \"Stand up Corporal! Damn it! Stand up!\" Kimison looked at Derrick and sighed out in relief, \"I thought you all were dead sorry commander I freaked a bit.\" Derrick nodded to Shelby as he back away and Shelby shocked the man, a curious look came into his eyes as he slumped in the chair. We need to get him fixed up and soon Derrick thought. Looking out he saw that they'd arrived at the Imperial planet. Smiling, he picked up Kimison and called Mary."
    ],
    "authorname": "Pars001",
    "tags": [
        "science fiction",
        "alien11111",
        "violence"
    ],
    "category": "Non-Erotic",
    "url": "https://www.literotica.com/s/lost-empire-ch-18"
}