{
    "title": "Lost Empire Ch. 54",
    "pages": [
        "0001 - Tempro\n\n0003 - Conner\n\n0097 - Ace - Zimmel\n\n0098 - Lucy\n\n0101 - Shelby (mother ship) - Derrick\n\n0125 - Lars\n\n0200 - Ellen\n\n0301 - Rodrick\n\n0403 - Johnathon\n\n0667 - Marco - Brown\n\n0778 - Jan\n\n0798 - Celeste - Shelby (human)\n\n0908 - Tara - Mara\n\n0999 - Zan\n\n1000 - Sherry - Lucie (for the moment)\n\n--------------\n\nBoth men looked at Mita expecting an explanation for her statement. An even bigger look of concern came over her features. Sighing she shook her head, she'd stayed quiet for too long. This was her child damn it! Not some random experiment. \n\nMita looked at Gunter, \"Do you remember what my name was before we married husband? I thought at first you weren't going to marry me; especially when you heard my last name.\" \n\nGunther could only stare at Mita then said, \"Yes I remember it was Aoki.\" Then Gunther shrugged as if the name meant nothing to him. \n\nA little relieved Mita turned to look at Derrick her fears returning at the look of shocked revelation on his face. \"Dr. Hideo Aoki! I remember a little now. Father took me to see him. I seem to remember being very sick but not much else.\" \n\nMita nodded then bowed slightly, \"You are the first I have ever heard of remembering anything of that time. You were as I remember one of the first few cases that actually survived; the very first, of the first generation.\" Here Mita hung her head, \"It is fortunate that you remember none of the pain. You screamed so, it was hard to take. I was so young at the time I didn't understand wha... what father was doing.\" \n\n\"Your father!\" Gunther shouted, finally remembering his father in law. Shaking his head he was beginning to feel stupid not recognizing the man. \"Here I thought he was this nice older man!\" Shaking his head again he tried to remember exactly what the man had been called. Suddenly his eyes went wide, \"Doctor Death!\" \n\nMita hung her head nodding affirmative to her husband. But the look of disgust in his eyes shocked her the most. \"I didn't know for the longest time. I remember hearing well muffled screams though at the time I didn't connect them with father.\" Here she turned to Derrick, \"then I met you one day. After we talked for a bit I felt I had made a friend. The first true friend I ever had, and then you were gone.\" \n\nDerrick's eyes went wide as a memory flashed before his eyes. \"Mi, Mi?\" Derrick whispered as his body started to shake. \"I remember you were younger than me. I made you a promise we'd see each other again.\" Turning his head away Derrick continued. \"I'm sorry I was never able to keep that promise. Your friendship and the promise are what helped me through it all.\" \n\n\"It appears that the Doctor was possibly responsible for the sudden deaths of thousands; both children and Adults.\" Mary interjected. \"At the present time there are only about twenty cases that survived his administrations. You sire are in the best condition. Almost all of the first cases died, at present you are the only one of the first year, first generation that survived. That's astonishing, to say the least Sire.\" \n\n\"Sire?\" Both Mita and Gunther said. \n\n\"What in the hell is she on about?\" Gunther asked. \n\nMita had both her hands covering her mouth as she could only stare at Derrick. Then her eyes went wide as she slowly sank to her knees. \"I'm sorry,\" she whispered bowing her head. \"I accept what punishment you declare your majesty.\" \n\nDerrick groaned as he went to his knees in front of her touching her face. Gently pulling her chin up, he stared into her eyes. \"Why are you sorry? It wasn't you it was your father plain and simple. Besides I think it was you that gave me the strength to live.\" Mita's eyes went wide as she tried to recoil from Derrick. \n\n\"I could have stopped father I know it. Had I known and not been so stupid and childish.\" Mita said tears slowly falling from her eyes. \n\nDerrick shook his head, \"Don't be so sure. As I remember your father was deep into all of it at the time. A few years later yes, though not I think, at the first.\" \n\nMita was slowly nodding her head then she looked at the visage of Mary. \"May I hug my friend? I recognize you so I don't want to do anything to alarm you.\" \n\n\"I will allow it as I have scanned you when I came here.\" Then she turned to Derrick, \"that is Sire, if you allow it.\" \n\nDerrick's face wore a look of irritation then he sighed. \"I will always allow it, like her husband and the others I trust her.\" \n\nMita's eyes went wide as a look of shock spread across her face. \"You trust me?\" Further shock seemed to take over her whole body as she sat there only able to stare at Mary and Derrick. \n\nA wide smile was on Derrick's face as he reached out grabbing Mita in a bear hug. \"As I said it was your father not you. Though I see that you, yourself went into the medical field. You met the Lieutenant when we were in the republic wars?\" \n\nMita nodded, \"He was brought in with a weapon injury to his leg.\" Here she turned to Gunther. \"You never said how you got that either. You think you could order him to tell me Sire?\" \n\nAgain, Derrick groaned though not as bad as before. Turning toward Gunther he smiled wide again as he said, \"It was Rayburn and Kimison wasn't it?\" \n\nA huge look of shock appeared on his face as he could only nod. \"It was right after our first year of the Republic campaign. I think you were gone at the time. They started arguing about lord knows what, as they always seemed to when you weren't there. Sergeants Norman and Jimison jumped in to try and separate them. They had both pulled weapons when I jumped in. I managed to wrestle the weapons from them or thought I had when one discharged.\" \n\nA smirk crossed Mita's face, \"We all thought that the wound was self inflicted. Considering the close range to his...\" here Mita got embarrassed. \"Uh... private parts.\" Here she looked at Gunther with a true look of love. \"Most would be screaming in pain. Not Gunther, he lay there as I applied all the salves and burn creams. I think, I think that was the day I fell for him.\" \n\n\"Yeah, I remember that, were you trying to be a hero or something?\" Came Norman's voice from behind them. \n\n\"As I remember you still kicked both their asses even with that wound. I thought you were going to shoot them, hell I would have. You gained a hell of a lot of respect from the both of us that day.\" Jimison said as Both Mita and Gunther turned to see both men leaning against the wall. \n\nGunther's mouth dropped open as he stared at both of his friends. Both who were supposed to be dead, dead for a few years now. \"You... you are both dead. I saw the video of you being blown into space. I saw you gunned down by Republic troops.\" \n\nBoth men smiled then they nodded to Derrick. \"Well actually,\" Derrick started. \"They are dead to their time. I...\" \n\n\"Sire? I think she is waking up.\" Mary drew up close to Shelly as her eyes flicked open. \"Hello little one. Feeling better?\" Shelly nodded as she reached up to Mary to pull herself up. \n\nShelly's eyes went wide as her hand passed through Mary. Motioning Mary down, she whispered low to Mary. Mary's eyes went large as she went to Mita. \n\n\"Is she alright? I've been afraid that the delay codes I used were being ignored by the nanomites. Damn if father didn't make these more complex than the first set.\" Mita said. \n\nInteresting Mary thought as she ran another scan of Shelly then was nodding. \"What were the codes? I wish to see if I can slow them further. The shock I administered will only last a week. Then I am afraid she will be where she was again. Though I think a week without the seizures will be good.\" \n\n\"Yes! Anything to help, Mary. Please just save her I thought father was helping her then this started. If he were still alive he could easily stop this. I wish I had been able to save more of his notes that I had.\" Mita told Mary. With that Mita told Mary all the codes that she had including all of those that were incomplete. \"What did she say? Mita indicated Shelly.\" \n\nMary got a strange look on her face as she said. \"She said she wanted to sit up. When her hands passed through me she giggled a bit. It was then she told me she was sorry then she called me the see through lady. Strange though I have never been called that, it is true. I am after all a hologram.\" Mita smiled as she recalled the other hologram's reaction. \n\nMary went through all the codes then compared all of them to those that Tempro had gotten from Derrick. Interesting she thought they were almost identical. From what she saw what Mita had done was probably the only thing that had saved the little girl. Looking further she began to find certain events that had caused the premature activation of the nanomites. \n\nMary turned toward Derrick as she was running the codes. \"Sire? I am receiving a transmission from the Empress. Apparently she is upset that you haven't contacted her as of yet.\" \n\nDerrick swallowed hard remembering the last time Shelby had back handed him to the deck. \"Open a channel Tempro.\" Derrick directed. \n\nA moment later a hologram of Shelby appeared. \"Why in the hell are you at the imperial planet? I've that piss ant Risen in a cell. I want IT gone! When...\" \n\n\"I'll be there as soon as I can. Shelby was damaged helping to boost Tempro's double IMT. It was being interfered with by the ripalon energy at the old ship yards. I blame myself.\" Here Derrick hung his head. \"I...\" \n\n\"Damn it Derrick! Don't start this self destruction again! I had a hard enough time getting you out of it last time. Unless of course you like being face down on the deck? I'm sure I could arrange for you to experience it again!\" Shelby said a little wicked smile crossing her lips. \n\nDerrick held up his hands in defeat, shaking his head she was definitely a force to be reckoned with. Shit as of yet he'd only seen her slightly upset. Full out angry? Here Derrick shuddered, no thank you! \n\n\"How damaged was Shelby? I take it she blew out her complete IMT system?\" Shelby asked then gasp when she saw Derrick nod then lower his head. \"My god! You almost lost her didn't you? MARY! Check his entire nervous system! Is he operating at full capacity?\" Shelby asked. \n\nMary's stunned look was quickly replaced by concern as she rapidly started scanning Derrick for the next five minutes. \"I am finding several healed burns and cuts since the last time I saw the Emperor. I am also detecting plasma burns from the regen matrix of an EIG. Sire you went into an EIG when there was an active Matrix? Again I have to ask you, Sire do you wish to die? That is one of the most dangerous things you have ever done!\" \n\n\"So he's healing well,\" turning toward Derrick Shelby told him sternly, \"I expect a full report!\" Then her hologram flickered as several alarms went off. \"WHAT!!? Get here soon Derrick. It appears that Risen has escaped! Celeste start scans, find him!\" Then the hologram vanished. \n\nGunther laughed a moment, \"'Bout like being a father isn't it? Least it sounds like it to me.\" \n\nDerrick could only shake his head as he went to a console. Typing as fast as he could he smiled when he started to get results. The travel into the past had been eye opening that was for sure, most certainly informative if nothing else. \n\nIt was several hours later that Mary began to formulate several new codes. These she was sure would allow Shelly to develop further without the seizures. \n\nAppearing before Derrick, Mary stated, \"I believe I have working codes for little Miss Shiloh. It was far easier than with those that you have.\" \n\n\"Alright inform Mita and Gunther. Tell them I'll be there as soon as possible.\" Derrick told her as he turned back to his console typing at a blurry speed. \n\nMary's eyes were suddenly wide as she read what Derrick was typing. \"Are you sure Sire? Though it is you I cannot implement this without her or her parent's consent.\" \n\n\"I know, that's why I am adding all that I can for you to work with. These codes I believe in junction with what you have will make it easier. Though I agree it is ultimately their decision I won't do anything to hurt her.\" \n\nMary had tears in her eyes as she looked at Derrick. The man truly was a great leader it made her feel fantastic to be serving a man like him. \n\nAlmost an hour later Derrick appeared in the med bay. Shuddering he just hoped he never had to come here again as a patient! \"Thank you sorry I was delayed. Mary has managed to develop the rest of the codes that you didn't have Mita. I have poured over those trying to find anything that I could. I believe I have found a solution, one that I could actually turn them completely off\" \n\n\"No!\" Mita suddenly shouted. \"You can't! They are the only thing that is keeping her alive. Much as it was for you. The disease that the both of you had is that deadly. It took many years for the nanomites to completely destroy it in you, Sire. It's only been a year for her; she is well yes, though if she loses them then I am afraid she wouldn't last more than a week.\" \n\nDerrick with a fear stricken face turned to Mary for confirmation. \"It appears she is right sire. The nanomites are keeping an extremely deadly, and aggressive strain of pyogenes influenza at bay in her body. I have scanned your body seeing that as of ten years ago it was completely eradicated from your system.\" \n\nDerrick nodded as he lowered his head. \"I could have killed her. Mary, delete all the adjustments that I made.\" \n\nMita came to Derrick hugging him tightly. \"It is alright Sire, you only had the best intentions. Unlike my father when he worked on you.\" \n\n\"Still I should have taken all factors into account before I started in on all of these codes.\" Here Derrick's head dropped. \"I could never hurt that precious little girl.\" \n\nMita had tears in her eyes as she was nodding at Derrick. Gunther came up and wrapped his arms around Mita as she pulled him tighter to her. \"Thank you Sire, at least now she might have a chance at a normal life.\" \n\n\"We'll soon see if the codes that I have work as well as I think they will.\" Mary told all three of them. \n\n\"Here's to hoping.\" Gunther said as they all awaited what the results of what Mary was doing. \n\n\"I have more than hope that she can do it Lieutenant. I've seen far more often than not, that she does know what she's doing.\" Derrick told the others. 'I hope you do,' Derrick thought as he looked at the relaxed face of Shelly. \n\n________________________________________________________________________ \n\nShelby was scrambling from console to console as were Kimison and Rayburn. \"I've got nothing on the shorter wave lengths.\" Shelby reported. \n\n\"Going through the mid range as of yet no anomalies. Still scanning to confirm.\" Kimison said as he was finally glued to a console. \n\n\"Already on the higher wave lengths. Celeste can you boost the resolution on the upper most bands?\" Rayburn asked as he stared at something he wasn't sure of. A steady beeping alerted them all to the fact that the sensors had picked something up. \"I've got something moving away at standard speed toward the planet. Energy configuration the same as that of the Taiolan ships that we fought. Son of a bitch!\" \n\nShelby looked at what Rayburn was seeing. Then her eyes got large as she turned to Celeste. \"Open a channel! All ships open fire on the following coordinates! Sector two A, three. Five zero point five-five by four zero, three five! Sorry Derrick.\" Shelby said under her breath she would be damned if that ass escaped without a fight from her! \n\nSuddenly the darkness was lit as up ten ships opened fire toward the same point. There was a titanic flash as all eleven beams struck the shields of the small ship that was just entering the atmosphere. \n\n\"What in the hell is going on!\" The Duke was screaming at those on board. \"I demand to know...\" the Duke started when the man he'd yelled at chopped him lightly across the throat. \n\n\"You are not the leader I am! I suggest that you shut the hell up while we try to land this. Our shields are damn good though not against the power of ten of those ships!\" The new leader growled at the Duke shoving the Duke against the wall. Crumpling the Duke looked at the man with dagger like looks. \n\n\"Any particular place you want to land?\" The leader growled at the Duke. \n\nGrabbing his throat the Duke tried to speak then sighed. Pointing to a small building on the other side of the planet \n\n\"Damn it!\" They all heard Conner curse a moment later. \"Empress we hit them. Problem is it wasn't a direct hit! Son of a... sorry Empress I HATE missing! Permission to blast the shi... crap out of where they land?\" \n\n\"Denied. There may be innocents there. I don't want to risk killing anymore than I have to. The people of this planet have been through enough as it is.\" Shelby told a crestfallen Conner. 'Damn it Derrick,' she thought, 'I need you here!' \n\n________________________________________________________________ \n\nDerrick was waiting with baited breath for Mary to go through the last of her tests before she started. In the mean time he watched as Shiloh. Grant, Jimison, and Norman got reacquainted with each other. Shaking his head it was hard to believe all this started a year ago with a dream. Smiling as he remembered a naked Shelby and his self within the dream. Damn he thought all he and she had been through it was a wonder neither of them weren't dead yet. \n\n\"Sire?\" Came Mary's voice breaking him out of his rumination. \"I believe I am ready to start.\" Turning toward Gunther and Mita she stated. \"I am going to try the idle command first. It is a more advanced form of what you used Mrs. Shiloh. I will keep the commands active that keep her alive fighting the disease.\" \n\nMita was nodding to all that Mary was saying, \"Thank you Mary. Thank you for giving her a chance to be a normal little girl.\" \n\nMary nodded to Mita and Gunther then looked at Derrick who nodded. \n\nAs she started she was constantly monitoring Shelly as the codes were transmitted. \"I have administered the first set. I am receiving conformation of reception of the codes. Now sending second set. Awaiting code reception confirmation. I... oh dear.\" Mary suddenly said. \n\nDerrick flew to the console as he looked at what Mary was seeing. \"Damn it! I was afraid that! Your father had another set of codes for anything like this second set. Mita was there anything that you can remember about executive codes? Without them I'm afraid there's no way to set exactly what we want. We also can't guarantee that they will stay idle 'til she reaches adulthood.\" \n\nMita was looking at Derrick with a look of horror after all they had done. To come this far to fall short at the very last second! Panicked a moment, Mita had been racking her brain for a few minutes when she remembered something her father had said. \n\n[My little Mita always remember this. \n\nWhen things seem bad, when all else fails, \n\nNever be sad, Like wind in sails, \n\nit always tends, to return joy, \n\nas will your friend, the lonely boy. \n\nDerrick] \n\nMita stared at Derrick her mouth hanging open. In a small whispering voice she repeated the rhyme to Derrick whose eyes grew wider by the second. \"Oh my god!\" Derrick said as he fell to his knees. \"The lost boy poem! Your father used to repeat it every day! Mary, try the code word Derrick!\" Derrick said not believing that Hideo had used his name as a code. \n\n\"I am receiving conformation of acceptance of the code word. All nanomites have gone into standby mode for all operations other than attacking the disease and keeping her healthy.\" Mary said as she continued to monitor the now mostly inert nanomites. \n\nDerrick was nodding when Tempro appeared. \"Sire it's the Empress, I'm afraid she's very distressed.\" \n\n\"Shit! Put her on!\" Derrick said afraid that something worse had happened. \n\n\"Derrick!\" Shelby said as soon as she came on. \"I need you here as soon as you can. The Duke escaped it seems with the help of the Taiolan sect. I can't order a full out attack of the planet. Even as Empress, I don't have that much power. Only you do, I know you've just gotten back but the empire needs its leader as badly as I need my husband.\" ",
        "Derrick looked at Shelby's worried look then nodded. \"Now Tempro!\" A mere three seconds later they were pulling into orbit around the Duke's planet. \"Now transferring command to Tempro temporarily.\" Derrick said as he sat in the command chair. A moment later a message came to his wrist comp. \"I know Shelby, I just want you to be whole again. How long...\" Derrick started to ask when the message appeared. \"Ok I see at least another five days on everything. It will be good to see you again.\" \n\n\"It's good to see you back sir.\" Thomas said as the hologram of him appeared. Then his mouth dropped open as he was staring at his long lost friends. \"Sir? You got all of them didn't you? Thank god finally real people to talk to!\" Thomas almost shouted. \n\n\"Still being a trouble maker I see aren't you David?\" Norman said as he smiled at him. \n\n\"Hey! You said you'd never mention that! Besides the commander...\" Thomas started to say \n\n\"What, knew that the both of you got thrown in the brig for a day. I believe it has something to do with a certain officer's daughter. Ok so I didn't know!\" Derrick said with a smirk. \n\nDerrick sat and listened as first Shelby, and then Conner told Derrick what had happened. Derrick nodded then opened up a channel. Dempsy? Greeson? Was it the sect?\" \n\nDempsy appeared with Greeson. \"Yes Sire, though no where the skill of any of those that we met on the last planet we fought them on.\" Dempsy scanned all the men that were with Derrick his eyes falling on Norman. Turning to look at Greeson Dempsy shook his head. \"Sire If I may ask?\" \n\n\"Yes Colonel, go ahead.\" Derrick said with a nasty wicked smile on his face. \n\nOh course this made Dempsy groan. Sighing Dempsy continued. \"Have you told him?\" Dempsy said indicating Norman. \n\nDerrick followed Dempsy's eyes, nodding no. \"I'd rather it stayed that way 'til such time as I can arrange a meet.\" \n\n\"It is as you wish you majesty!\" Dempsy said bowing all the way to the floor making Derrick groan this time. \"Alright touché Colonel.\" Derrick said with a grin as he clicked off. \n\n\"Is everything alright?\" All four of the men before him asked. \n\n\"No, though I think it will be soon. This is one battle I'm afraid that none of you can join. Then again...\" Derrick started as he thought of possible uses for each man. \n\nRisen and the rest of the sect men had finally gotten the secured door open. Stepping inside the Duke smiled at the smaller version of the control center that had been in his castle. Switching on several pieces of equipment he smiled more. This was what his grandfather had held off a fleet of invaders with. Let that bastard fake come! He'd be ready this time."
    ],
    "authorname": "Pars001",
    "tags": [
        "science fiction",
        "alien11111",
        "violence",
        "fantasy"
    ],
    "category": "Non-Erotic",
    "url": "https://www.literotica.com/s/lost-empire-ch-54"
}