{
    "title": "Breeding the Pony Girl Pt. 11",
    "pages": [
        "Breeding the Pony Girl, Pt. 11\n\n(This story is set in a world where legalized, non-hereditary slavery is commonplace for serious crime, unredeemed debt, or voluntary self-indenture. All characters who are enslaved or have any intimate/sexual contact with slaves are 18 years of age or older. This is fiction; no one should ever be deprived of free will, still less used sexually, without his or her uncoerced permission.)\n\n(Both the basic plot of this episode and the dialogue when Lois is offered for sale are courtesy of Joe Doe.)\n\n(Lois Spalding's Perspective)\n\nI had never imagined I would actually get bored (in the dual senses of physical penetration and mental indifference) with having my clitoris fondled.\n\nI was bent over a sawhorse, a bridle and bit securing me head down on one side, my forearms restrained behind my back, and on the other side my booted legs were stretched across a spreader bar, literally \"showing my ass\" to the world--or at least to anyone passing by at the annual Slave Expo. Ordinarily, I would be at the booth for my own business, the Spinning Wheel Pony Ranch, talking to customers who wanted to train, rent, or buy pony girl slaves. My stable manager and friend Mary Jacobs would have to woo the customers today--I was otherwise occupied.\n\nBeing a horny little submissive, I had not been able to resist another opportunity to pretend to be a pony girl myself. Tex Rider, who had done my late father a huge financial favor 15 years earlier, had called in his marker. His youngest daughter Abby was a student in the new Slave Veterinary program at the University of Texas. For the Slave Expo, therefore, Tex had assembled a team of ponies with different hair colors and ethnicities to pull a Conestoga wagon in the parade and then be \"demonstrators\" at the Slave Veterinary booth. Tex had heard that my ranch had a well-endowed, auburn-haired pony, a coloration he needed to complete his team, so he asked me to lend Ginger to Abby for the day--not knowing, of course, that Pony Girl Ginger was really Lois Spalding in disguise.\n\nOnce again, my horniness overcame my common sense, so my employees and friends had delivered a helpless \"Ginger\" to the parade early that morning. The parade was good fun for any submissive exhibitionist, a team of mostly-naked, bound women trotting down the street while thousands of male on-lookers popped boners from the view. Afterwards, I was one of three slaves bent over for a \"Pin the Tail on the Pony Girl\" event. Anyone who could prove that he or she was at least age 18 got to feel me up, running a vibrator across my clit until I ALMOST reached a minor climax; that in turn would make me relax my sphincter so that the lucky volunteer could stuff me with the bulky butt plug that anchored my ponytail. So, the sequence went: pull out the plug (often roughly), tease the helpless slut for a few minutes, ALMOST give the pony a minor orgasm, and re-stuff her butt, leaving her unsatisfied. Then repeat, about every two minutes. It was a combination of the slowest, most incomplete or spoiled climax of my life and an even slower butt pegging, at the rate of about 30 penetrations and 30 withdrawals per hour. What might have been fun at a faster pace was now agonizingly boring--and I never got to cum! (Was it too much to hope that this little game would help some of the guys learn how to give their women more pleasure? Probably.)\n\nI had no idea how long this had been going on--it seemed like hours--but I was bored out of my pony gourd. Did I mention that I was also wearing a voice conversion collar, so that my sighs and cries were translated into nickers and whinnies? (I wondered briefly if the \"nicker\" sound made by a horse was somehow related to the fact that everyone could get into a pony girl's \"nickers.\" But then, pony girls never get to wear knickers, so probably not.)\n\nSince I wasn't a real slave, this boredom was self-inflicted and I had nothing to complain about so I just tried to endure. It could have been worse, of course--consider Charlene, the big-breasted blonde slut crying quietly as she got the same treatment while bent over the sawhorse next to mine. Several months ago, Charlene had been an arrogant, cock-teasing pony trainer who took great pleasure in insulting and humiliating Ginger when I sent my alter-ego for trotting training at the ranch where she worked. Then Charlene got enslaved for debt, giving her first-hand (or perhaps first-ass and first-cunt?) experience in being a slave slut. I couldn't decide whether she deserved my scorn or my pity.\n\nAfter the first 20-odd pony peggings, I at least got a distraction in the form of one of the Slave Vet students, whose nametag read \"CJ.\" He must have been as bored as I was, because he approached me on the inside of the exhibit, where no one could see him clearly, pulled out a respectable-sized set of \"wedding tackle,\" and simply ordered \"mouth\" to me. By now, I'd given enough pony blow jobs to be pretty good at it, bringing him off in five minutes or so. He repaid the favor by pulling out and spraying his semi-transparent goo all over my face. Darn--I was looking forward to a white protein shake for lunch.\n\nThat probably would have tasted better than what I did eat. Charlene, I, and the third girl were replaced for a \"lunch break\" while three other members of the wagon team took our places on the sawhorses. As I listened to the Slave Vet students talking among themselves, I gathered that except for Abby Rider they had little to no experience with pony slaves. That showed in the way they treated us, leaving us with our forearms bound behind us for more than six hours so far. Which meant that we had to eat \"lunch\" without our hands, kneeling on the concrete floor, our bits momentarily removed while we shoved our faces into bowls of tasteless slave kibble followed by trying to lap water out of bowls as if we were dogs (I know that any female slave is a \"bitch,\" but this was taking that insult to an inefficient extreme). Eventually, Abby saw what we were doing, and she at least knew enough to release the forearms of two ponies at a time, allowing us to regain our circulation, rinse off our faces, and straddle the pee grates more gracefully. Since \"Lois Spalding\" wasn't there as a witness, I wondered how I could suggest to the Slave Vet program that they needed to ensure all students learned how to handle all types of slaves.\n\nAbby did take the time to show her classmates how to tighten my forearm binder as well as my bustier and demonstrated various ways to keep a pony aroused--finger-fucking, goosing, playing with the clit and nipples, all while whispering promises of demeaning sexual use. I LOVED that kind of treatment, and seriously thought about hiring Abby when she finished school. Eventually, though, it was time for me to again let strangers diddle me and plug my butt for another hour or so.\n\nBefore that could happen, however, Abby's father showed up, and I soon realized that he was headed towards me--or rather, Ginger. I hadn't seen him in a decade, but even so I was thankful that the helmet concealed much of my face.\n\nTex was loud and quite crude in his assessment of Ginger, whom he had watched in the parade. In fact, he wanted to examine her personally--which implied that he wanted to tear off a piece of pony tail. At least he led me to the far back of the exhibit, out of sight of the visitors and even of his daughter. (Slave sex is rarely considered private, but a gentleman shouldn't be having it in front of his own daughter, for crying out loud.)\n\nTied to a portable breeding frame, I was not particularly impressed by the aging, wilted cock that he presented for my oral attention. I don't know whether he took a blue pill or what, but after five minutes of my best licking and sucking his member grew in length, circumference, and rigidity until it reached a respectable size. How to make a slave slut feel appreciated!\n\nJust when I thought he was going to give me my second facial of the day, however, Master Tex pulled out, used his wet prick to slap my face a few times, and then walked around to my main entrance, so to speak.\n\n\"You've got a fine looking ass there, little filly--I'll have to tell Lois Spalding to make sure you get used more often, maybe knocked up so you can produce some equally-fine fucking foals.\" I knew he thought that was both a compliment and a great treat, so I enthusiastically whinnied and tossed my head as if to thank him. He laughed at that: \"I knew you were a horny girl--you were dripping down your thighs all during the parade. In fact, I need to call up Ms. Spaulding and find out how much she would take to sell you.\"\n\nBy then, his hands were gripping my ass HARD; if he knew Braille, he would have been able to read my Spinning Wheel brand with his fingertips. I needed to keep him happy, not to mention that I was three hours overdue for a good pounding, so I tried to move my rear around as much as my bonds would permit, showing him I was eager for his shaft.\n\nAnd he DID shaft me, but before my body could even begin to respond, I felt something liquid inside of me and he was done, pulling out and zipping up. Thinking about it afterwards, I realized that in my previous slave games I has become spoiled. The people (and stallions) who fucked me had mostly been concerned that I enjoy myself, and I did. Hell, even my anal orifice ex-husband made SOME effort to turn the pony on, perhaps because when we were married I had berated him for lack of foreplay. Until Tex Rider.\n\nIt wasn't that he was deliberately cruel or mean to me, it just never occurred to him to think about my pleasure. He was like the vast majority of slave owners, who regarded slaves as sub-human servants who happened to have moist openings that were convenient for a free person to use sexually. Think of an X-rated house elf from Harry Potter. Poor men had plastic \"flesh lights\" to get off with, while rich men used cunts, asses, and mouths of their real-life \"flesh lights.\" I had often thrilled to the sensation of being a sex slave who could be used by any adult in any way, but being a living sex toy whose physical and mental feelings were of absolutely no interest to an owner was both more demeaning and far less erotic. THIS was the ultimate loss of power, and I realized again that I DIDN'T really want slavery.\n\nPart of my problem, of course, was that I had already been teased and denied for several hours of pin-the-tail-on-the-pony-girl BEFORE Tex mounted me, gunned my sexual engine, and then jumped off again while my loins were still humping empty air, desperate for satisfaction. And THEN Kathy took me back out to the sawhorses for ANOTHER round of tease-and-deny. My only previous experience with this kind of edging was when Sam Houston Sterling made me beg to be fucked, and he needed less than 20 minutes to turn me into a frantic bimbo slut. At the Expo, the teasing had gone on for hours, putting me into a sub haze that left me desperate for an orgasm no matter what I had to do to get it.\n\n*****\n\nThese Slave Veterinary students might not know how to care for ponies, but they certainly knew how to manipulate their sexual desires. In mid-afternoon, Charlene and I found ourselves bent over narrow tables, facing a small crowd at the main part of the booth. The students had removed the bits from our mouths and given us some water to drink, but our forearms were still bound behind us and we were securely tied to the tables.\n\nAbby Rider, whose father had \"borrowed\" the pony team for the day, announced a demonstration on how to \"motivate\" ponies. First, she put on a clean pair of gloves and extracted Charlene's plug for what must have been the 70th time that day. Then Abby spread a thin layer of concentrated ginger paste and other ingredients around the narrow neck of the butt plug, at the point where the young woman's sphincter would tighten down to hold it in place. As the student explained what she was doing in a thick southern accent, I was horrified and Charlene began whinnying and bucking in a vain effort to get free from her bonds. As a former pony trainer, she had witnessed--and laughed at--plenty of sluts (including me) getting \"gingered\" in this way, watching as we bucked and whinnied and ran with frantic haste in a vain effort to escape the pain. Every time that plug shifted inside me or I tightened my rear end, the ginger paste came into contact with a new part of my colon causing renewed agony. Charlene and her colleagues had forced me to trot faster in wind sprints than ever before or since before they would take the plug out and flush my bowels. Even after that enema, the burning sensation remained for hours.\n\nNot for the first time that day, I was torn between sympathy for Charlene's plight and a sense of \"serves her right.\" I felt more than a little satisfaction that the arrogant bitch slave trainer was now experiencing the torments she had so gleefully inflicted on others. I guess I'm not a nice person, because the latter emotion won out, tinged with a little self-righteousness because I had NEVER allowed gingering with MY herd. After frantic wriggling and whinnying, Charlene certainly put in a stellar performance in worshipping the pricks of several spectators, but it was yet another example of indifference to the suffering of slaves.\n\nAs Charlene finished the third blowjob she needed to earn an enema, I became apprehensive about how Abby Rider would use ME to demonstrate motivation. Turns out it was both easier and more insidious. In effect, Abby was using the same psychological approach that I applied to MY ponies, only this time I was the recipient. She may not have known for certain how her father had used me, but she had to realize that I was in a sub haze after hours of tease-and-deny while visitors rubbed vibrators on my clit in order to assist in inserting my ponytail plug.\n\nShe gave the spectators a bunch of mumbo-jumbo that, in essence, argued that it was kinder and more efficient to obtain obedience by keeping the pony so horny that she would do ANYTHING to obtain an actual climax. Abby used the sensor package in my butt plug, projected on a plasma screen, to show that all my vital signs were already elevated. Then she used yet another of those damn finger vibrators to bring my clit (and my arousal) to a peak and told me that if I wanted a real orgasm I would have to bring three different male spectators to shoot (down my throat or on my face) in under ten minutes.\n\nI immediately devoured the first cock offered to me; the only other time I could remember being so frantic was when, on the morning after I had been branded, I had to satisfy a slave wrangler with my mouth before he would take me to a pee grate! I was vaguely aware of a crowd of people jeering at how incredibly submissive and slutty the red-haired pony was, eagerly licking, tonguing, and bogarting strange dick--some of it not too clean--to reach my goal. Halfway through, I realized that my second customer was actually someone I had known and dated in college--I can guarantee that neither I nor any other coed ever worshipped him in such a fervent, erotic manner. Thank heavens he couldn't recognize me in my safety helmet, because at that moment I would have abased myself in any way necessary to reach the goal of bringing all three guys off in ten minutes.\n\nI did it in under eight. After that, mercifully, Kathy used TWO vibrators, one on my clit and one on my nipples, to bring me off, all the time teasing me about what an obedient, slutty little bimbo bitch of a cock whore I was. Damn, I needed that orgasm, and at that moment I was so far into sub space that I actually felt pleased to be \"praised\" with all those nasty words by a condescending woman in her early 20s. Bliss, both mental and physical. The crowd was dispersing and I was slowly coming down from my high when Kathy released me from the table and told me to stand at \"Present\" beside it. Just then I became aware of an alarming conversation between Abby Rider and my third oral customer:\n\n\"This one for sale?\" the tweedy gentleman asked, casually finger-fucking me as he chatted up Abby.\n\nAs a pony rancher's daughter, Abby automatically fell into bargaining mode. \"Might be,\" she remarked. \"What's ya' offerin?\"\n\nMy already fatigued mind went into overtime. You see, in Texas, slaves are like guns--lots of them are bought, sold, or traded on a handshake without any record of the transaction, let alone a proper background check! My ranch never did business that way because I wanted my records straight when I sold a girl, but other people were a lot less finicky. I suddenly realized that I hadn't heard what Hailie had told Abby when I was delivered that morning. Hailie was SUPPOSED to say that I wasn't for sale, but whatever she HAD said didn't help me now. If this 22-year-old girl wanted to sell my pony ass to the strange old coot in a suit, Ginger and Lois would disappear without a trace!\n\n\"Do you have a price in mind?\" the old man countered.\n\n\"Sure do,\" Abby drawled. She smiled, and the braces on her teeth flashed in the overhead lights (who has braces in graduate school? My mind whined helplessly.) Abby was short and looked young, but I sensed the well-dressed gentleman was fully willing to take advantage of her inexperience if he could.\n\n\"I assume you have the authority to sell her?\" the man asked, pressing.\n\n\"Sure do,\" Abby replied. I wasn't sure if Abby was bluffing, or if some dreadful miscommunication had taken place. I instinctively tried to speak and back away from the man whose hand was on my cunt, but these were useless gestures that came out as a whinny and a sad little shuffle.\n\n\"Steady, girl,\" Abby said, stroking the side of my face and feeding me a sugar cube. Despite the horror of the situation, I was so hungry that I gobbled the sugar cube down. It was delicious.\n\n\"She's a mighty fine runner,\" Abby said, tapping my legs with the dressage whip, \"and young enough to be bred,\" she continued, tapping my tummy. \"Get a bunch of foals out 'er. Plus she's slave hot, but I guess yer hand is tellin' ya that.\"\n\n\"I was going to use her for a fox hunt,\" the man replied, continuing to stroke my wet sex. \"She's shaved, but I assume she would have a natural fire crotch, if you let her fleece grow back?\"\n\nAt this unwelcome revelation my pulse quickened, and my nostrils flared as I breathed faster. I was horrified, but excited as well. The casual nature of their conversation was arousing, even if the prospect of being sold--not to mention hunted and mounted by dogs--terrified me. But this was my fantasy; I was being bargained over like livestock at a 4H show, with a girlish young woman holding my reins and my mind still partially lost in slave haze. Damn his fingers!\n\n\"Sure would,\" Abby replied. \"Look at that red hair. Oh, she'll make a fine fox!\"\n\n\"Has she ever been hunted?\"\n\n\"Not that I know of,\" Abby said. \"But she'll learn fast enough, with a pack of hounds chasing her down,\" she added, laughing as she love-tapped my bottom with the whip. \"And if you want to put your brand on her right ass cheek to match the one she already has on her left, we've got the tools right here. So what's yer offer? Can we do business, or are ya'll just here to wet yer hand?\"\n\nMy nostrils flared as I struggled to breathe. Mistake or not, livestock sales were handshake deals, and difficult to even trace, let alone undo. My fate was now in the hands of a freckled, 22-year-old girl in pigtails who still had braces on her teeth. Now I knew what it was like to be a pony girl, unable to even protest as strangers disposed of my body and my entire life.\n\n*****\n\nAnd then, thank heavens, I heard a familiar voice.\n\n\"Excuse me for interrupting, sir, but this filly belongs to the Spinning Wheel Ranch, and I know for a fact that the owner of that ranch is NOT willing to sell her at this time. What are you playing at, Abby Rider? I know your Daddy taught you better than that.\" As the man reluctantly withdrew his fingers, I saw Richard Jameson standing beside him, looking annoyed. Annoyed at me, I might add.",
        "\"I thought if'n I got a good 'nough price for her, her owner would be happy to sell,\" replied Abby, suddenly sounding like a little girl caught stealing cookies.\n\nRichard butted in again. \"I do apologize for this waste of your time, sir,\" he almost bowed to the old coot. \"As I said, I know her owner and I've even had this slut on my ranch for training. Believe me, if she were for sale I would have bought the little bitch myself, months ago.\"\n\n\"My fault for trying to deal with children; good day to you, sir.\" Said the old guy and left, looking equally annoyed.\n\nRichard turned back to Abby. \"Don't tell me, your daddy borrowed this filly for the parade, just like he borrowed Charlene from me, and you got carried away, right?\" Without waiting for an answer, he went on. \"Well, tell your daddy that Richard Jameson took Ginger here for safe-keeping; I'll return her to the Spinning Wheel Ranch booth so you don't need to worry any more, OK?\"\n\nIn a very small voice, Abby said, \"OK, Mr. Jameson.\" He didn't even wait for her response. I felt his hand cupping my bottom, fingers pressing deep into my crack just below my ponytail. \"Heel, slut,\" he said in a very annoyed tone, and marched me away.\n\nI was relieved, shaken, and humiliated all at the same time. Fortunately for my composure, the exhibition booth for the Jameson Ranch was nearby. Richard paused just long enough to tell someone that he needed to go collect Charlene from the Veterinary students, and then he marched me into the secluded area at the back of his exhibit and pulled out a chair. As he sat down on it, he almost dragged me into his lap, being careful not to jam my tail in the process. I collapsed in tears.\n\n\"There, there, girl--no harm done.\" Richard rocked and petted me for a few minutes until I stopped crying, then he removed my converter collar and released my arm binder. Of their own volition, my arms went around his neck, but I almost clobbered his face with my helmet. At which point he grinned, fished out his keys, and inserted the standard one to unlock my chin strap, followed by taking off my bridle harness. I was so happy to be safe in his arms that I collapsed into another crying jag.\n\nOnly then, the penny dropped--Richard Jameson could see my face! I jerked backwards, but he refused to let me go.\n\n\"Hello, Lois,\" he chuckled. I started to sputter a half-formed question, but he stopped my lips with his. For several minutes we necked happily; I didn't even object when he removed the bustier, leaving me wearing only pony boots and butt plug. His hands went all over me, including my groin and boobs, but they felt more like calming caresses than sexual fondling. I sighed and snuggled closer, making no effort to stop him. Could it be that the guy I loved would accept my weird hobby?\n\nEventually, though, he fished out a tissue and wiped off my face, then began to admonish me gently. \"I traced your SIN [Slave Identification Number] from when I trained you; don't worry, I have no intention of outing you. Today, however, you damn near got your cute little tush sold into slavery for real, babe. Need to be more careful.\"\n\nI hid my face and groaned. \"Thank heavens you saved me. Not only did that old geezer want to buy me, but I think Tex Rider is going to call Lois up and suggest the same thing.\"\n\nRichard almost laughed in my face, then said, mock seriously, \"Well, if Tex offers to buy Ginger, Lois will just have to tell him that Richard Jameson has the right of first refusal. Any time you want to put on a collar, I insist that it be mine. Promise me that.\" His eyes bored into me in a way that suggested he wasn't kidding about wanting me as his slave.\n\nI didn't know how to take that, so I tried to make a joke of it. \"Weeelll, I don't really want to be a slave, but if I ever change my mind, I'll be sure to call you first.\"\n\n\"In the meantime you've got to think of a safer way to live. A couple things I need to tell you, Lois. First, you're not the only woman who plays pretend pony. In fact--do you know Nancy Bradford?\"\n\nI couldn't follow his change of subject, but replied, \"Yeah; I met her at some alumnae functions because we belonged to the same sorority in college, but she's a few years older than me. What's that got to do with pony games?\"\n\n\"Everything,\" Richard replied. \"Let me call her up and lay some groundwork; I think she'll agree to meet you for lunch and tell you about a much safer way of playing pony. Promise you'll talk to her if she calls.\"\n\nI owed him a big one for rescuing me, so I agreed without arguing.\n\n\"With that out of the way,\" my boyfriend (loved the sound of that thought) continued. \"I care a lot about you, Lois, and you simply have to stop taking such big risks. This is the third time I've found you dressed up like a pony slut getting fucked by every guy in sight. You're a free woman, so if you want to screw everyone, that's your business. But you can't keep pretending to be a slave--it isn't legal or safe.\"\n\nBy now, I had gotten over my fright, and my temper got the better of me. I jumped off his lap and almost shouted. \"I really appreciate you're helping me out, Richard, but what gives you the right to tell me what to do?\"\n\nHe stood up, still calm but again looking annoyed. \"What gives me the right? I'll tell you what--Present!\" His commanding tone and sex appeal kicked in, and before I realized it I had obeyed his command. My hands interlocked behind my neck, I spread my legs slightly more than shoulder width, and I stared straight ahead, waiting for the next command. It wasn't long in coming.\n\n\"Collar,\" he growled, and again I couldn't resist. I dropped to widespread knees, put one hand on my hip and the other reached to move my hair away from my neck, even though that hair was already pinned into a crested comb to take the place of a horse's mane. From somewhere he produced a plain leather collar and strapped it around my neck. It was tight, but it also felt natural on me.\n\n\"Stand... Reverse...Back Hands.\" I dutifully obeyed, and before I knew it was facing away from him with my hands zip-tied behind my back. Finally, he told me to Reverse and Kneel in front of him.\n\n\"So, Lois, to answer your question, YOU gave me the right to tell you what to do. Look at yourself--what are you?\"\n\nI was miserable and yet excited to kneel before him. No sense hiding the truth. \"A slave, Master.\"\n\nRichard sat back down on the chair and exhaled. \"Darling, you already promised me first refusal if you ever wanted to be collared. I'm sure I could gather enough witnesses to your slutty behavior at your ranch, mine, and the Breeding Barn to take you to court--just as you are now--and have you declared my slave. Do you want that?\"\n\nI thought for a minute but then shook my head--I really didn't want to be a true slave. \"No, Master.\"\n\n\"That's good,\" my boyfriend/master replied, a note of relief in his voice. \"Because I don't want just Ginger the slave--I also want Lois the woman. So I won't enslave you TODAY. By rights, I should pound your brains out right here, but you'd probably ENJOY that, wouldn't you?\"\n\nI couldn't help smiling. \"Yes, Master--I'd love it if you fucked me again.\"\n\n\"I thought so,\" he said. \"No sense rewarding your bad behavior, then. Besides, you may be a slave at heart but you're still legally free, so I wouldn't feel right taking advantage of you right now. Instead, I need to give you a punishment that you'll remember for a while. Stand up.\"\n\nI struggled to my feet, no easy trick with my hands bound behind me. Richard tugged me over to his right side and then flipped me over his lap, head and feet low and ass sticking up and very vulnerable.\n\n\"Count the spanks, or I'll start over.\" He said, once again fairly calm. WHACK! It was only his hand, but he wasn't holding back on me.\n\n\"One, thank you, Master. May I please have another?\" WHACK! \"Two, thank you, Master. May I...\"\n\nWe quickly worked up to \"Ten, thank you Master,\" when he paused, rubbing all over my tender rear end. His touch made me feel a lot better, but there was no doubt I had been punished, if only because he was treating me like a recalcitrant toddler. I cried quietly.\n\n\"So, Lois, do you know why I'm spanking you?\" He asked.\n\nI caught my breath and replied, \"Because I risked being enslaved by playing pony girl.\"\n\n\"That's right,\" Richard replied. \"Not only that, but since you rented yourself out at the Breeding Barn, you could be convicted of prostitution. Course, knowing you, the atonement for that crime would probably be a big thrill. Just imagine being in those electronic stocks while the corrections officers get to use all three of your openings and THEN give you a circle star brand so you can be auctioned off. But even if you enjoyed that, imagine Mary Jacobs getting the same treatment as your pimp. Is that what you want for her?\"\n\n\"No, master.\" I was quietly shaking at the reality struck me.\n\nHe continued, sounding much more friendly. \"There ARE safe ways to play pony if that's what you want. I'm sure you've heard of Texas Free In Name Only (FINO)--you sign an agreement with somebody you trust, like Mary or me (I'd be happy to take care of you), and that person treats you as a slave on a scheduled, part-time basis. But if I catch you free-lancing as a pretend slave again,\" he paused and gave me the two strongest spanks yet. \"If I catch you playing slave again, I'll have to take action to protect you, and I won't be so gentle. Understand me?\"\n\nI was quietly sobbing but nodded my head. He resumed slowly rubbing my buttocks until the pain faded. His other hand crept around to play with my left boob, which I took to mean he wasn't THAT angry with me.\n\n\"OK, darling. Enough for today.\" By now his voice had returned to the happy, loving tone of our last date. \"Remember, though--you promised me you would talk to Nancy Bradford when she calls, right? And I also want you to think long and hard about how you can be happy and safe at the same time, OK?\"\n\nHe gently deposited me back on my feet and extracted my ponytail plug before walking me over to an empty wire-mesh \"poodle cage.\" I'd seen thousands of them in my life, because they were the usual vehicle for shipping slaves from one place to another. They were less common with pony girls, who usually travelled tacked up in boots, bustier, ponytail, and bridle. Today, though, I had a sinking feeling that I was about to get a personal experience of poodle transport.\n\nRichard turned me to face him, then kissed me hard and long before telling me to \"open wide\" as he inserted a fabric gag that tied in the back of my head, pulling the corners of my mouth backwards into the \"slave smile.\" Compared to a pony bit, this device was smaller and slightly softer but did a better job of silencing the wearer. On top of that device, my boyfriend/captor reinstalled the safety helmet--whatever happened to me now, at least he had tried to conceal my identity. Richard firmly pressed downward on my shoulders until I was kneeling, that ordered me to \"wiggle that cute ass of yours back into the cage, slut.\" I was soon kneeling on the hard tray at the bottom of the cage.\n\nI must have looked really odd. Most slaves travelled \"slave naked,\" wearing nothing more than a collar, cuffs, and a gag. I had all that, but also a helmet and pony boots. Too bad my boobs were hanging out for the world to see! Richard tucked my butt plug into a large zip-lock bag, and then deposited it, along with my bustier, forearm binder, and bridle rig, onto my lap before closing the cage and securing it with a cheap little padlock.\n\nWhistling quietly, my boyfriend/owner retrieved a handcart and briskly rolled my cage down the aisle between a long aisle of exhibitors. By this time, it must have been close to 5:00 p.m. and the visitors were thinning out, but I felt far more exposed kneeling in a cage with my breasts naked than I had at any time during the parade that morning.\n\nWhen we reached the Spinning Wheel Pony Ranch booth, I was relieved to see that everyone was packing up. Richard leaned on the handcart for a few minutes, then quietly waved Mary over.\n\n\"Look what I found.\" He said in a mocking tone. \"I gather that you loaned Ginger here to Tex Rider for the Slave Veterinary exhibit, right? I lent him one of my sluts as well. Trouble is, Tex's daughter got carried away and was about to sell this filly to one of the guests--I think he was impressed with the blowjob Ginger gave him!\" I didn't think I could still blush in front of Mary, but I did this time.\n\n\"Anyway, I've had a heart-to-heart talk with Lo--I mean, Ginger about the risks that unattended pony girls run wandering around where they can get traded or stolen. I think this filly needs plenty of time to think about that, don't you?\"\n\n\"Absolutely,\" replied Mary, as if they were old friends. \"I've been warning Ms. Spalding about that for a long time. In fact, I'd say the two-hour drive back to the ranch should be just about long enough for her to contemplate the error of her ways, don't you?\"\n\nRichard grinned, damn both of them. \"Great minds and all that. If you'll show me where your truck is, I think this cage will look real nice right next to the tailgate.\" Double damn them! He was going to ensure that I spent the next two hours not only riding in a poodle cage but flashing my naked tits to everyone we passed on the road! I guess I should be thankful that he had covered my face.\n\nIt was a long, windy ride back to the ranch--this was yet another essential part of the slave experience, with my nipples erect from cold rather than excitement. Which didn't stop me from rubbing those nipples against the wire in hopes of getting off again! I reluctantly decided that I deserved both the discomfort and the spanking Richard had inflicted on me. I had promised to meet with Nancy Bradford and think about a Texas FINO personal services contract. Trouble is, my mind kept going back to being a FINO slave on my knees for Richard.\n\nWhen we finally got back, I had to wait in my cage until Mary and Hailie put away the other ponies, and then wait longer while Mary awakened her husband, Bill, to manhandle the cage off the truck and roll it into the main house. Mary thanked Bill but told him to go away and stop staring at my boobs!\n\nOnly after he shambled off to bed did she unlock me (I was relieved to see that Richard had given her the tiny padlock key.) Stiffly, I crawled out and she freed me, removing helmet, gag, zip tie, and everything else.\n\nMary was too tired to say much, but I got the impression that she was biting her tongue and would have enjoyed telling me off for being such a damn fool. Thing is, Richard had already done that for her.\n\nIt was a long time before I fell asleep, only to dream of being the fox in a hunt, with a bushy red tail plugged into my rear end, hounds nipping at my heels, and men on horseback driving me towards a trap. What will they do to me when they catch me? Hell, what WON'T they do? I really had to do something about my kinky mind... perhaps see a slave psychiatrist?\n\n(To be continued)"
    ],
    "authorname": "Carl_Bradford",
    "tags": [
        "slave",
        "legal slavery",
        "pony girl",
        "oral",
        "spanking",
        "nonconsent",
        "non-consent",
        "non-con",
        "anal",
        "noncon"
    ],
    "category": "NonConsent/Reluctance",
    "url": "https://www.literotica.com/s/breeding-the-pony-girl-pt-11"
}