{
    "title": "The Twelve Tables Ch. 11",
    "pages": [
        "Authors Note: Thank you to everyone left comments or sent me feedback about the resumption of the story. Thank you also to Margaret who gave this a quick proofread for me. I hope you enjoy this chapter. ~ellie\n\n*\n\n\"You will address each of us as Marshall during your stay,\" Francesco said as Peri walked with him through the corridors of the large house. \"Your bag will be brought over later today. You will be given set times during the evening to contact your loved ones. If you are given consequences, losing your phone privileges is common.\"\n\n\"I wouldn't have access to my friends and family?\" Peri asked quietly.\n\n\"You would need to earn the privilege back,\" Francesco answered warily. He knew that this girl was different to the usual prostitutes and addicts who come here to train hoping for a new start at a better life but there had not been time to review all of the rules surrounding her trial.\n\n\"It's just that I worry about my mother and...\" she paused and swallowed nervously. \"I guess it's only two weeks,\" she said softly and tried to keep the picture of Josh in her mind.\n\n\"You will have cell number three,\" Francesco stopped in front of a room without a door. Peri peered into the small room. The room had a bed, a small bookshelf and a large chest of drawers. Spartan was the best that could be said for it. \"There are shared bathroom and kitchen facilities this way,\" he walked to the end of the corridor and she saw a small kitchenette and a large bathroom with several shower stalls and toilet cubicles. \n\n\"It's like going to camp,\" Peri said quietly trying to put it in a favourable light but receiving a sharp look from Francesco.\n\n\"Unless you have been given special duties, you will wake when the siren sounds at five each morning. You will shower and dress according to your station and be at the mess hall by six.\"\n\n\"I understand,\" she said following him as he led the way back up the corridor and the stairs one to a large room that clearly took up half the floor.\n\n\"You will sit at the table coloured to your assignation, to begin with you will be white, the colour of your toga will define you from the other girls who have already been graded and given assignations. Novices wear white, house servants wear yellow and are given the most freedom of movement here, the Kept wear red, gardeners green, animal keepers blue and servants belonging to a specific family wear purple or pink. Family members in rehabilitation wear orange once they are released from the hospital facility and brought here.\"\n\n\"Because orange is the new black,\" Peri said trying to ease the tension and calm her anxiousness. Francesco tried to frown at her but it was ruined by the corners of his mouth turning up a fraction showing he understood her reference.\n\n\"During breakfast a Captain will give you your schedule for the day, it is important that you follow it precisely,\" he continued to speak. All of the rooms you will be required to visit in the first few days will be on this floor and the basement where your room is located. All doors and exits are numbered so that even people unfamiliar with the facility can find their way easily enough.\"\n\nPeri looked around, aside of the door they had come through which she knew led to the stairs there were several doors along the sides of the room that she assumed would lead to other corridors and rooms due to the size of the building she stood in.\n\n\"All meals will be served here. Unless given special duties you will return to your cell after supper. You will be given the opportunity to choose books that will help you during your time here from the library. You will also have one phone call per day at this time,\" he continued with his induction. He turned to look at her properly then and uttered, \"Questions?\"\n\n\"Will I have access to the small bag of belongings I have brought with me?\" she asked.\n\n\"Joseph will have that sent over today, and it will be delivered to your room. You will be allowed to keep your phone and any other personal items but the one call a day rule applies, and it is up to you to self-regulate that. We are not here to babysit you every minute of the day. You came to us of your free will, for your own reasons, that being so we expect you will follow our rules while you are here.\"\n\n\"What happens if I decide I made a mistake about that?\" she asked quietly.\n\n\"There is no door on your cell and the doors of the house are not locked you are free at any time to leave and suffer the consequences of that decision. You need only to give your name to the guard at the gate to be released,\" Francesco said with an air of finality in his voice. \"This is not a prison. This is an enrichment facility. We rehabilitate, retrain and assist people to be the very best that they can be given their status.\"\n\n\"Status?\" Peri asked taken aback by his answer. No locks on the doors, no threats of what the consequences might be if she decided to come and go as she pleased, it felt like she was checking herself into rehab only she didn't have an addiction. She had expected a prison in her wild imaginings and while this place looked the part she wasn't as sure about it being that way now.\n\n\"Let me see if I can explain in terms you would understand,\" Francesco said condescendingly and seemed to think about the word. \"Imagine a middle-class woman from an average family with a drug dependency who comes here to get clean and offer a year of service to the Twelve as a Kept. She is smart, attractive and understands she had choices. A woman like that has a higher status than say a drug addicted prostitute who accidently overdosed and has very few options to have a better life, who may take the opportunity to come here and get clean and give a year of their life in servitude as a Kept. She is not clever or attractive after years of abusing her body and mind. One woman would make an attractive, intelligent companion to spend time with, the other a warm and welcoming body to lay with only. There is a different expectation on both of these women, and they are given a different status accordingly. Those that come of their volition and ask for the opportunity to serve have a different expectation and status again as do family members who are here to rehabilitate or to heal.\"\n\n\"How does that work for Me?\" Peri asked. \"I came here of my own free will but were it not for my intention to marry a family member I would not have come. I have no wish to enter a life of servitude to anyone but my future husband.\"\n\n\"Yours is an unusual situation to be sure, but I believe we will lean towards the idea that you have come here for the opportunities that we offer you within all the Twelve Tables not just your preferred Donati Table,\" Francesco said with an edge of uncertainty to his voice. \"You should expect to be treated as an intelligent and loyal companion. Though the proof of those traits has yet to be seen.\" He seemed to have ignored her mention of marrying Josh.\n\n\"That makes me sound like a dog,\" Peri laughed. \"Dogs are often described as intelligent and loyal,\" she explained as he frowned at her. In truth she had died a little inside at the description, he obviously did not find her the least bit attractive, or he would have used the same words he had in his explanation of status.\n\n\"As I said you have yet to prove those traits, as yet whether you have the value of a loyal hound or anything else remains to be seen,\" his tone turned hard, and he looked over her shoulder. She turned noting the other two men had arrived in the dining hall.\n\n\"I have one last question,\" Peri said turning back to Francesco. \"When may I see the library?\"\n\n\"You may see it now,\" Francesco led the way to one of the side doors midway along the right-hand side wall.\n\nFollowed by the other men, Peri walked with Francesco through the door and down a short corridor to a room that obviously ran behind the kitchen and took up the other half of the building. She was overawed by its immenseness but was grateful to find a computer system available to help her search for what she wanted.\n\n\"May I?\" she asked indicating the computer that was displaying a search screen. Francesco nodded then seeing her take a seat he and the other men all took a seat at one of the long tables that ran down the centre of the room.\n\n\"Excuse me for interrupting,\" Peri lowered her head as she had seen them do with the commander as a mark of respect. \"I was wondering if I can request a few books from the Athenaeum?\" She paused as they all stared at her wide-eyed as if she had grown two heads. \"It's just that I would very much like to read about the origins of the Battaglia Table and the warrior nobles who sat at it and those books seem to be in the other library.\"\n\n\"Show me your search,\" Nero said rising. \"To his knowledge, no one had ever inquired about a book that was held in the Commanders personal collection, and he was interested in what the girl had found.\n\n\"I will see the commander about your request until then you might start with these books,\" he typed rapidly bringing up a list of books. \"They will give you insight into the location and era of our earliest forbearers.\"\n\n\"Thank you,\" Peri jotted down some of the numbers and went in search of the books and Nero went back to the table.\n\n\"I don't believe she will have any problems with an intelligence test,\" he said taking his seat.\n\n\"That's a shame the dumb ones are always easier to break. She's a bit awkward looking too,\" Francesco followed her as she climbed a ladder to seek out the books she was after. \"I was expecting another Donati Princess like the one we got in a few weeks ago. This one doesn't look or act the part.\"\n\n\"I can see the appeal of a woman with curves,\" Nero said absently. \"Besides, we only have to teach her the basics. It's two weeks. No one expects miracles.\"\n\n\"I do,\" Marco said quietly. \"What we do here during these two weeks can make or break our reputations. No one has ever done this before, and it's tricky. She's not a naughty girl who did the wrong thing and were being sent here as punishment by her father. Neither is she some misguided masochist who has a fantasy idea of what slavery is about or a frightened girl looking to escape all her problems in the anonymity we offer. The Donati love her, and she's doing this because the Twelve have demanded it from her because she's an outsider not because she chose to come here. If we go too easy we risk our reputations if we go to hard we risk retribution. It's not going to be an easy thing we do.\" He reiterated.\n\n\"There are three of us because we each have specific skills but also to counterbalance each other. To be sure we find the right medium it is important we constantly check-in with each other and report to the commander. I suggest evening meetings after she has gone to her cell for the night,\" Nero said.\n\n\"Yeah alright, that way we can update the schedule as needed but you both should remember this is supposed to be intensive training. I won't be going lightly and tip-toeing my way around this girl,\" Francesco agreed to meet each evening, despite the frown he got from his companions. \"I'll let her poke around here and take her books back to her cell. She can have a little downtime, and I'll meet you in the dining room for lunch, and you can take her from there,\" He said to Nero.\n\n\"Sure, then Marco can have the afternoon session after tea,\" Nero nodded and got to his feet. \n\n*****\n\n\"Good morning sunshine,\" Carlo sang brightly. Seeing Josh stir from the couch he had fallen asleep on in the wee hours of the morning.\n\n\"Is it?\" Josh asked sourly\n\n\"Yep, a new year with new challenges, a new life awaits you, we went through all this last night so get up off your fat ass and shower you stink of last year's shit,\" Carlo said. \"Plus if you stay here Mama will only fuss and make you talk about your feelings. I'd like to spare her what I went through with you last night.\"\n\n\"Yeah alright,\" Josh grumbled getting to his feet and walking toward his room. His head was thumping, and he cursed himself for drinking so much. He stripped off as he walked into his room and the bathroom. It still rankled that plans for Peri's trial had been changed more than once in the last twenty-four hours, and he felt like any agreement he had with those plans had been taken away from him. He knew he had to trust his father, at this point he had no choice, he had willingly handed her over to him, and the fate of his future with the woman he loved was no longer in his control.\n\nHe tried to focus on what he wanted to accomplish over the coming weeks. The purchase of the publishing house had been rushed through. The former owners had been eager to sell so it had been a smooth transaction. He needed to get there and start modelling it to his vision of what it could become. He needed to read his sister novel properly and begin the editing processes that would make it a number one best seller. Most of all he needed to create a team around him there that he could rely on. His thoughts focused solely on the business, trying to blot out the worry and emptiness that consumed his heart.\n\nJosh did not want to make plans for his future with Peri until she was back in his arms. He closed his mind off to the visions of the house with the large veranda's she had spoken about, to the wedding and children and future he wanted with her. Especially as she had been taken so far away from him to endure God knows what at the hands of the Battaglia. Turning off the water, he knew the first thing he needed to do was read the novel and talk to Lucia. Until then he was just guessing at what was happening to Peri, and he hated the feeling of uncertainty that surrounded that lack of knowledge.\n\nJosh spent an hour or so with his mother reassuring her that he was as good as could be expected given the circumstances while the plane he had arrived on was readied to return him to the winery where he had left his car. The flight back was painfully slow and despite his determination to keep his mind working on the things that he could control, like the new business, his mind constantly worried at what was happening to Peri. Andreas met the plane when it touched down, and they drove one of the small carts back up to the house.\n\n\"I won't stay but thanks for the offer, I need to get back to the city,\" Josh said when invited to stay a few days with his Uncle and Aunt. \"I need to keep busy, and I have a lot to do now that the publishing house settlement has been pushed through.\"\n\n\"Just remember when this is over, no one will ever be able to question her suitability to be part of the family again. Taking her there was the best solution in an unusual situation,\" Andreas counselled.\n\n\"Bizarre situation,\" Marisol echoed Peri's words as she kissed Josh goodbye. \"The time will pass quickly if you are busy so go and do what you must.\"\n\n\"Thanks, Zia,\" Josh embraced the woman returning her farewell kisses and climbed into his car. Travelling once again his mind wandered between Peri and the list he was creating in his mind of what he needed to achieve over the next two weeks with the business. Frustrated as he pushed Peri from his mind again, he called Ben.\n\n\"Remind me where we are up to in the deal again?\" He asked as Ben answered the phone.\n\n\"Handover happens in Jules and Romey's office tomorrow at nine,\" Ben said easily. \"Everything went through like clockwork, helped along by the fact that we made a cash offer and didn't have to worry about finance.\"\n\n\"Great, and then I can go in and start making changes tomorrow afternoon,\" Josh said with determination.\n\n\"Sure if you want to,\" Ben laughed. \"I thought you might have wanted to hang out at the farm a bit and keep an eye on things.\"\n\n\"She's not at the farm. Papa took her to the Battaglia,\" Josh admitted knowing they would all find out, it was just a matter of time but grateful that Carlo had said nothing, letting him deal with it the way he needed to.\n\n\"Shit! When? Why?\" Ben sputtered into the phone.\n\n\"Last night, she walked off one plane and on the other when we arrived at the farm,\" Josh admitted being ambushed and let his apprehension show in his voice. \"The Twelve insisted. Apparently it was the best of several bad choices.\" He shook his head knowing Ben couldn't see him through the hands-free call.\"\n\n\"You were ambushed at the airstrip?\" Ben asked incredulously.\n\n\"Something like that. She's gone for a month, and not a lot anyone can do about it,\" Josh said woodenly.\n\n\"Yeah maybe, but I think you and I might have to go down and visit Nik just to see how she is fairing and if we happen upon Peri at the same time all the better,\" Ben's voice had taken on the authoritative tone he used when dealing with family business. He was a born leader, and Josh smiled not having thought of such a solution. It would be good to know they were both okay for himself rather than relying solely on his father for information.\n\n\"Mightn't be the best time to leave Emily,\" Josh said after a moment's thought. \"Maybe D. would make the trip with me,\" he suggested.\n\n\"We'll talk about it. Where are you now?\" Ben asked.\n\n\"Driving back to the city, should be home in half an hour or so,\" Josh looked at the dashboard clock.\n\n\"Great, come for dinner, I'll get D. and Lio over as well,\" Ben said making it more of a command than an invitation. \n\n\"Yeah alright, that'll give me time to swing past home and do a few things first. See you about six-ish?\"\n\n\"Yeah works for me, I'll give D. a call and let him know,\" Ben said and hung up.\n\nJosh felt better for having told Ben and hearing his reaction to the news. As much as he loved Carlo, his casual tough love approaches to life could be irritating. He just accepted whatever lemons came his way and either made lemonade or washed them down with tequila until he didn't care anymore. Well, the tequila method hadn't worked out to well last night, so it was time for Josh to see about some lemonade with his brothers help.\n\nJosh arrived back at his apartment and dumped his bag. Everywhere he looked he could see signs of her. Worry ate away at him, so he picked up the hard copy of his sisters novel and flopped onto a couch to begin to read. At half past five, he reluctantly put the book down questioning what he knew about his sister and seeing her in an entirely different light. He was not even half way through it, and he knew he would probably stay up tonight finishing it. If she hadn't alluded to the fact that this was her story, Josh never would have believed it. He wondered if any of his siblings knew.\n\nHe showered and changed for a second time that day and having thought about what he had read so far he sent Lucia a text saying simply, \"I love you.\" Then he headed over to Ben's taking the book with him in case he got the opportunity to read more during the evening.\n\n*****\n\nPeri sat at the white table alone during lunch looking at a schedule she had been given. Basically, her day was broken up by the four mealtimes observed in the facility. At six she had breakfast, and then she would work with one of the men for four hours then Lunch was at ten thirty followed by another fours hour session until tea time at three thirty and a final session finishing at eight for dinner. The half an hour break times to eat and go to the bathroom did not seem very long until she had sat here alone idly playing with her food as she perused the schedule Francesco had given her.\n\nThere was a loud crash of a tray being dropped and the accompanying sound of china breaking at the kitchen end of the dining hall and Peri looked up noting a woman wearing orange and bending down to pick up the debris. Her view though was obscured as Nero came to stand in front of her. \n\n\"Are you ready?\" he asked in a friendly informal way. \"We have plenty to get through today.\"\n\n\"Yes Marshall,\" Peri said standing and gathering her tray to return it to the kitchen.",
        "\"Leave the tray the kitchen staff can deal with that,\" he said.\n\n\"The signs say not to, and I don't want to be seen as lazy on my first day so I'd rather not if that is okay. The receptacle is just over there it will only take me a moment,\" she hurried over and deposited her trash and the tray before he could answer. She then returned to his side noting his dissatisfied expression.\n\n\"Follow me,\" Nero said in a clipped tone and walked through a left-hand side door to a corridor and entered a surprisingly large and spacious office. \"Close the door,\" he said over his shoulder once he was sure she had followed him within. \"Kneel here,\" he pointed at a spot in the middle of the room and retrieved a file from his desk turning to perch on the edge of it facing her and waited until she was settled on the floor.\n\n\"While you seem to be able to pick up the protocols for using our titles of respect, it would seem that you haven't quite grasped your place within this facility yet,\" he addressed her with a cold hard voice. \"My earlier casual tone may have led you to believe that you could negotiate what I asked of you under the guise of politeness but make no mistake if I ask you to do something I expect you to do it without hesitation.\"\n\n\"I'm sorry Marshall,\" Peri immediately apologised. \"I was just...\"\n\n\"Without hesitation do you understand?\" Nero cut her off.\n\n\"Yes, Marshall,\" Peri responded and dropped her head.\n\n\"While you are here at this facility you are a servant. You do as you are instructed by any of the Battaglia. You do not decline, negotiate or prevaricate. You do not explain yourself unless asked to do so. That is your role here, to follow orders and prove your worth as a member of one of the twelve families. The consequences for not following orders can be as severe as failing your trial and being asked to leave not only this facility but the family that has sent you to us.\" He pressed the gravity of her situation onto her.\n\nPeri looked up as he spoke taking in the seriousness of not only his words but his voice and body language.\n\n\"You have been given only a short time with us, so it is imperative you don't make the mistake of thinking you are here as a guest who has choices. You are here under trail conditions to prove your worth and value to us. Do you understand the gravity of your situation?\" Nero asked.\n\n\"Yes Marshall,\" Peri answered wanting desperately to explain that she had no idea what she was doing or what was expected of her in reality. All she knew was based on books and little snippets she had gleaned from talking with the family.\n\n\"Good. I would hate to have to punish you on the day of our first meeting. Now that we understand each other, I will be your case worker and doctor while you are here. I will test and judge your mental and physical abilities over the next few days, and we will work on areas of deficit from there,\" he spoke absently flicking through the file he held in his hand. \"I see that Doctor Peter Lee has done a superb job in running all the medical tests required over the last six months. That will save us a great deal of time.\"\n\n\"Tell me of your academic history,\" Nero ordered and picked up a notebook.\n\nPeri spoke about everything from the first school she attended as a five-year-old right through to graduating university and the minimal research training she had received at the publishing company she worked at that time. She didn't embellish at all claiming to be an average student who won no prestigious awards. She did not speak of being bullied, or what an introvert she had become during her high school years she just kept to the facts.\n\n\"So reading between the lines, you were a decent student who studied hard to achieve. You were not popular at school, but neither were you an outcast. Possibly bullied somewhere in there though I have the feeling it is not something you associate with school. You enjoyed University and grabbed any opportunity given to you with both hands. I would even go so far as to suggest you remain friends with at least one of your lecturers. Does that sound about right?\" he asked knowingly.\n\n\"Yes Marshall,\" Peri didn't hide the surprise from her voice that he had pegged her so accurately. She wondered what exactly was in that file that sat on his desk. \n\n\"We shall begin then,\" he stood and walked toward her holding out his hand and helping her to her feet. \"We will begin testing your verbal comprehension, processing speeds, working memory and visual perception.\"\n\nPeri followed him to the table realising he was about to administer an IQ test. She said nothing in return taking the seat he offered and waited for further instruction. He took his time slowly gauging each of her answers and watching her critically.\n\n\"You may go to your cell and rest before dinner,\" he said abruptly as she finished the second subtest. Packing up the items she had been working on, he added, \"We will continue this tomorrow.\"\n\n\"Thank you, Marshall,\" Peri stood and walked toward the door. She walked into the corridor beyond and through a door on the opposite side leading to the dining hall. This place was not so hard to navigate she decided and walked toward the stairs leading down to the lower level and her cell. She was pleased to find her small bag and a few of the books she had requested had arrived.\n\nShe went about unpacking her meagre belongings and storing the phone in the drawer with her journal, so she was not tempted to use it outside of the set times. She placed the two photos she had brought with her on the top of the dresser and smiled back at the faces of Andie and Josh. These were the two people she knew loved her best in the world, and she could do anything they asked of her here knowing they waited for her. \n\nShe sat on the small bed leafing through one of the books that detailed some of the histories of the Battaglia scanning the text lightly for any mention of the twelve tables when she heard noise in the corridors outside. Realising it must be dinner time she closed the book and left her cell.\n\nShe noted the various coloured toga's that walked along the main corridor past the one her cell was located in. Two men in the black and white Battaglia uniform walked with three women who wore the orange toga assigned to family members. She remembered the incident at lunch and watched the women telling herself it was just a figment of her imagination, but when Nik turned to look directly at her, Peri stopped in her tracks.\n\nJosh had told her that Nik was in a rehabilitation facility, but she hadn't connected the dots until right at that very moment. She wasn't sure what to do. Should she tell the Marshalls of her falling out with Nik? Not that it was falling out with Nik exactly, it had been Sabrina who had done Nik's dirty work. Even though she was sure that Nik was behind Sabrina's actions she had no real proof, it would sound like she was paranoid if she did make a fuss. By the time she had gathered herself together and made her way to the dining hall, she had convinced herself that it was better to say nothing about the unease she felt at seeing Nik here. She decided it was best if she just avoided the woman as best she could.\n\nOnce again she sat by herself at the white table. She ate quickly so she could dispose of her tray before Marco came to get her. She kept her schedule tucked into the belt of her toga, and as she sat quietly at the end of the meal time, she looked it over again. It took her through to breakfast the following morning, and she assumed she would get another schedule then.\n\n\"In the future, you will make you way down to the Stanhope room when it is on your schedule,\" Marco instructed her as she rose from the table. \"As it is your first day here I understand the necessity of collecting you but it will not happen again.\" He turned and walked away expecting her to follow. He walked back through the dining room in the direction of the library. The middle door on the left side she knew led to a library at the end of the walkway.\n\nIgnoring the door to the library, Marco walked into a cleverly concealed passageway to a room that seemed to run the whole length of the rear of the stone building. It was made of rich polished wooden beams that held toughened glass panels that made up the walls and the ceiling. Unlike the conservatory at the Donati home it held few plants but rather was filled with a rich, eclectic variety of antiques grouped together at various intervals. Lounging areas sat beside dining tables which then sat beside couches as every sort of chair and table that Peri could ever think of seemed to have been jumbled together here. Despite the strange variety of shape and mass of the furniture, it all seemed like it belonged here in this room.\n\n\"Within this room I will do you the courtesy of calling you Miss Wells, and you will address me as Marshall Marco,\" he said inviting her to sit with an arm gesture. Taking her cue from him, Peri took a seat and sat demurely crossing her legs at the ankles and tucking them under her chair.\n\n\"Now Miss Wells, tell me about your mother,\" he said his tone softening slightly but still unusually formal.\n\n\"Andie?\" Peri was surprised by the question. \n\n\"You call your mother by her name?\" Marcos asked disapprovingly.\n\n\"My mother has never been the traditional mother type. Though she has started to become inclined to act more like it recently,\" she laughed softly thinking about how their relationship had changed since becoming involved with Josh and his Uncle Charles.\n\n\"Explain,\" Marcos prompted her.\n\n\"My parents didn't divorce until I was about fourteen. Before that, they seemed to fight and have make-up sex in equal measure. I kept myself out of the way mostly, learned to cook at an early age and did most of the household chores. They both worked so as long as I had good grades and didn't invite friends over they seemed happy to ignore my existence for the most part,\" she began speaking honestly about how she was raised. These people would never meet Andie, so it was no big deal if they knew the truth.\n\n\"After the divorce?\" he prompted.\n\n\"Andie changed overnight, suddenly she wanted my company but more as a friend or a sister, someone to shop with and go out to dinner or piano bars with. I don't have particularly fond memories of that time,\" Peri sighed remembering those horrible teenage years. Marco tilted his head inquisitively and motioned that she should continue. \n\n\"She seemed determined to make me in her image, which is that tall sexy Jessica Rabbit type when I am short, and my figure is not what society deems beautiful, and she tried to fight nature itself. She would put me on fad diets, and try to dress me in clothes not suited to my figure or my personality. When I got to University, she wanted me to become part of the social scene so she could tag along and date the good-looking young guys there rather than people her own age.\" Peri let the bitterness she felt creep into her voice.\n\n\"This behaviour changed recently?\" Marco prompted once again interested now in how the girl sitting opposite him had become the poised, well-spoken young women she presented as.\n\n\"I met Josh,\" she smiled. \"The first man I dated who could resist Andie's particular brand of seduction. Then she met a man who seemed to change her outlook on life. She started staying home in the evenings and took an interest in what I was doing and wanted. It's been nice not having to worry constantly about where she is or who she is with. I still worry about her but on a different level,\" she shrugged trying to explain how she still felt that she needed to be the responsible one of the two of them.\n\n\"You obviously had good role models, a grandmother or an Aunt perhaps?\" Marco asked.\n\n\"No there is no one else, just my mother and I,\" Peri smiled. \"It's taken some adjustment to get used to how involved in each other's lives Josh's family is. There are twelve of them, and I've only met eleven, so far. I met some of them over the holidays for the first time; then there is the extended family. I never knew someone could have so many relatives.\"\n\n\"Most of the families who belong to the Twelve are large,\" Marco allowed himself a small smile. \"Family is important to us.\"\n\n\"I have come to understand that,\" she returned his smile. \"That is a large part of the reason I am here.\"\n\n\"You appear to have some etiquette, if not from your mother's influence then where?\" Marco continued doggedly poking at her early life and what factors created the woman sitting before him.\n\n\"I may not have been one of the popular girls at school, but I did have friends and join clubs with them,\" Peri tried to remember the good times she had at school. \"I guess my home economics teacher was old fashioned and believed every girl should be able to cook and sew and keep a perfect home so that she could host fabulous dinner parties or high tea. We had a high tea club in our senior year where we would host school dignitaries or parents once a month after school. It was like playing ladies when we were all just kids trying to work out what we wanted to do after graduation.\"\n\n\"I see,\" Marco nodded. \"It didn't continue through college?\"\n\n\"We went our separate ways, but a few of us get together now and then and go to high tea at a nice hotel or restaurant,\" Peri answered. \"Usually for a birthday or special event.\"\n\n\"No major influences on your persona aside of your mother and the home economics teacher?\" Marco asked seeking to find how a girl with such neglectful parents and obvious self-esteem issues came to be here in this unusual situation.\n\n\"I had some lovely lecturers at University. One introduced me to some of her friends who worked for some of the state galleries or as independent contractors. I was able to visit Melbourne a few times to be able to see one particular restorer at work. It's a difficult field to succeed in, reputation is everything,\" Peri said remembering the woman fondly. \"We still correspond, and she lets me know when art exhibitions that might interest me are coming to the galleries she is connected to. Quite often they don't make their way up to the northern states.\"\n\n\"That is most fortunate for you then,\" Marco said studying her carefully as she spoke. \"I too was fortunate enough to find friendships from those who are experts in my field of study at college.\"\n\n\"May I ask what you studied?\" Peri said politely putting the spotlight back on the man who was asking the questions.\n\n\"I have a doctorate in Sociology but I enjoy the historical aspects of what creates the societies we live in. Some would see my study as more along the comparative lines of Anthropology,\" he offered and was pleased that she didn't seem confused by what he had said.\n\n\"I had an interesting conversation comparing patriarchal societies with matriarchal societies which have made me rethink some of my views on the topic. Perhaps if we have time you could share your understanding on some of the idea's that were shared with me,\" Peri tried to engage the man on an intellectual level.\n\n\"I believe we may be able to do that,\" Marco was surprised by her response. \"It will be my role within your trial to help you to understand the expectations of women within our society. Not society at large as you have always known it but our society within the tables of twelve. Your home economics teacher had it unexpectedly right, and I am glad you had that influence in your life even at such a removed angle.\"\n\nPeri said nothing listening carefully to what would be involved in her trial and what this man expected from her.\n\n\"There are certain expectations a man has of any woman deemed worthy to become his wife. You are obviously intelligent, but Nero will judge the depth of that during your sessions with him. Unlike your teacher's beliefs the women who lead our families with their husbands do not have to be home-makers in the traditional sense of the word. There are servants available to cook and clean and tend to the daily domestic chores. It is preferable if they have those abilities of course and a woman's value rises considerably with those attributes but they are not necessary for a potential wife.\" He paused to gauge her understanding.\n\n\"My teacher would be pleased to know that her beliefs were valued by some of the societies elite,\" Peri said quietly feeling like she should say something.\n\n\"We have an expectation that our wives will be loyal, beautiful and have integrity,\" Marco explained. \"They must be intelligent, have perfect etiquette and have a passion that matches their husbands.\" He cleared his throat. \"You obvious have some of these traits, but you will hone them here with us. You will become the perfect lady whether hosting a dinner party, chairing an arts council, or enjoying the pleasures of the marital bed. Should you fail to embrace the opportunities we give you here you will fail and be sent away to live your life far distant from any of the twelve families.\"\n\n\"I understand the reasons why I am here and the seriousness of this trial,\" Peri said seriously not needing to be reminded that her future with Josh rested on her time here.\n\n\"This first meeting is informal to allow me to judge your aptitude to the life we would expect you to lead. You may talk freely and relax within the bounds of honour and respect that we expect from all who enter this facility,\" Marco sat back into the large high backed armchair he sat in. Peri couldn't imagine this stiff and formal man ever relaxing completely and remained as she was, sitting demurely in a simple high-backed table chair.\n\n\"Tel me of this conversation you had comparing societies,\" Marcos said breaking the small silence. He was pleasantly surprised by this young woman and listened carefully as she began to speak.\n\n*****\n\nJosh felt strangely vindicated by his brother's reaction to the news that Peri had been taken to the Battaglia. He had reacted badly getting drunk with Carlo and raging at the interference in his life by the Twelve, but as he watched Dante pace and curse, he considered his reaction as being justified.\n\n\"So he just sprang it on you at the last moment?\" Dante asked incredulously. \"She didn't have time to talk to you or make an informed decision?\" He was asking questions he knew the answers to but still needed to ask them again. \"She went, she heard what he said, and she just went? Didn't she ask questions? You told her she didn't have to go right?\"\n\nIn the face of Dante's inquisition, he relayed once again the last words they spoke to each other. \n\n\"This will not be an easy task,\" he had said to her. \"I understand what it entails, and I won't stop you if you want to change your mind now.\"\n\n\"Tell me you love me,\" she had said softly looking up into his worried face. \n\n\"Always and forever,\" he had kissed her lightly. \n\n\"Then this is what has to be,\" she had swallowed loudly and reached up to cup his cheek gently, \"I love you more than that even.\" She had let go of his hand then and left with Papa. \n\n\"This is not the way it should be,\" Dante resumed pacing and cursing to the strange looks of his brothers.\n\n\"D. the rooms not soundproof,\" Ben said with a sense of unease. None of them liked what had happened, but he seemed to be taking the news personally. \"This isn't helping anyone.\" He motioned toward Josh meaningfully.\"\n\n\"I'll fly down and see Papa tomorrow,\" Dante said reining back his anger. \"I'll go and see Nik while I am there and look for Peri.\"\n\n\"Not even Nik will believe you are there to see her,\" Lio chuckled. \"You can't go especially given your feelings about the matter. Send the Valentine brothers down, they can talk their way in and out of any situation and get to the heart of the matter.\"\n\n\"They're in the middle of this deal thing for Josh, Lio, and I can go down for a few days and if we have no luck they can go down. It will show them that we all love her not just Josh,\" Dante suggested making Ben raise an eyebrow and look at him. \"I mean what were the alternatives? Papa didn't say just that this was the best choice. Maybe it wasn't.\"",
        "\"Could also make us look like we are worried she will fail instead of having faith in her,\" Lio said cautiously. \"How long is she there for? I mean if she is gone for a month but some of that time will be with Papa at the sitting then how long is she with the Battaglia for the trial?\"\n\n\"Two weeks,\" Josh said. \"Two weeks intensive training with the Battaglia, two with the Twelve.\"\n\n\"Why two weeks at the sitting?\" Lio asked. \n\n\"I didn't have time to ask a lot of questions,\" Josh said sullenly.\n\n\"Then the first thing anyone should do is call Papa and get the specifics,\" Lio said letting logic overrule the emotions in the room.\n\n\"Makes sense,\" Ben agreed. \"Why don't you do that, Josh. Dante and I will go and make sure BJ hasn't learned any more bad words from his naughty Zio.\" He chuckled. \"Lio can stay for support if you need it. He seems to be the only one thinking sanely tonight.\" He said with meaning holding the door open for Dante.\n\n*****\n\nPeri had spent the afternoon and early evening engaged in debate with Marco, who seemed to be studying every move she made. He had solicitously offered her tea which she had politely declined worrying about her already full bladder and how much longer it would be until she felt relief from it.\n\nHe had escorted her to the mess hall for supper and instructed that when she was finished, she may return to her room for the night and make her one phone call. She had tried to eat slowly and savor the food she had been given but knowing she would be able to hear Josh's voice made her gulp at the food in large mouthfuls until she realised how unladylike she would look. Being prim and proper and lady-like at all times seemed to be the basis of her trial at present, and she was determined not to do anything that could incur the consequence of losing her phone privileges.\n\nShe waited until she saw a few of the other women leaving their tables and moving toward the stairs before she stood and disposed of her tray. She was moving toward the door when Francesco, who seemed to have been waiting for her stopped her.\n\n\"Follow me,\" he instructed and led her down to the basement living quarters but rather than taking the main corridor where the cells branched off from he turned at the bottom of the stairs and walked along an identical corridor on the other side of the building.\n\n\"This is the room you will come to meet with me in,\" he opened a door leading to a large darkened room. The dull golden glow that came from the sconces on the walls seemed to cast shadows around the room, and he turned up the brightness slowly as her eyes adjusted to her surroundings.\n\nCabinets lined the walls, and a large four-poster bed sat in the middle of one wall. Peri considered it thinking it was odd that it had no canopy covering the wooden frame at the top of the posts. A large desk sat along one other wall with high-backed leather armchairs before it. There was a large amount of open floor space which she crossed to stand before his desk as he took a seat behind it.\n\n\"Men, in general, wish their wives to be a perfect lady in public and a perfect slut in private,\" he said without preamble watching her to gage her reaction and was pleased to see that this statement did not shock her. \"I am sure you know Joshua Donati's sexual preferences better than anyone, however, it is my role in your trial to push you to find the limits of your sexuality and passion and then push those limits. We will discover what excites you and what is beyond your limitations. For some this is an enjoyable journey for others a harrowing ordeal,\" he continued to watch her carefully.\n\nPeri said nothing. He had asked no questions, and she didn't know if a response was even needed as she took in what he was saying. She knew there would be some sex involved and nothing he said surprised her. She imagined that the Kept were trained in all manner of service much like the courtesans of history. She hoped that she was strong enough not to find any of it an ordeal. Josh used her harshly on many occasions, and she had found the bliss in the painful pleasure he gave her. She would just have to find that blissful place here too. \n\n\"I would like you to take a few minutes filling out these forms, so I have a better idea of your experience before our meeting tomorrow. It was unfortunate we missed our time today, but my fellow Marshalls have said that you have impressed them with your candour and openness today. I hope you will do me the same courtesy. He slid the forms across the desk to her. \"You may bring a chair close enough to sit as you fill them in.\n\nThe forms began with broad multiple choice questions on sexual orientation and the role which she identified the most with. She answered based solely on her relationship with Josh as a heterosexual submissive. The following pages listed fetishes and she needed to grade them as curious about, into, soft limit or hard limit. The second set of choices for each fetish gave her the choice of giving, receiving, watching, wearing, While confusing, at first, she answered as honestly as she could while Francesco watched on.\n\nBefore now Peri believed she had a good knowledge of sexual fetishes, after all, her work with Josh on various books along those lines, but she struggled to understand what some of the terms meant precisely, so she skipped over those not wanting to give a response to something she knew nothing about. When she was finally done, she looked up at Francesco and explained her reluctance to answer some of the fetishes as she had no knowledge of the terms.\n\n\"We can work on that together this has given me enough of a guide to go on. You understand what it means to be Kept within our family?\" he asked.\n\n\"Yes Marshall,\" she nodded. \"I was told that this would be part of my trial,\" she admitted.\n\n\"Good. Then you will obey me in this room without hesitation as you obey all the Marshalls here,\" he said making clear his expectations. \"Come and stand beside me,\" he said picking up the papers before him and tapping them on the desk to form a neat pile before replacing them as she came to stand beside him. \"What I saw of your responses has been quite illuminating, I believe I will enjoy our time together.\" He reached up and pulled the material of her toga to reveal her right breast bunching the material that hung from her left shoulder. Clicking his tongue loudly, he stood and stepped behind her to release the strapless bra she wore beneath the toga. \n\n\"If you must wear underwear to your other sessions with the Marshalls you will remove it on entry to this room,\" he pulled the bra free leaving her breasts to bounce back into their natural shape. \"Panties too,\" he held out his hand for them. He watched as she took them off immediately and handed them to him. \"Obedience is a desirable attribute, so too is your obvious heat and excitement at being here with me,\" he smiled as his thumb smoothed over the damp crotch of her panties.\n\nPeri blushed deeply at his words and watched as his thumb moved over the evidence that she was aroused. She knew though that her arousal came from memories of Josh introducing her to those fetishes she had marked that she enjoyed, but she said nothing. \n\n\"It shouldn't surprise me that a Donati has introduced you to the painful pleasure of true submission,\" he began to play with her exposed nipple, but I will admit I was not expecting that or your reaction to this talk,\" he pinched the hard pink nub between his fingers. His eyes bored into hers as she gasped. \"Widen your stance,\" he instructed as his other hand reached under her toga to run along her wet slit. His fingers delved deeper rubbing over her clit roughly as the fingers of his other hand continued to play with her nipple.\n\nPeri's body reacted to this man even if her conscious mind didn't, and she found her breathing shorten to panting, and the tell-tale tremors in her thighs begin. He continued to play with her body until she finally begged in a weak breathless voice, \"May I come please, Marshall?\"\n\n\"You may,\" she smiled impressed that she had known he would require her to ask for a release before coming or be punished for her lack of respect. He watched as she arched unsteadily, her body tensing like a strung bow before crying out in loud whimpers as she crashed over the edge. He moved his hand from her breast to her back to support her and slowly removed the fingers that were now coated with her cum. Once she had regained some focus to her eyes, he lifted his hand and fed her those fingers to clean. \n\n\"Donati has taught you well,\" he said finally. \"You may take your underwear and return to your cell. You may have your phone priveledges tonight. You will not discuss the details of your trial, but you may reassure your family that you are well cared for here.\"\n\n\"Thank you, Marshall,\" Peri said quietly taking her underwear from the desk and walking toward the door.\n\n*****\n\nThe two brothers went to look in on BJ, who was fast asleep. Then Ben indicated they should walk back through the house. He led Dante out to the back patio before saying what was on his mind.\n\n\"So how long have you been in love with Peri?\" Ben asked pulling no punches.\n\n\"I'm not!\" Dante immediately denied the accusation. \"It's just a bad situation. They should have been told and given a chance to think about what they agreed to.\"\n\n\"How long?\" Ben asked again.\n\n\"I'm not in love with her. I care about her. She's tough and smart and sassy, and if Josh ever threw her away, I would consider her as more than a sister, but I don't. I am jealous that Josh found a girl that loved him enough to become part of this fucked up family,\" he admitted, \"but it's not love, its affection.\" Ben gave him a sceptical look. \"Look I know what happened to Lucy at the Battaglia facility. I wouldn't wish that on anyone I care about, not even Nik though there was no other choice.\"\n\nBen was startled. Even he didn't know the details of why Lucy had been sent or what had happened to her. He considered Dante again. He had suspicions about Dante's feelings for Peri before this, though. His mood had brightened considerably since she had gone to work for him and over the holidays, he had been overly protective of her when Josh wasn't close by.\n\n\"You can fool the others, you can even fool yourself, but I know you better than most D. They are committed and devoted to each other. Don't set yourself up for more heartache, you feel that jealousy for a reason.\" Ben said gently. \"Let's go and see how that phone call went,\" he said deciding not to push Dante any further. \n\nThey walked slowly back to the study in silence. Dante considered his brothers words. He would have to be crazy not to feel affection for Peri. They were friends and worked together. He treated her like a sister or, at least, he tried to. He may be jealous of Josh, but he would never step over that line regardless of his feelings. He wasn't in love with her he told himself again but now that the idea had been voiced he worried that maybe he did care more than he should about what was happening to her\n\n\"I didn't call,\" Josh announced as they reentered the study.\"I have to trust that Papa has the family's best interest in mind in agreeing to this. What if this is like a trial for me as it is for Peri. I need to show I can be a loyal family man and obey the rules of the trial. She agreed to this for me, and I don't want to be the one to mess it up by being a whiny child in Papa's eyes. He said he would keep me informed, and when he does I will ask the questions then if I still need to.\"\n\n\"Okay,\" Ben said slowly looking to Lio for an explanation.\n\n\"Josh just needed someone to listen to him instead of rushing in to fix things their way,\" Lio shrugged. \"Did either of you ask him what he wanted to do?\"\n\n\"Don't go down there on my behalf,\" Josh said even though he would love some information on how she was from his brothers. \"Let Papa handle it, he promised he would watch over her. I have to believe she loves me enough to endure it.\"\n\n\"But you don't know what it's like down there,\" Dante said in a pained voice.\n\n\"No, but Lucy does,\" Josh patted the large envelope holding her manuscript that he had brought with him absently. \"I'll go and see her again tomorrow.\" He gave a half smile. \"It's getting late, and I have meetings in the morning as do you, so I'm gonna head off.\"\n\nHe stood and embraced his older brother but as he was leaving his phone came to life singing a familiar tune. Fishing the phone out of his pocket, he looked at for a moment before answering it in an alarmed voice, \"Peri?\"\n\n\"Yes, I miss you so much already,\" she said happily hearing the alarm in his voice and wanting to reassure him. \"I have my phone and will get to make a call occasionally at night. Have I interrupted anything?\"\n\n\"No! It's so good to hear your voice. I was worried when you left the way you did,\" he wanted to reach down the phone and hold her close.\n\n\"I'm fine honestly. There is no need to be concerned. I am well cared for here. I just miss you already and wanted to hear your voice,\" she said keeping her voice cheerful because of the worry she could hear in his. \"Tell me you love me,\" she said smiling into the phone.\n\n\"Always and forever,\" Josh responded smiling with the relief of hearing her voice.\n\n*****"
    ],
    "authorname": "xelliebabex",
    "tags": [
        "trial",
        "training",
        "bdsm novella",
        "drama"
    ],
    "category": "NonConsent/Reluctance",
    "url": "https://www.literotica.com/s/the-twelve-tables-ch-11"
}