{
    "title": "Let Him Use Your Face",
    "pages": [
        "If the idea of blowjobs or taking some nice warm cum on your face offends you, this is not for you. For me blowjobs are a beautiful thing. Slow, romantic, rough, submissive, dominant - there's so much to blowjobs it'll be impossible to write everything down in one go - so this is about the rough type. Girls, you'll need to be submissive to enjoy this fun. \n\nThis isn't about you teasing him, you being in charge or anything of the sort. This is about him grabbing your head and ramming his cock repeatedly down your throat while you gag and splutter on it. \n\nFirst: all women can deepthroat. Men love it so learn to do it. It's just not fair to keep it from him just because you gag a little, the look of pleasure on a man's face, his eyes rolling back as your lips reach the bottom of his shaft is worth it and if you can do it no man will leave you (unless he's a complete idiot). Sorry if this sounds sexist but it really isn't that hard a thing to learn to do (and you'll probably get jewellery more often). \n\nThis is where being close helps, the only way you're going to be get used to having cock down your throat is to take cock down your throat. People say use frozen bananas but having something cold down my throat just sounds painful. \n\nPut a towel on the floor by the side of the bed, there's going to be a lot of spit. Lay on your back with your head hanging off the side of the bed, this is probably the easiest position to get throat fucked in. After a few throat fuck sessions you'll be able to give deepthroat pretty easily as your gag reflex will be better trained. \n\nHave him stand on the floor and push his cock into your mouth, balls deep and keep it there until you need to breath. After doing this a few times let him fuck your throat. You're going to gag and splutter, don't worry about it. Lots of spit is all part of this so gag away. It'll often feel like your going to be sick, just go with it, fighting it will hurt. Most of the time it's just thick spit and nothing nasty coming up BUT if you are sick, stop - clean up and either get back to it or do it another day. If he wants the pleasures of your mouth he's going to have to put up with it. Hopefully you're both mature enough to deal with this. \n\nWhen he's ready to cum I suggest having him pull out, open your mouth and have him jerk himself so he shoots into your open mouth, he'll still get some on your face so you get that sensation as well but you also get to taste it. You can either swallow it down or let it dribble out over your face, both are great. \n\nMy man also loves cumming straight down my throat, as you're being throat fucked it's easy for him to do, it's nice but feels pretty weird (like drinking without swallowing) and you'll miss out on tasting it. \n\nOnce you're used to taking his whole cock in your throat the real fun can begin. Put a towel on the floor, get on your knees and have him handcuff your hands behind you. I suggest putting heavy non-water proof make-up on as well, give him that slut look which runs with tears. \n\nLet him fuck your throat for a while to get his cock nice and sloppy. And now show him why he loves you. Rub your face all over his cock, suck and lick his balls. His balls are very important, lick them, suck them, one at a time, both at the same time. Make love to his nuts with your face basically - it'll drive him wild. Tell him how big he is, how much you hunger for it. \n\nRubbing your face against a hard cock and balls feels really good and it'll make him bust his nuts big time. This at the end of the day is all about getting a big load out of him (well it is for me anyway hehe). \n\nDepending how your man cums depends where he should cum. Mine shoots pretty far so I like it when he cums on my tits first, and then lets a few spurts out onto my face. If he aims for my face first I only get the second half as his first couple of spurts shoot over me and thus is wasted. \n\nIf he doesn't shoot far have him point that thing straight at your face. You want as much cum on your face as possible basically. Not only will he like the look of your make-up ruined cum drenched face you'll feel like such a naughty slut your whole body will be tingly and you'll be smiling for days. \n\nWhenever we have a proper throat fucking session I get the biggest cum glazing ever - so be prepared to be soaked as your man gives you your reward."
    ],
    "authorname": "Goey",
    "tags": [
        "blowjob",
        "oral",
        "throat",
        "submissive"
    ],
    "category": "How To",
    "url": "https://www.literotica.com/s/let-him-use-your-face"
}