{
    "title": "How to Write a Good Sex Scene",
    "pages": [
        "I have to admit, it seems a little strange for someone like me to be writing a how to article on writing good sex scenes. Anyone who's read my profile knows that I have the absolute least amount of experience with real world sex possible, none. Yet, if reader response to my stories is any gauge, I seem to know what I'm doing (If I don't, will someone please let me know). So what do I do when I write a sex scene?\n\nThe first step in writing a good sex scene is read good sex scenes, and bad ones. Knowing what sucks is just as important as knowing what is great. I have a voracious appetite for erotica. I have been reading it since before it was legal for me to do so. Lots of letters magazines like Penthouse letters and Hustler fantasies. I've collected massive amounts of erotica from the internet ever since it was possible to do so. So I have seen lots of good and bad stories, as well as good and bad sex scenes.\n\nSo just what is a good sex scene? For me, a good sex scene is one that draws the reader in and makes them wish, or imagine, that they are there. A really good one makes you wish you were one of the participants. I will admit that different people have different ideas about what great is, but there are some constants in the good ones. The most important constant of good sex scenes is that they don't fixate on just the physical acts.\n\nSex is something that is felt, deeply and strongly. \"My cock thrust into her pussy again and again,\" is just nowhere as erotic as \"My cock felt her clench against it with each thrust into the warm moist folds of her pussy.\" Brevity is not the goal here, lots of vivid descriptions is. Capture the feelings of the acts that are being described. It's also important to be vivid about the sensations that result. Compare these two descriptions. \"My arousal grew as he caressed my pussy, sliding his fingers between the lips.\" \"As he caressed my pussy, sliding his fingers between my lips, my body flushed with heat and sensations, much like electric sparks, rushed from my cunt, causing my body to shudder with pleasure.\" The second one is vastly better, letting you feel with the character, the sensations that she was feeling.\n\nIt also helps if the descriptions are realistic. I need to qualify this, however. Real sex can be incredibly dull, at least if you believe some of what had been written about it. I had the pleasure of reading an interesting book some time ago, \"The Hite Report on Female Sexuality.\" The Hite study solicited women's comments about every possible aspect of sex and compiled them in a book. One of the findings was that at least half of the women in the study reported unsatisfying sex lives. 10% of those having sex regularly had NEVER experienced an orgasm. So realistic descriptions are not about what happens in the real world, per se, but what happens in the real world when the sex is good (unless, of course, your story needs a bad sex scene for plot purposes).\n\nNow, how does someone like me describe realistic sex scenes, if he's never experienced real sex, bad or good. That's where all the reading comes in, especially the various letters magazines. Now, I don't believe that every letter in \"Penthouse Letters\" describes things that actually happen, but I am convinced that they are written by real people. These people describe sex as they have experienced it, possibly spruced up to be more glorious. There's nothing wrong with that, that's what we do when we write erotica. Even for the sexually experienced, this is important, since there will always be half our readership that we cannot share an experiential connection with, the opposite gender.\n\nThere is no way that a man, such as myself, can know what a woman feels when experiencing sexual arousal, pleasure and orgasm. I may have (and do have) an extremely vivid imagination, but it has to have an initial reservoir of experience to build on. \"The Hite Report\" and various letters magazines have been my inspiration. I draw on these and let my imagination go to work, honed by 30 years of being a game master for fantasy role playing games. Similarly, I know that no woman can know what male arousal, pleasure and orgasm feels like. But both sexes can imagine and describe them for the other.\n\nThe good news is that, based on extensive reading, real sex has as many variations as there are people. This means that most of our descriptions will be realistic to someone. It also means that there will be someone out there who thinks that anything you write will seem unrealistic. Our goal should be to make it seem realistic to as many people as we can. Frequently, out audience will affect out choices. One of the areas I write in is BDSM. The audience for that kind of erotica has certain expectations that, to non-aficionados, would seem horribly unrealistic. Take pain, for example. A common theme in BDSM fiction is the 'pain slut'. This is the woman who can cum just from experiencing intense pain (Singularity's Michelle or Surmi from my Valerie series are excellent examples). BDSM fans will believe such a character, or at least suspend disbelief in such a character, but those who are not fans will find such a character and the descriptions of how pain drives her to an orgasm unrealistic. Like wise, the lesbian/gay archetype of the homosexual who can successfully seduce the straight person is easily believed by fans of lesbian/gay fiction, but those who don't like such stories will find the descriptions of straight people responding positively to homosexual advances unrealistic. And it will not matter how real it really is. For all I know, homosexual seduction is real and common, but if the reader doesn't want to believe it, then it will always be 'unrealistic' to that reader. (It's nice that literotica allows readers to find what they want to read)\n\nI'm about to get controversial on you. Good sex scenes do not exist in a vacuum. They are part of a story. Now don't get me wrong, I like a good stroke story just as much as the next guy. It is possible to write a really hot sex scene that will get rave reviews. But hot is not good. Not everyone believes this. Some people believe that hot sex equals good sex. I have to disagree. Good sex scenes draw the reader into the scene and make them care about it. Caring comes from knowing the characters. That requires story, not just sex. Now I'm not talking about a novel. Part one of my \"Galactic Slave\" series is only one literotica page long, contains one hot unwilling sex scene, one vivid humiliation sequence and two sequences of uncontrollable arousal, yet it has enough story to make you care about Susan and what is happening to her. Let the reader know what the backdrop is, why the characters are involved in the sex they are in. It doesn't take a likable story either, or a sexual result that the reader wants to see. King_Welsey's \"I Want to Play a Game\" is one of my least favorite stories, not because it is poorly written (it is actually very well written). I hated the intent of the protagonist and what he was subjecting his victims to. But, he was extremely successful at getting me to care about the poor women in the story, making the subsequent sexual scenes, disappointing as their outcomes were, very good. His descriptions of unwilling arousal and terror at being aroused are powerful and moving.\n\nThere is one more thing that makes a good sex scene. Emotion. Sex, good sex is emotional. Your characters should feel emotions when they approach, engage in and recover from sexual experiences. Any emotion can motivate sex or be motivated by sex. A frequent emotion used in the reluctance/non-consent area is fear. The woman (or man) engages in sex does so out of fear of some consequence if they don't. Of course, love is the most common and potentially powerful emotion connected with sex. The single most powerful use of love as a sexual catalyst that I have read was in \"McKayla's Miracle\" by HLD. The incredibly strong love that is portrayed between McKayla and Amberle makes the sex scenes something you want to have happen.\n\nI hope this has helped someone. From what I have read on literotica, this may be one of the least needed how to articles, as there are a lot of good writers out there that incorporate the things I have talked about. But, if you're new to the whole erotic writing thing, maybe I have helped you write something a little better than you would have otherwise. Fell free to let me know what you think of this article. I enjoy almost all feedback, the positive, the thoughtful and the critical, especially the constructively critical (if you just want to make fun of me or flame me, don't bother). Enjoy. "
    ],
    "authorname": "dweaver999",
    "tags": [
        "witing advice",
        "writing how-to"
    ],
    "category": "How To",
    "url": "https://www.literotica.com/s/how-to-write-a-good-sex-scene"
}