{
    "title": "How To Write A Character Biography",
    "pages": [
        "The following is a guided exercise. It's intent is to allow you to get out of your own way and let your character tell you about themselves. Simply answer the questions to the best of your ability. Some of the questions will spark more answers. That's good. Just write and move on.\n\nYou should write out this information with no structure in mind, simply let the words flow from you. It's intended to allow your mind to be open to whatever inspiration occurs while you think about the character.\n\nGet the information written. Don't edit it. It is not intended to be seen by anyone else. This is information that only the writer of the story needs to know. Put it in a file, single-spaced on about two to three pages in a font about like this (Times-Roman 12 point).\n\nDo this exercise for all of your major characters - the ones who significantly drive your story. Remember, there are no villains, just characters with different points of view about how the world should work.\n\nKeep each 'Character Bio' in a separate file. Keep them all in a separate 'Character Bios' directory where you have your other development files for your story.\n\nAsk yourself these questions about your character and just write down whatever comes to mind. You may be answering some other question, that's good, that's okay. Just let it flow. When you stop typing, just move on to the next question. Good luck!\n\n------- Character Questions -------\n\nWho are their parents? Did they know their parents? Where are their Mom and Dad from? Did they work, what was their profession? Who was your character closest to? Mom or Dad? Did they have any Aunts or Uncles? Were the Aunts or Uncles living with the family? Close to the family? Did they know their grandparents?\n\nWhen were they born? Are they immigrants? First generation? Second? Did they have brothers or sisters? What were their names? How many of each? Where did your character lie in the family tree? Youngest sibling? Oldest? Middle child? Which sibling was closest to your character? What did they do together?\n\nDid the family have a pet? What was its name? What kind of animal was it? Did it live in the house? Who took care of it? Did they have more than one pet? Who was closest to it? When did it die? Is it still alive? Who takes care of it now? Did it have any good/bad habits? What was your character's relationship with the family pet?\n\nWhen your character was a child what was their favorite thing to do? How often did they get to do it? Were they artistic? Mathematical? Curious? Conservative? Shy? Were they scared of anything when they were young? If so, did anyone help them with that?\n\nWhat is their health like? Do they have any allergies? Are they robust? Athletic? Frail? What are their personal habits like? Are they clean? Tidy? Well-groomed? Or not?\n\nWhat were their favorite clothes? What did they like to eat? Were their family meals or did everyone eat separately?\n\nWho were their friends? Who was their best friend when they were nine years old? Around the age of nine-ten, they learned something valuable from their parent. What was it and what happened? Where did the family live? Did they live in a house, apartment, ranch, condo? What kind of things did the family have? Cars? TVs? Rich? Poor? Was the family close to any other families?\n\nWhere did they go to school? Who was their teacher? their favorite teacher? What did they like to study? Were they a voracious reader? Or did they shy away from it? Why? Did they participate in any school functions? Plays? Teams? Clubs?\n\nAround the age of thirteen-fourteen some event occurred in their lives that made them think about what they might do in life. What was that event? How did it effect them? Who else was there?\n\nWho did they date in highschool? Who was their favorite person? Who did they stay away from? Why? What was their life like in highschool?\n\nDid they go to college? What did they study? Did they get to travel abroad? What was their first job out of college? Was it in their chose profession? Who did they work for? Did they like them? Did they get any opportunities? Responsibility?\n\nIf the character is older, you will need to answer more questions.\n\nDid they get married? Who did they marry? How did they meet? What is their family like - the In-laws? \n\nDid they have children? What were the children's names? Are the children still alive? How did having a family effect who they were? Did they change jobs?\n\nHow did their career progress? Did they move up? Down? Stagnant?\n\nIs their spouse still alive? What is their job/profession?\n\nAre they still married? Divorced? If divorced, did they/would they get re-married? If so, then to whom?\n\n------- Finish the above questions first, then answer the following:\n\nWhat is their point-of-view? What is their view of the world? Are they optimistic? pessimistic? Does the world belong to them? Or does it treat them badly? \n\nWho is/was their mentor? Who is the person in their life who teaches/taught them the most about life? About their profession? About being a person? About being themselves?\n\nWhat are their professional relationships? In their career/work, whom do they get along with? How do they treat those who work with them? Is there someone's whose work that theirs compliments? Is their someone whose work that theirs is at conflict with?\n\nWhat is their attitude? Are they dark? Carefree? Sarcastic? Straight-shooter? Hate the world? Love it? What do they expect out of their job? their relationship? their life?\n\nWhat is their Belief System? Do they think that hard work will get them what they want? Do they believe the Universe is a random series of events? Or is it pre-ordained?\n\nWhat is their Emotional Change? During the story, your character will learn something new that will change them. How do they change? How do they begin? Are they sad at the beginning and happy at the end? Or what?\n\nWhat is their Dramatic Need? What do they want to get? Is it money, fame, wealth, power, love? Riches? The death of another? Saving someone dear? What is it?\n\n---------------------------------------\n\nNow that you've finished writing your Character Biography, you will know your character very well. So well, in fact, that if you breathe deeply and meditate on them for a moment, you can see them.\n\nMeditation: turn the lights down low, sit quietly in a comfortable chair, breath slowly and deeply and close your eyes. You see a path leading through a park. Follow it. You come to a river. The river flows gently and lazily downstream. The path leads along the shore of the river. There's a bench overlooking the park and the river. Please sit down and relax, taking in the scenery - the trees, the flowers. Smell the air. You can smell plants, the flowers, the river and a bit of ocean from somewhere nearby. A person approaches down the path. It's your character. They sit down on the bench with you. Just be with them for a moment. Let them sit there and do what they will.\n\nAfter meditation: Turn the lights back up and get out a paper and pen. Write down your experience. What did your character do? How did they sit? Did they ask you anything? Did they tell you anything? Does the experience have any significance for your story?\n\n-----------------------------------------------------\n\nThe questions and the meditation are methods for getting your mind out of the way and letting the character step out of you. Once you've done these exercises, you will have a very good understanding of this person who lives in your mind. You will know what they will say, how they will say it and what they will do. Some of the items you have come up with may be items you need to include in your story. They might be very significant and interesting.\n\nHave fun with this. The characters are inside, waiting to meet you."
    ],
    "authorname": "JUDO",
    "tags": [
        "author how to",
        "writing exercise",
        "writing how-to",
        "character history",
        "characters",
        "character development",
        "story development"
    ],
    "category": "How To",
    "url": "https://www.literotica.com/s/how-to-write-a-character-biography"
}