{
    "title": "A Guide to Great Anal Sex Pt. 02",
    "pages": [
        "II. Training for anal intercourse\n\nHow many times have you heard of this scenario played itself out. Perhaps it's an experience you have had. A man pleads with a woman to try anal sex. With some misgivings, she consents because he wants it so much. Excited, he tries to thrust his penis into her ass, causing pain when her inner sphincter is forced open and then ejaculates in the process. This leaves the woman in pain, with a load of semen in her ass, completely unsatisfied, and thinking \"yuk, that was disgusting. I'm never doing that again.\" It also leaves the man embarrassed, hopefully apologetic, doubting his lovemaking abilities, and thinking that anal sex is not at all what it is cracked up to be. End of story for that particular couple.\n\nGreat anal sex involves an almost completely opposite approach. There is no pleading man, yielding woman, or \"me Tarzan, you Jane\" attitude involved. Rather, careful mental and physical preparation in anticipation of even the possibility for ass fucking. If you were a diver, you wouldn't expect to get up on a three-meter springboard and execute a perfect triple somersault the first time; if a pianist, your not first go at a Chopin etude is going to be far from faultless. Why, then, would a woman or a man expect perfection in their first experience with anal intercourse? Like anything else that brings real pleasure that you want, experiencing great anal sex requires training and practice. \"On the job\" training through experimentation with actual fucking really is not fair for either partner.\n\nPerhaps the most difficult training piece of both women and men is psychological because great anal sex invites, and to some degree demands, role reversals for both from general societal expectations. It asks a woman who knows, respects, and loves her body to come to terms with her aggressive, highly sexual nature. She needs to admit to herself that she is going to have a man put his penis in her ass not only because it gives him pleasure, but also because of the pleasure she anticipates for herself thinking about the orgasm(s) she may experience. An absolute precondition to great anal sex is that the woman sees herself as completely equal partner in the process of ass fucking. Her pleasure is just as important as the man's, and by inviting a man into the most intimate spot in her body, she has the right--even responsibility--to set some preconditions for what happens if she is to remain within her comfort zone. She may want her partner to fuck her with his penis, but it is equally legitimate for her to want to fuck herself on his penis. The difference between these two desires is enormous.\n\nIf it is challenging for a woman to recognize and access her own aggressive sexuality, it is equally difficult for a man to come to understand that great anal sex requires him to access the gentler side of himself. As a matter of fact, most of the time that a man's physical action is described in these lessons, \"gentle\" or \"gently\" could be added. Those occasions when a man is asked to be an aggressive fucker are because the woman wants it that way. Great anal sex is not the product of the hunter-gatherer returning to his cave in his bearskin with his club slung over his shoulder and delivering pleasure to his woman by giving pleasure to himself. A woman's sexual pleasure is not the function of what the man imagines it should be, but what a women experiences it to be. The man needs to understand that creating circumstances for her extraordinary pleasure, he receives the same in return. Celeste playfully calls me her \"sex slave.\" To me, it is a badge of honor, Guys, you have to come to grips with the fact that there's only one person who should be driving the racecar during ass fucking—AND MOST OF THE TIME, IT'S NOT YOU.\n\nOnce you have grappled with these psychological challenges, there is some necessary physical training before great anal sex is possible. For Celeste, this involved a thorough examination of and experimentation with her own body to understand what brought her anal pleasure (see part one). A woman can accomplish this in the privacy of her bedroom through any number of masturbation experiences.\n\nMore challenging, but absolutely critical, is the training that relaxes a woman's inner sphincter. Here you need the help of sex toys: a small and a larger butt plug. Penile shaped dildos are less useful because the key feature of the toy should be a protruding ring that increases the circumference of the shaft. Fortunately, many varieties of these are available through Internet sales today. \n\nWith the small butt plug in hand, the woman should relax in a warm bath, perhaps with a glass of wine. Then she should move to her bed and lubricate (your choice of products here but nothing petroleum-based such as Vaseline) the small butt plug. (When you are comfortable doing so, use the larger one). Gently insert it into your anus, pushing it through both the outer and inner sphincters so that the protruding ring lies beyond the inner sphincter in the anal canal. Several female readers of the first lesson have raised the issue of their fear of pain as the major obstacle to a willingness to try anal sex. Celeste's response: THIS IS GOING TO HURT THE FIRST TIME AND THE PAIN CAN BE A SHARP, STABBING ONE. IT CANNOT BE AVOIDED AND IF YOUR NOT WILLING TO EXPERIENCE THIS, DON'T GO ANY FURTHER WITH ANAL SEX. YOU ARE BEYOND YOUR COMFORT ZONE. FOR ME, THE PAIN WAS ABOUT THE SAME AS WHEN MY HYMEN WAS RUPTURED DURING MY FIRST EXPERIENCE WITH VAGINAL INTERCOURSE. Know, also, that the pain diminishes rapidly with practice and then disappears completely. That, at least was Celeste's experience. Know also that this is a classical example of the accuracy of the cliché about \"no pain, no gain.\" What you are gaining through what was brief episode of pain for her is the potential for extraordinary sexual pleasure the rest of your life.\n\nAssuming that you have and properly inserted the plug, now pull it partly out to the point where you can feel the ring lodged between your two sphincters. Relax, let it rest there for a moment and then slowly rotate it clockwise and counterclockwise. Reinsert it and repeat the procedure if you feel comfortable in doing so If you are in continuing pain after the first cycle, remove the plug and stop that day's training, knowing that you have taken a giant step down the road to experiencing great anal sex. After a number of sessions, the number varying with each individual, a woman will feel comfortable graduating to the larger plug and eventually will have trained her inner sphincter to be pliable. Eventually, you may want to masturbate to orgasm using your finger and thumb as described in lesson one. This orgasm should be more intense and pleasurable than those you generally experience from masturbation. If it isn't, anal sex itself may not bring you the pleasure it brings us.\n\nIt is such an advantage for a woman to approach the possibility of her first anal intercourse with the self-confidence and knowledge that training her inner sphincter provides. Most women will engage in this practice alone. Some may train with their male partner or lover, but it would take an exceptionally astute and caring man to understand both the mental and physical needs a woman faces during this. Although it was a bit daring and certainly not to every woman's taste, Celeste wants me to share her training experience with you. \n\nWhen we were both in college in the late sixties and early seventies, she developed a close personal friendship with the college's gynecologist. This doctor educated her on the intricacies of anal sex. She recommended training with another woman, if Celeste had a truly discrete, close personal friend with whom she was not involved romantically. This, the doctor pointed out, provided the opportunity for a relaxing massage before insertion and the benefit of the gentleness of a woman's touch on another woman's body during what was going to be a new and somewhat daunting experience for both. Celeste had exactly such a friend in her roommate and they did train each other. It was an experience both enjoyed and nothing romantic ever developed between them. They have remained close friends over the years. The roommate has been happily married for thirty-six years. I doubt that it is a coincidence that we have sixty-eight years of happy marriages between us. We see each other as a foursome every year or so, enjoying each other's company a great deal. This is in spite of the fact that we live on the East Coast and they on Michigan's Upper Peninsula, of all places. Incidentally, the subject of sex is not consciously avoided but doesn't naturally come up in the course of our visits together.\n\nOnce I came to understand and accept the fact that I wasn't calling all the shots during ass fucking (Celeste refers to me as her \"sex slave\" with great love), the great physical challenge for me was overcoming the embarrassment of premature ejaculations. For a man, having his penis in a woman's ass because she has invited him to be there is a real gift. For me, it is everything it is supposed to be, and more. The sensation of a hot, form-fitting, pulsating anal canal massaging your dick is a sensory overload if you concentrate on it. To be honest, when you are a novice, no amount of training is going to prevent you from ejaculating prematurely the first several times you ass fuck and there's not much you can do about that. The physical sensations are just so overwhelming. \n\nEven before becoming sexually active, a man can train himself in masturbation sessions to control somewhat the timing of his orgasms. This is a good lesson for a man to learn about all sexual situations. Celeste was very understanding of my shortcomings in this area during the opening episodes of our anal sex, but I knew that it couldn't be satisfying for her to have me cum and lose my erection as she was beginning to approach her orgasm. As her lover and a provider of pleasure, I recognized that it was my responsibility to control my own body.\n\nOne way to control the timing of your ejaculation is to practice tightening the muscle(s) at the base of your penis when you feel an orgasm approaching during masturbation. As you strengthen these muscles over time, you should be able to time when you cum with some precision. (The opposite action, completely relaxing them while pushing outward, produces a \"gusher.\") Although I have trained myself to control my timing with this exercise, I don't find it to be completely satisfactory. Many times I will have a dry ejaculation where I experience of having contractions associated with cuming without passing any semen. In this case, I lose my erection anyway. I much prefer to stay well short of the point of inevitability (much more on the point of inevitability for both women and men in the fucking lesson) and to distract my mind by thinking of something else when I feel it approaching. Although the mental images have obviously changed over time, today calling up a picture of the little stream that runs through our back yard works every time. The potential crisis passes, and Celeste and I continue our lovemaking. \n\nNow that we have reviewed basic female anatomy and how a woman and a man can train themselves both mentally and physically for great anal sex, Celeste and I discuss levels of anal penetration and positions for ass fucking in part three.\n\nIII. Degrees of penetration and positions (to follow shortly)"
    ],
    "authorname": "celesteandjim",
    "tags": [
        "anal how-to",
        "anal sex advice",
        "anal intercourse",
        "anal first time"
    ],
    "category": "How To",
    "url": "https://www.literotica.com/s/a-guide-to-great-anal-sex-pt-02"
}