{
    "title": "How to Be Alone... And Happy",
    "pages": [
        "I am a misfit. I always have been...and always will be. I am a throwback to another time. And to evolved for this one. I am a romantic. A true romantic. Whether it be the trashy romance novels that I have been reading since I was twelve and writing for almost as long. Or the idealistic way that I see the world and the people in it. I love being different. I love being me. But it is lonely. \n\nWhen you are those things, it is hard to find someone like you. Someone to share this journey with. A partner, a true partner. Oh, there are always people about. Friends and lovers who are attracted to you. To what you can do for them. For what you can and do give them. There are more of them than you can ever feed, love and nurture. \n\nBecause the sad truth is that there are too few givers in this world and way too many takers. I am forty-nine...and five weeks. And I have always been alone. Even when I was in relationships. Even when I was married. I was alone in all the ways that matter most. \n\nAs a child, my sperm donor left me when I was two and a half. I was raised by my great-grandmother in a neighborhood with only a handful of children. My only friends were women ten times older than I was who taught me to sew, cook and crochet before I could read. They told me stories of the Great Depression and World War II. Don't feel sorry for me. Those women taught me more, were better friends than most I have had in my life. They made me who I am today...and I am thankful for that.\n\nWhen I went to school, I was alone. Oh, I had a friend...or two. But I was not in the popular crowd. I had trouble learning to read so I was called dumb. My family did not have money so my hand me down clothes were made fun of. I escaped into my mind. My fantasies. I suppose you could say I told lies, but they are not lies when you believe them more than the reality about you. Don't feel sorry for me. Those experiences taught me to fantasize. That as long as you have your mind, you can go anywhere, be anything.\n\nWhen I grew up and got married, I thought everything would be all right. I had someone that was all mine. A best friend. Someone I could count on. Except it was more about him counting on me. Me being what he needed when he needed it. When the chips were down, I was always alone. I was the one facing the hard choices...alone. Don't feel sorry for me. I made those decisions. I took the consequences. And I survived. That is what matters.\n\nWhen I had children, I thought...at last, someone that will love me forever. And I poured my heart and soul into them all. I loved them. I taught them. I mentored them. And then I let them go. To be the people that they were meant to be. Don't feel sorry for me. That is how it is supposed to be. Children grown into adults and have their own lives. And if you have done your job well, they fly back home every now and again. Just often enough to remind you that it was all worth it.\n\nThese days I have my friends. People around me that care for me and I care for them. When I need someone to talk to, they listen. If I truly need something, they give it if they can. They are wonderful people. But they cannot be there all the time. The truth is that unless you are a twin...all of us enter this world alone. And even if we died in the arms of the person we love the most, we all leave it alone.\n\nOne of my favorite authors is Dr. Seuss. The man offers some of the best advice about how to live your life that you could ever have. Forget self-help books. Forget philosophy. Forget gods and religion. Go with Seuss. And my favorite book of all is \"Oh, The Places You'll Go.\" These words are immortal:\n\nAll Alone!\n\nWhether you like it or not,\n\nAlone will be something\n\nyou'll be quite a lot.\n\nIt is the one thing that most of us spend a lifetime trying to avoid. As babies, we wake up alone and cry to get someone to come and just pick us up. And if no one comes? The sad thing is that we learn not to us...and it fucks us up for the rest of our lives. As teens, we do almost anything we can to be 'popular.' Drink, smoke, do drugs. We discover the one that we will continue to manipulate well into adulthood...sex. If we have sex, then we are not alone. Right? We marry. We have children. We make friends. Hell, we work crappy jobs. Just so that we won't have to be alone. \n\nExcept alone is not that bad a place. Alone is quiet. Alone is peaceful. Alone is freedom. To do and be what you want. Alone is serenity. Alone means just for me. \n\nBut getting to that place is not easy. I know that. I spent forty-nine years trying all those things that I mentioned. Two marriages. Six children. A dom. A daddy. A master. Friends. And way too many lovers to mention. I tried them all to avoid the one thing I have come to love and embrace the most. Just being alone. \n\nSo what have I learned? How did I get to this place? What makes it so wonderful?\n\n1) Spend time looking in the mirror. Yeah, for some of us that means actually looking in those glass things. But that is only a first step. The more important mirror is eyes...the windows to our souls. Look into your own. See yourself for who you really are. The good. The Bad. The Ugly. The Special. The precious being unlike any other. Yeah, you have made mistakes. Welcome to the human race. Embrace them, those mistakes, those ugly parts of you. Know that they are there and probably won't ever go away. Then choice to focus on the good parts. Choice to see the amazing things you do get right. Learning to love yourself, it is the greatest love of all.\n\n2) Find good people. They are out there. People like you. Basically good but horribly flawed. Let them in. accept them as you accept yourself...for who they are. Not who you want them to be. Not who you think they should be. Don't try to change them. Just be there for them when they fuck up...and let them in when you do. \n\n3) The most important words you will ever learn are...I am sorry. Because without those three little words then those other (I love you) will never mean anything. Without admitting when we are wrong, first to ourselves and then to the ones that we have hurt...we are toxic to them and us. \n\n4) Yes is more powerful than no. From the moment we start to crawl...and perhaps even sooner if we were unlucky enough to have those type of parents that thought they would teach us life's important lessons by not coming when we cried...the word we learn almost as soon as Mama or Dada is NO. We hear it hundreds of times a day. And it eats at our souls. It gnaws away the happiness that we were born with. Oh, don't get me wrong there will always be no's in this world. There has to be. No, don't touch that fire. No, don't bite your friend. No, don't give up your dreams. But the yeses in this world should always outweigh the no's.\n\n5) Do what you want/love. Never let your dreams die. Because if you do, then you have died already. If you dream of writing that story, that poem, that play/movie/TV show that will be read or watched hundreds of years from now like Shakespeare, Austin, Hitchcock or (insert name), get to writing. Even if you don't make money at it. Even if you have to publish your crap for free on places like...Lit (love you Laurel and Manu for giving us this place). OK, so some dreams are harder than others. If you are my age and always wanted to be an astronaut or play major league baseball, we can agree those dreams are not physically possible. But you can still have those same feelings...join an astronomy club...hell, save up your money for those silly trips to 'inner space.' Coach a little league team...who knows maybe you will make that dream come true for some little kid. Just get your ass up and do something. Anything that you love.\n\n6) Give. Give love. Give support. Give you. Until it hurts. Then keep giving. Because here is another secret...the more you give, the more of you there will be. \n\nAnd when you have those special quiet moments ALONE you will discover that you have found what you sought all along...HAPPINESS."
    ],
    "authorname": "Tara Cox",
    "tags": [
        "philosophy",
        "alone",
        "happy"
    ],
    "category": "How To",
    "url": "https://www.literotica.com/s/how-to-be-alone-and-happy"
}