{
    "title": "How To Handle Infidelity",
    "pages": [
        "This is for my friend, and also for me. I love you D.\n\nInfidelity. Just the word can bring havoc and panic to the heart of most committed people, married or not. It happens all the time, we hear about it constantly. That coworker at the office, the late-night call from a friend. But...it never happens to US. Never in OUR relationship. Oh yes it does. You'd better fasten your seat belts boys and girls...this is one hell of a bumpy ride.\n\nFirst, let me give you my history on this topic, so you know up front that I've been there.\n\nI've been on both sides of this emotional roller coaster. My first brush with infidelity came at the tender age of 20 years old. So young, so inexperienced with life, sex, orgasms, and men. He was 23 years old, and to me at that age -- that meant he was a MAN, and I was impressed. His marriage was crumbing, he told me so. I was the woman of his dreams, the love he was looking for. \n\nAnd the sex, have I not mentioned the sex yet? Ladies...this man rocked my world. Before him, I had never experienced an orgasm that wasn't self-inflicted, never had a man eat my pussy, never had anal sex. My thighs quivered so much from this man that I thought I might never walk again. \n\nSo he had a wife, so what! She wasn't my concern. It's amazing how good sex can throw all clear thinking right out the damn window. I played the role of the \"other woman\" for almost three years. Until...he went back to his wife for good. He's been married and divorced twice now. The second marriage ended when she cheated on him. What's that old saying? You reap what you sow.\n\nI got married myself two years later. I chose a shy, sweet, innocent man. He was a virgin for God's sake. He adored me, he would never cheat on me. Yeah, keep telling yourself that. Looking back, I can honestly say I didn't try as hard as I could have to make sure he was happy. I was so confidant of myself, that I missed the signs right in front of me. \n\n4 years into our marriage he was cheating on me. It took me months to figure it out. I think the phone call from her one afternoon was my first clue. That same great sex I had been having with some faceless woman's husband, was NOW being had by another faceless woman with MY husband! Here we go again. You reap what you sow.\n\nIn my somewhat humble, yet slightly educated opinion on this topic, I feel there are two basic types of infidelity. While there can be many different variations of this, they do seem to be classed into two distinct groups. \n\nType #1\n\nThe one night stand. That sort of fly-by sex. You don't think much about it ahead of time, you don't necessarily plan it, it just happens. A moment presents itself, you're in the wrong place at the wrong time (or the right place at the right time), and that heated lusty feeling in your groin sucks up all your brain cells and you fuck like bunnies.\n\nIt can be incredibly intense and erotic. Maybe your sweet, demure wife doesn't give head, and this woman whose name you might not even know is sucking your cock like she works for Hoover. Maybe your football-crazed husband tells you \"later, honey, the game is on\", and this man you just met is practically ripping your panties from your body because he NEEDS your pussy. Did I mention this could be intense?\n\nBut, it's a lapse -- a one time fling -- nothing more. You pull your cock from her ass, find the shreds of your clothes scattered all over the floor, and crawl away in shame. (Once you cum, you can't get out of there fast enough anyway) Or, ladies, you salvage what's left of those ripped and damp panties, quickly stuff them into your purse, and run home to get the kids lunches made for school the next day. It's temporary insanity, as I tried explain to a friend recently. You won't get the death sentence for it, but that gold-plated free pass to heaven has just built up some tarnish. Does anyone need a ride to confession?\n\nDuring the act you may or may not be feeling any guilt. You may get so caught up in the passion of the moment, that real life has escaped your brain. Your brain cells are rather pre-occupied at the moment. Who could blame you? On some levels this may even seem like fantasy, with the reality not hitting until your clothes are back on, and you've scampered off into the night.\n\nYou might not feel guilt afterwards either, though from my own experience, and the stories I hear from my circle of friends, most people do. The guilt can eat away at you, making you question your values, and even your relationship. You vow that this will never happen again. You shower your significant other with love, kisses, attention, and gratitude. All of this, of course, is to try to reduce your guilt.\n\nSometimes it doesn't happen again. That was it, you sowed your wild oats. You swear on all that is holy that you will never stray again. Sometimes you don't. Then again...sometimes you do.\n\nAs horrible as this may sound to those people I saw waiting outside the confession booth with me last Saturday (Please, don't tell my mother I was there AGAIN), even if you slip again...with another person, and it happens only one time, it's STILL a one night stand. Does it make you any less of a cheater? Hell no. It just makes you a Type #1 cheater.\n\nI've known people who felt that because they never slept with any of their \"one night stands\" more then once, that it didn't mean anything. It wasn't REALLY cheating...they were all just \"mistakes.\" Using that logic, we can rob the bank of our choice, and as long as we don't rob each bank more than once, we aren't REALLY stealing. Stick to that story when you meet Bubba, your new prison-mate, when he's handing you the soap on a rope and calling you \"his bitch.\"\n\nThis brings me to the next and in my opinion, the most damaging, type. Remember, I've been here, and I've played every part in this nasty little game. I've been the victim of both one-night stands and more meaningful infidelity, but I have also been the one doing the cheating. Am I proud of what I've done? Hell NO! But...if asked if I would change the experiences I've been through, I would really have to think long and hard. \n\nType #2\n\nThe \"more than once encounter,\" maybe not so casual infidelity. Oh sure, maybe it started out as a case of temporary insanity, but you go back for round #2, and maybe more. Type #2 infidelity is almost always born from Type #1. You think it won't happen again, but God, it felt so amazing, you were reborn sexually, and you just can't help yourself. It's like a drug addict needing another fix. You try to tell yourself this is the last time you're going to see her, the last time you let him fuck you, but it's like a runaway train, you can't stop it from happening.\n\nAs if Type #1 wasn't messy enough, filling you with enough guilt, Type #2 is worse by tenfold. This is damn hard for some people to admit to, but once you begin seeing someone on even a semi-regular basis, a relationship is formed. Semi-regular can mean once a week, or once a year. Does a relationship always mean love? God no, but a relationship has formed none the less. \n\nThat first time can sometimes be written off using the \"temporary insanity\" plea. But...when there is a second time, and maybe more, you're no longer insane, my friends. You have made a conscious decision to cheat. You may not even realize the choice has been made, but trust me, it has been. From now on, though, where this goes, and what it means, gets very tricky.\n\nFirst of all, men and women look at infidelity in completely different ways. Let me give you an example: When my husband began his first affair, the first thing I asked him was \"do you love her?\" Oh, believe me, I asked hundreds of other questions, and still do. But at that moment, when he finally told me about \"her,\" the first and most important thing that came from my lips was \"do you love her?\" \n\nNot \"have you slept with her? Is she better then me?\" All of that came later, after a very large bottle of wine. Women are generally much more emotional creatures then men are. We see the world through our hearts. If, as a woman, you have never experienced this, close your eyes, and imagine...just for a moment...your husband embracing another woman, and telling her \"I love you.\" Do you feel that in your stomach? Do you want to throw up? Yeah, I know, it's gut wrenching.\n\nAll right ladies, put the baseball bat back in you son's room and step away from the car keys. I didn't say he was cheating, I just wanted you to know how it feels. Go back to folding his underwear, make him a nice dinner, he's been a good boy.\n\nNow, men -- they react differently. For men -- for the most part (not trying to classify anyone) -- the biggest fear is of another man touching their wife. I think it goes back to the caveman days. Men are wired differently then women are. Men are hunters by nature. Going out into the world and bringing home their prey. They will proudly, with swelled chests, show their catch to other men, but don't try to take that catch home with you, or out come the clubs, and a battle will ensue.\n\nNow it's the men's turn. Close your eyes boys (don't worry, you wont miss any porn pop-ups) and without me even making a suggestion, what is the first thing that comes to your mind when you think about your wife or lover being involved with another man? Hmm...let me take a stab in the dark here. I would bet money it didn't have anything to do with her saying she loved him. Does it have anything remotely to do with another mans body on hers, his cock inside of her, making her cum, gasping and moaning in pleasure? \n\nOkay, okay, drop the club, and unclench your jaw. Go buy her some flowers, tell her you love her. She was home doing laundry all day, I swear. That was just the gardener leaving all sweaty. \n\nDoes everyone remember \"Fatal Attraction\" with Michael Douglas and Glenn Close? Remember all the talk around the water cooler from men? Remember how freaked out men were about it? Do you know why? The woman became the hunter, Glenn Close went after her prey like a mad woman. Men were terrified. I would bet that many, many men who were in the midst of a hot, steamy love affair quickly ended them out of sheer terror. My husband has seen that movie a dozen times, and he STILL calls her insane. \n\nBut...ask those same men to watch \"Unfaithful\" with Richard Gere and Diane Lane, and they will react entirely differently. They will call Diane Lane every name in the book for the most part, and will continue to go on saying the man she had the affair with deserved to die. That movie shocked people, and opened their eyes to their own personal views about infidelity.\n\nIt's a double standard, isn't it? It's almost as if men are allowed to cheat, and women are expected to forgive. But God forbid if a woman cheats. There is no excuse in the world to justify that, at least not to her husband, or a good portion of men. Maybe that will change someday, but for now, society still deems it much worse for a woman to be unfaithful.\n\nIn one regard, it doesn't matter if you are a man or a woman. If you have cheated, or if your spouse has cheated on you, the basis to dealing with it is learning to understand why it happened. Sure, there truly are some people out there who just can't seem to keep their pants on, and fuck everything they can catch. But that's not what I'm talking about here. If you're unfortunate enough to be with someone like that, give Glenn Close a call, she can help you remedy that.\n\nThis is deeper, and its tougher to handle. For you, or your spouse, or your lover to go outside of the relationship to seek sexual fulfillment, something has to be missing at home. That's a tough pill to swallow, isn't it? When you have been betrayed, it's very easy to blame the entire incident on your partner. If we take some of the responsibility for their actions, the hurt is even deeper. Let me give an example I told to a friend of mine recently.\n\nI adore Ralph Lauren's Polo on men. Any man. The checkout boy at the market; the postman; but mostly, my husband. Whenever I smell it, it arouses me on some level. For many, many years whenever my husband would wear it, I was all over him. I wanted him then, right then. It makes me feel submissive, and very erotic. But...after 14 years together, I don't react the same all the time. Oh, sometimes I still want him to take me right then and there, and will even suggest that to him. Sometimes, he will even turn the game off and oblige me. But...then...there are those other times. I will smell it, and I go into that bitchy wife mode. \n\nI've caught myself doing it. Instead of letting the scent fill me with lust and desire, I will gripe that he didn't put the bottle back in the medicine cabinet. I'll bitch that he wears it too much, and its too damn pricey to wear to work... Or, I will accuse him of wearing it for some other woman. I assume the woman at his office doesn't bitch when she smells it on him. I wonder whom he is more likely to respond favorably to? \n\nDoes that mean it's okay for him to start sleeping with her? Absolutely NOT!!!! But...if I'm completely honest with myself, perhaps I can see why some other woman would be more appealing to him. The same goes for men. If you are so absorbed in your football game, your car, whatever it is that makes you happy, that you are pushing your wife aside and not seeing to her needs, then how can you be totally surprised if she fills those needs outside of your bedroom?\n\nMost of are guilty of being too comfortable in our relationships. It feels safe, secure, and we stop trying very hard, or stop trying at all. The hubby rolls over and slips his hand under your nightie, and you grumble about being tired, having to get the kids up early. He pulls his hand away, and you go to sleep. It's no big deal, right? You can do it the next night, he isn't going anywhere. But...after years of being told \"not tonight honey\", trust me, he's going to stop trying. Not because his need is any less, but simply because he's sick and tired of being rejected, and he just gives up. \n\nDoes that mean it makes it right for him to begin a torrid affair with the woman at the grocery store who flirts with him? No, it doesn't. But, it sure does explain why he responded to her flirting in the first place. Once you can admit that to yourself, and see that you may have an active role in why the infidelity took place, you may be on the way to forgiving it, moving on from it, and making sure it never enters your life again.\n\nAn affair can be highly exciting for the person involved in it. It's completely free of any responsibilities. That person that you meet once or twice a week to have wild, hot sex with doesn't give a damn when the mortgage is due. They don't care who's taking the kids to soccer practice, or if you picked up the dry cleaning. All they care about at that moment is the feeling of fucking you. Fucking you in a way that your spouse never does anymore. Remember when you and your spouse were like that? You couldn't keep your hands off each other? God, the good 'ol days. They don't have to be gone, you just have to work harder to get them back.\n\nGuys...get her flowers on the way home...just because. Tell her she's beautiful even if she's wearing sweats and a T-shirt. She just may reward you with exactly what you were looking outside of your relationship to find.\n\nLadies...how about taking off the sweats today, and putting on those jeans. The pair he loves on you whenever you wear them. Maybe tonight you could roll over to his side of the bed, and sleep in late this weekend to make up for it. \n\nTrust me...the excitement and the thrill that you or your spouse feels with someone new would quickly vanish under the pressure of day to day life. Try talking about the mortgage with your new fling, see how that goes.\n\nWill it always work out the way we want it to? Sadly...no. But if you take an active role in trying to make it better, you won't be filled with the guilt of knowing you could have tried harder. Thanks for reading, It's time for me to dig out those jeans the hubby loves, and make him forget about the little checkout girl for tonight. "
    ],
    "authorname": "lonelylisa",
    "tags": [
        "diane lane",
        "brain cells",
        "woman husband",
        "infidelity",
        "time still",
        "night stand",
        "close eyes",
        "men",
        "man",
        "love"
    ],
    "category": "How To",
    "url": "https://www.literotica.com/s/how-to-handle-infidelity"
}