{
    "title": "Deepthroating 101",
    "pages": [
        "Here on Literotica and on the internet in general, there are several stories and guides posted on the subject of giving blowjobs. Many of them are great and give various techniques and opinions on how to enhance oral sex on a guy. Once again, I'm not claiming to be an expert, especially at the young age of 22, but I do have skill, experience and above all, enthusiasm. In this post, I'm focusing on the deepthroating aspect because I feel over time I have gotten pretty good at it and want to pass my knowledge along so that I may help others. \n\nFirst, what is the definition of deepthroating? If a girl goes all the way down on a cock, gags, chokes, then immediately rises back up, is that defined as a deepthroat? Should there be a time limit on how long you have to keep it in your throat before it actually qualifies as deepthroating? Should you be able to, not only swallow the dick, but bob all the way up and all the way down on it while performing, in order to count it as a true deepthroat? I believe there are three levels of deepthroating, so the answer to all those questions are yes. A stage one deepthroat is the first type I mentioned which most girls can do. A stage two deepthroat is more difficult and fewer can keep the cock in their throat for an extended period of time and finally, a stage three deepthroat is the most difficult to perform and a low percentage of people can continually suck a cock while deepthroating it continuously every time they go down. If you are one of the lucky few that can give your guy a stage three deepthroat, he will be a very happy person. Deepthroating not only allows him to feel his entire cock into a warm, moist orifice, it also excites his mind seeing every inch disappear in your mouth. \n\nMy last serious boyfriend had a long cock. It wasn't freakish big, but was just over 8 inches. He couldn't believe how easily I could deepthroat it while I blew him. He became obsessed about it and together we would look up deepthroating porn on the internet. There are some amazing deepthroating videos out there but no one porn star that I had ever seen was better than a girl named Heather Brooke. Have any of you seen her work? OMG, she is the deepthroat queen, with no peers. If you haven't seen her, I strongly advise looking her up on the internet. \n\nThe two factors that prevent someone from deepthroating are either physical or psychological. The physiological makeup of people is what determines the largest portion of their deepthroating skill. The physical barriers include the gag reflex in which we all hear the most about, throat length, penis thickness which is much more of a hindrance in deepthroating over penis length, among others. Many times, our skill level is predetermined but I do believe we can improve it. I cannot walk up to Ariana Grande and ask her to teach me to sing as good as she can no more that I can ask Heather Brooke, teach me to deepthroat like you. If you don't have the natural ability, you cannot be elite but you can get better and better with practice and it would be a shame to never realize your potential. \n\nEven if you are great at deepthroating cock, it is a physiological certainty that those barriers, I mentioned, will still get in the way sometime. Even the elite will gag, cough, heave and eyes will water at some point during deepthroating. As you perfect your skill, those things will happen less often but they still will happen nonetheless. That is why you would not deepthroat a guy through an entire blowjob. It's physically impossible. I treat deepthroating like it's glitter on a poster. You add a little here and there but it makes the best statement at the end. \n\nI think the psychological hurdle accounts for only a small portion but I wouldn't underestimate the effect it possesses. Girls, we all know when we have crossed over into extreme horniness or what I call \"lust mode.\" That may happen with alcohol, great foreplay, loving our partner, great lead up sex, or just a really hot guy who knows what he's doing. When you are in that state, that is the best time to attempt deepthroating. Lust mode may shed that \"claustrophobic feeling\" of having an object lodged in your throat if that is your psychological barrier. When you are uninhibited, you become more daring, experimental, and enthusiastic. \n\nA good blowjob starts and ends with enthusiasm. You have to like sucking dick and you have to want to suck dick. I have questioned my girlfriends at length and some like doing it and some don't. The ones who don't, still will do it on occasion just to please the guy but he will sense this in your demeanor which will diminish his pleasure. I also hear that, on average, when a woman gets married or older in general, she performs fellatio a lot less but I don't know many older women that I feel comfortable asking, so I cannot give a valid opinion. I love sucking cock and hope that enthusiasm I have for it never diminishes. If you sincerely want to please his cock, savor the taste, do all the little sexy non-verbal gestures, and truly swallow every inch of it, he will absolutely love it. Sometimes, I get so aroused and into it, I feel like I can't swallow enough of it, even if it is completely buried down my throat! I want even more! We can sense when a guy's attitude is lackadaisical in eating our pussies and the guy knows when we are sucking his cock just because it's \"his birthday.\" \n\nBefore you try to get your man's cock down your throat, be sure it's lubricated. Of course with all the sucking, there will be excessive saliva built up in your mouth but much of it will either stay in your mouth or ooze out as drool. There will be no doubt his cock will be lubricated but many forget to swallow to lubricate the throat. It is also good practice to have a drink handy when giving a blowjob if it is possible. The wetter your throat, the better his cock will slide down. Your throat is no different than any other orifice in your body. \n\nYou cannot read anything on deepthroating without hearing about the gag reflex. It is very real and very different for everyone. My sister gags at everything and cannot stick anything in her throat. My friend Kelly can slide a 10 inch dildo down her throat with no trouble. Those two girls have very different pharyngeal reflexes. I think my throat is much closer to Kelly's. Most of us girls have been so drunk or feeling so bad, we have had our fingers in our throat trying to throw up just to feel better. That is triggering our gag reflex. \n\nWhen we have a dick lodged in our throat, we have to think the opposite. We are suppressing our body's natural instinct to reject the object. How can we do that? I think there are a couple of techniques that may help. The first one is practice. We cannot completely change our gag reflex but we can train it. When I was a teenager and learning the art of giving blowjobs, I got tired of gagging, so one day when I was at a friend's house, she was showing me her mom's dildo collection. She let me take one of them that looked old and not in good shape. I peeled the outer rubber or \"skin\" off, exposing only the core which was just a long, thin piece of rubber. I sterilized it with rubbing alcohol and used it as my practice tool. It was still very long and perfect for sucking. \n\nI would push it to the back of my throat, heave and pull it out. I would try different positions and a variety of techniques before I would go to bed. Some of those included, shove it in very fast, very slowly, drive it back and forth very quickly, try to swallow it, and twist it around. I did get to where I found my own personal preferences that worked best for me. The guy I was dating at the time could tell a big difference in a relatively short amount of time as could I. In a few weeks, I went from gagging and choking to deepthroating his dick like a pro. The best advice I can give is to not think specific techniques work the same for everyone. Most information that I have read about deepthroating directs people to relax and straighten their throat because that provides a better \"sword swallowing\" angle and suppresses the gag reflex. Yes, that can work for some people but not for me, it is the exact opposite. I deepthroat better with my chin down and tightening my throat muscles. \n\nTo elaborate, I start out by locking or pressing my tongue down at the bottom of my jaw. I then open my throat while keeping the muscles contracted. Once the head of his cock touches the back of my throat, I push it down rather quickly without changing my throat position in any way. Quicker works for me but sometimes slower is better and you will have to see what works best for you. When his dick reaches its destination and completely submerged down your esophagus, it is important to not pull it completely out when you start sucking. Give yourself some time to get used to it. Shallowly, bob up and down while barely moving the dick in your throat and keeping your tongue perfectly still. Moving your tongue transfers the feeling in your gag reflex which could cause you to gag. \n\nWhen you get more comfortable, you can \"slide\" the dick further distances until you are deepthroat sucking. It's important to breathe when it slides out. Try not to change the throat angle or the pace of the sliding cock until you have mastered your gag reflex. Even if you go to great efforts to keep everything consistent, there will be times in the heat of passion you will choke or gag. There is nothing wrong with pulling it out, regrouping and starting over. That is why it's physically impossible to deepthroat someone throughout an entire blowjob. \n\nOf course there are many positions to give a guy a blowjob and to deepthroat in particular. Whether you are experienced and comfortable or just starting out, I feel the best position for deepthroating is with both of you right side up. The first advantage is you keep your orientation because while on your knees or sitting down, being right side up tells your brain that everything is \"normal\" which allows you to focus on the task easier without gagging. Another advantage to this position, is it's easier to control the depth and thrusting speed of the cock. Your mouth or his cock are not fighting or supporting gravity. If you feel yourself start to gag, a quick pull off is easy, plus, you can use your hands to press on his abdomen when direction is needed. In addition, this position allows you better access to his balls and ass. By fondling, rubbing, cupping, jostling, or just playing with his balls, you can add that extra sensation to make him cum quicker. If he likes ass play, he can spread his legs and allow you to slide a finger in his butthole to enjoy a prostate massage while you deepthroat him. That can also trigger him to cum quicker. \n\nAnother recommended position is, what I call, aligning to your lover's penis. If his dick curves upward, attack it from the top like you would do while on top during a 69 position. If it leans to the left, then get on his left side and swallow it that way. Properly aligning your throat to his natural curve can help reduce friction in your throat which in turn could help reduce gagging. It is ironic, if you have ever watched a nature show and see a snake swallow its prey, it aligns its jaws to help pull the prey down its throat and swallow it whole. Now we are the predator and our prey is the snake but we are trying to accomplish the same result. \n\nI don't recommend allowing your man to be on top if you are inexperienced at deepthroating. Another words, it is very difficult to allow him to \"fuck your throat\" without complications. He may get caught up in wanting to go faster or deeper than your comfort level allows. However, if you do get to the point where you can handle him doing that, it can be very exciting and erotic. Make sure he is aware of your \"rules.\" I will also tell you that if you upside down or lying with your head hanging over the bed while deepthroating, it can be a struggle to breath with his balls covering your nostrils. That is why I always keep a hand free to tap or \"rearrange\" him if needed. \n\nOnce you have improved your deepthroating ability, then it is time to add some skills for his pleasure. One thing I like to do is lick his balls while his cock is totally submerged in my esophagus. I like to give a little smile, maybe even a wink, and rub my tongue back and forth on his nuts. Be careful not to stick your tongue out too far because that releases the tension of gag reflex and can cause you to gag. You will have to find your own tongue technique that works best for you. \n\nAnother skill I like to performance during a good deepthroat blowjob is clenching my mouth very tightly. Once I have him completely buried, I clamp and keep removing the air trapped between my cheeks and his cock. This provides a different type of a snugness sensation, almost like a vacuum effect. When you start to bob in this position, it will feel like he is fucking a virgin. It will be no time and he will be ready to cum. \n\nIf you are willing to finish a guy while deepthroating, then you have decide how you will receive his cum. It can be a little trickier than it would be with just a standard blowjob. When a guy cums in your mouth during a blowjob, you can prepare by blocking off your throat with your tongue and let him empty without choking you. The second technique is when you suck it out like your drinking through a straw. Either way, it feels natural. Cumming in your throat is something completely different. It is more difficult but if you can master the technique, it also supplies a couple of advantages. \n\nThe first advantage to deepthroating an ejaculating cock is if you don't like the taste of cum. The cum shoots directly into your throat, bypassing the gag reflex and taste buds. So if you are one who hates the taste or even the slimy, thick consistency of semen, this is perfect and you are basically not swallowing until the end. Another advantage is that you have the entire cock trapped. Every inch is completely lodged and secured in your throat, therefore he cannot jam it down your throat any further which keeps you in control and gives you a better ability to take it without him doing something unexpected.\n\nThere are also disadvantages to deepthroating an ejaculating cock. The first would be the movement factor. This is the total opposite of what I just explained in the last paragraph. Yes you would have better control when you have it completely swallowed, but as he is enjoying his orgasm, he may twitch, shake, or even buck and this could cause the slightest change in your throat, triggering your gag reflex. I learned this the hard way with one of my boyfriends. He was a \"hard cummer\" which means he would completely shake and buck when he came. I would have to literally hold tight to his ass cheeks and keep him pressed firmly against my face when he shot because one time he bucked, causing me to gag, then shot a huge, thick wad that hit my air pipe instead of in my throat, causing me to cough up his load while he had to jack the rest of it on the floor. My eyes watered and there was a mess everywhere so you have to be careful. It was the ultimate deepthroat gone wrong. \n\nI will tell you that once you have deepthroated a cock, your throat will be sore. With all the trauma, it feels like you are catching a cold, so don't be alarmed. I hope my tips and ideas will help you deepthroat you man like a porn star. Just remember to find what works best for you because no one method is for everyone. That is the key. If you have any questions, feel free to email me....kisses....Britt "
    ],
    "authorname": "Brittni4u",
    "tags": [
        "blowjob",
        "deepthroating",
        "cum swallow",
        "oral",
        "fellatio",
        "self help",
        "swallowing",
        "sucking"
    ],
    "category": "How To",
    "url": "https://www.literotica.com/s/deepthroating-101"
}