{
    "title": "How to Write Romance",
    "pages": [
        "My name is Marsh Alien, and I am a Romance writer, and I have a problem. \n\n\"Hello, Marsh Alien.\"\n\nYeah, yeah. Anyway, in \"How to Break the Literotica Toplist, an entry in Literotica's How-To Contest, Tink4Fairy debuted with a work describing the best ways to reach the top-rated lists in each of the site's categories. The Romance category included the following: \"This category is fairly simple to excel in, actually, especially if you've read a lot of formulaic romance novels.\" I'm sorry, simple? Did you say simple?\n\nBecause the fact is that I haven't read even a single formulaic romance novel, let alone a lot of them. And I'm sure I speak for my fellow Romance writers when I say that we appreciate fine literature as much as the next person. Daniellekitten, for example, is currently finishing the reading required for her upcoming presentation at the American Library Association comparing the novelists John Updike, Philip Roth, and Margaret Attwood. As for me, I have nearly completed with the entire Hardy Boys series, and am considering whether or not I should take up the Bobbsey Twins. Although I have to say that so far I find the character of Flossie a little annoying.\n\nFrankly, the idea that we Romance writers can't come up with these plots on our own is offensive. It may be true, but it's still offensive. The secret, though, lies not in reading a lot of formulaic romance novels, which would be very time-consuming, but simply in obtaining a copy of the formula itself. Once you join the club, either by purchasing the introductory video or by actually posting a story in the \"Romance\" category, you receive a copy in the mail (we romantics have yet to adapt to the modern world of e-mail, although I am given to understand that the billet-doux is actually a thing of the past now.). And at that point, you can start cranking these babies out like nobody's business.\n\nI recently had a little falling out with the club's management, the result, apparently, of what they termed a certain immaturity on my part. \"But if posting a story in the Romance category makes me a Romance writer,\" I argued, \"doesn't posting a story in the \"Mature\" category actually make me a Mature writer?\" Apparently not. Or maybe they just don't want any Mature writers in the club. Whatever. Anyway, they've ticked me off enough that I've decided to spill the secret formula. So get out your notebooks, newbies. This stuff is golden.\n\nThere are essentially two basic elements to any Romance: plot and language. As we will see, once you have mastered them, you will be able to branch out on your own. For the moment, however, you should stick to the basics. After all, it's only after we know the notes to sing, that we can sing most anything. (Sorry. I was having a Julie Andrews moments. I'm fine now).\n\nFirst, the basic plot: The heroine a plucky, lovely (orphan/elementary school teacher/princess/virgin coed/rich debutante) is beset by the villain, a hardhearted (sheriff/sister/queen/college professor/banker), who is determined to relieve her of her (homestead/boyfriends/life itself/virginity/money), requiring the intervention of the hero, a tall, handsome (stranger/business consultant/prince/science nerd/tennis pro) with whom she falls desperately in love, resulting in (sex/sex/sex/heavy petting/sex) and ultimately in everyone, except the villain, living (happily ever after/happily ever after/happily ever after/happily ever after/happily ever after). Initially, you shouldn't try to mix and match. A story involving a plucky, lovely school teacher beset by a hardhearted queen determined to relieve her of her virginity, requiring the intervention of a handsome tennis pro is frankly beyond your skill at this point. Instead, perhaps you should start with all of the first choices (the orphan, the sheriff, etc.). No, no, wait a minute. I'm sorry. That's the plot of SweetWitch's \"Dire Straits.\" So don't use that one. Even though three of the chapters of that novel occupy spots in the top ten of the Romance toplist, she gets really upset whenever I plagiarize anything of hers, and pissing her off is even worse than pissing off the management of the Romance Club. And now that I think about it, the second choices are actually the plot of my own story \"Goin' Fishin.'\" And of course the third choices are from \"Snow White,\" which would no doubt be at the top of the list if the third brother, \"Smilin' Jim\" Grimm, hadn't traded the copyright for a handful of beans. But the others -- the virgin coed and the rich debutante -- are yours to use as you see fit. \n\nOnce you have the basic plot, actually, the characters don't really matter that much. You could have the two best characters in the world, but if you just have them lying around in bed, chapter after chapter, fucking each other's brains out, your basic Romance reader is going to lose interest very quickly. My advice, if you have a story like this, is to make them cousins, or better yet brother and sister, and post in \"Incest.\" Those horny toads will read everything. In Romance, plot is everything. All you need to do, once you've chosen the appropriate plot variables, is worry about things like hairstyles and outfits. In fact, you might try simply looking around you to find characters. For example, from where I sit, I can see a fascinating story about a plucky, lovely woman watering her plants, beset by a hardhearted man walking a dog who is determined to relieve of her porch swing, requiring the intervention of a tall, handsome insurance agent who lives next door. Ooh, I can already see a red \"H\" in somebody's future.\n\nThe one other area to which you will need to pay specific attention is language. For example, our characters don't fuck. They \"couple.\" There are no cocks or dicks, only \"rampant members.\" Pussies and cunts are \"fruitful loins\" or, since you may need more than one synonym, \"honeyed treasure palaces.\" The clitoris is a woman's \"center of pleasure.\" Breasts, boobs, tits, or the even cruder jugs or hooters? I don't think so. \"Pink-tipped downy/ebony/dusky hills\" (notice our multiculturalism) is the closest you're going to find. Asses and assholes rarely get mentioned in Romance stories; when we acknowledge them at all, we refer to a woman's \"soft curves\" and a man's \"sculpted thighs.\" Rather than coming or climaxing or blowing our loads, partners experience a \"joyful release.\" You can set your word processor to automatically find and replace these words and phrases when you're writing a Romance story. Just make sure you don't use that program elsewhere; calling your editor a \"coupling moron\" won't have anywhere near the effect you intend. \n\nSo now you have mastered the basic plot and the language (aren't you full of yourself today?), and want to turn to something more difficult. Because, after all, Romance \"is fairly simple to excel in\" and you're looking for more of a challenge. @#$$#&! Tink4Fairy. I would suggest that you don't need to look far. There are plenty of other categories here at Literotica that could benefit from a healthy dose of romance. Let's take a look at a selection:\n\nAnal Romance: Romance for people who don't actually want to have to look at each other.\n\nBDSM Romance: This reminds of the joke about impersonating a German Shepherd: \"You sheep vill stay in that field, und you vill eat that grass, und you vill like it!\"\n\nCelebrities Romance: Usually very, very, very short stories.\n\nExhibitionist and Voyeur Romance: What you call creepy, we call unrequited love.\n\nFetish Romance: \"I love those shoes.\"\n\nFirst Time Romance: All Romance is First Time Romance. Nobody's entitled to more than one True Love.\n\nGay Male Romance: Oddly, many Literotica readers are unwilling to read a story that involves two rampant members and no fruitful loins.\n\nHumor & Satire Romance: Marriage.\n\nIncest/Taboo Romance: In 1957, Jerry Lee Lewis married his 14-year-old cousin.\n\nInterracial Love Romance: Now legal in all 50 states, thanks to the Supreme Court's 1967 in Loving v. Virginia. And honestly, with a title like that, did the Commonwealth of Virginia really think it had a chance of winning? \n\nLesbian Sex Romance: The same readers who wouldn't be caught dead in a Gay Male story will happily wallow in a story that features two honeyed treasure palaces, probably on the theory that the two women involved are more than likely just killing time while they wait for a rampant member to show up.\n\nLoving Wives Romance: Divorce. Interestingly, Jerry Lee Lewis married his second wife (the one before the cousin) 23 days before the divorce from his first wife was final. \n\nMature Romance: The Anna Nicole Smith story.\n\nMind Control Romance: Doesn't count.\n\nNon-English Romance: Who cares?\n\nNonHuman Romance: Why darling, what big, sharp teeth you have.\n\nToys & Masturbation Romance: All right, so maybe it doesn't work for all the categories.\n\nTo see how it would work in practice, let's use an actual example from a story currently ranked fifteenth on the \"Mature\" list: \"The Accidental Gigolo, Pt. 01\" by MarshAlien. Why, it's one of mine! Yes, even though my law student (I heartily recommend law students over so called \"real\" lawyers. You can easily find one with two-thirds of the schooling as an older lawyer, yet willing to work for less than a quarter of the price) told me that I could steal from anyone's work under the \"fair abuse\" doctrine, she also said that I would actually be much less likely to be sued if I stole from myself (she wouldn't rule it out completely, though). The following scene occurs when our young hero, Terry, returns home from the store and finds his houseguest, who happens to be his French teacher as well as one of his mother's best friends, entertaining herself with a zucchini. Here's the original: \n\nWithout speaking, I bent my beautiful teacher over the countertop, forcing her curvy ass outward as she braced herself with her hands. \n\n\"Qu'est que çe, Mademoiselle?\" I teased her. \n\nI reached down with my free hand and squeezed her bikini-covered ass, eliciting a moan of arousal. I slowly slid my hand downward until I felt the bulge that I'd noticed against my leg. I pushed against it, feeling it disappear inside her. She moaned again, her strong muscles involuntarily pushing it wantonly back out. I pushed twice more, watching with interest as Ms. Lee — hell, we were friends, right? — as Pam sank to her elbows, her breasts pressing against the countertop. \n\n\"Oh, God,\" she groaned. \n\n\"So what is this, Mademoiselle?\" I asked. \n\n\"Please, I. . .\" Pam was pleading with me. \n\n\"Tell me,\" I insisted. \n\n\"It's — it's a zucchini,\" she choked. \n\n\"A zucchini?\" I chuckled. \"And ou est la?\"\n\n\"In my — my pussy!\" Pam moaned as I kept teasing her by pushing against the vegetable. \n\n\"Have you been teasing this innocent little zucchini?\" I smirked. \"Like you tease all the guys in your French class?\"\n\n\"I. . ., \" the teacher whimpered. \n\n\"You're pretty hard on us, aren't you, you little French bitch?\" I insisted. \n\n\"I'm sorry, oh God,\" Pam moaned. \n\n\"Maybe you should give the zucchini a blowjob first, to make up for teasing it,\" I suggested instead, pulling the crotch of Pam's bikini aside. The vegetable popped out and I slowly, tantalizingly, pulled it free and held it in front of my teacher's lips. \n\n\"Mmmmfffff, mmmmffff, mmmmffff,\" Pam groaned, opening her mouth and sucking her juices off as I slid the zucchini in and out. She groaned again when I pulled the zucchini away and once again brought it down to her dripping cunt. Slowly, I pushed it inside of her, pushing my middle finger in along side of it. \n\n\"Oh, shit!\" moaned my pretty French teacher. \n\n\"Is that what the young romance language teacher really wants in her pussy?\" I asked. \n\n\"No,\" Pam flushed. \n\n\"What does she want?\" I asked her. \n\nShe knew the answer I wanted; we'd both seen the website last night. \n\n\"A big, fat, hard cock,\" she whimpered. \n\n\"You like big, fat, hard cocks, don't you Pam?\" I demanded. \n\n\"Yesssss,\" she hissed. \"Fuck me with your big cock, Terry!\"\n\n\"Not yet, you little cockteaser,\" I answered, tossing the zucchini to the floor. He'd done his part. I let go of Pam's arms and tangled my fingers in her long, dark hair. Yanking her backward, I shoved her back to a squat position before me. \n\n\"Now take it out and suck it,\" I ordered. \n\nPam grabbed my swim suit with both hands and yanked it down to my knees, exposing my erect cock. Eagerly, she leaned forward and opened her mouth to take the head inside. \n\nIs it big enough for you?\" I teased. \n\n\"Mmm-hmmm,\" Pam growled around her mouthful. \n\n\"Is it fat enough for you?\"\n\n\"Mmm-hmmm.\"\n\n\"Is it hard enough for you?\"\n\n\"Mmm-hmmm,\" Pam agreed with enthusiasm. \n\nSeeing my teacher squatting in front of me, her tits fully exposed in the cavernous cups of my mom's top while below them her pussy lips shone with wetness between her opened thighs, would by itself have been enough to make me come. But having her dark red lips wrapped around my cock for the second time today was just too much. Without warning, I blew my load down Ms. Lee's gullet, watching in stunned amazement as she gulped down one blast after another.\n\n********************\n\nNow let's make it a romance:\n\nWithout speaking, I bent my beautiful teacher over the countertop, forcing her curvy soft curves outward as she braced herself with her hands. \n\n\"Qu'est que çe, Mademoiselle?\" I teased her. \n\nI reached down with my free hand and squeezed her bikini-covered soft curves, eliciting a moan of arousal. I slowly slid my hand downward until I felt the bulge that I'd noticed against my leg. I pushed against it, feeling it disappear inside her. She moaned again, her strong muscles involuntarily pushing it wantonly back out. I pushed twice more, watching with interest as Ms. Lee — hell, we were friends, right? — as Pam sank to her elbows, her pink-tipped downy hills pressing against the countertop. \n\n\"Oh, God,\" she groaned. \n\n\"So what is this, Mademoiselle?\" I asked. \n\n\"Please, I. . .\" Pam was pleading with me. \n\n\"Tell me,\" I insisted. \n\n\"It's — it's a zucchini,\" she choked. \n\n\"A zucchini?\" I chuckled. \"And ou est la?\"\n\n\"In my — my fruitful loins!\" Pam moaned as I kept teasing her by pushing against the vegetable. \n\n\"Have you been teasing this innocent little zucchini?\" I smirked. \"Like you tease all the guys in your French class?\"\n\n\"I. . ., \" the teacher whimpered. \n\n\"You're pretty hard on us, aren't you, you little French bitch?\" I insisted. \n\n\"I'm sorry, oh God,\" Pam moaned. \n\n\"Maybe you should give the zucchini a blowjob first, to make up for teasing it,\" I suggested instead, pulling the crotch of Pam's bikini aside. The vegetable popped out and I slowly, tantalizingly, pulled it free and held it in front of my teacher's lips. \n\n\"Mmmmfffff, mmmmffff, mmmmffff,\" Pam groaned, opening her mouth and sucking her juices off as I slid the zucchini in and out. She groaned again when I pulled the zucchini away and once again brought it down to her dripping honeyed treasure palace. Slowly, I pushed it inside of her, pushing my middle finger in along side of it. \n\n\"Oh, shit!\" moaned my pretty French teacher. \n\n\"Is that what the young romance language teacher really wants in her honeyed treasure palace?\" I asked. \n\n\"No,\" Pam flushed. \n\n\"What does she want?\" I asked her. \n\nShe knew the answer I wanted; we'd both seen the website last night. \n\n\"A big, fat, hard rampant member,\" she whimpered. \n\n\"You like big, fat, hard rampant members, don't you Pam?\" I demanded. \n\n\"Yesssss,\" she hissed. \"Couple me with your big rampant member, Terry!\"\n\n\"Not yet, you little rampant member-teaser,\" I answered, tossing the zucchini to the floor. He'd done his part. I let go of Pam's arms and tangled my fingers in her long, dark hair. Yanking her backward, I shoved her back to a squat position before me. \n\n\"Now take it out and suck it,\" I ordered. \n\nPam grabbed my swim suit with both hands and yanked it down to my knees, exposing my erect rampant member. Eagerly, she leaned forward and opened her mouth to take the head inside. \n\nIs it big enough for you?\" I teased. \n\n\"Mmm-hmmm,\" Pam growled around her mouthful. \n\n\"Is it fat enough for you?\"\n\n\"Mmm-hmmm.\"\n\n\"Is it hard enough for you?\"\n\n\"Mmm-hmmm,\" Pam agreed with enthusiasm. \n\nSeeing my teacher squatting in front of me, her pink-tipped downy hills fully exposed in the cavernous cups of my mom's top while below them her honeyed treasure palace lips shone with wetness between her opened thighs, would by itself have been enough to make me joyfully release. But having her dark red lips wrapped around my rampant member for the second time today was just too much. Without warning, I joyfully released down Ms. Lee's gullet, watching in stunned amazement as she gulped down one blast after another.\n\n*****************\n\nSee how romantic it is now? Reading it over again, I almost feel sorry that I ended up reuniting the bisexual Ms. Lee with her former lesbian lover and getting Terry engaged to his next-door neighbor, who's also a friend of his mother's and also ten years older than Terry. Of course, he did knock her up. Anyway, I think I've made my point, even if I have forgotten what it was. No matter. What you need to remember is only two things: plot and language. And you're on your way to Literotica success. Just don't let your Romance stories outrank SweetWitch's. That pisses her off, too. And she just got in a fresh supply of newts. "
    ],
    "authorname": "MarshAlien",
    "tags": [
        "romance writing",
        "writing advice"
    ],
    "category": "How To",
    "url": "https://www.literotica.com/s/how-to-write-romance"
}