{
    "title": "How to Give a Man a Happy Ending",
    "pages": [
        "This guide is intended to help you give your man, and I assure you, for as long as your hands are on him and you follow this guide, he will most surely belong to you, an amazing happy ending massage. I assume you can already give a good massage, so this won't focus on the technical details of the massage, but rather how to heighten and eroticize the experience. There will also be some short vignettes for the prurient and perverted to read, even if uninterested in giving massages themselves. Enjoy! \n\nStep 1: Set-Up \n\nThe important thing to remember about the ambiance for a massage is that it should be like correct grammar and spelling. You're not trying to have the recipient focus on the music, the light, or anything else. It should simply be there to coddle the senses so that they can focus on touch, so that they aren't jarred out of the experience by anything distracting. Low light and soft music that barely registers upon the listener are best: white noise, nature sounds, and calming instrumental music that flows in one ear and out the other without leaving any sort of impression. Scents are good, as well, but again, should be only enough to keep the mind focused on the massage, rather than drawing attention to the scent itself. \n\nYou'll need to pick an oil for the massage. I like sweet almond oil, myself, but you'll have to pick something that works for you. I'd avoid a scented oil, just because it can be a bit strong and distracting. I've got a strawberry scented bottle of oil, but using it just makes the room smell like a dessert and I get hungry, and you don't want to be hungry while giving a massage because you might bite the wrong thing. \n\nMake sure that the room is a good temperature. You want your recipient to be comfortably warm, especially for any times when their towel is off their body. If the room's too cold, they may have a difficult time showing their excitement. If possible, it can be a good idea to warm up the towels beforehand. Just toss them in the dryer for a bit. They won't keep their heat long, but if the room's a bit chillier than you like, it can certainly help. \n\nI usually use two towels. A larger one to drape the body, and a smaller one to cover the eyes after their face is massaged. One advantage to having a second towel is that, with their eyes covered, your own movements are more likely to be a surprise. People are also less bashful if they can't see you, so your recipient will be more likely to be willing to let you work your magic. Additionally, the sensory deprivation will amplify certain other sensations. Be sure you have everything you need in advance so there won't be any interruptions. \n\nStep 2: Build-Up \n\nFor the actual massage itself, a lot of teasing is very important. You want to heighten their excitement and expectations before anything truly explicit actually occurs. They should be aching for your touch, for the relief that only you can bring them, long, long before you intend to actually succor them. \n\nWhile massaging a man's thighs, go as far up as possible. You'll find yourself brushing against their scrotum, but technically you're only massaging their leg, so there's a nice bit of plausible deniability there if things aren't yet certain. Reaching under their upper leg, too, is a pleasing sensation for them. \n\nOne place I especially like to tease is the perineum and surrounding areas while the recipient is still face-down. Find an excuse to massage his tight ass, such as how many muscles there are in that region, if you need one. While you're massaging lower, let your thumbs drift to the area between his balls and ass and gently knead there with your thumbs and knuckles. It's a very unique feeling, and he'll love that exquisite combination of vulnerability and pleasure that it brings him. \n\nOnce he's on his back, the face is an intimate area to massage. You can linger on his lips, rest your chin on his forehead, gaze into his eyes in case he opens them, things like that. It's also a natural time to compliment his appearance, telling him how you never noticed what a handsome face he has. If he has a beard, let your fingers run through it. \n\nAs you massage his broad, manly chest, be sure to pay attention to his nipples. Just a quick flick or two is enough to tease and get his attention, although you can massage his pectoral muscles for longer and just ensure your fingertips rub them especially. I think the stomach is under-rated for teasing possibilities. In my experience, your fingers under the towel, waltzing down his abdomen, will make him tingle in all the right ways. Wander down his happy trail and through his pubic hair, even bumping against his shaft while you caress his stomach. If you're particularly well-endowed, stand above his head while you massage his stomach, and lean down so that your plump, round breasts rest gently upon his face. It'll be a memory of mammaries he won't soon forget. \n\nWhen you massage his arms, find a good place to rest his hands. His arm will be totally in your control, so take advantage. If you're quite forward, you can guide his hand to your breast while you stroke his arms. Otherwise, you might guide it to your stomach or hip or thigh or cheek, depending on what you want to highlight and your relative heights. \n\nAnd lastly, the thighs are the best place to tease, if only for their proximity to your true prize. As before, go as high up as you desire. By now, he's hopefully rock hard, just waiting for your touch. If his towel is still covering him, you might move it just to expose one thigh, leaving it in the middle, where his hard shaft's eagerness might be enough to push the towel off of itself, exposing it to your ministrations. If his cock is exposed and up, a nice trick is to massage the thigh opposite yourself. That is, if you're standing on his left side, use that position to massage his right thigh, so that his hardness is between you and your goal. It's a wonderful opportunity to brush against his manhood with your hands and wrists oh-so-innocently.  \n\nPart 3: Climax \n\nAnd finally, it's the main event. I like to categorize the various ways to finish things into four broad categories. I'll explain each a bit and include a bit of a vignette to demonstrate. If I were to plot these on a graph because I'm a math nerd, the two axes would be his pleasure and your pleasure. Both of these are just purported pleasure, though. Obviously, in all these cases, hopefully both you and the recipient are thoroughly enjoying everything. But the difference lies in, outwardly, who is this supposed to primarily benefit? \n\nThe Nonchalant \n\nOne possibility is to approach the matter as nonchalantly as possible. Simply treat his cock as though it were any other limb. This technique is low on both your and his purported pleasure, because if an orgasm happens, it either wasn't intentional, or it wasn't a big deal. You were just rubbing and oops, or you saw a friend with some stiffness and you were there with a helping hand. It wasn't sexual at all. Just a few good pumps to get rid of that last bastion of stress, and all that tension came squirting out. \n\nIf you're giving a nonchalant happy ending, you probably won't even mention it. Once he's hard, you'll just move the towel aside and pump away casually until he finishes. Or you may not even give proper strokes, just massage it gently as you would his arm or leg, squeezing and rubbing, until all his stress goes away. When it is time for him to cum, you can make sure there isn't a big mess by aiming his cock either between his legs or by pinning it against his stomach so it all just goes on to his abdomen. The latter might ruin his orgasm a little bit, but it's not like that's a big deal, after all. \n\nOr if you're doing it more as a friend because this sort of thing isn't a big deal at all, you might ask him if he wants you to take care of it, and once he inevitably agrees, give him a quick finish so he can focus on the rest of the massage. But it certainly isn't anything to make a big fuss over. Just finish him off, wipe him up, and continue with the massage. His cock is another limb, no more special than any other. \n\nExample Vignette \n\nHer hands expertly massaged my thighs, kneading my aching muscles. And yet, despite how good it felt, I couldn't help but wish that she would notice my other aching need. My rock hard cock throbbed under the towel, apparently invisibly, despite its prominence. But Beatrix worked silently and patiently away at my legs. Maybe she, like me, wasn't quite sure how to address it. She had to have noticed it, after all. It was impossible not to. What was she thinking? \n\nWas she simply hoping it would go away? Was she disgusted? Flattered? Annoyed? Aroused? I wished I could hear her thoughts right now and get an idea of what was inside her head. \n\nShe finished my right leg and moved to my leg, her hands squeezing, her forearms pressing, and all my tension leaving me. I just sighed deeply and closed my eyes. If nothing else happened, this had still been an excellent massage, and I could always jack off as soon as I got home. Or as soon as she left the room, I reconsidered, my cock begging me for relief. Her hands left my leg, and I prepared for the massage to end. \n\nBut she wasn't done yet. \n\nI felt her hand land on my thigh and slide up...and up...and up... I swallowed. Her hand snuck under my towel and wrapped around my cock without any formalities. \"You need me to take care of this real quick?\" Beatrix asked. \n\n\"Sure,\" I said, too thrilled to quibble over her 'real quick' comment. \n\nShe nodded, a neutral expression on her face. She pumped away, steadily, unhurriedly, with the same firm grip she had used on my arms and legs. I couldn't help but groan, my pleasure building as she stroked my manhood. She pulled the towel down for easier access without missing a beat. I watched her hand move, her visage betraying no emotion. If she were enjoying herself, I couldn't tell. She had the same look as when she had been rubbing my arm: a look of focus, fixated on her work, but it was clearly just a task to be completed. \n\nMy hips bucked. Her hand felt amazing. I wanted this to last forever, yet I knew I couldn't last much longer. Already the familiar sensation of an approaching orgasm rose inside my loins. \"I'm going to cum if you keep doing that,\" I warned her. She simply moved the towel between my thighs and aimed my cock downwards. \n\nI groaned as that pleasure exploded inside me. I trembled in her grip. My body released and my essence gushed out of me. Her hand kept pumping, eking out every last drop into the towel, ensuring my climax was as efficient as possible. As soon as my orgasm subsided, she released her grip. \"Better?\" she asked me. I nodded. \"Good.\" \n\nThe Tease \n\nMy personal favorite is to be a tease. A Tease is doing this for her pleasure, not his, and doesn't really care whether or not he has a satisfying orgasm, or even any orgasm. He might just end the massage with blue balls, or a ruined orgasm, or if he's very lucky, he'll get a real orgasm, but only after you've thoroughly enjoyed making him squirm. \n\nYou'll graze your fingernails up his shaft, giving him just the barest caresses. You'll massage all around his package, your fingers exploring where his scrotum meets his thighs, and brushing through his pubic hair. You can even massage his perineum while he's on his back, forming your thumbs and forefingers into a diamond, your thumbs pressing against him below his balls, your forefingers on either side of his shaft, touching nothing sensitive, just reminding him that, at any moment, they could be. You'll use the towel to your advantage, keeping it draped over his cock, and then rubbing beneath it elsewhere, so the friction of the towel's motion relentlessly and torturously brushes against the head of his cock. He may even cum without you touching his shaft directly, if you can do it correctly. \n\nYou'll need to be very patient. He's going to want more than you're giving him, and by the end, he'll be begging for you, aching for your touch. Don't feel obligated to give it. If he wants to cum, he has hands, doesn't he? You can make him jack off for you while you watch, providing support both moral and physical, caressing his balls and thighs while he strokes away. \n\nExample Vignette \n\nHer wrist bumped against my cock again. I gripped the sheets and tried to ignore it, but I found the task impossible. She was doing it deliberately. There she stood, to my right, while massaging my left thigh, my hard cock jutting towards the ceiling between us, and yet she refused to move to the other side of me, instead insisting on keeping my shaft between her and her task. Her little \"accidental\" brushes and nudges were more torturous than satisfying, enough to nudge me closer to orgasm without giving me any true pleasure or relief. \n\nI wanted to ask Jenny to just finish me off. I wanted her to rub my cock against her pert, petite breasts and her pebble hard nipples, to engulf it with her plump lips, to take hold of my cock and give me some semblance of a real orgasm before I simply lost control and had a helpless, ruined jizz in front of her, but what little dignity I retained kept me from outright begging for it. She had to take pity on me eventually, didn't she? \n\nOne of her hands departed from my leg, tracing a trail up my thigh and towards my cock. For a moment, I thought I might be about to receive what I so dearly ached for. But alas! Her fingernails grazed up my trembling shaft, just barely touching, the lightest whisper of a caress, all the way up my cock, until they passed my head, and then she stopped and waited. My cock twitched, bringing a smirk to her face. A few moments later, she did it again, watching my erection for its reaction, ignoring the rest of me. It was evident that my cock was her goal and her toy, and the rest of me was superfluous. \n\nMy loins tingled and prickled. God, I knew I was close. I tried to distract myself and declined Latin nouns in my head, but another pass of the edges of her sharp nail up my shaft and my mind turned into pulticulam. She began to caress my uppermost thighs, her hands tracing the edge of my scrotum and pressing firmly into my thighs. \n\nThe pleasure inside me began to waver and topple. I knew nothing could stop what was about to happen. I reached out to grab her round, tight ass, but she dodged expertly. I grunted as my cock betrayed me and I came, helplessly, untouched, my cock flailing wildly, spurting cum as Jenny laughed uproariously, pulling her hands back to avoid the mess. \n\nMy orgasm ruined, my cock deflating, covered in my own semen, my arousal only intensified rather than satiated, Jenny looked from my mess to my face. \"Wow, just from your thighs, huh? That's almost impressive, Quickdraw.\" She gave my tamed cock a playful pat. \"Good boy. Maybe next time you can last a little longer. What do you think?\" \n\nThe Professional \n\nAnother option is to approach it as a job to do. You may even negotiate beforehand, either as part of a roleplay or for real, depending on just how close you are. If you do ever need to negotiate with a man, I strongly recommend waiting until his hard, throbbing cock is in your hand. It gives you quite a bit of leverage. \n\nOnce you start, though, it's for his pleasure, not yours. To you, it's just a job. He might grab your ass roughly or firmly take hold of your tit while you stroke him to completion, and you just let him. The customer is always right, after all, regardless of where his hands wander. \n\nUnlike the previous two techniques, which are pretty strictly hands only, the Professional can use other body parts, too: her mouth, her cunt, her tits, if nature has blessed her thusly, and so on. Try to get him to take a bit of a dominant role, giving instructions for you to follow. If he's a bit shy, you may need to prompt him a bit, but once your hand is wrapped around his cock, his imagination should begin flowing. \n\nIf your recipient is really into the whole happy ending massage kink, this offers a lot of opportunities for you to roleplay a bit. Asking him, \"Is this okay?\" as you massage various parts of his, negotiating for a payment before you stroke him off, acting like you're his side piece and making references to his girlfriend or wife, or faking a thick accent can all help with that. \n\nExample Vignette \n\n\"Please turn over,\" Indra instructed me. I did so, waiting for her to drape the towel back over me. But she didn't. She walked by my hips and stationed herself by my exposed crotch. She began to massage my thighs eagerly, her hands dancing within inches of my cock and balls. Her intention was immediately obvious. I grabbed her ass firmly in my hand, squeezing her plump, tight ass while she worked. She squeaked, but submitted. \n\nIt wasn't long before the twin sensations of her derriere in my palm and her hands so close to my cock brought me a full erection. She wrapped her hand loosely around my cock and asked me, \"Do you want me to massage her?\" \n\n\"Yes, please.\" \n\n\"How much you pay?\" she asked, her hand lazily stroking my cock. \n\n\"What's the usual?\" I asked. I felt myself at a distinct disadvantage in this negotiation, what with my desperate eagerness on full display, yet I decided to try anyways. \n\n\"Sixty dollars.\" \n\n\"Can you make it forty? Sixty's a bit much. My girlfriend'll notice.\" \n\nAnother stroke of my cock. \"She won't find out, it's okay. Sixty?\" \n\nI groaned. It was getting difficult to maintain my concentration and keep myself from finishing embarrassingly quickly. \"Fifty?\" I compromised. \n\nHer grip tightened. \"Fifty.\" Her hand quickened its pace. Her other hand delved between my thighs, found my balls, and caressed them in her palm, sending me into a state of erotic relaxation, my body surrendering to her touch while my cock was ready to blast off at any moment. My hand left her ass and reached to her chest. I grabbed her tit hard and squeezed roughly. \"This feel good?\" she inquired. \n\n\"Very,\" I panted. Her firm breast filled my hand, her lack of bra both noticed and appreciated, the plump flesh an invitation to squeeze and savor. \n\n\"Your cock is very handsome. Nice, big dick,\" she said, taking hold of it with both hands, sliding her hands up in alternating succession, as though she were pulling the rope to close the curtains at a theater, creating a sensation of an infinite stroke without beginning or end, pulling my pleasure right out of my body and into my cock where it collected and condensed into the beginnings of a orgasm. \n\nI felt the end coming. I gripped her breast as my hips bucked involuntarily. She switched to one hand and pumped me fast and smooth and with a purposeful dedication, her hand massaging my balls to help me on my way. That ecstasy inside me exploded forth, my entire body shaking, quivering, as pure, intense pleasure coursed through me like tingling electricity. My cock spasmed, my cum gushed out of me, onto her hands and my crotch, covering us both in an ivory glisten. Her pumping slowed as my ejaculations weakened. She gave my balls a playful tap, as though checking that they were empty. Satisfied that no more was to be milked out of me right now, she got a warm, moist cloth and tenderly cleaned me up, gently wiping my cum from my body, leaving me clean and satisfied. \n\n\"Worth it,\" I whispered to myself. \n\nThe Girlfriend \n\nHowever, you may prefer a more intimate approach. This technique is for both of your pleasure, and is the most romantic. Kiss frequently and everywhere. Use kisses in combination with your hands to massage his body: his face, his chest, his abdomen, his thighs, and his cock. ",
        "Making off, where you stroke his cock while kissing him passionately, is definitely encouraged. It's a lovely sensation, occupying both his lips and cock at the same time. You can do other combinations of carnal and romantic, too, like jerking him off with one hand while the other caresses his face lovingly. Having him finish inside you, either your mouth or your pussy, is strongly recommended, as well. \n\nBe vocal. Be sweet. Tell him how much you adore him while you coax him to climax. Make sure he knows just how much you love him and how much you appreciate everything he does for you, and that this massage is his well-earned reward. Climb on top of him and guide his big, thick, hard cock between your lips and ride him, letting him stare at your jiggling breasts, until he empties his essence into your womb, and then describe in exquisite detail how good it felt. \n\nOr you may prefer to take his shaft between your lips and bob your head until you can swallow every last drop of his delicious cum, locking eyes with him the entire time, holding his hands in yours so he can grip them tightly as his body convulses and his cock and balls pulsate as he surrenders to his orgasm. \n\nExample Vignette \n\nLauren kissed me deeply, our lips pressing against each other, sending tingles down my spine as her hand ministered to my cock, overwhelming me with disparately pleasurable sensations, romance and carnal lust both swelling inside me. Her lips detached from mine just long enough for her to gasp out, \"I love you,\" before returning to their osculations. \n\n\"You're the best thing in my life,\" I whispered back, my hand finding her soft, pliant heart and gently caressing her breast, her nipple stiff against my palm. I meant it, too. All I had had to do was mention how sore I was after our day of hiking and she had practically pushed me onto the bed so she could massage my aching muscles and make all my tension disappear. Of course, she had had an ulterior motive, but I wasn't complaining. \n\n\"Ready for your happy ending?\" she asked. \n\n\"This isn't already a happy ending?\" \n\nShe shook her head. \"Nope. This is just the happy beginning. Then there's going to be a happy second act, a happy rising action, a happy climax, a happy denouement, a happy sequel...\" she babbled on. \n\n\"Just...I'll take whatever's on the menu.\" \n\nShe kissed my cheek. \"Good choice.\" She climbed on top of me and guided my cock between her soft, smooth lips. I watched, entranced, as my manhood vanished inside of her and she began to rock herself back and forth on top of me, her quim gripping my cock with no intention of letting go. \"Put a baby in me,\" she begged. \"I want you to cum inside me.\" \n\nMy cock throbbed from her words. I grabbed her hips and helped guide her movements. \"You mean it?\" \n\n\"Yesssss,\" she hissed. \"I want it so bad, you have no idea. I want your baby inside me. Make me yours. Make me a mommy.\" \n\nI needed no further encouragement. I squeezed her ass and helped her ride my cock, eager to cum inside her, to fill her womb with my seed and essence, to mark her very body as belonging to me. Her firm, pert breasts bounced above me, her nipples hard, her long, red hair tumbling down her body like rivulets of fire. \n\n\"I'm going to cum soon,\" I told her. \n\nWithout a word, she leaned down close to me, our chests together, our hearts beating as one as I wrapped my arms around her and held her close. My cock pulsated and throbbed as I came inside her tight, fertile cunt. \"I can feel it,\" she whispered against my ear. I filled her, flooding her womb with my passion, pushing my manhood as deeply into her as I could, penetrating her, impaling her with my tool in an attempt to ensure success. All of my pleasure, all of my physical bliss, flowed through my body and into her. \n\nOnce I had finished, I rolled her over. \"Don't let a single drop come out,\" I ordered her sternly, kissing her nose. \"You just lay there like that. I'll bring you some blackberries and hot cocoa. Sound good?\" \n\n\"Sounds good.\" \n\nPart 4: Clean-Up \n\nBut you're not done yet. If you're not planning to clean up orally, licking up that creamy proof of a job well done before safely storing it away in your stomach, savoring the salty satisfaction of every last drop, I'd recommend having a warm, moist face cloth available to clean him up. It's an intimate, tender touch, and afterwards you can cover him back up with the towel and finish the massage. \n\nOnce you're finished, give him some privacy to get dressed. I usually make sure to let him know just how much I enjoyed the massage. Feel free to set his next appointment, as well. I'm certain he'll be eager to do so. Enjoy yourselves and have fun! \n\n* * * * * \n\nThank you for reading. I hope you enjoyed the story. Please be sure to vote and leave a comment. I'd love to hear what you think! Check out my profile for more information about me and my stories."
    ],
    "authorname": "BlowjobSuzuki",
    "tags": [
        "creampie",
        "guide",
        "handjob",
        "happy ending",
        "happy ending massage",
        "how to",
        "massage",
        "ruined orgasm",
        "teasing",
        "vignettes"
    ],
    "category": "How To",
    "url": "https://www.literotica.com/s/how-to-give-a-man-a-happy-ending"
}