{
    "title": "How to Pleasure a Lady - & Yourself",
    "pages": [
        "Whatever sex or age you are, sex plays a great part in ” Mr, Mrs, or Ms Average’s” life. Invariably, each of you have aims, hopes, and expectations of certainly achieving great orgasms for yourself – and most likely – giving them to your partner. Unfortunately, few know how best to do this.\n\nCunnilingus; (going down on her) Fellatio; (giving a blow job) Masturbation, Intercourse: These are the usual paths to Ejaculation/Orgasm. (Getting off.)\n\nIn the case of self-gratification by masturbation, males usually do this reasonably satisfactorily by using their hands to stimulate their penis - so producing an ejaculation. With females, a much more varied source of body areas, techniques and objects are available to assist in achieving orgasm. Stimulation of breasts, clitoris, labia, and internal vagina (and other erogenous areas) are all used singly, or in various combinations, to reach a single (or series) of climaxes. I intend to concentrate here mainly on how best the male can pleasure his female partner. Taking any woman to the point she has to orgasm is a thing any guy can do to any gal – it just needs ‘know-how.’ However, I will list first a few techniques females can employ to attain orgasm in those moments alone when they feel randy –\n\nSome Female Masturbation Techniques\n\n“Tickle Your Fancy”:- Anything soft will do for this: paint brush, feather, bit of velvet! Start by tickling your nipples, then breasts and belly. Move it around your body, but don't touch your vagina. Then start on your inner thighs, back to nipples and belly, and then move down to your thighs again. Keep this up as long as you can stand it. The result is usually very intense.\n\n“Ice-cool Ecstasy”: - Whilst lying naked and comfortable, have some ice-cubes to hand. Begin by slowly rubbing a cube on your breasts. Circle your nipples with it, and slowly proceed to move the cube down your body, finally on to your clitoris and labia. There is nothing like the icy temperature to set your nipples pouting erectly, or giving your clitoris an extreme energy rush.\n\n“Lazy Washday Vibes”:- Whilst they are switched on doing the wash, park yourself on top of your washing- machine or dryer. Adjust your position and legs to get the full benefit of the vibrations. Cross your arms and relax. Let the vibes do the work until you cum and cum again. \n\n“The Roller”, or “Tweeker” technique:- Using thumb and index finger, hold your clitoris between them, then roll it gently between them. Adjust the speed and pressure best suited to you to achieve an orgasm. Paused: • Right before you are about to climax, Stop. Relax a little, and then return masturbating. A few times doing this will make the end=result more powerful. \n\n“The Clit Grinder”:- Grind your clit against any suitable object: Door, chair/sofa arm, and rock back and forth against it like you would a thrusting penis Use some fing help if you need it – chances are you won’t.\n\n“Toad in the Hole”:- Stick a warm sausage inside a condom and stick it inside your vagina (hang on to the condom end!), then just enjoy it, or use your lower muscles to hurry things along. Unlike a penis, they don’t go soft on you at the instance when you need them hard most! (More enterprising ladies may prefer a sizeable cucumber!)\n\n“Jetting Off”:- Whilst using a removable shower head to play water on your clitoris is a favourite ploy, your bath may not have one attached. An alternative to this is to have an empty liquid soap, or shampoo bottle in the bath with you. Fill it with water, hold it very close to your clitoris, and squeeze. The water jets out onto your clit – and WOW!\n\n“Tap Dance”:- Lay on your back and pop your index finger on to yourr clitoris. Start lightly tapping it rhythmically, and continuously. Adjust the speed and pressure as the urge strikes you, until you just have to cum.\n\n“The Seamstress”:- You need a pair of tight jeans for this. They have a stout seam runs near your clitoris. Sit in a chair and rock back and forth whilst moving it across your clit. That gets most females going.\n\n“Polish the Pearl”:- using an electric toothbrush is best for this. Gently pop it onto your clit, and start ‘polishing’ it all over. Every gal I know that tried this says it is simply the best.\n\n“Strip Tease”:- Lay down naked on your back with a small pillow by your side, and finger- tease yourself for a short while. Then roll over onto the pillow and hump it until you are about to orgasm - then stop. Repeat this as often as you can stand it. When you DO ‘explode’ it feels like a bomb went off inside.\n\n“Good Vibrations”:- A decent size waterproof vibrator is needed for this: Get naked, lay and relax, switch on the dildo and set to work .lightly caress your my whole body – except your vagina. Give plenty of attention to nipples and breasts. Wait until your nipples are gorged and rock hard. By that time your pussy is hot, wet, and begging for attention. Use your dildo to start pumping in and out of your vagina, whilst using your other hand to rub your clit in a slow circular fashion. You do what comes naturally as your body starts to spasm. Just go for it…\n\n(Many women never achieve orgasm through intercourse. A surprising number never experience an orgasm throughout their life. This has to be sad, and it is not so much the lack of desire to do so, as their own or partners’ lack of knowledge on how to achieve/induce one: It is my aim to pass this knowledge to both, in the writing that follows:)\n\nI defy any man to fail to induce orgasms in his partner if he heeds my instructions. I defy any female desiring to have an orgasm to not get off if she is at the receiving end. First requisite is that each trusts the other and feels comfortable being intimate with them. This is more important for the female than the male. In general, if a guy is feeling randy he is as able to get off ‘shagging’ a knot-hole as he is a 36” 24” 36” sex bomb. Whilst most females can get off by themselves, and most by having a partner help, how frequently, how satisfying, and how intense, is proportionate to the trust they have in their partner, and his sexual skills.\n\nDoes penis size matter? It does not need to. (Though in fairness, I would sooner have ten inches than ten centimetres attending to my internal needs!) However, the bog standard average five point zero three inch American Male’s appendage will induce the desired effect admirably. Whilst a ‘quicky’ will keep a man happy, it invariably leaves his partner disappointed, unfulfilled, frustrated, and feeling cheated.\n\n“Bang, bang, thank you Ma’am” is okay for the guy: It’s as much use to the girl as a top hat with sleeves in. The moral to this, men, is to treat your partner. That is right – give her a treat each time you screw with her – leave her satisfied and content. Believe me it’s better for both of you than your ‘bang, bang – shoot your load, - roll over, grunt, fart, and start to snore!\n\nIt is unfortunate, but so many females are so badly disappointed with their partner’s efforts, they find it best to ‘ let him get his rocks off quick’, and simulate an orgasm to keep him happy. The guy thinks he is a super-stud and is quickly snoring loudly – resembling a bear with asthma. Few men know when the woman is faking it, and ‘experts’ have you believe you cannot tell – but you can: Next time you think you are an 'all-pleasing rampant stallion', check her breasts and nipples. Note the difference between them when she does have an orgasm – and when she is just kidding to keep the peace. (Note: You may have to catch her at it alone in the bathroom to do that!)\n\nJust for once – next time you decide to ‘bang’ her – try making gentle love to her instead. It is worth the effort for both of you.\n\nApproach lovemaking with a purpose: That purpose should be to pleasure your partner. (In doing so, you pleasure yourself.) Bringing a female to orgasm can be likened to blowing up a festive balloon. It needs handling carefully (no fingernails causing damage), and takes just a little patience and effort to get things going. Women resemble a balloon (not literally, ha, ha,): Often a moist tongue and kiss around the neck makes the job easier. It is a little hard to get her build-up started – just as it is to get the first puff of air into the balloon. However, once that first step is over, the rousing of her sensuous emotions becomes progressively easier as you fill up her emotional balloon.\n\nAs with the balloon, do not rush too much once you are on the way. Feed her emotions as you would the balloon, taking care not to blow and burst it in one big rush. Pause for a moment to take a breath. If the balloon had a life of its own, it would want to be filled to brimming in a few large breaths. Your partner should now be feeling the same. Hold her, admire her, and tease her. Make her want it – then give her a little more. Kiss her tenderly, slowly, gently. Fondle her – but do not grope her. Keep concentrating on her upper body and breasts, only occasionally letting your hand or lips hover anywhere near her pubic mound. Caress her, stroke her, lead her right to the edge, and then ease off. Move to slightly less erogenous areas. Stroke her arms and wrists. Keep her hot, but tormented. She wants to get on with it, wants to feel you inside her, make her wait.\n\nVary your caresses: Be gentle, fondle her breasts, circle but do not touch her nipples. Use your mouth and flick your tongue around them. You will feel her desire building. Her thighs will strain involuntarily, hungry for you, begging for attention. Making love is an art. Women love the foreplay: the embracing, kissing, the sensuous touching, and the feeling of being loved. This is the reason we concentrate initially on any part of her body but that all- important spot between her legs.\n\nIf you go straight to her ‘pussy’, subconsciously she thinks all you want is to screw her. Of course you do, but let her know that you love all of her. Let her feel that you love her completely – not just her pouting hole. For this very reason, you should always follow a few rules. Even if she is just a ‘one-night-stand', follow them. Word will soon get round that you really are a stud, and other females will seek you out. (Give a ‘one-nighter’ the ‘whip-it-in-shoot-whip-it-out-and-wipe-it’ treatment, and you will soon find it harder to pick up a ‘piece of stray’).\n\nIf she is a steady partner or wife, by following these rules you will keep her happy and eager. (Convenient ‘headaches’ become a thing of the past). She will look forward to each new session with genuine desire and expectation. Her vaginal juices will start to flow, and – if you could see it – her pussy is already starting to gorge and pout in anticipation.\n\n1/ Treat her as your best friend. Convey to her that she is the best thing in your life. Even hold and squeeze her hand. Gaze into her eyes; look at her with love filling your own. Look often and long into her eyes as you start your lovemaking.\n\n2/ Let your caresses and kisses cover every part of her body (except her vagina. In seconds, you turn her whole body into one complete erogenous zone. Include her hair, ears, neck, eyes, shoulders, inner/outer arms, hands, between her breasts, thighs, buttocks - legs, feet, toes even.\n\n3/ Vary your order (never follow a set routine.) As you feel her respond, tease her by including brief caresses and kisses to her inner thighs, then gaze into her eyes again before continuing to stimulate other areas.\n\n4/ As you gauge her heightening excitement and pleasure, intersperse your kisses and caresses with gentle massage and sucking of ears, breasts, and elsewhere. As you do this, so you build up longing, and that all important thing, trust, in you.\n\n(Few women even know what a good lover is – far less ever meet one…)\n\n5/ Enjoy what you are doing, and let it show. Whether you have had her regularly, or it is your first time together, surprise her. Show her you really are a good lover. Do not just go for her ‘LTP’ (lips, tits and pussy) – most males do that – surprise and delight her by treating the rest of her body. Do it with unselfish generosity. It will be a new and very pleasing experience for her, she will respond filled with emotion.\n\nTo males, sex and love do not necessarily go hand in hand. Love is one thing: having some pussy is something else. Love to the man is an emotion: ‘Getting his rocks off’ is an instinctive urge. Few females are like that – or will admit even it to themselves.\n\nIt is woman’s nature to be wanted. Her desire is to be appreciated. To her, sex is the end-result of a loving relationship, and emotional intimacy. By your above action you have created the necessary trust and bonding. To her, you are no longer a partner just after his oats - you are as one with her, your loving emotions deeply entwined. So much so, that the desire to be sexually intimate with you is no longer propelled mostly by a desire to please you – or get you off her back – it has become a genuine need and desire on her part to both release her own emotions, and to give pleasure to her lover.\n\n(And to think! Here she is almost begging for it, and you haven’t even touched her sexual organ yet…)\n\nUnless you indulge in this foreplay, just ramming your penis inside her and thrusting, invariably makes her at least a little sore. She knows she has no chance of getting off herself, so fakes an orgasm to get it over with.\n\nOnce you are adept at the above, it will not be unusual if she has already had one or more orgasms – but she sure as taxes will be hungry for that Dick of yours to slide in and give her the ‘really big one’.\n\n6/ Having gotten her into a highly aroused, and receptive state, it is time to give her ‘love-nest’ some attention: Let your hand just brush her pubic hair (or where it was if she shaves it), and then slide it in between her thighs. Cover her whole vagina with your palm for a moment, hold it, even give it a gentle loving squeeze, then use a finger to go between the lips. (At this point she usually moves to part her legs, so exposing herself fully to facilitate you giving it the full attention it seeks. \n\nUse your fingers to pleasure her external bits. She should be well moist, but you can always wet your fingers, or use your mouth to apply some spittle lubrication. Pay most attention to her clitoris – always bearing in mind it is an extremely delicate and sensitive organ.\n\nBy this time you have probably had several ‘hard-ons’ yourself, and your balls may well be aching to shoot their load. If you have gotten her where both you and her want her to be emotionally, and have not already done so – and it is wise to use a condom – this is the time to do so. Most partners are both willing and eager to fit this on for you.\n\n7/ With protection fitted – if desirable – it is now time to get down to the real business of actual intercourse, but – once again - do not rush it. Okay, you both want it, however, her pleasure will be all the more if you continue your ‘teasing’. Start by rubbing your penis head around her inner lips, and clitoris. Slide the shaft up and down her clitoris a few times.\n\nShe will be wondering why you are not sticking it in her. By now, she will know you are rock hard and know you could drive it home. Even if she wants it so badly she urges you to ‘give it to her’, hold back from doing so. Tease her some more by just touching her vaginal opening with it, and then use it to rub her clitoris again. This clitoral stimulation is almost too much for her – she wants that Dick driven right home inside her – but, however much she indicates by words or thrusting to get it in her - resist.\n\nBy attending to her clitoris, you have her aching for an orgasm. So, tease her more – by feeding just your knob into her. Ease it in and out slowly. However much she wants more, make sure she only gets your knob for starters. Then slowly, as you go in and out, feed her another inch, and then another. Resist giving her more. Keep at least half your length from entering her.\n\nShe will become even more aroused. Because you both so want it, but are not getting it, in effect you are both holding back. Keep teasing her until you just can’t take it any more. Her orgasm will have built up to near its peak. Go in deeper a couple of times, it will be too much for her. At this point really drive home.\n\nDependant on your partner, she may just want you to press and hold hard as her orgasm floods over her. Others want you to keep ramming fast and hard. (It is up to you to do what she wants you to do) – either way, you will have as good an orgasm as you have ever had. More to the point, your partner will also have had a real, and genuine one herself. It may well be her first – it will almost certainly be the best she ever got from a guy.\n\nBelieve me, even the most frigid of women when treated with patience and loving care in this way, almost scare themselves by having an orgasm which almost blows their mind.\n\nNow for the bonus of all this attention: If you can get yourself hard again quickly, you have gotten her so aroused you can bang her and bang her again. (Yes – really BANG her. No teasing necessary now, and probably for the first time in her life she will get a series of multiple orgasms. Hold back your own as long as you can and she will continue getting orgasms. Kiss and tongue with her now, and you will have another surprise: Her orgasmic state is reflected in her mouth juices. They become delightfully intoxicating, deliciously sweet, like finest honey. Once you have tasted this with a partner you will want more: It is almost like having a full body orgasmic sensation yourself, and sends shivers right through you. It is almost like a drug – you will want it more and more…\n\nSo endeth my first lesson … But there is more:\n\nA few hints on getting and giving good oral sex, and a few more bits on orgasms and things.\n\nThis First Part Is For The Ladies:\n\nHow to give a good ‘Blowjob”.\n\nSeveral experts have offered views on the best ‘Blow Job’ Techniques, both on the WEB, and in books. There follows some information from my own experience, and those of others culled from different sources: \n\n“Start with gentle teasing, by licking the man's testicles and the shaft of the penis. Make sure your lips are wet and use lots of saliva lubrication. Blowing on his penis with your hot breath will also give him considerable pleasure.\n\nGet yourself into a position so the he can watch you at work This is a real turn-on for a man.\n\nUse your hands for an extra bit of teasing: run them all over his testicles and genital area. When you start to feel him squirm it is time to start on the next phase: Holding the shaft, take his penis head into your mouth. Purse your lips together to forming a sealing ring around it, and imitate a vacuum tube, by gently sucking on the head of the penis.\n\nUse lots of saliva for lubrication, and concentrate almost totally on the head of the penis – just occasionally taking him all the way inside you mouth. Whilst doing this you can lightly stroke the shaft with one hand as you would if masturbating (wanking) him off.\n\nNeed a little variety? Try an ice cube or a mint in you mouth.\n\nIf you want to really excite and please him, give him some ‘Deep Throat’: To do this right you need practice in keeping your throat as relaxed as possible. At first, you get a natural gag reflex. Just like a sword swallower, with practice the urge to gag ceases. (Practice with your finger, or a peeled banana.) Unlike a sword, his penis has no sharp edges.\n\nAfter teasing him until he is near ready to shoot, start using an up and down motion on his head and shaft. Keep your lips pursed tight and proceed to take as much of his full length in and out as you can. And keep one hand fondling his testicles and under his ass. The average American penis is 5.03” it should slide home with no effort. (With practise you can ‘deep –throat’ double that in comfort.) What you have to decide next is:",
        "Do I Spit it out or Swallow?\n\nYou will know when you have brought him to the point of no return, and he is about to spurt semen: so it is ‘make your mind up time’. Some guys prefer to drag their Dick out, and do the last bit of wanking themselves. Most love it if the girl will suck them right off, and swallow the cum as it spurts. Many girls prefer to give head this way too, but you decide - If he doesn’t pull first out first!\n\nBlowjobs are also a great foreplay activity: He’ll last longer for you if you give him one prior to a passionate lovemaking session.” _ _ _ _ _ _\n\n“Dr Mel says: A blowjob is oral sex on a lad. How do you do it? Like this...\n\nWisely. Only if you want to - not because someone asked nicely - And definitely not because you think you should.\n\nSafely Oral sex can cause infection. Who needs an STI in the mouth? Flavoured condoms are like sweets, which don’t rot your teeth. Fabulous.\n\nLegally Wait till you're 16. • Expertly Practise on your finger first • Slowly There’s no rush. Taking a deep breath and nose-diving your partner till your jaw aches is unnecessary. Relax. • Thoughtfully Ask him what feels good. Talk with your mouth full if you have to.\n\nGently Avoid teeth. Think lollipop, not stick of rock. And you don’t need to go too deep - gagging is no fun.\n\nCarefully The most sensitive bit of the penis is the top, particularly on the underside. \n\nExperimentally As the saying goes: 'Suck it and see'.” _ _ _ _ _ _ _\n\n“Pleasure Areas” Skill is required to suck your man's cock and provide him with the highest degree of pleasure possible. While his erect penis points toward the ceiling, cup his balls in one hand and gently, using only your tongue, lick softly, but carefully along the entire underside of his erect organ. As you suck along the underbelly you will learn those areas that give him the greatest pleasure when your tongue is touching them. Unless he is made of stone, your partner will provide you with vivid clues as to which areas are most pleasurable. As you discover these areas of enhanced pleasure concentrate on them.\n\nFor most men the most sensitive area will be the point where the ring (or corona) of the head and the foreskin are attached. Or were attached prior to his circumcision. By continued licking and tapping along this area with your tongue, you are going to bring forth a geyser. If you are not skilled and you want to please him in a hurry I suggest that you get him off in this manner in order to become familiar at first hand with the nature and delight of his climax.” \n\nClimax As he is getting ready for climax, you will note changes in his penis. These signs will be the same every time he climaxes so you can prepare for his cum properly. The head of the cock may swell somewhat larger then it is during normal erection. He may thrust his hips forward hurtling out his cock with his cum. Usually, just prior to the cum, a clear drop or two of fluid will appear at the tiny, lovely lips at the tip of the cock. When you see this or feel the opening at the meateus through his condom you know that the ‘moment of truth’ is at hand. Launch the torpedoes, full cum ahead!\n\nTechniques\n\nThe best position is by kneeling between his legs and approaching his cock from the bottom rather than from the side or the top. Try the various positions I describe later and see what works best for you and your partner.\n\nMouth Circle Place his stiff cock inside your mouth but do not tighten your lips around the shaft. With your head begin a circle motion. The cock will slide to different places in your mouth as you continue the circle motion. Watch your teeth on this one. A kneeling position will suffice but it is also effective when your partner is on his back and your head is directly over his cock. The circle should be executed in both clockwise and counter clockwise motions in a slow purposeful manner. When the technique is performed correctly, it means many hours of unadulterated pleasure.\n\nLollipop With your man sitting in an elevated position and you on your knees in front of him lift his hard cock to reveal his balls. With your tongue, find the underside of his balls. Now, while resting his balls on your wet tongue lick in an upward motion, to the very tip of his cock. It is permissible to use your hands in this technique. It is better to do this technique several times in a row - like licking a lollipop.\n\nCocksucking Slide his cock into your mouth but not deeply by sliding your moistened tongue lovingly over the head until your lips close around the shaft at the point just behind the corona. Encase the shaft of his penis with your hand. Now you have several options. Try twisting your head from side to side making sure your moist lips stay in contact with the coronal ridge. While doing this gently move your hand up and down the shaft. \n\nWhen he climaxes he may want to push your head further down the shaft of his penis. He wants to envelop you with his cock. As you are learning his climax you will miss the fine points if you deep throat at this time. Instead gently suck around the corona as he climaxes so that you can intensify his pleasure and increase the force of his orgasm. As you gain more experience you will be able to tell exactly when his climax is approaching and you will be ready for that initial spurt.\n\nRefine this basic technique and heighten his orgasm by placing your thumb at the very base of the penis in such a way as to block the tube through which the cum spurts. The semen cannot escape even though he is spasming and going through the reflex action of ejaculating semen. If at the same time you suck vigorously on the head of his cock, you can delay his cum for several long moments. When you finally allow the cum to spurt, it will last much longer and be just as intense as a result. Even though you delay the cum for only a few short moments you will be surprised by the intensity of his cum. \n\nHis Balls Here are two objects that can enhance your partner's feelings more than any other. Begin by gently licking his balls with your tongue and caress his cock with your hand while you are bathing his balls with your tongue. Thoroughly wet them with your tongue before taking them into your mouth. By giving the balls a complete tongue bath prior to taking them into your mouth, you will have pressed these hairs down along the surface of the sac and will not inadvertently cause pain by pulling on them. Try stroking his perineum, the area between his balls and anus. Some men like to have their prostate massaged during oral sex as well. This is accomplished by placing your finger up his ass.\n\nQuickie Blow Job Place your lips around the head of your partner's cock and twirl your lips wetly and gently around the coronal ridge at the back of the head of his penis. This does not require any great cocksucking skill and it works simply because this is the area that is most sensitive on his cock. It is not necessary to be a skilful cocksucker. All that is necessary is for you to find the most sensitive area around the coronal area. By sucking on this area of his cock continuously, you will produce a quick powerful cum. It is not necessary to bob your head up and down on his cock to get him off.\n\nSixty Nine 69 is not always the perfect way to provide your partner oral satisfaction. Inadvertently, one of you will \"let up\" your end in order to experience the subtle pleasures the other partner is giving you. Actually, I believe that sixty-nine is the ultimate pleasure. Done correctly and unselfishly when both of you are completely in tune with each others’ innermost desires, the sixty nine is the ultimate.\n\nDeep Throat One of the first things you encountered when you first started to suck cock was a gag reflex. Most men seem to want to force their cocks down your throat as far as they can get it. Particularly at the moment when they cum! The biggest obstacle to taking all of his cock down your throat is the fact that there is a bend of almost ninety degrees behind your tongue leading down into your throat. So, the first thing to do is get the cock past that angle. Get past the angle of the dangle!\n\nIn order to practice this, get in a position where you can turn your head in such a way that your mouth and throat lie almost in a straight line. The best position to accomplish this is to lie on a bed so that your head is near the edge with your body sprawled across the bed so that your head is tipped sharply back. This position will put your mouth and throat nearly in a line and will allow your partner to approach you in such a way that insertion of his cock can be made so deeply that his pubic hair presses against your lips.\n\nThe natural tendency of the body is to gag when a deeply thrusting cock is being forced down your throat. You can overcome this tendency by completely relaxing your throat at moment the insertion is made. It is equally important that you maintain this relaxation during the entire deep throating. Let him put his cock down your throat and hold it still while you find the most comfortable way to proceed. Because of your position, you will not be able to move or to offer him any greater stimulation than simply keeping your mouth tightly closed around his throbbing cock. If you are able, try to stimulate his underbelly with your tongue, do it!\n\nYou will only be able to relax and take his cock in this way if you completely trust him. Your partner is in full control. He must initiate and maintain all the motion. Now he begins an in and out movement that is just like fucking. He should start slowly, especially if this is a completely new experience for the two of you. His only other requirement during this exercise is to keep the motion in the same direction throughout this oral exercise, as there is simply no leeway for him to vary the motion from side to side. \n\nCuming A word of caution: Don't let him get carried away at the moment he starts to cum. At that spectacular moment, he will be able, for the first time, to thrust his cock all the way inside your oral cavity and that is the most important lesson of this exercise! \n\nBecause of your position in bed you will not be faced with the problem of swallowing his cum. And this is not just because he has a condom on his dick. The reason is because he has gotten his cock BEYOND your gag reflex! Without the rubber, his cum would shoot directly into your stomach! If both you and your partner understand what it is that you are trying to do as well as the possible problems that may \"cum\" up along the way no harm or discomfort will happen to either of you.\n\nIt is possible that not everyone will learn the \"deep throat\" technique but this inability does not make you any less a cocksucker. You must allow your throat to relax completely while your partner is thrusting his cock this deeply down your throat. To do this long enough for your partner to completely get it off is very difficult and may require practice beyond this day. It may be that you will be able to take your partner completely down your throat, but you will not be able to maintain proper relaxation of your throat until he shoots his load.\n\nHopefully your partner will understand that this is not a rejection of him or of what he is offering you, and it is my sincere desire that you not stop here and think that you will never master the \"deep throat\" technique. Continue to practice this lesson. your practice will allow you to take his cock deeper into your throat each time and for longer periods of time. \n\nThe Butterfly Flutter The best position for this very sensuous cocksucking movement is kneeling over him. If he is on his back kneel between his legs. Or kneel in front of him while he stands. Create the basic vacuum pressure on his cock, but only enough pressure to pull the cock into your mouth ever so slightly. With your lips firmly wrapped around his big swollen cock head and shaft, gently flick the tip of his cock with your tongue. Open around the cock at a depth so that you can touch the tip of his cock with the tip of your tongue. With your lips around the cock make an up and down movement with your tongue. Flutter your tongue up and down the tip of his cock. After several minutes of this continue with the basic vacuum suck. \n\nThe Travelling Figure Eight With your lips firmly wrapped around his cock shaft try very slowly to reach the base of his shaft or as close to it as you are comfortable. With your nose trace a figure eight as if the figure eight were lying on its, side. Your figure eight motion should be three to four inches long. Slowly travel up the shaft of his cock to the head, doing the figure eight motion. Keep doing this motion and let your lips firmly travel up and down the cock shaft. Do this for as long as you are comfortable with it. When you get tired of the movement slow down and return to the basic vacuum suck.\n\nGo down on the cock shaft as far as you are comfortable. All the while your lips should be firmly wrapped around the shaft. Open your mouth as wide as you can and suck in as much air as your lungs will hold. While sucking in air, let your open mouth travel up to the cock head. Your up stroke motion should end at the head of his cock just as your lungs fill with air. Now with your mouth still open let the air in your lungs out slowly through your mouth as your opened mouth travels back down the cock shaft. This technique cools the cock on the up stoke and warms the cock with your hot breath on the down stroke. Do this movement as long as you like then return to the basic vacuum suck method. This is great with edible body oils that heat up with your breath. If you feel he is about to cum stop what you are doing and let him cool off for a few minutes.\n\nThe Circle Place his stiff cock inside your mouth but do not tighten your lips around the shaft. With your head begin a circle motion. The cock will slide to different places in your mouth as you continue the circle motion. Watch your teeth on this one. A kneeling position will suffice but it is also effective when he is on his back and your head is directly over his cock. The circle should be executed in both clockwise and counter clockwise motions in a slow purposeful manner.” \n\nThis Part Is For The Men:\n\n“Licking & Pussy Eating:\n\nCunnilingus is the act of using the mouth to stimulate the female genitals. This can include sucking or licking the outer and inner areas of the vagina, and most often involves direct stimulation of the clitoris. Some women find cunnilingus to be the most satisfying sexual act. I know this sounds boring but that's the best description I could find. Now what is the mystery of cunnilingus ( better known as licking and pussy eating)!? The fact that almost 70% of women are unable to reach orgasm (vaginal that is) makes them turn to stimulation of their clitoris; which is the core thing of cunnilingus. A great number of women report that oral sex is the only way they can achieve orgasm. That is where you fit in.\n\nFirst, you should know that many women are shy about their body. Work on her psychologically. Tell her she is beautiful. Complement her on her look and her great boy. Make her trust you and feel comfortable with you in bed. It is much important for a good lick as it is for good fuck so make her feel wanted. After the first shy remarks, be aggressive a little. Complement the breasts and ties. Tell her how much you are looking forward to tasting her sweet juices. Sweet-talking is just to get her in the mood. Remember, each woman is different. Some techniques work better one kind of woman than another.\n\nBefore you go off, meet what you'll be working on - Your partners private parts:\n\nVulva - or the pussy is folded around itself. Sexual excitement will open it like a pretty pink flower. And how to open it? Lightly use the tip of your tongue. Slide it from the top of the slit to the bottom. Very slowly, repeat this until you see the unfolding. This is caused by the woman's sexual excitement engorging her pussy with blood. The labia majora are, pussy lips. The pussy lips are comprised of erectile tissue - Meaning that they fill with blood as sexual excitement builds. The outer more prominent lips are the labia majora. The inner pussy lips are called the labia minora. Both are extremely sensitive to the tongue and lips.\n\nLabia Majora and Labia Minora are the keys that unlock the terrifically sensitive clitoris. Pussy juice or vaginal fluid is comprised of glucose and fructose. In other words, sugar. (If you ever run into a pussy that smells like fish. You can be sure that the woman has an infection and should see a gynaecologist.) Pussy Juice has a slight syrupy consistency, which makes it an excellent natural lubricator. The clitoris or clit, is the most sensitive place on the woman's body. It swells with blood as it is aroused. It is interesting to note that the clit and a head of a penis are made of the same tissue. The clit is the zone we're looking for.\n\nWhen you start to touch and caress her, don't go down straight to her pussy, start slowly to caress her other erogenous zones of her body, and kiss her gently. Have in view her face (lips, eyes, neck, etc.), breasts, belly, and only after that her legs. Especially, take your time with nipples since nipples have a direct neural connection to the clit. This all will relax her and prepare for upcoming pleasure. Remember and take your time with everything you do.\n\nYou must understand the sensitive nature of a pussy. You cannot be TOO soft when you eat pussy. You cannot hurry it along to orgasm. (Make her cum) You must give the woman time, lots of time, for her sexual excitement to build. The labia fold must be parted by gentle touches of the tongue in oral sex. Everything you need is there: sensitive pussy lips that - along with excitement - gives you a clear opening to the clit. Use your tongue gently - moving pussy juice, the perfect lubricant, to each, and every part of her pussy. Gentle moves will give you the pleasure you both seek. Just do not rush with it, and what ever you do, do not use your teeth. Take your time and examine your partner while you are doing it. Her face will let you know if you are on the right track.\n\nPositions Position of giving a pussy licking depends on likes and dislikes of your partner and of course on your durability. You do not wish to be in a position where you can't keep your body too long. There are few simple and most common ones, you should try:\n\nA lot of sub variations on laying flat position, as you can situate yourself many different ways to give cunnilingus to a woman who is laying on her back. \n\n1/ A great beginner position is to have her laying flat on her back with her legs completely spread. Approach from between her feet and lay on your stomach between her legs with your lips at clit level. Another great one is to have her lay on the edge of the bed with her legs up in the air. Approach from the floor and as you put your head between her legs, let them drape over your shoulders.\n\n2/ With her standing facing you, kneel directly in front of her and position your lips at clit level. This is a great position to use your hands and fingers as they are freed up to explore.\n\n3/. Chairs and couches provide can be stimulating accessories that allow for some unique positions. Try having her sit in a chair with arms, draping her legs over the arms. Approach from below.\n\n4/. The doggy style - with her on all 4s waiting for you to explore.\n\n5/ An all time favourite is the 69 position, with the great benefit that you receive as well as give pleasure.\n\nYou may certainly think of a few more positions, but it all really is a combination of the ones already mentioned. Remember the key thing is for the position to be comfortable for the both of you.\n\nTHE BEST WAY TO EAT PUSSY When a woman finds a man who gives good head, (cunnilingus) she has found a treasure she is not going to let go of too quickly. There is nothing that makes a woman more unique than her pussy: They come in all different sizes, colours and shapes; some are tucked inside and some have thick luscious lips.",
        "One side of her clitoris is normally more sensitive than the other. If she doesn't know which side - experiment. When a woman becomes aroused, the clitoris becomes engorged. The more engorged, the more it craves to be touched.\n\nTake A Look Be sure to wet your finger(s) before you touch her clit because it does not have its own juices and it is extremely sensitive. Your finger will stick to it it's dry - and that hurts. Whenever you touch her pussy, make sure your finger is wet. You can lick it or moisten it with juices from inside her. Before she becomes aroused, her clit is usually too delicate to be handled.\n\nGently peel apart the labia minora, her small lips, and look at her inner lips, even lick them if you want to. With the tip of your wet finger, slide it upward until you reach her little pink bud of flesh in the front. If you are in front of her, you can find it where all the whorls and folds of skin come together at the top of her vagina. The clitoris is usually about the size of the tip of your little finger. This is the most erotically sensitive spot in a woman's body. Its sole purpose is receiving pleasure. \n\nTease Her Women love to be teased. The inner part of her thigh is her most tender spot. Lick it, kiss it, make designs on it with the tip of your tongue. Come close to her pussy, and then float away. Make her anticipate it. Now lick the crease where her leg joins her pussy. Nuzzle your face into her bush. Brush your lips over her slit without pressing down on it to further excite her.\n\nWhen she is bucking up, and straining to get more of you closer to her, put your lips right on top of her slit. Kiss her gently, then harder. Now use your tongue to separate her pussy lips and when she opens up, run your tongue up and down between the layers of pussy flesh.\n\nTongue Fucking Gently, spread her legs more with your hands. Tongue-fuck her. This feels divine. It also teases the hell out of her because by now she wants some attention given to her clit. Quickly push your tongue in and out of her wet pussy, alternate between quick and slow thrusts. Do not forget to run your tongue up the full length of her pussy lips just nipping at her clitoral bud. Never use your teeth. \n\nClitoral Orgasm See if her clit has become hard enough to peek out of its hood. If so, lick it. If you can't see it, it might still be waiting for you underneath. Bring your tongue up to the top of her slit and feel for her clit. If you can't feel the tiny bud, you can make it rise by licking the skin that covers it. Lick hard now and press into her skin. Gently pull her pussy lips away and flick your tongue quickly against her clit, hood covered or not. Her legs should shudder. When you sense she's getting up there, toward orgasm, make your lips into an O and take the clit into your mouth. Start to suck gently and watch her face for her reaction. If she can handle it, begin to suck harder. If she’s into it, suck even harder.\n\nGo with her. Move with her as she lifts her pelvis into the air with the tension of her rising orgasm. Don't fight her. Hang on, and keep your hot mouth on her clit. Don't let go. That's what she'll be saying too: \"Don't stop. Don't ever stop!\" There is a reason for that, most men stop too soon.\n\nFinger Fucking & Orgasm You can finger-fuck her while she's enjoying your clit-licking talents. Before, during or after, she'll like it all. In addition to the erogenous zones surrounding her clit, a woman has another extremely sensitive area at the roof of her vagina. This is what you rub up against when you are fucking her: The infamous G-Spot. Your fingers will have to do the fucking. Take two fingers. (One is too skinny, and three is too wide), and can't get deep enough into her pussy. Make sure they are wet. Slide them inside, slowly at first, then a little faster. Fuck her with rhythm. Speed up when she does. Listen to her breathing. She'll let you know what to do. If you're sucking her clit and finger-fucking her at the same time, you're giving her far more stimulation than you would with your cock alone. You can count on it that she's getting high on this.\n\nWhen she starts to have an orgasm don't let go of that clit. Hang in there. When she starts to come down from the first orgasm, press your tongue along the underside of the clit, leaving your lips covering the top. Move your tongue in and out of her cunt. If your fingers are inside, move them a little too, gently though - things are extremely sensitive just now. If you play your cards right, you'll get her some multiple orgasms this way. A woman can stay excited for a full hour after she's had an orgasm.\n\nDon't leave her alone just yet. Talk to her, stroke her body, caress her breasts, and keep making love to her quietly until she's come all the way down. ----------\n\n1. Start slow\n\nDon't be in a hurry to attack her clit. Kiss, nibble, and suck on her mouth, her breasts, her thighs. Like any sex act, she needs to be relaxed and ready before you start getting serious. Even when you do make it down there, kiss and lick and suck on all of her, not just her clit. Her labia need attention too, and many women love having a tongue pushed up inside of them. \n\n2. Find the clit\n\nYou need to find the spot near or on her clit that is \"just right\" for her, the area that, with every flick of your tongue, sends surges of pleasure through her body. No, we're not going to draw you a picture, or describe a roadmap. The best way to find it is simply to ask her. Each woman is slightly different in how she wants to be stimulated, so tell her to give you guidance as your explore her nether regions. \n\n(Note: some women find direct clitoral stimulation too intense. You need to communicate to find the way to stimulate her best.)\n\n3. Relax your tongue\n\nMany men tense up their tongues and flick the tip furiously against her clit. That is all wrong. A relaxed tongue will do the trick better, using the broad flat part, whether you flick it or just bob your head.\n\n4. Use your hands\n\nYour hands are free, so use them! A little finger-fucking is a great complement to clitoral stimulation. You can also caress her labia, lubed up with her own juices, of course. If you're an adventuresome couple, even try putting a finger or two up her ass. However, be careful not to put them anywhere near the vagina after that. A pair of latex gloves and water-based lube will definitely come in handy. \n\n5. Get down to business\n\nOnce you've gotten her excited and figured out her hot spots, it's time to get down to business. Flick your tongue with a steady rhythm over her clit. Don't stop, and don't change the rhythm. That's the key to making her come: patience and a steady stroke. Don't vary things too much, and for goodness sake, don't ask her \"did you come yet?\" Let her fall naturally into an intense, mind-blowing orgasm\n\nWhat woman doesn’t love to be expertly eaten out? Oral sex - done right - can take your partner to new heights of pleasure, but done wrong it can be an ordeal for both of you. Munching rug should be no great mystery. These tips will introduce you to some of the basics of cunnilingus and help you go down like a pro. Don’t forget to come up for air!\n\n1. What’s that smell? \n\nFor many people, fear of a funky odour or taste is the chief barrier to going down on a woman. All women do have a distinctive scent and flavour, and for some would-be cunning linguists, these may be an acquired taste. However, if your partner is clean and in good health, her taste and smell should not be unpleasant, or overwhelming. If you have concerns about her hygiene, the most tactful approach is to suggest a shared shower or bath before sex. If after a good soaping, her pussy still smells like something crawled up it and died, or she has unusual discharge, she probably has an infection and should see a doctor.\n\n2. Work your way up. \n\nTake your time when you start to eat pussy. Get her warmed up with some basic foreplay—kissing, fondling, etc. It is better to go down on a wet pussy than a dry one. Once she is aroused, make your descent: Try kissing and tonguing her ankle or the sole of her foot. Then kiss and lick your way slowly up the inside of her leg (the back of the knee is a good erogenous zone, too). Tease her a bit more by kissing and tonguing her inner thighs. Blow some air lightly over her pussy. She’ll go nuts.\n\n3. Get acquainted. \n\nOnce your face is up in her crotch, don’t dive straight for her panic button. Explore the whole area with your mouth. Gently probe with your tongue and locate her vagina and clit. Suck on her labia. Get your whole face messy.\n\n4. Get busy. \n\nNow you want to go to work on her clit. The key is to use your tongue and lips to suck and massage it gently. Do not poke at it or press too hard. Go in circles, go up and down, flick back and forth lightly. There is no real “right” way to go down on a woman; just make it up as you go along and pay attention to what works. Vary your speed and pressure and see what she responds to. When you hit the right groove, you’ll probably know it, because she’ll grab the back of your head and clamp her thighs around your ears like a vice. But to be on the safe side, ask her beforehand to let you know what she likes. Once you hit her hot spot, there’s no need to rush; just keep her engine revving. Feel free to explore some other techniques or positions before you take her over the top.\n\nThe ABCs. \n\nThis is perhaps the most common tip when you eat pussy: use your tongue to trace the letters of the alphabet on her clit. Some people swear by it. Personally, I don’t recommend it. I don’t think it’s a good technique. Also, it’s too much of a distraction, and if she catches you humming the Alphabet Song under your breath, you’re busted. You should be paying attention to her, not what comes after Q. \n\n6. Use your hands. \n\nYou can create some wild sensations for her by stimulating her clit with both your fingers and your tongue simultaneously. Also, most women enjoy a finger or two in their cunt while being eaten out. Insert your fingers with your palm up, crook them slightly, and stroke toward you in a “come hither” motion to hit her G-spot. A finger up the ass will also drive her over the edge if she’s into anal play. (As always, to avoid infection, if you put something in her ass, make sure you do not put it in her pussy afterward.)\n\n7. Stick out your tongue. \n\nYou can also use your tongue to penetrate her—just make it rigid and plunge in. You can then tongue-fuck her by moving your tongue in and out, or by keeping it stationary and bobbing your whole head. For bonus points, try stimulating her clit with your nose while your tongue is inside her. \n\n8. Let her ride. \n\nPut a pillow or two under your neck and let her sit on your face. This gives you a nice view of her tits and gives her a degree of control over pressure and position. Let her grind her juices all over your mug. _ _ _ _ _ \n\nThe Two Types Of Orgasm\n\nIt is now known women can experience two kinds of orgasm. But they are not clitoral vs. vaginal as some have reported.\n\n1.The most common (some times called clitoral) also involves the vagina since the clitoral stimulation also produces contractions of the pubococcygeal (PC) muscle supporting the pelvic floor, which is where \"vaginal\" contractions are felt.\n\n2. G-spot and Uterine. G-spot stimulation results in orgasmic contractions around the uterus, which is several inches above the pelvic floor.\n\nLater research has shown that women who can orgasm both ways have even deeper, more powerful blended orgasm, resulting from contractions in both areas at once.\n\nOne woman described the difference this way: \" I have two DISTINCTLY different types of orgasm. The G-Spot orgasm tends to result in my vaginal walls contracting and fluid being expelled. The clitoral orgasm can either have fluid expelled or be \"dry\" but both result in my uterus contracting, not my vaginal walls. And both types can either be whole body or localized. I state all this because it seems as if some posters are implying there is only one kind of orgasm and that it always involves uterine contractions and I'm here to tell you that that is not always true. So good luck in experiencing ALL the kinds of orgasms there are for women!\"\n\nLocation Of G-spot\n\nThe G-spot lies directly behind the pubic bone within the front wall of the vagina. It is usually located about half way between the back of the pubic bone and the front of the cervix, along the course of the urethra and near the neck of the bladder, where it connects with the urethra. The size and exact location vary. Imagine a small clock inside the vagina with 12 o'clock pointed towards the navel. The majority of women will have the G-spot located between 11 and 1 o'clock a few inches inside the vagina.\n\n\nUnlike the clitoris, which protrudes from the surrounding tissue, it lies deep within the vaginal wall, and a firm pressure is often needed to contact the G spot in its unstimulated state. Usually it is a lima- bean sized, spongy area, which responds to stimulation by hardening and swelling as blood rushes to it. _ _ _ _ _ _ \n\nOne Guys’s Experience With Women (Copied from WWWeb - writer unknown.) “First of all, let me define a G-spot orgasm the best I can from women that have discussed it with me as well as my readings and research. G-spot simulation usually results in an initial feeling of needing to urinate, which may last a few seconds to 30 sec. This is because the spot is so close to the bladder. \n\nMany women stop the stimulation fearing the urination feeling. BUT, I assure you the feeling will change to a highly sexual pleasurable feeling. The resulting orgasm is much deeper within the body than a clitoral orgasm. \n\nFrom women who have shared their experiences with me, there are two common descriptions: either a very, very powerful explosion that keeps on going and going (one woman who is very highly orgasmic told me it was the best she ever had) or less intense but an experience of deep, rolling orgasms. \n\nIn one case, after about an hour of my massaging her G-spot, as my hand was getting tired, I moved away to her clit and she wanted me back on her G-spot, saying that while clitoral stimulation would result in a one time big bang, the ongoing smaller, almost continuous G-spot orgasms were more enjoyable.\" - - - - - - - \n\nTechniques For Stimulating the G-Spot\n\nLie back with your knees pressed up to your chest. In this position, your vaginal depth will shorten and even small fingers should be able to reach the G-spot. With a partner, lie on your side with one leg drawn up to your chest as your partner enters you from the rear. He should be able to hit the spot.\n\nInsert fingers and bend them gently up, around and behind the pubic bone. Beyond the rather rough-surfaced tissue immediately behind her pubic bone, your fingertips will encounter a very soft, smooth area. Go very slowly and let her tell you what she feels as you explore the smooth area, which will feel to you like the inside of a very slippery mitten. When you straighten your fingers and reach further inside, you'll encounter a hard, rubbery structure that feels like an erect nipple pointing south. This is her cervix. The G-spot is somewhere just his side of the cervix, about an inch beyond the mitten, in the flesh immediately in front of the vagina.\n\nImagine you are holding a tennis ball on those two of three inserted fingers. An area about the size of a grape in the centre of the tennis ball is what you're trying to reach. It can be anywhere along that two-or-three inch long area between the pubic bone and the cervix. Explore slowly, allowing for feedback front he woman - let her guide your fingers with her words if she can feel the stimulation. The G-spot responds to pressure rather than to touch. Gentle stroking is not likely to find it. It is more like massaging a pea under a mattress - one has to compress the flesh to find it.\n\nWhen you reach in from the front with the woman on her back, the heel of your hand is over her clitoris while your fingers hook around her pubic bone. Pull upwards, as if you are trying to lift her off the bed. Do this with the same sort of rhythm you would use fucking, and keep your fingers hooked, so they press deep into the tissue. Once you know where it is you can try using your penis on it, but for good G-spot orgasm, she may prefer your hand. In face-to-face intercourse, the penis may not stimulate the spot enough to do any good, although some positions, such as the one where the women draws her knees close to her chest, may increase the changes for a G-spot orgasm.\n\nHow To Hang On To Any Woman:\n\nGIVE HER ALL SHE CAN TAKE.\n\nHey! Everyone knows that NO guy can give a randy woman all she can take, don’t we? Well don’t you believe it: You can give her orgasms until she gasps she can’t take any more, and collapses from exhaustion. (I’ve give females more orgasms in a half hour this way than the ever got in total in a couple of years before – and it wasn’t for their want of trying! I call it the:\n\n“CHINESE CRACKERS”\n\nI expect you have all seen those ‘Chinese Cracker’ fireworks, or ‘Jumping Jacks’. You light the fuse, toss it well clear – and wait for the series of explosions, as it jumps around in wild random.\n\nNow imagine the same thing happening inside your woman: A series of orgasmic explosions erupting inside her from all directions – one after the other in rapid succession – and you keep them going until even the most abandoned nymphomaniac has to scream ‘Enough, enough.”\n\nBefore you can perform this, you must be well practiced in the ‘Balloon technique’ of bringing her to orgasm. (Make sure you understand and can carry out that task detailed at the beginning of this book.)\n\nAs mentioned earlier, once a guy has ejaculated a couple of times in quick succession, he is pretty-well shagged out for a while. If you have brought a woman to attaining a good orgasm she remains highly sexually aroused, and can (and usually wants) more for at least a half hour – usually longer. \n\nIf you are proficient in bringing her to orgasm, you can move on to giving her multi orgasmic explosions. The key to this is correct stimulation of her G-Spot. Forget using your penis for this – it just isn’t enough: you need a couple of industrious fingers inside her. It only works if she has 100% trust in you, and abandons her body to you. The technique is much as the one outlined above. Again, the secret is ‘Hold back, hold back, hold back’.\n\nSo, you just brought her to orgasm, have relaxed a minute and covered her with kisses. Now drop your hand down and cover the whole of her sex organ, hold it gently but firmly. In her still high state of sexual arousal, she will desire much more stimulation Despite knowing from past sexual experiences that there is little chance of it, she will badly desire to have penis, fingers, or tongue inside her again. Surprise her: Make a movement with one or other of them to part her lips and touch her entrance – but don’t go in. Don’t let her force you in either, tease her. Move from there to her clit, and alternate slowly between the two.\n\nShe may physically try to get you in her, or cry out begging you to fuck her or whatever. Hold back, just tease. By doing this, you are building her desire, heightening her expectation, frustrating her to distraction. Keep this up until it is obvious she is at the limit of her frustration and expectation – then slip one finger part way in and pause. That simple movement should send her sexually wild. Pause a couple of seconds to let her go beyond the point of her endurance, then head your finger straight for her G-Spot\n\n(A reminder here: The G-Spot is situated approximately two inches inside her vagina, on the inner wall, and at the roof or top of it. If you slide your finger in and hook it upwards you should be right on it.)",
        "As you hit the G-Spot, use your other hand, mouth, tongue, lips to stimulate the rest of her body. (Deep kissing her neck is usually effective whilst massaging her breasts,) Use the pad of your finger to press in gently and rub the spot. It should feel moist and silky smooth. Slip another finger in to join the first. Don’t press too hard. Concentrate on the G-Spot, Don’t start fingerfucking her, but slid your fingers in and out without letting them leave that spot. Gaze into her eyes; vary your movement and pressure. See what is working for her and what is not. Vary the pressure of individual fingers. Move faster or slower, pause at different points to apply a little more pressure.\n\nHer inner muscles will begin expanding and contracting in uncontrollable spasms. These movements indicate an impending ejaculation of vaginal fluid. Some females ‘cum’ or ejaculate very little during orgasm, others actually produce a fair amount of vaginal fluid as the orgasm. At this point, her whole internal and external pubics will feel like they are ‘on fire’. There is NO WAY she can hold back an orgasm now. \n\nShe will be breathing heavily. At this point, most females become ‘noisy’. Some scream, or shout obscenities. Her muscles will grip you hard. Grip her hard right back.\n\nYou will know the exact moment she is about to shoot, as her muscles tighten so hard they almost force your fingers out. Instantly use your mouth, hand, penis to do whatever you know turns her on. (Kissing, sucking, even biting the neck or breasts, nipples – whatever you know they like), will send them way beyond any normal orgasmic sensational peek they have previously experienced. She will become super-wet. If she has previously been given to ejaculating during orgasm, this time she will do it with such explosive force she could literally shoot across the room.\n\nYou have achieved what she wanted – what you wanted – so time to relax eh! NOT ON YOUR LIFE. Continue your stimulation, always varying the movement, pressure, and continue using your other hand, penis, mouth to stimulate her. You can continue giving her one after anther super explosive orgasms. She will be as super-horny as a rampant nymphomaniac, and may continue like this for a full half hour. \n\nIf she begs for a break, give her one, you can stick your penis in her at this point, and consider getting off yourself. This sets her off again. Once she is responding, force your fingers in as well. Use them to work her G-Spot, whilst you fuck her with your penis to get off yourself. Believe me, you will never have gotten off better, and she will know that for the first time in her life she has attained the fuck of her life – one she could only previously dream of…\n\nHey, you gals and guys: Practice the above, and when you are really proficient I have a little pussy that adores attention.\n\nCandida. "
    ],
    "authorname": "Teenage Venus",
    "tags": [
        "orgasm make",
        "firmly wrapped",
        "vacuum suck",
        "grip hard",
        "stimulation clitoris",
        "orgasm clit",
        "trust partner",
        "back tease",
        "coronal ridge",
        "orgasm women"
    ],
    "category": "How To",
    "url": "https://www.literotica.com/s/how-to-pleasure-a-lady-and-yourself"
}