{
    "title": "How to Humiliate and Degrade",
    "pages": [
        "Marriage is a glorious thing. It provides security and companionship. It lets you be with some one you can trust implicitly and confide to. If all goes according to plan, it will last us the rest of our lives.\n\nI have been married for 17 wonderful years and am head over heals with my husband to this day. He is my best friend and I would move heaven and earth for him. Our relationship however has not been without its ups and downs. Most of these issues revolved around sex. We started off in a very vanilla sexual relationship. We certainly did very little out of the ordinary and for us, spicing things up would mean we did it in another room in the house rather than the bedroom.\n\nYou may have heard of the 7 year itch and in the case of our relationship, it couldn't have been more apt. About 3 years in to our marriage (7 years in to our relationship), there was a very sudden and dramatic shift with respect to sex. It became clear that we, and probably more importantly he, needed a little more when it came to our time in the bedroom. He began asking more and more risqué questions and requests of me. The one that truly stands out was the desire for a golden shower which also intrigued me and so we performed it and made it a part of our sexual relationship. To me this was about as out there as I could possibly have imagined although I did enjoy this naughty aspect of our sex lives. I kept thinking, \"what if my friends knew what we were up to?\" Guilt crept in and I became more and more reluctant to perform these sorts of acts whilst my husbands desire started to grow for them.\n\nAs my interest and guilt kicked in, my husband started demanding more. He started to bring up the idea of humiliation. This was the straw that broke the camels back for me. I broke down in tears and took this as an ultimate rejection of myself. He didn't love me anymore! He wanted to engage in strange and ludicrous acts that would have made even Hugh Hefner shiver in disgust. He might be mentally ill! No one in their right mind could have possibly sought to do the things that he wanted me to do to him. I convinced him that we needed therapy if we wanted to move forward with our sexual relationship to which he reluctantly agreed.\n\nI finally felt relief! The therapist would cure my man of his depravity and hopefully, we would be able to leave the whole sordid mess behind us and pretend it never happened. I was the one in for the shock however when we sat down with the therapist. \n\n\"There's nothing abnormal about that,\" replied the therapist when I had finished my tirade against my husband. Had she not heard me? Perhaps she didn't understand the sort of sordid requests he was asking from me. \"It's actually perfectly normal,\" continued the therapist. \"Every couple at your point of the relationship will have something out of the box that they will be doing. It's the seven year itch! Sexual relationships need the spark and kick to keep it exciting.\" \n\nIt was her next line however that will stay with me forever. \"If he wasn't coming at you with some sort of kinky desire at this point in time, he is either extremely conservative or he is getting his satisfaction elsewhere! The question you really need to ask yourself is how you feel about it?\"\n\nAnd that's when it hit me. My reservations revolved around what I perceived to be normal. I couldn't get the idea out of my head of what my friends would think of me if they knew what we got up to. But as this woman was showing me, the same could probably be said if I knew what they were up to. How did I honestly feel about it all? Did it excite me? Not really but with in the context of what I had heard from the therapist, I also didn't feel repulsed by my husband's requests. Perhaps she was right? If he wanted to change it up, it would be easy for him to go and find someone else to do it with. A change in partner would provide the excitement he was after. But he wasn't doing this, he wanted to do it with me. I started to realise that his request actually didn't bother me that much at all and I was making it into a bigger deal than it should have ever been.\n\nI decided that I would do it. But what was 'it'? He had given me a few ideas but not very much to go by. I was absolutely clueless. Our first night was a disaster. I called him names but felt weird doing it and hardly very convincing. It petered out to nothing and I think we were both a little disappointed by the experience. We put the cue in the rack for a few months after this but I decided I owed it to him to try a bit harder so I took the initiative and started reading a bit about it on the net (not as easy as it is today as it was still a bit primitive back then). I found the contact of a dom from my research and started messaging her for some tips and ideas which has since evolved in to a great friendship.\n\nI was amazed at the different types of humiliation. Firstly, for many Dom's and Sub's, this isn't a one off event but a lifestyle. The Dom/Sub relationship extends to every part of that persons life and isn't restricted to the bedroom. This wasn't for me (though is for my friend) though it was intriguing to me that a couple can live their lives this way in such happiness.\n\nThe style that I was looking for was humiliation as an event. It's not part of our everyday lives nor is it even part of our everyday sex lives but is something we do on occasions. At present, it is my Wednesday nights with hubby. Throughout the week we will also have a romantic night for the two of us and a night that is all about my sexual fulfilment (humiliation night is about him). On these other nights, humiliation does not make an appearance. \n\nI also discovered that there are two forms of humiliation. One in which the sub enjoys the experience and one in which he dislikes what he's being asked to do. The end result for both however, is an incredibly sexy experience and I believe it is important to mix a healthy dose of both forms in to the play. Otherwise, the humiliation element will eventually be taken out of the equation if you stick with just likes on hubby's part and instead, you'll just have a collection of kinks. In saying this though, there are still boundaries. There are some things that he will find distasteful and then there are some things he will flat out refuse. Be mindful and respectful of where those limits may be. I find for me that part of the thrill is constantly testing those limits and I am constantly surprised by just how far I can take things. But I have had some demands knocked back and whilst I may playfully punish him for this, I completely respect it and note it down for next time.\n\nI then gave it all another shot and this time, he was not disappointed! I have now been humiliating my husband for 13 years and he can't get enough of it. I have gone from being disgusted to lukewarm on it all to now getting a kick out of making him do what I want and enjoying the testing of his limits. I feel such love from him when performing these acts when in particular, he is just doing it because I have asked. That is part of the structure that gets him off. I don't necessarily get a big sexual rush from being dominant but I do love the pleasure it brings him and have come to enjoy it in many other ways. Ultimately, to see your hubby so satisfied is a thrill in itself and an ultimate compliment to yourself that you were able to do this for him.\n\nSo with out further ado, here is a list of some of the many things I have done to my husband over the past 13 years as well as some things that I know some dom friends have tried but I am not game to. I have categorised them for ease of use but I suggest that you mix and match a bit. Also, it is important that you use this list as a dom. It is quite extensive and it should be you calling the shots not him. This is not a list of things that he might like to try but a list of things that YOU can make him do. Be dominant and most of all, have fun with it and really get yourself in to it. When he starts to respond sexually, it should drive you even more to really embrace your role.\n\nWATER PLAY\n\nThis was our natural starting place as we had engaged in water play before we had ever contemplated humiliation. Whilst we had engaged in Golden Showers in the bath and the shower, it never went further than really splashing each other with our pee.\n\nThe first successful attempt I had at humiliating my husband was through trips to the toilet. We picked a night in which he was to be humiliated and every time I went to the toilet for a pee, I would make him lick me clean after I came out of the bathroom. I secretly cleaned myself the first couple of go's as I thought he would surely baulk at this but he cleaned me up with such enthusiasm that I stopped cleaning myself before going to him and eventually on my last trip, I left myself dripping so that he was undoubtedly licking pee of my vagina. This all resulted in a massive orgasm and it was quite clear that he enjoyed himself.\n\nAfter a few more times of this, I picked an activity that I was sure he'd reject. I was going to actually pee in his mouth and make him swallow it all. When I suggested this, I almost keeled over in shock when he accepted my request. Even more so, I could tell that not only was he willing to do it but that he was eager to do so. He greedily guzzled it all down and wanted more.\n\nThis started a whole string of different activities in this domain all which I have never been knocked back. Here are my memorable ones:\n\n• Piss all over the floor of the bathroom. I then tell him he has to get on all floors in the bathroom and lick every drop up. Whilst doing this, I either ask him to finger himself or I come from behind and either finger his anus hard whilst he is licking the floor or I put a strapon on and fuck him from behind. All the while, I tell him how filthy he is. I might also pee all over the toilet seat and make him lick it off there.\n\n• Piss in to a cup and give it to him to drink whilst I sit at the edge of the bed and watch him. I might ask him to take a tablet with the drink. I might pee in to a cup with ice and a spirit such as rum or vodka. I may ask him to dip food in to the cup and eat it whilst I watch on. I might also piss in to a drink he is already drinking be it a soda, a beer or a glass of wine. All of these he has done without hesitation and with much delight. I may also ask him to play with himself whilst he is doing all of this, particularly by either fingering himself or playing with his own nipples.\n\n• Piss all over food he may be eating. I have given him a bowl of cereal (rice bubbles) that I have subsequently peed on and watched him eat them as they went snap crackle and pop. I have peed over a plate of fries before he has eaten it and told him I am adding vinegar! I have opened bags of candy, peed in to the bag and given it to him to eat. \n\n• Get in the shower and put some shampoo in his dry hair. I then get him on the ground whilst I squat over him and get him to shampoo his hair using my pee. Only after he has had a really good clean and he has cleaned with his tongue any pee that may have splashed on the shower floor or on my legs do I let him turn the shower on. \n\n• Fill him up with water for a change and have him lie on the bed with rubber sheets. He doesn't get anything from me sexually and is not allowed to touch himself until he has peed over himself. I then get him to clean himself up and to suck as much out of the sheets as possible. I might also make him pee in to a cup and drink his own pee which doesn't excite him as much as drinking my own.\n\n• Piss my panties and then hand it to him. He has to squeeze as much pee from them as possible in to his mouth before cleaning any mess that I may have made anywhere else with his tongue.\n\nThese are but a few ideas. Think depraved. I personally find it all a bit gross but I do love to come up with my next depraved activity for him to do and watching him follow through. I can always tell that when it comes to water play, he cannot wait to see what I come up for him next.\n\nSCAT\n\nThis was a boundary that my hubby would not cross much to my own relief. I asked him to eat my crap but he refused in what was the first time that he turned me down. I expected this although I must say, he has done a lot of things that I also thought would be turned down. \n\nWhat he will do is lick my ass after I have been to the toilet. He does this only after I have wiped with toilet paper so really it is perfectly clean down there and I actually don't mind it as the one thing he does clean off is the occasional tiny bit of toilet paper that is stuck to my behind. He enjoys rimming me and I find it quite pleasurable.\n\nAll in all, scat is not for us but it needed to be included as it might well be perfect for you the reader.\n\nSPITTING\n\nSpitting is a staple of most humiliation sessions. It is usually something that most couples are open to as you are already swapping spit every time you kiss. There is something exciting and degrading about it though and really should form a solid part of your repertoire.\n\n• Spit on your partners penis whilst you tell him how disgusting he is\n\n• Spit on his ass, scoop it up with your hand and shove it in to his mouth\n\n• Ask him to open his mouth wide and amuse yourself by seeing whether you can spit in his mouth from a distance or just hover your face above his and spit in his mouth.\n\nSpitting is a big turn on for him and something that I enjoy very much as well.\n\nFEMININITY\n\nThis is a category my husband does not like (except for a few parts) but that he will do when I push him to. You can see the disgust with himself when he is doing some of these but it still really gets him off because he does find it so genuinely humiliating.\n\n• Simply fuck him with a strapon. My hubby does like this part of it though he does not like the pain that comes with it. I respect his wishes here and take my time to work it in but others may wish to cause a bit of pain.\n\n• Get him to suck your strapon. This my hubby does not like but I make him do this a lot now as it is a good safe humiliation tool. I like to get quite in to it as well and thrust a fair bit whilst holding his head there.\n\n• I will make him wear sexy lingerie for me. Again, this still makes him uncomfortable but really does work. Have him lie on the bed and play with himself through the panties. I make him slide the bottom of the panties over while he fingers himself. All the while I refer to his ass as his pussy and ask him to finger it. I will also ask him to put his hands under the bra and play with his tits. I like to also put him in crotchless panties and stockings whilst I bend him over and fuck him with the strapon. He seems to cum buckets when I do this.\n\n• I sometimes put him in a dress and refer to him by a female name whilst I have sex with him. He leaves the dress on whilst I do him from behind. I might then turn him around and make him look in to my eyes whilst I do this too him whilst I keep spitting in his face. This is again by no means something he enjoys but it is utter degredation and he certainly gets off on it in a big way\n\nCUM PLAY\n\nThis is something we do with either his frozen cum or some fake cum that we will make up. \n\nIf you use real stuff, Just try to use condoms and freeze them. Then let them thaw when you want to use it and use as you see fit.\n\n• An obvious one is to eat a creampie after he has gone in you. I don't care who they are and how enthusiastic they seem, when it comes to the crunch they will almost always baulk at it as they have lost their desire. You have to make them do this! Make them come in you and hold their head against your pussy and demand they eat it up. If they don't, tell them you'll never do any of this again for them and that they'll be sorry later on. Stick to your guns and make sure they know you mean business and they will get down to it. I actually really enjoy this one! Also, you may wish to force him to lick it up off himself after you have forced him to masturbate for you.\n\n• The other creampie option is to fill yourself up with your pre prepared cum. This can either be real or fake. You will have a more willing participant this time around. Use a bit of fantasy here. Tell him you just had sex with his best friend but he didn't use a condom. Tell him that the saliva will help kill off the sperm so he needs to get in a clean you out so that you don't get pregnant! Whilst he cleans you, tell him how much fun you had with his friend (or whoever you may wish to choose) and that you can't wait to do it again. Tell him how good he is at cleaning up! You may wish to splash a bit of cum around other parts of your body such as your face, breast and ass as well as dripping down your thighs.\n\n• Put your strapon on and cover it with real/fake cum. Make him suck it off. Better still, I have a dildo that has an empty chamber in it that can be filled up and can simulate ejaculation. I make hubby suck this and squeeze it to cum in his mouth. It's a little on the large side but I have also pushed it up hiss ass and squeezed it in to there and then watched him have his own creampie.\n\n• I will occasionally go wild with the fake cum. I cover myself from head to toe in it and get him to lick it all off my body. I then get him between my legs to lick it out and then start peeing in to his mouth.\n\nBELITTLING\n\nI find this the hardest to do as I am not at all sincere with what I am saying but with practice, I have become good at it and see it as some quite playful fun.\n\n• I tell him how small his cock is and that it just doesn't satisfy me. I tease that I may need to find someone who can.\n\n• I talk about my ex boyfriends. I tell him how much the thought of being with them again turns me on and how they were so much better in bed than he is.\n\n• I refer to his ass as his pussy and his nipples as his tits or breasts (breasts is actually an accurate term anyway) and demand that he plays with them whilst I watch. I call him a sissy or gay.\n\nPUBLIC ACTIVITIES\n\nThis is a bit hit and miss for us but can be a lot of fun. I generally don't want him to actually get caught out so this may not be as extreme as everyone would like.\n\n• Put either a butt plug or a set of ben wah balls in his anus and I go out with him for the night. No one knows that he's doing it but he gets a thrill and I make occasional references to scare and humiliate him such as \"what is that sound\" if I can hear the Ben Wah balls tapping together or \"is there something wrong with the back of your pants\" if he has the butt plug in.\n\n• I make him strip off completely naked and sit on our back lawn late at night whilst I watch him from inside the house from the window. I then instruct him to masturbate for me and to finger himself. I might go outside and pee all over him as well and if its cold out there, I'll quickly come back in whilst I ask him to play with himself some more for my amusement whilst I watch on. Our place is reasonably secluded but there is a small chance that someone might see him.\n\n• Take a trip in the car with no pants. He is not allowed to bring pants at all and wears a towel around his waist to get in to the car. I remove this then drive. I will occasionally go park at the mall and leave him there whilst I go in to do some shopping. I have also asked in these situations that when I get back, I want to see that he has ejaculated over himself. This is the most risqué one we do but I still don't think anyone who has ever passed the car has realised he is missing his pants. \n\n• I have done this only once but I once had my Dom friend come over to watch him. I humiliated him in front of her and made him masturbate and finger himself after I peed in his mouth and on his food. This was our ultimate humiliation performance and was quite well received by hubby but I would never do it with any one outside the sub/dom community. It will be a very occasional activity moving forward.",
        "OTHER PARTNERS\n\nThis one is on the extreme side and it's not something I have ever done. We have discussed a bit of swinging but I don't think I could humiliate hubby in the cuckold situation that I'll describe below although my Dom friend has done this to her man. I do like to play on the fantasy side though.\n\n• Actually go out and find a man to have sex with and bring home a creampie for hubby. This is a big fantasy for a lot of people but is not something I could ever do. Not only could I not do that with another man, there are the practicalities of STI's and pregnancy to consider. It is popular in the more extreme Dom scene though and so I have shared it here.\n\n• Bring another man home with you to have sex with. Either do this in front of hubby or go to another room. If you go to another room, set up a baby monitor so hubby can hear it all. Whilst having sex, keep telling the man how good he is and how he's the best you've ever had. Say how you wish your husband could please you like this and make sure you moan and scream as much as you can. Again, not for me but it is definitely hot if you are in to it.\n\n• Fantasise about being with other men with your hubby. This I will do and he seems to respond excitedly to it. Keep calling your hubby someone else's name and refer to hubby as though he wasn't in the room. As above, say things like you wish your husband could satisfy you like this.\n\nSo there you have it. That should give you a bunch of ideas to get the ball rolling. As mentioned, I've tried all of the above except for the Scat and some of the other partners points but have done just about everything else. And this is just the tip of the iceberg. Have fun in coming up with dastardly things for your man to do. Don't be limited by how disgusting a particular idea might be. Push the barriers and see how he responds. Get a kick out of being his sexual boss for an evening and having him do whatever you want. If your man likes a little bit of pain, punish him if he doesn't do exactly what you want or doesn't do it as well as you would like. I have a paddle and whip and will use both if he doesn't obey. I also have some clover nipple clamps and will pull them slightly every time something is not done up to scratch.\n\nRemember above all else that this is normal. We may not talk about this sort of stuff with our friends, but trust me, they're doing crazy stuff too. You're not a couple of freaks. There are millions of kinks out there, just check out the internet. What turns one person on will disgust another but be assured that we all have some kink or fetish that we'd be ashamed for anyone to know about it. Stop feeling shame, embrace it and have fun. Here's hoping you'll have many more years of great sex together!\n\nMistress Anna!"
    ],
    "authorname": "annyfanny",
    "tags": [
        "piss",
        "cuckold",
        "cream pie",
        "creampie",
        "sissy",
        "strapon",
        "humilation",
        "degredation",
        "spitting",
        "food play"
    ],
    "category": "How To",
    "url": "https://www.literotica.com/s/how-to-humiliate-and-degrade"
}