{
    "title": "The Agency Ch. 09",
    "pages": [
        "*Author's notes: This is a work of fiction, hopefully that is not a word you struggle with. It is a story of fictional, consenting adults who enjoy power exchange, lingerie, heels and the like. It's in the transgender/crossdressing category for a reason, if that scares you please back away slowly. For the rest of you, please enjoy!\n\n~~~~~~~~~~~~~~~~~~\n\nWaking up, Michelle looked over at her phone to see she'd received two text messages. The first from Brenda, thanking her for a fun night and saying she was looking forward to breakfast Friday morning. The second was from Ms. Allison detailing what Michelle needed to wear to work this morning. Additionally, the text informed Michelle there would be more instructions to follow when she arrived at work. This sent a chill up Michelle's spine. Slipping out of bed, Michelle decided to skip her morning yoga, instead she grabbed a lavender robe to start her day.\n\n\"Well, that's a bit of a mess.\" Michelle chuckled to herself as she spied the dildo still suction cupped to the chair and the dried pool just beyond it.\n\nMichelle got her morning coffee started before cleaning up the kitchen, which quickly led to picking up her discarded clothing from the night before. Before stepping into the shower, Michelle took a quick look at herself in the small medicine cabinet mirror. Even 24 hours after her saline injections her budding breasts still showed a bit of size. She was now almost a solid A-cup, but what excited her more was how toned and flat her stomach was now. Her pauper's diet had gotten her so far, but now she was a healthy slim build instead of looking almost sickly. Michelle showered, taking extra care to shave everywhere as Ms. Allison was certainly going to have her in the office a majority of the day today.\n\n\"Okay, let's see what we have!\" Michelle said to herself as she walked back into her bedroom. \"Oh, I haven't worn this one yet!\"\n\nMs. Allison had selected a pink and sheer bra, panty, and garter belt set that Michelle had eyed often but wondered if she could wear it all day at work. It was mostly satin, but unlike the panels yesterday that covered her nipples and crotch, the panels today left them covered only by pink sheer material and small flowers. The garter belt sat just above Michelle's bellybutton covering her sides almost to her hips with slight built in boning. The front close shelf bra had V shaped cut outs exposing the nipples of Michelle's false breasts. She also realized that her growing chest was now creating a bit of a space issue in her bras. It was exciting to think that soon, it would only be her body filling the very revealing cups. Ms. Allison also required a pair of back seamed suntan stockings, thankfully Michelle had a fresh pair of those. The panties sat low on Michelle's hips, cutting across her body just above her crotch, which was also left exposed with the sheer and rosette panel.\n\n\"These are definitely not a power thong!\" Michelle giggled to herself.\n\nMichelle did her makeup, and fixed her mess of a wig, before figuring out what she should wear over her lingerie. She chose a cream camisole to try to tone down the nipples poking out of her bra. Next she chose a black pencil skirt and sleeveless tan knit top. It would be a pain to wear if she were in and out of the office constantly through the day, but today that wouldn't be the case. The top did fit a bit snug, so her attempts to hide her pert nipples were quickly undone. Deciding she liked the top more than the concern of who would be staring at her chest, Michelle stuck with it. Finally, she stepped into a pair of 3 1/2\" black heels, although she brought a pair of coordinating pink heels to change into once her outer clothing was off. Michelle stuffed her shoes, new dildo and the weighted plug into her bag with her lunch before heading out.\n\n\"Good morning Michelle.\" Cindy said from behind her.\n\n\"Oh good morning,\" Michelle smiled, noticing Cindy looked far more put together this morning than she had yesterday, \"how are you doing?\"\n\n\"I'm good,\" she replied as they walked to the elevator together, \"but I think the real question is how are you doing this morning?\"\n\n\"Oh I'm great! I slept like a baby last night.\" Michelle replied wondering what her neighbor was getting at. \"Why do you ask?\"\n\n\"The walls are pretty thin,\" Cindy replied with a sly smile, \"and you were a bit loud.\"\n\n\"Oh!\" Michelle's face blanched, she hadn't considered how loud she was when she was riding the dildo the night before. \"Well, in my defense,\" Michelle felt the sudden need to turn the tables on the woman who'd never given Mike the time of day, \"Mike stopped by last night to pick some things up and I just couldn't help myself.\"\n\n\"Really? Mike?\" Cindy did nothing to hide her shock as the elevator doors opened.\n\n\"Oh yeah, Mike!\" Michelle replied stepping into the elevator then turning to face Cindy while leaning against the back wall. \"Ever had a guy who just possesses your soul when he's inside you?\" Michelle exaggerated a bit of a chill for extra emphasis. \"I swear, he just looks at me and my clothes fall off!\"\n\n\"You'd said he was good in bed before,\" Cindy's eyes lingered around Michelle's chest, obviously thinking her erect nipples were a direct reaction to talking about sex with Mike, \"but I never imagined, he just looked so unimpressive to me.\"\n\n\"You know what they say,\" Michelle responded, \"you can't tell a book by its cover!\" Michelle turned just a bit, watching Cindy's eyes follow her nipples. \"I swear I passed out during my last orgasm! Hell, even the aftershocks were amazing!\"\n\n\"Wow!\" The obviously dejected Cindy replied. \"I guess I never imagined.\"\n\nFor extra emphasis, Michelle shuddered again, this time lifting her right leg and squeezing her thighs while gripping the elevator's railing. \"Honestly, he took me every way possible too! He's insatiable.\"\n\n\"Jesus.\" Cindy replied as the elevator doors opened.\n\n\"Fred must be hiding today.\" Michelle said as she confidently walked off the elevator.\n\n\"I think you scared him yesterday.\" Cindy chuckled.\n\n\"Could be!\" Michelle replied with a laugh before she placed her hand on Cindy's lower back as she walked through the door. \"Have a great day!\"\n\n\"You too!\" Cindy called out as Michelle headed off.\n\nMichelle couldn't really identify where her new confidence came from, but it was surely a large part of how people around her saw her now. As Michael, she was almost invisible to the outside world. He was undersized, certainly not wealthy, and a bit of a slob. Now, as Michelle, the rather attractive blonde confidently walking in her heels down the side walk, chest moving in time with each step, she was definitely not invisible. Michelle smiled to herself as a woman elbowed her male partner in the ribs for staring at her a bit too long. Life as an attractive woman certainly had its perks. Rather than being shoved and jostled out of the way attempting to step onto the train, a guy in an expensive business suit stepped out of her way ushering her inside. He'd taken the liberty of giving her a healthy once over, and surely did the same after she'd walked past, but Michelle enjoyed the attention.\n\n\"Why thank you.\" Michelle said as another man got out of his seat for her to be able to sit. \"What a gentleman you are.\" As the train lurched forward, Michelle more or less returned the courtesy he'd shown by grasping his inner thigh. \"I'd feel terribly guilty if you fell.\" She said with a wink, letting her hand linger for a bit.\n\n\"I appreciate that, thank you.\" The man replied.\n\nNo wonder Michelle enjoyed her commute so much more these days! She felt like a rock star walking out on stage. Surely, real women could and would get tired of garnering such attention, but after being overlooked her entire life Michelle savored it. Walking into the building was no different, people held the door, or the elevator just so she could enter. No one ever held a thing for Michael other than a look of disdain or disinterest such as Cindy had not so long ago. Maybe that was why Michelle found herself being so forward with her neighbor?\n\n\"Let's see what this says!\" Michelle said to herself as she picked up a post-it-note on her desk. \"Go into My office, there's a list on the desk for you.\" Michelle read. \"Oh boy!\"\n\nMichelle moved as quickly as her heels allowed to the office. Just in case, she made sure to service the dildo hanging behind the door. This was the woman who'd hacked her computer and downloaded all the content, and devised the assessment she'd taken to know exactly what buttons to push and when, surely there was a strong possibility She was watching right know. Michelle's hands trembled slightly as she looked over the checklist, instead of emphasizing the leg lift and squeeze as she did on the elevator for Cindy, Michelle involuntarily did so while reading the instructions. She then read them through a second time, letting out a slight moan.\n\nIn all it took Michelle 45 minutes to get ready. She was thankful that she was allowed to sit with her legs under her on a pillow rather than the thin carpet on the concrete floor. Michelle had swapped into the 1/@\" platform pink heels to match her lingerie, her panties had been removed and were now hanging neatly from her mouth with the front tucked between her lips. Her bottom had been cleaned with an enema, and now had a vibrating, inflatable plug inside. On her ankles and wrists were pink leather cuffs, while she'd been unable to attach all four cuffs to the small leather and metal X, three of them were holding securely in place. The breast forms had been removed, and with the help of a little ice, nipple clip connected by a chain had been attached to her chest. A tall, stiff pink collar also held her head perfectly still as she knelt with her back to the office door facing the building across the street. All she could do now was wait for Ms. Allison's arrival and leak precum into the small white bowl positioned below her still caged cock. It was a mixture of fear and excitement as the sound of the door opening behind her happened. Then silence.\n\n\"Good morning sissy Michelle!\" Ms. Allison gleefully said as She stepped into view. \"It does look like you've followed My instructions perfectly!\" Ms. Allison removed the panty from Michelle's mouth before continuing, \"How was your date with the lovely Brenda?\"\n\n\"It was great Ms.,\" Michelle said before swallowing hard, \"we spoke for hours.\"\n\n\"Very nice, and how did you part?\" Ms. Allison sat on the bench in front of Michelle, crossing Her legs slowly.\n\n\"We shared a cab,\" Michelle felt her face redden slightly, \"I walked her to the door of the building and we shared a quick kiss.\"\n\n\"Really! Do tell!\" Allie was genuinely intrigued, this was not originally part of Her plan for the day, but it fit wonderfully into it.\n\n\"I wasn't sure, but we'd held hands and touched quite a bit when we were out,\" there was a sincere look in Michelle's eyes as she spoke about Brenda, \"then I just leaned and she did too.\"\n\n\"What did you do when you got home?\" Ms. Allison asked as She slowly got to Her feet and approached Michelle.\n\n\"I took the new dildo and put it on one of my kitchen chairs.\" Michelle couldn't look down because of the collar, but couldn't bring her eyes up beyond Ms. Allison's knees. \"My neighbor Cindy heard me and asked me about it this morning.\"\n\n\"Oh? Were you loud sweetie?\" Allie leaned down, producing a key and reaching for Michelle's twitching cage.\n\n\"Apparently very loud Ms.,\" Michelle moaned as Ms. Allison slowly massaged her swollen balls before unlocking her cage, \"I passed out in my bed right after.\" The sheath was removed as was the ring that sat behind Michelle's balls causing her erection to spring to life immediately. \"Ohhhhhh shit!\" Michelle groaned feeling her erection surging.\n\nMs. Allison walked behind Michelle, letting Her hands slowly glide down her arms before securing Michelle's free arm to the binders. \"Did you have any issues getting ready?\" Allie whispered rather huskily in Michelle's ear, and was so close Michelle could feel Her breath.\n\n\"Not at all Ms.!\" Michelle's cock twitched at her Boss' touch.\n\n\"I like these plugs,\" Allie said as She slowly turned up the vibrations, then shut the valve halfway for the air bladder, \"I like when My girls feel nice and full.\"\n\nWith the bladder half shut the quick squeeze of air was only slowly let out. Allie could hear the faint hiss of air as it escaped, when it stopped, She gave the pump two quick squeezes causing Michelle to moan loudly. When the hissing stopped again, She gave the pump three quick squeezes.\n\n\"Ohhhhhhh gaahhh!\" Michelle moaned loudly.\n\nGiving the pump four squeezes before closing the bladder, Allie let Michelle sit like that for a moment before continuing. Letting a hand gently slide up Michelle's right arm, Allie reached over Michelle's shoulder finding the small chain between her nipples. Giving the chain a slight tug, Allie could see Michelle react to the new stimulus.\n\n\"Your nipples are coming along nicely too,\" Allie let Her lips brush lightly against Michelle's ear as She spoke, \"the cream has estrogen in it to increase your sensitivity.\"\n\n\"I thought as much Ms.,\" Michelle moaned softly while straining at her cuffs, \"I can't wait for my own boobs!\"\n\nMichelle was far too aroused to be upset about getting estrogen, and in the back of her mind she'd had an idea it wasn't just a skin moisturizer. Her nipples had grown increasingly sensitive over the weeks, she'd certainly been far more aware of them recently as well. The thought of having full, voluptuous breasts excited her, and she often wondered how it would feel to have them be a real part of her.\n\n\"I'm excited for you as well,\" Ms. Allison said as She released the chain then walked back in front of Michelle taking a seat again, \"I do have a reward and a surprise for you today too.\" Michelle swallowed hard, still tasting the precum she'd sucked out of her panties not that long ago. \"Today you'll be allowed to orgasm as a boy, well more or less.\" Ms. Allison smiled as Michelle's cock twitched and leaked more precum. \"I mean, I doubt when you jerked off you did so dressed up like you are,\" Allie made a circle with Her finger almost mockingly as if Michelle didn't know she was in lingerie and heels, \"or with an inflatable plug filling your sissy pussy.\"\n\n\"No, I didn't Ms.!\" Michelle's hips were now moving slightly, had the vibrations just been increased?\n\n\"I do find it important to take these opportunities, when an employee is aroused far more than usual, to expand their training, push them into scenarios they may not be as open to trying if they aren't as horny as you are now.\" Ms. Allison paused momentarily for Her words to sink in. \"That is because I want your reaction to be instinctual rather than second guessing yourself, does that make sense?\"\n\n\"Yes Ms.!\" Michelle all but blurted now convinced the plug was being turned up somehow.\n\n\"I'm glad you understand so clearly,\" Ms. Allison smiled, then looked past Michelle and nodded, \"I'd like to introduce you to My friend Ms. Amy.\"\n\nTwo soft hands touched Michelle's shoulders lightly, in the reflection of the window in front of her Michelle could only make out the outline of a person but not see them. No wonder the wired plug seemed to be vibrating stronger, Ms. Amy had been slowly turning it up behind her! Michelle's cock ached, practically vibrating as the straining appendage poured clear fluid.\n\n\"It's very nice to meet you sissy Michelle.\" The voice was soft, as were the lips on Michelle's ear. \"Why don't you hold this between your teeth for now?\"\n\nMs. Amy lifted the chain for the nipple clips to Michelle's opening mouth. The chain was just long enough to reach, yet exerted some pressure on Michelle's nipples which only added to her excitement. She moaned softly holding the chain delicately between her teeth.\n\n\"Would you like to feel something interesting?\" Ms. Amy asked before gently nibbling Michelle's earlobe.\n\n\"Yesh Mish!\" Michelle groaned.\n\n\"Don't drop the chain now.\" Ms. Amy said as She produced a lit candle in front of Michelle's face causing her to groan again.\n\nEyes wide open, Michelle watched as the white candle slowly tipped, and the drop of wax gradually built up until it was enough to fall. \"Just missed.\"\n\nMs. Amy repositioned Herself, pressing Her chest into Michelle's back as another drop formed. Fear filled Michelle's eyes as the drop slowly got bigger, and bigger before eventually becoming too big to remain on the candle. With the collar holding her chin up, the candle wax drop quickly disappeared from view. Michelle winced and groaned as the hot wax splashed at the base of her twinging cock before quickly cooling and tightening around her skin.\n\n\"That wasn't so bad was it?\" Ms. Amy wrapped Her left arm around Michelle's torso, pressing Her body against Michelle as best She could while leaning Michelle's body back slightly.\n\n\"No Mish!\" Michelle responded feeling her ass squeeze the base of the plug tightly and release it, as if it were trying to fuck itself.\n\n\"Would you like Me to do it again?\"\n\n\"YEsshhh, pleash Mish!\"\n\nMichelle had no concept of time, it was doubtful to her that she'd be able to read a clock if one was even in front of her while Ms. Amy worked Her magic. The entire length of Michelle's cock was coated in layers of wax, which was then removed by Ms. Amy rubbing baby oil over it, bringing Michelle dangerously close to orgasm. A cold, wet towel was wrapped around her spasming member, then another round of wax was applied, all while Ms. Allison sat and watched. When Ms. Amy released Michelle from Her grip, Michelle was given several minutes to recoup while Ms. Allison and Ms. Amy spoke softly out of view. Thankfully, Michelle had been allowed to drop the chain giving her aching nipples some relief.\n\n\"Did you enjoy that sweetie?\" Ms. Allison asked as She returned to view.\n\n\"I've never experienced anything like it Ms.,\" Michelle replied conveying the exhaustion in her voice, \"it was unreal and I loved it.\"\n\n\"Would you like to thank Ms. Amy?\"\n\n\"Yes! Please oh please Ms.!\" Michelle responded.\n\nMichelle felt her hands being unclasped from the restraint behind her. Thankfully, the plug was also turned down and partly deflated. \"Don't get up, you'll certainly fall if you stand up right now,\" Allie teased, \"lean forward so you can kiss My Friend's shoes.\"\n\nMichelle moved without hesitation, almost banging her forehead on the floor in the process. She used her hand to flip her long hair to one side of her head, eliciting a smile from Allie at how naturally and without thought she'd performed such a task. When the shoe was presented before her face Michelle kissed and licked it as if the shoe were her lover. She tried to convey the passion and desire as well as her thanks through her mouth to the shoe. Michelle even kissed and licked the stocking covered foot inside the shoe up to the ankle, and was only stopped by her arms being pulled behind her back again. Michelle strained slightly, not wanting to be done just yet, but soon her wrists were again locked to the X holding her ankles.\n\n\"Well hello darling.\" The woman in front of Michelle said with a warm smile. \"I had a lot of fun with you today.\"\n\nMs. Amy squatted in front of Michelle, dipping Her finger into the pool of precum collecting in the bowl, before inserting it into Michelle's mouth. Michelle greedily sucked the finger while staring into Ms. Amy's eyes. Ms. Amy was not as thin as Ms. Allison, but was not grossly overweight, she was a woman who would certainly tower over Michelle if they'd been standing together. She had an athletic build, intense blue eyes and short blond hair. Ms. Amy looked like She'd played sports in college, had Michelle the presence of mind to be able to form a picture of Her prior, She would not have been the same as the person before her. Still, as Ms. Amy's finger slid in and out of Michelle's mouth, Michelle greedily sucked it while swirling her tongue around it.",
        "\"Michelle is quite the cock sucker isn't she?\" Ms. Amy asked over Her shoulder. \"She's working My finger like it's going to cum!\"\n\n\"I agree,\" Allie replied proudly, \"she has a very talented mouth.\"\n\nFor the next few minutes Ms. Amy fed Michelle several more coated fingers of precum while She and Ms. Allison not only talked about her body and appearance but which customers Michelle was best suited to meet. Michelle, unable to move, remained there will being discussed like a piece of meat or a show animal. Still, her cock trembled and ached praying for release. As Ms. Amy walked past, she let Her fingers linger over Michelle's lips then glide along her jaw to her neck before leaving the sissy aching for more. After some time, Ms. Allison returned taking Her seat on the bench in front of Michelle.\n\n\"Do you know why we did that this morning Michelle?\" Asked Ms. Allison.\n\n\"No, Ms.\"\n\n\"This job and this life style are not about physical appearances,\" Allie leaned forward resting Her forearms on Her legs, \"it is about the power exchange, the Dominance and submission, and the bond between Dominant and sub.\" Michelle nodded but still looked somewhat confused to Allie. \"Not every client you meet with will be out of a magazine, not every woman a model, and not every man someone who spends hours in the gym,\" She explained, \"but, just as Amy did, They will be able to bring you to amazing heights and open you to new experiences.\"\n\n\"I understand, Ms. Allison.\" Michelle leaned forward looking down slightly.\n\nSurely, as she'd come to work thinking she were on top of the world as a beautiful woman, she had to be careful of the dangers of looking down on others based on appearance. It was an eye opening experience. Without being seen, Ms. Amy had shaken Michelle physically and mentally. When She'd stood in front of Michelle, while her head was down, Michelle desperately tried to convey her devotion to the Domme who'd manipulated her body so much in such a short period of time. Michelle had to ask herself if she'd had been as open to the experience if she'd seen Ms. Amy beforehand? She hoped not.\n\n\"Thank you Ms.\" Michelle felt her eyes water slightly as the life altering revelation washed over her.\n\n\"The clients I choose are based on their knowledge and abilities, not their appearance,\" Allie wanted to convey the importance of this to Her employee, \"I certainly cannot have you go on a date and react negatively to them when you first see who you're meeting.\"\n\n\"I will do everything in my power to make You proud Ms. Allison.\" Michelle's voice was filled with sincerity.\n\n\"I believe you,\" Allie smiled, truly feeling She'd made Her point, \"but this isn't the last time you'll meet a client this way.\"\n\n\"Is Ms. Amy a client?\" Michelle looked up at her Boss.\n\n\"She is, I take it you'd like to see Her again?\"\n\n\"Oh YES Ms.!\" Michelle's eyes pleaded.\n\n\"I'll keep that in mind,\" Ms. Allison moved from the bench, walking behind Michelle again, \"you're right handed aren't you sweetie?\"\n\n\"Yes I am Ms.\"\n\n\"That's what I thought,\" Allie said releasing Michelle's left hand, \"so, when you used to jerk off you did it right-handed?\"\n\n\"Yes, Ms. Allison.\" Michelle moved her now free hand to her thigh, unsure of what was going to happen next.\n\n\"Now, I'm going to use this timer,\" Allie said putting a large red timer on the bench She'd been sitting on previously, \"I'm going to give you a certain amount of time to orgasm, but you'll have to do it with your left hand.\" Michelle nodded, gradually moving her hand to her aching crotch. \"Not yet though, I'm not done explaining how this works.\"\n\n\"Sorry Ms. Allison.\" Michelle replied putting her hand behind her back again.\n\nUsing the term orgasm, rather than cum, was important for Allie as it was just another small piece of the mental training. Boys jerked off until they came, girls orgasmed. While She hadn't wanted to use the term \"stroke\" the confusion was obvious and understood. None of Her employees had ever tried to use their opposite hand to pleasure themselves, in the past when Allie had left it at \"rub\" that's what they did. Allie wanted their frustration to grow as it not only increased their submissiveness but also their dependence on Her.\n\n\"Now, when the timer hit's zero you have to stop,\" She continued, \"if you go past the time, I'm going to use this crop to give you a tap or two to help you pay better attention.\" Allie slowly rubbed the end of the crop along the underside of Michelle's dripping cock for emphasis. \"If you don't orgasm by the time the timer goes off,\" She said presenting the wet crop tip to Michelle's open mouth, \"I'll let you cool down and then I'll let you try again.\" Michelle's tongue slithered along the crop searching out her precum. \"Ready to begin?\"\n\n\"Yes, please Ms.!\"\n\nThe timer beeped, displaying one minute and thirty seconds in in three-inch red letters. The moment it did, Michelle's left hand flew to her cock, feverishly yet clumsily attempting to stroke herself to orgasm. It was impossible for her to develop any kind of a rhythm, as the timer continued to mercilessly pass second after second, causing her desperation to grow more and more. As the timer reached zero, Michelle reluctantly stopped stroking herself, her hips however continued to keep rocking back and forth.\n\n\"That seemed difficult, did you even get close?\" Ms. Allison's voice was full of concern but Her smile showed She knew exactly what was going on. \"Let's see if this will help a bit.\" Leaning forward, Allie picked up the bowl of precum pouring some of it on Her right shoe. \"Oh, how clumsy of Me,\" Allie smirked lifting Her foot to Michelle's face, \"clean that up for Me would you?\"\n\nThe passion Michelle had conveyed when she'd licked and kissed Ms. Amy's foot paled in comparison to the love and devotion, she gave to Ms. Allison's shoe. Precum, grit and dust coated Michelle's tongue but she continued to lick with abandon. With her entire body focused on moving her tongue over the shoe, Michelle couldn't even form thoughts outside of keeping her tongue in contact with the black leather. When Ms. Allison lifted the heel, Michelle pursed her lips around it sucking and licking it like a pointed cock.\n\n\"Ready to try again?\"\n\n\"Please Ms.,\" Michelle pleaded, \"can I used my other hand, please?\"\n\n\"Not just yet!\" Allie said pulling away Her shoe and hitting the timer.\n\nRegardless, at the sound of the beep Michelle's hand again grasped her cock again, rapidly and awkwardly stroking as fast as she could. Perspiration developed on her body as she feverishly worked her cock to no avail. Unlike the first time, she didn't hear the beep this time.\n\n\"Uh oh!\" Allie said laying the crop over Michelle's hand. \"Did you hear the beep?\"\n\n\"No Ms.!\" Michelle's bottom lip trembled as she let go of herself. \"I'm sorry Ms. Allison!\"\n\n\"It's okay, this is supposed to be frustrating,\" Allie smiled warmly before lightly slapping the tip of Michelle's cock with the crop leaving a red mark, \"focus is important.\"\n\n\"Ouch!\" Michelle squealed as her eyes watered. \"I'm sorry Ms.!\"\n\n\"It's okay.\" Allie said lightly touching Michelle's face while dipping Her finger into the bowl. \"Here, this will help.\" She said pushing Her finger into Michelle's mouth.\n\nJust as she'd done with Ms. Amy earlier, Michelle's tongue lavished Ms. Allison's finger, swirling and sucking it with abandon. The process was repeated far too many times for Michelle to even count, the rewards intensified as her frustration only grew. Ms. Allison, who was wearing dress pants, placed a Little Mikey dildo into Her pants before coating it with precum and feeding it to Her exhausted sissy. Was it the one Michelle had fucked with abandon twice yesterday? It didn't matter, Michelle's lips parted without thought, her tongue meeting it before the tip passed her lips. All Michelle could taste was latex and precum and that was all that mattered to her!\n\n\"Would you like to really orgasm now sweetie?\"\n\n\"Ohhhhhhh pleeeassseeee Miiissssssss!\" Michelle almost cried.\n\nAllie lifted the bowl again, this time pouring what was left over Michelle's crotch until it was dripping off her aching balls. Michelle immediately began massaging her now wet balls with her left hand while Allie freed her right. The moment it was free, Michelle's had desperately began jerking on her aching cock, her knees banging into the pillow with each hard stroke. Suddenly, Michelle's ass was filled with the vibrating balloon of a plug all but sending her into orbit. Allie let out the air, the pumped again and again. The short blasts of air into the plug felt like someone was fucking her insides causing Michelle to groan and shake.\n\n\"My sissy girl wants a real cock in her ass soon, doesn't she?\"\n\n\"OH, FUCKING GOD YES!\" Michelle screamed.\n\n\"Cum for Me sissy, cum the way you want a Real Man to cum inside you!\"\n\n\"Ohhhhhhhhh ffffffuuuuuccckkkk!\" Michelle leaned back, spraying cum into the air, which landed on her chest, shoulder and neck with the first two blasts from her cock. \"Ohhh so much cum!\" Michelle squealed as more landed on her abdomen, garter belt and hand.\n\n\"My sweet girlie was a bit backed up wasn't she?\" Ms. Allison teased.\n\nAs Michelle wound down from her orgasm, still mindlessly milking and stroking herself, Allie scooped the first fingerful of cum from Michelle's left shoulder, quickly pushing it into her mouth. Instinctively, Michelle's lips pursed around the finger, sucking and licking it clean. Allie continued to feed Michelle her sissy discharge while moving behind the still kneeling sub. Getting into the position Amy had been in before, Allie slid Her left arm over Michelle's shoulder, undoing the clip on Michelle's right nipple causing her to moan slightly.\n\n\"Those cute boobs of yours are getting more sensitive aren't they?\" Allie's mouth was right behind Michelle's ear as She whispered.\n\n\"Yessssss, Ms.!\" Michelle hoarsely whispered back. \"I can't wait until they're bigger.\"\n\n\"All in due time,\" Allie smiled proudly before feeding Michelle more, \"but first we have to clean up this mess you've made of yourself.\" Nodding and moaning around the cum covered finger in her mouth, Michelle milked her softening cock. \"You did very well this morning Michelle, I'm very proud of you.\"\n\n\"Thank you Ms. Allison,\" Michelle's exhausted voice replied, \"I want to make You proud.\"\n\nIt had been almost three non-stop hours of sexual arousal for Michelle, not including the time she spent getting ready and waiting for Allie to arrive. It was almost lunch time by the time Michelle finally orgasmed.\n\n\"Clean up your hand now.\" Allie's voice was a soft suggestion, yet Michelle immediately complied, lifting her cum covered hand to her mouth.\n\n\"Yes, Ms.!\"\n\nAs Michelle cleaned her fingers and the back of her hand Allie reached underneath Her sub, massaging the area between Michelle's plugged ass and loosely hanging balls, moving the last of her sticky sissy juice forward. Allie released Michelle's small breast, slowly getting to Her feet, and walking back in front of Her sub. Picking up Her phone, Allie took a couple quick pictures of Michelle, who had now smeared lipstick and cum around her mouth.\n\n\"You are making quite a mess of yourself aren't you?\" Allie teased.\n\n\"I'm sorry Ms.,\" blushed Michelle, \"I don't know how I can still feel so horny though, I just came!\"\n\n\"No, you orgasmed sweetie,\" Allie leaned forward touching Michelle's arm softly, \"you're very much a girl, and girls orgasm.\"\n\n\"Yes, Ms.\" Weakly replied Michelle.\n\n\"Now, milk yourself one more time,\" Allie instructed, \"then clean up the bowl.\"\n\nMichelle immediately complied, rubbing the end of her flaccid cock on the rim of the bowl, before lifting it to her mouth. Allie was quite pleased at the lack of hesitation. A sub experiencing a post orgasm \"drop\" was always an issue, Babette had been terrible with it. She attributed that to where they were in life before coming to The Agency. Babette hadn't been rich, but she'd done very well for herself before the market caught her unaware. Prior to that, Babette had to be a strong person dealing in a high pressure world of stocks and always on her game, submission did not come naturally to her. Michelle on the other hand was a natural submissive and had spent her life trying to please those around her. Life had been unfair to her along the way, which only added to that need to please. Allie took a couple more pictures as Michelle poured the contents of the bowl into her mouth.\n\n\"It's a good thing you're going to shower after this,\" Allie teased as white fluid dripped down the sides of Michelle's mouth, \"I can't have you sitting in the front office with dried cum on your face after all!\"\n\n\"Sorry Ms. Allison.\" Michelle blushed, feeling like a child that had just made a mess drinking Kool-Aid.\n\n\"No need to be sorry,\" Allie replied taking a close up picture of her doe eyed submissive's messy face, \"this won't be the last time you end up with bodily fluids dripping down your chin!\"\n\nAllie undid the clips holding Michelle's ankles to the black leather and chrome d-ring X behind Michelle's back. She opened the valve to the inflatable plug all the way to insure it was empty as well, then turned the wired controller off completely. Placing the wire over Michelle's shoulder, Allie tucked the controller into Michelle's bra cup, then took Her sub by the elbow to help her to her feet. Michelle was not only unsteady from the physical exhaustion, but also the fact she'd been sitting on her lower legs for several hours.\n\n\"Go ahead and take a shower,\" Allie instructed, \"you'll need to change your wig too, there's cum in this one and you just won't get that out.\"\n\n\"Yes, Ms. Allison.\" Dutifully replied Michelle.\n\n\"Take your cage with you,\" Allie instructed as Michelle wobbled toward the bathroom, \"you'll need to have it on again when you come back out, there's a new outfit and lingerie for you in the closet.\"\n\nBracing herself on the furniture along the way, Michelle eventually made it to the small hallway off Ms. Allison's office and to the bathroom. The full length mirror hid no details from Michelle's view. She was a mess. A cum covered mess that is. Cum was in deed in her hair, on her lingerie, face, body and stockings. The pump from the plug hung between her legs while her cock slowly came back to life.\n\n\"Oh stop it you!\" Michelle hissed looking at her shaft.\n\nIt took effort, considerable effort, but Michelle was eventually able to completely undress and remove the plug and wig before stepping into the shower. The hot water felt wonderful on her sore muscles. Michelle spent extra time in the shower just reviving herself, never in her life had she experienced something like she'd just been through. This time, when she stepped out of the shower, it felt more natural to wrap the towel around her upper body to cover her breasts. Looking in the mirror, a hint of real cleavage showing above the towel, Michelle couldn't get over how far she'd come since the first time she'd used that shower.\n\n\"Holy crap,\" she said to herself with a chuckle, \"I wonder if that counts as my first threesome?\"\n\nUnsure if she would ask when she returned to the office, Michelle went through her post shower routine, thankful the makeup drawers were well stocked. Just as Ms. Allison had said, in the closet was a new set of peach and white floral lingerie, nude stockings, heels and a peach and white vertical striped dress with thin white belt. Michelle dressed in everything but the dress, before moving on to select a new wig. There were a couple short wigs she liked, but they seemed too dark for her outfit, ultimately, Michelle settled on a shoulder length straight haired brunette wig. Carrying the dress on the hanger, and with her soiled clothing in a bag, Michelle returned to the office where Ms. Allison was on the phone and waved Michelle to the chair.\n\n\"We will have to get together again soon Amy,\" Ms. Allison said as Michelle sat in the chair, \"I'm glad you had fun today, thanks for helping out.\" Ms. Allison hung up the phone then directed Her attention to Michelle. \"I called to thank Her for coming in,\" Ms. Allison said to Michelle, \"She said She had a lot of fun with you and looked forward to seeing you again Michelle.\"\n\n\"I'd like that very much Ms. Allison.\" Michelle felt a slight tremble of excitement pass through her at the thought.\n\n\"Obviously you understood what I said about physical appearance with My clients?\" Allie asked succinctly. \"I know you were a bit distracted during our training session after all.\"\n\n\"While I can't say how I would initially react to seeing someone I may not be immediately physically attracted to Ms.,\" Michelle shifted in her chair, not wanting to offend her Boss, \"when Ms. Amy was doing what She was doing, I didn't care about anything but what She was doing to me.\"\n\n\"That's good,\" Allie responded with a warm smile, not all these conversations had gone this well, \"I have several Clients, who you would truly enjoy your time with, possibly even more than you did with Amy earlier, who are older, or overweight and you may not be physically attracted to initially.\" Allie watched Michelle intently as She spoke, wanting to gauge her reaction more than what her reply would be. \"If you're able to get past that initially, I guarantee the time you spend with them will be more than memorable.\"\n\n\"I understand Ms. Allison,\" Michelle replied looking directly at her Boss,\" when Ms. Amy was behind me, I wasn't sure of anything but the fact someone was behind me. It could have been Babette, or a man who was doing what She was doing, who or what they were didn't matter and still doesn't.\" Michelle swallowed hard before continuing, wanting to be honest and open as Ms. Allison had always told her to be when they talked like this. \"I may not have initially reacted the same way had I seen Ms. Amy first,\" Michelle felt ashamed admitting the truth and looked down momentarily, then continued, \"but I will never make that mistake again Ms. Allison.\"\n\n\"I have every faith in your ability to keep true to your word Michelle.\" Allie was thrilled with Michelle's response, She'd had to let two girls go previously based on their responses and reactions to who She'd brought in. Michelle not only sounded, but looked sincere as she spoke. \"The good news is you're due for another bonus today as well,\" Allie said turning to Her computer screen, \"and, I had My attorney streamline your name change paperwork's processing, so you are officially Michelle as of today.\"\n\n\"Wow! No more panicking someone will ask for my ID anymore! Thank you, Ms.\"\n\n\"By tonight you'll have the paperwork to get your information changed over,\" Allie was happy to see Michelle's excitement over the name change more than the sizeable bonus, \"and, when you decide your time here is over it will be just as quick to change back should you decide to do that.\"\n\n\"I can't thank you enough for everything Ms. Allison, truly.\" Michelle felt tears welling up in her eyes as she spoke.\n\n\"You're welcome sweetie,\" Allie replied, \"now go get back to work, I think Brenda texted you and is probably anxiously awaiting a response.\"\n\n\"Yes, Ms.!\"\n\nMichelle stood quickly, making her way to the door and stepping into her new dress. Taking the outfit she'd worn to work, and her bag of soiled lingerie, Michelle made her way to her desk and phone. There were texts from Brenda, Michelle felt horrible she'd left her waiting for a response for so long.\n\n\"Lunch outside?\" Michelle texted anxiously awaiting a response.\n\n\"Sure! 20 min?\"\n\n\"Come get me!\" Michelle responded beaming with excitement.\n\n\"K\"\n\nMichelle quickly tidied the outer office area, emptying her small trash bin, fixing the tables, and hiding her discarded clothing. With only a few minutes to spare, Michelle sat at her desk, crossing her legs, letting them lean to one side to present the best feminine look for Brenda. The tall, thin legs on the desk left Michelle on almost complete display to anyone that walked in.",
        "\"Oh I like your new hair!\" Brenda said as she leaned in the office door. \"Is that all you have for a desk?\"\n\n\"Thanks! Yeah, it is, no hiding behind this!\" Michelle chuckled a bit nervously.\n\n\"Well with legs like yours, why not show them off?\" Both of them blushed at Brenda's comment.\n\n\"I saw yours last night, you've got nothing to complain about.\" Michelle replied sliding out from behind the small desk. \"Did you bring lunch or are you picking something up?\"\n\n\"I was going to pick something up, you?\"\n\n\"You know it's okay to walk in,\" Michelle said as she grabbed her small purse, \"no one's going to bite you.\"\n\n\"Well, I just don't know, it feels odd being here after seeing...\"\n\n\"The patients that come up from here?\" Michelle asked.\n\n\"Yeah, like I'm not allowed or something.\" Brenda said tentatively stepping across the threshold.\n\n\"Look at that, you didn't melt or anything!\" Michelle teased taking Brenda by the arm and leading her to the elevator. \"I had a lot of fun last night,\" Michelle said as they waited for the elevator, \"I'm sorry if I was too forward at the end of the night.\"\n\n\"I kissed you back silly!\" Brenda replied while rubbing Michelle's arm.\n\n\"Yes you did!\" Michelle beamed with pride as the elevator doors opened.\n\nStepping into the crowded lunch time elevator, Michelle managed to stay close to Brenda. Or was it she was staying close to Michelle? In any case, they walked to a stand around the corner, opting for something quick and easy before heading across the street to a bench near a fountain.\n\n\"How do you manage to wear those heels all day?\" Brenda asked looking at Michelle' 4-inch heels. \"I'm tired at the end of the day wearing my sneakers!\"\n\n\"I'm not on my feet as much as you are.\" Michelle responded. \"There's a lot of sitting in my job.\" Michelle stifled a giggle but wanted to add the part about kneeling too. \"You are always up and about in your office.\"\n\n\"That is true.\" Brenda replied. \"Okay, you knew this question was coming,\" Brenda set her soda aside and turned to face Michelle a bit more, \"what was the deal with winking at that guy?\"\n\nEven though she knew it was coming, Michelle still choked slightly on her drink. She coughed a couple times before she was able to answer. \"I'm not sure,\" she replied honestly, \"I've been thinking about it a lot and the only thing I can figure out is, I didn't get a lot of attention from anyone before becoming Michelle.\" Michelle turned to face Brenda more before continuing. \"Now I get a ton of attention and it's tough not to enjoy or even react to it,\" Michelle said earnestly, \"I'm sure someone as attractive as you never had that problem.\"\n\n\"Thank you for the compliment,\" Brenda blushed and looked down, \"but that wasn't always the case, I was kind of nerdy in school and didn't go out much in college. I'm kind of an introvert.\"\n\n\"Yet you asked me out.\"\n\n\"There was something different about you.\" The statement made both of them giggle. \"I mean aside from the obvious wardrobe changes; you just have kind eyes.\"\n\n\"Thanks.\" They sat silently for a moment before Michelle asked her question, \"So, you know what goes on in my office, more or less, why did you flirt so hard with me?\"\n\n\"I don't know,\" Brenda replied, \"maybe I know you're a safe date?\"\n\n\"It's not like I'm going to take advantage of you with caged fury down there.\" Michelle giggled.\n\n\"Caged fury? Is that what you call him?\" Brenda laughed loudly after asking.\n\n\"No, I just made it up actually.\" Michelle said sheepishly. \"But really, why do you have any interest in me? It's not like we can do much romantically.\"\n\n\"I know you can't, but that also makes you kind of safe right?\"\n\n\"True, but your friends may think you're into girls if they see us kissing.\" Michelle responded.\n\n\"I don't care what they think!\" Brenda replied, leaning forward and kissing Michelle's cheek.\n\n\"I'm glad.\"\n\n\"Speaking of friends, and not caring,\" Brenda said in between bites of her lunch, \"next weekend one of my friends is having a bachelorette party, wanna come?\"\n\n\"Seriously?\" Michelle asked completely shocked.\n\n\"Yeah, why not?\"\n\n\"I mean, what are you doing that night?\" Michelle was nervous but excited about going out with Brenda again.\n\n\"They have a party bus so there's no driving, we'll hit a couple dance clubs,\" Brenda replied, \"and you know, see some strippers.\"\n\n\"Guys?\" Michelle asked feeling immediately foolish for asking.\n\n\"Well of course silly,\" Brenda gave Michelle a friendly nudge with her shoulder, \"it's not like we'd want to watch women take it off, the bride to be is straight.\"\n\n\"I'd be really scared, I've never been out with a group of women. Ever.\" Michelle responded feeling her heart race.\n\n\"I'll be right there keeping you company,\" Brenda responded, \"and we can practice you going out by going out to dinner again. Say, next week?\"\n\n\"How about sooner?\" Michelle suddenly felt bolder. \"Like this weekend?\"\n\n\"You don't think you'll get tired of me seeing me that often?\" Brenda teased.\n\n\"I like the idea of seeing a lot of you!\" Michelle responded.\n\n\"Ohhhh! And just when I said you were safe!\" Laughed Brenda.\n\n\"I mean seeing you a lot!\" Michelle blushed deeply.\n\n\"You're just too cute,\" Brenda leaned into Michelle again, resting her head against Michelle's, \"I don't know why I'm so comfortable with you, but I am.\"\n\n\"I am really comfortable with you too,\" Michelle responded leaning back into Brenda, \"and I've never been comfortable around any woman.\"\n\n\"I feel honored you feel that way.\" Brenda replied.\n\nAs they finished lunch, Michelle took Brenda's trash and put it in the barrel for her. They made their way back to the building, and were holding hands by the time they walked through the front doors. Rather than wait for another crowded elevator, Brenda suggested the stairs.\n\n\"I have to go four floors up,\" Brenda teased, \"you only have to do two!\"\n\n\"Yeah, but I'm doing two in heels so it's like doing four!\" Michelle said before begrudgingly following her.\n\n\"Oh just come on!\" Brenda led the way up the first few flights, before looking back at Michelle, \"Did you let me go first so you could check out my butt?\"\n\n\"Call it my incentive!\" Michelle laughed in response.\n\n\"And here I figured your incentive would be me kissing you goodbye,\" Brenda said before playfully storming up the next few steps, \"can't do that in a crowded elevator!\"\n\n\"Wait, what?\" Michelle almost fell trying to catch up.\n\n\"For that,\" Brenda said standing with her hands on her hips while trying to sound stern, \"you go first up the next flight!\n\n\"How are you going to check out my butt in this flowy dress?\" Michelle asked as she started up the last ten stairs.\n\n\"Who said I was going to look?\" Brenda's response was playful yet snarky. \"Or maybe I will!\" With a quick move of her right hand Brenda lifted the back of Michelle's dress, affording her a view of the lace stocking tops and cheeky boycut bottoms. \"Okay, seriously? Your panties match your dress that perfectly? Who does that?\"\n\n\"It's another long story.\" Michelle responded while not attempting to lower her dress.\n\n\"I can't wait to hear that one!\" Brenda replied finally dropping the dress. On the next landing they stood face to face again. \"Thanks for going to lunch with me,\" Brenda said as she put her arms around Michelle's waist, \"and for letting me check out your cute ass.\"\n\n\"Hopefully that means I get to check yours out one day soon!\" Michelle responded.\n\n\"Maybe!\" Brenda pressed into Michelle, standing on her toes a bit to press her lips to Michelle's. This time their kiss was not as brief as the night before. Their lips met, then again, the third time just a quick touch of their tongues before meeting the last time.\n\n\"That was nice.\" Michelle said softly.\n\n\"I agree,\" Brenda said reluctantly stepping back, \"tomorrow at 7 at the coffee shop?\"\n\n\"I wouldn't miss it for the world!\"\n\nBoth giddily continued on their way to their respective offices. On Michelle's commute home she ended up not only texting Babette about her day but Brenda as well. The only concern she ran into was moving into Babette's the same day of Brenda's friend's bachelorette party. She'd also have to figure out a way to tell Babette that she and Brenda were, were what? Dating? Were they? She'd have to ask tomorrow at lunch. Before bed, Michelle laid out her lingerie and dress for the following day. Now she not only had to be prepared for when she was called into Ms. Allison's office, but also if Brenda lifted her dress again! Slipping into a white satin nightie, Michelle fell fast asleep wondering what the next day would bring."
    ],
    "authorname": "Ms_Allison",
    "tags": [
        "men in heels",
        "men in lingerie",
        "femdom",
        "sissy slut",
        "strapon play",
        "forced fem",
        "forced feminization",
        "anal training",
        "cross dresser",
        "cross dressing"
    ],
    "category": "Transgender & Crossdressers",
    "url": "https://www.literotica.com/s/the-agency-ch-09"
}